{"jobID": "2835259950", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst/Data Modeler", "companyRating": null, "companyInfo": {"Website": "www.teksystems.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Adecco, Apex Systems, Robert Half Technology"}, "estimatedSalary": null, "jobDescription": " Seeking a Data Analyst/Data Modeler with the following skills and responsibilities: Performs data profiling (Data Flow, System Diagrams etc…) to analyze the candidate sources to clarify at an early stage that data is available along with inherent anomaliesLeads the development of a test case, test data, traceability matrix, and metrics to ensure all data validation requirements are met and documented. Communicates results to IT and key stakeholders. Tracks and verifies any required corrections and ensures completion.Works with Data Architect to contribute to the development of an Enterprise level data model as well as specific business domain data modelsDemonstrated understanding of business process modeling, data provisioning modeling, entity relationship modeling and dimensional modelingAbility to understand source systems, data dependencies, interfaces, integration, ETL, data integration and reconciliation5+ yrs in depth experience in DB2, MS SQL Server, Oracle databasesWe cannot consider anyone who will need sponsorship now or in the future.About TEKsystems:Join TEKsystems®, a leading IT staffing, IT talent management and IT services firm, and get your career on the fast track. We have more than 100 offices worldwide, and we partner with over 6,000 clients and place over 80,000 consultants per year. At TEKsystems, we seek to understand our consultants' skills, goals and interests, allowing us to present targeted job opportunities on a contract, contract-to-hire or direct placement basis. TEKsystems' leadership in the market stems from our sincere and personal commitment to driving the success of our customers, consultants and each other. - provided by Dice  Data Analyst/Data Modeler"}