{"jobID": "2677520397", "jobLocation": "Santa_Clara_CA", "jobTitle": "Application Framework Data Engineer (Next-Generation Security Platform)", "companyRating": "3.8", "companyInfo": {"Website": "www.paloaltonetworks.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 2005", "Type": " Company - Public (PANW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Check Point Software Technologies, Fortinet"}, "estimatedSalary": "157000", "jobDescription": "Palo Alto Networks® is the fastest-growing security company in history. We offer the chance to be part of an important mission: ending breaches and protecting our way of digital life. If you are a motivated, intelligent, creative, and hardworking individual, then this job is for you!  We are looking for Data Engineers to join our Threat Intelligence development group to drive and reinvent how customers rapidly access, evaluate and adopt the most compelling new security technologies as an extension of the Next-Generation Security Platform.  The all-new framework is a culmination of over a decade of security disruption, providing customers with superior security through compelling cloud-based apps.  Read more on our Application Framework at Palo Alto Networks http://bit.ly/2HUwM0IResponsibilities:As a Sr. Data Engineer, you will be an integral member of our threat intelligence service team responsible for architecture, design and development.Having the dynamic ability to adapt to conventional Big Data frameworks and tools with the use-cases required by the projectAbility to communicate with research teams and data scientists, finding bottlenecks and resolving themDesign and implement different architectural models for our scalable data processing, as well as scalable data storageBuild tools for proper data ingestion from multiple heterogeneous sourcesQualifications:6+ years of experience in design and implementation in an environment with hundreds of terabytes of data6+ years of experience with large data processing tools such as: Hadoop, HBase, Elastic Search, Kafka, Flink, etc.5+ years of experience with JavaPassion for doing research on large data sets containing ill-formatted dataCan-do attitude on problem solving, quality and ability to executeExcellent inter-personal and teamwork skillsBS/MS in Computer Science/Engineering, or equivalent experience Learn more about Palo Alto Networks here and check out our fast facts #LI-PALSAAS"}