{"jobID": "2831958087", "jobLocation": "Somerset_NJ", "jobTitle": "Scientist- Somerset, NJ", "companyRating": null, "companyInfo": {"Website": "www.kellyservices.com", "Headquarters": "Troy, MI", "Size": "5001 to 10000 employees", "Founded": " 1946", "Type": " Company - Public (KELYA) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Adecco, ManpowerGroup, Allegis"}, "estimatedSalary": null, "jobDescription": " Scientist- Somerset, NJ 08873- Contract position  The Quality Control laboratory supports testing and release of raw materials, intermediate and finished products, and all critical systems supporting manufacturing operations such as purified and potable water, compressed gases, captive zone environmental analysis, as well as cleaning and process validation support. The department provides analytical services to manufacturing, Technical Services, Validation and new material qualifications. All activities are performed in accordance with specifications, standard operating procedures, approved test methods and/or protocols, regulatory requirements  Basic Function:  Independently test, develop and implement assays useful for the identification and characterization of Raw Materials, pre-capsulation, Stability and Finished Products. Analyze data, document results, maintain laboratory notebook according to cGMP and Internal guidelines. Communicate results in written and oral presentations. Help in writing Procedures, Specifications and Test Methods. Keep abreast of literature in field; help train colleagues; contribute to continuous improvement within the group. Comply with FDA, EPA and OSHA regulations, performing all work in a safe manner. Maintain proper records in accordance with all SOP s and policies.  Responsibilities:  Cultivate and identify bacteria or other microorganisms isolated on selective and non-selective media. - Maintains cultures according to ATCC and departmental Standard Operating Procedures. - Performs identification of microorganisms using techniques such as API, Gram Stain, etc. - Prepares reagents, standards, Medias, etc. needed for analysis. - May be required to work with potent and teratogenic compounds. - Capable of working under moderate supervision. - Responsible for login of samples routine and non-routine into LIMS database and logbooks - Interprets and tabulates results of analysis. Records the results in approved notebooks, reports and logbooks. - Required to perform basic statistics to support analytical testing. - Helps receive, label and store receipts of solvents and analytical reagents. - Logs results into LIMS database - Verifies co-worker’s calculations in notebooks/logbooks and verifies results in reports and/or appropriate systems to check for accuracy and integrity of data.Why Kelly®?"}