{"jobID": "2821612074", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.devtechsys.com", "Headquarters": "Arlington, VA", "Size": "1 to 50 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DevTech Systems, Inc. (DevTech) is an international consulting firm dedicated to development, with 35 years of experience providing advisory services and technical assistance to government, private sector, and civil society stakeholders in more than 100 countries. DevTech core practice areas include: Economic and Data Analysis, Monitoring and Evaluation, Education and Youth Development, Gender and Inclusive Development, and Public Financial Management. The Economist will work on the new USAID Analytics, Data, Visualization, and Information Services (ADVISE) project. ADVISEs main purpose is to improve the usage of USAID data and information, so that the Agency continues to ensure its development outcomes are supported by evidence. Overview: The Economist works on ADVISE databases using SAS software, writes analyses using international development data, and responds to requests for data, analysis, and online products. The economist provides analytical products and services using socioeconomic and foreign assistance data and information resources, which will include running queries on databases, enterprise systems, and other primary data sources. The economist supports special projects which span any of the systems, websites, and services under ADVISE and may include reports, visual products, and maps or cartographic and other geospatial products based on underlying data. The Economist supports, with official reporting requirements, fielding analytics requests from customers, and processing and analyzing economic and other data in a variety of formats from multiple sources. The Economist/Data Analyst reports to the task lead. Primary Duties and Responsibilities:Support the collection and harmonization of data from socio-economic sources, USAID enterprise systems, and foreign assistance data from a wide and disparate range of information sources, in a variety of formats;Administer data calls and surveys, and will have a strong background in applying quantitative methods to produce new insight and analytical products;Support processes related to collecting, verifying, redacting, normalizing, and otherwise processing data received from multiple sources;Support the development quantitative models, methodologies, and business processes and must be conversant in using statistical packages such as SPSS, SAS, STATA, R, and related programs;Examine statistics and indicators to draw conclusions and present results in visually intuitive formats;Develop data analysis, including statistical analysis and compelling data visualizations, and development of analytical reports tailored to USAID needs;Develop online applications for data analysis for use by USAID staff and the public;Communicate analysis to a variety of USAID staff;Provide USAID staff with data analysis training.QualificationsEducation: Masters Degree in Economics, international development, or related field.Experience: At least two years of related experience in analytics, economics, development economics, data or computer science, or relevant subject.Knowledge: Knowledge of and interest in the economic and international development and relations fields. Skills: Experience using data to support research efforts, strong levels of data literacy, and solid grounding in the principles of data validity and integrity. Sectoral knowledge in one or more of several economic fields relevant to USAID work, such as economic growth, poverty, trade, international development finance and aid effectiveness. Knowledge of statistical software such as SAS, Stata and R preferred. Must has interest in database management and strong understanding of relational database principles. Highly motivated and responsible self-starter. Excellent interpersonal, communication and writing skills, including with technical audiences. Strong leadership and solid teamwork.  The applicant must be a U.S. citizen to qualify for the required U.S. government security clearance for this project. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, national origin, disability, sexual orientation, protected veteran status or other status protected by applicable law.  NOTE: This position description should not be construed to imply that the requirements are the exclusive standards of the position nor will it be the sole basis for any subsequent employee evaluations. Incumbents will follow any other instructions and perform any other related duties as may be required by their supervisor."}