{"jobID": "2803385350", "jobLocation": "Dallas_TX", "jobTitle": "HR Data Analytics Analyst", "companyRating": null, "companyInfo": {"Website": "www.cbre.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1906", "Type": " Company - Public (CBRE) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB SUMMARYUnder broad supervision, assists HR Data Analytics Manager in the preparation of analyses on the employee population. Prepares reports and presentations on demographic profiles, turnover ratios, etc. for various audiences. Works independently with internal clients to determine their reporting needs. Manages databases, works with HRIS to ensure data integrity, and performs trend analyses on historical turnover, recruiting, and staffing. Role typically requires between 3 and 5 years of experience.ESSENTIAL DUTIES AND RESPONSIBILITIESPerforms re-occurring and ad-hoc analysis of structured and unstructured data across multiple data sources, leveraging HR and other business relevant data to perform workforce analysis and measurements.Develops data structures and pipelines to organize, collect, cleanse, and standardize data in order to generate insights and addresses reporting needs.Design, produce, and maintains various HR dashboards and scorecards to provide key workforce measures utilizing a variety of tools (Excel, BI, Tableau, etc.) in accordance with governance procedures. Monitors trends and highlights areas of concern for possible intervention.Utilizes programming and analytical tools, including open source programs including Python, R and SAS, SQL, Oracle, or similar relational database tools to formulate models and/or extract insights. Well versed in knowledge of creating algorithms, identifying patterns and insights from structured and unstructured data sets utilizing graphs, trees and/or other data representation techniques as required.Identifies and troubleshoots data integration and integrity issues. Documents global definitions, processes and practice to ensure consistent usage of data regarding the workforce.Identifies opportunities to maximize data usage, applying modeling and optimization methods to develop new strategies and improve business performance.Exhibits analytical rigor, judgment, and ability to present a comprehensive 'data story' to multiple levels of the organization.May coordinate involvement of personnel from other departments and information technology groups to facilitate successful project implementations.Other Duties as Assigned.SUPERVISORY RESPONSIBILITIESNo formal supervisory responsibilities in this position. May provide informal assistance such as technical guidance, and/or training to coworkers. May coordinate and assign tasks to co-workers within a work unit and/or project.QUALIFICATIONSTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.EDUCATION and EXPERIENCEBachelor's degree (BS or BA) and 3 years of experience in quantitative analysis, data modeling, reporting, relational database tools, data warehousing, database architecture, and SQL, SAS and/or SPSS including. Technical experience in statistical analysis, data engineering, data visualization and machine learning.CERTIFICATES and/or LICENSESNoneCOMMUNICATION SKILLSExcellent written and verbal communication skills. Strong organizational and analytical skills. Ability to provide efficient, timely, reliable and courteous service to customers. Ability to effectively present information.FINANCIAL KNOWLEDGERequires knowledge of financial terms and principles. Ability to calculate intermediate figures such as percentages, discounts, and/or commissions. Conducts basic financial analysis.REASONING ABILITYAbility to comprehend, analyze, and interpret documents. Ability to solve problems involving several options in situations. Requires intermediate analytical and quantitative skills.OTHER SKILLS and/or ABILITIESIntermediate analytical skills. High attention to detail and accuracy is required to assure data products are reliable and actionable.Proficient in Microsoft Office Suite including Word, PowerPoint, Excel, and Outlook.Knowledge and ability to work with confidential personal data, GDPR and apply data privacy controlsSCOPE OF RESPONSIBILITYDecisions made with understanding of procedures and company policies to achieve set results and deadlines. Responsible for setting own project deadlines. Errors in judgment may cause short-term impact to co-workers and supervisor."}