{"jobID": "2831192194", "jobLocation": "La_Porte_TX", "jobTitle": "PP Catalyst/Product Dev Scientist/Engineer", "companyRating": null, "companyInfo": {"Website": "www.ineos.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " INEOS Olefins and Polymers USA is one of the largest integrated producers of olefins and polyolefins in North America. From its manufacturing locations at Chocolate Bayou and LaPorte, Texas, it is a merchant marketer of butadiene, ethylene, polypropylene, and high-density polyethylene with annual revenue of over $2 billion. How the Role Fits In: The PP Catalyst/Prod Dev Scientist/Engineer is responsible for developing and executing the technical development plan in support of the Polypropylene business by creating, capturing and maintaining value within the PP catalyst and polymer area.  Purpose of Job Critical assessment of PP catalysts and donors used within the current PP product slate. New catalyst selection through review of information and pilot plant studies.Timely delivery of catalyst deployment within the plants and operating units to improve reliability, product properties, operability and/or lower costs.Evaluating opportunities and implement PP product development on commercial scale for improved market positions.RESPONSIBILITIES AND ACCOUNTABILITIESIdentify and deliver catalysts, which support the PP business. Stay abreast of polyolefin catalyst and product technologyCreate options for alternative catalyst use on all PP linesInitiate and coordinate pilot scale and bench scale programs appropriate to PP developments opportunities for O&P; USA.Assess existing products and options to improve operability through catalyst or donor modificationsAssess options to improve product transitions and to implement new higher margin products through modification of catalyst or donor, or product compositions.Participation in Segment Teams, Operations meetings and Asset teams as appropriate to understand issues and opportunities for catalysts to improve products and processes.Deliver products via Six Sigma approachesLead and direct tasks/objectives and monitor/assess progress as appropriate for all polypropylene catalyst and donor projects.Ensure open communication and aligned technical and commercial objectives with business goals.Work with manufacturing sites to help form, lead and support project teams with the right mix of skills/knowledge; ensure that technical, operational, commercial, strategic concerns are considered in the development/selection of project scopeWork with INEOS Olefins and Polymers Europe technical contacts to exchange information on catalyst/donor performance and new products; and apply it to units as appropriate.Work with product stewardship to ensure changes achieve regulatory needsWork with product development scientists to understand the selected catalyst/donor systems and their influence on product properties.Interact with 3rd party catalyst vendors and with Ineos O&P; Europe to stay abreast of catalyst and donor capabilities.Monitor intellectual property in the area of catalysts, donors and products and manage confidentiality agreements of O&P; USA and suppliers.SKILLS & KNOWLEDGE REQUIRED Education/Experience Four-year/Bachelor’s university degree, in engineering, chemistry or material science. Advanced degree preferred.At least 5 years broad experience in the chemical industry. (Preferably Polymers). Technology  Maintain a high degree of technical acumen in the areas of PP catalyst, structure/property/process relationships, and process technology. Use the technical acumen to assess product/property/reliability issues and focus resources for delivery.  In depth understanding of PP polymer preparation and properties to conduct applied developments and meet customer requirements Strong analytical skills - ability to manage and integrate data from many sourcesGood interpersonal skillsProject management experienceAbility to facilitate and lead an inter functional teamSix Sigma min. green belt skill set Technical skills ? Technology Acumen: o Polymer Structure property relationships,  o Material science,  o Polypropylene Catalyst knowledge,  o Polymer fabrication, chemistry and process;  o Deep knowledge of the 6 sigma approach toward problem solving.  ? Business Acumen: Project management, Intellectual property and commercial awareness of cost benefit.  Behavioral skills Strong leadership and communication skills,Strong team builder,Ability to impress and influence internal and external stakeholders,Well-rounded personality,Strong intellect, analytical, and strategic thinker.Ability to prioritize activities consistent with the business priorities, asset and product capability. We are proud to be an EEO/AA employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing.  If you need accommodations with regards to submitting your profile, please send us an email at ineosopusacareers@ineos.com."}