{"jobID": "2733455478", "jobLocation": "San_Antonio_TX", "jobTitle": "Senior Scientist, Formulations", "companyRating": "2.8", "companyInfo": {"Website": "www.dptlabs.com", "Headquarters": "San Antonio, TX", "Size": "1001 to 5000 employees", "Founded": " 1938", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " IGI, Formatech, Ben Venue"}, "estimatedSalary": "98000", "jobDescription": " Job DescriptionESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Make laboratory batches to support early product development work.Conduct procedures in compliance with established protocols, DEA, cGMP and regulatory guidelines. Maintain a clean and safe environment.Prepare supporting documents on project related work from laboratory through process development and validations. Record, evaluate, analyze and interpret experimental data. Prepare and organize data for presentations and internal meetings.Write manufacturing process instructions for execution at the Plant that follow cGMP requirements. Watch and support the manufacturing of batches at the Plant from R&D; stage through Process Validation.Present ideas for modifying existing procedures and suggest alternative methods to improve results.Maintain a level of scientific knowledge in assigned area; perform scientific literature searches and evaluations as required and understand/comply with accepted laboratory and safety procedures.Work closely with internal and external departments to ensure the efficient progress of projects. Be able to interact with Clients in a professional manner.Be familiar with MS Office applications and possess some knowledge of statistical analysis software – such as Sigma Plot.Act as a mentor/advisor to more junior members of the department and use their knowledge and skills to mentor / advise more junior members within the department. Work under general supervision - work is only reviewed upon completion for adequacy in meeting objectives.Prepare technical reports and SOPs covering formulation development and handover activities – including manufacturing process instructions. Record, evaluate, analyze and interpret experimental data. Prepare and organize data for presentation at internal meetings.Within area of responsibility, understand and comply with all safety, environmental and quality practices and procedures as outlined in organizational/departmental guidelines and SOPs as well as applicable federal, state and local regulations.Perform other duties as assigned. Travel Shift Type First Shift Job Type Full-time Date Needed By Category Research & Development Job RequirementsEDUCATION and/or EXPERIENCEDegree in Chemistry, Biology or related field from a four-year college or university is required.Minimum 1 – 3 years of related experience is required for Ph.D., 4 – 6 years for Master’s degree, 7 – 9 years for Bachelor’s degree.Experience in formulation of pharmaceutical biological products is required.Knowledge in pharmaceutical drug development in semi-solids dosage forms and/or new drug delivery systems is a must.Strong knowledge of regulatory requirements and cGMPs is a must.Must be able to organize and prioritize work in order to accomplish tasks assigned.Ability to develop advanced research protocols, present findings and analyze, evaluate and interpret data.Strong proficiency in computer, writing reports, laboratory, analytical, and organizational skills.Must have excellent communication skills, a demonstrated ability to work with diverse teams and manage multiple projects within aggressive timelines.Ability to interact with personnel at all levels in department. Career Level Experienced (Non-Manager) Location DPT Laboratories, Ltd - San Antonio, TX 78215 US (Primary) Hiring Manager Education Bachelor's Degree Exemption Type Job Title Senior Scientist, Formulations # of Hires Needed 1 Wage Amount"}