{"jobID": "2645669090", "jobLocation": "San_Francisco_CA", "jobTitle": "Machine Learning Engineer", "companyRating": "4.3", "companyInfo": {"Website": "www.sonder.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": "At Sonder we're reimagining travel, hospitality, and how cities are experienced by building the world's first deconstructed hotel. We started a little over 4 years ago and are now active in 20 markets across North America and Europe.What's a Deconstructed Hotel?Its an answer to a lot of questions weve been asking. Like what would happen if we took the hotel on a little field trip? What if we unbundled it and brought its rooms to the kinds of neighborhoods we ourselves would want to live in? What if we stretched and reconfigured those rooms to include a dining area and a living space, and perhaps an extra bedroom or two for the kids? What if the design was modern and exciting, and the only thing cookie-cutter wasnothing. A place like that would help create a travel experience built to take guests further. To bring them home better. And thats a place wed like to stay. And a philosophy weve built our company around.Backed by some of the most well-regarded VCs in the Bay Area, we are building the future of hospitality so that we can inspire unforgettable moments of discovery and joy throughout the world. The data science team at Sonder is looking for a highly motivated individual to join the team as a machine learning engineer.AT SONDER YOU WILL:Be a part of a team that is focused on building data driven systems and machine learning solutionsUse machine learning to solve a wide spectrum of problems across multiple domains such as dynamic pricing, yield management, demand forecasting and recommendation systemsContribute to ideation, prototyping, design, and production of machine learning algorithms leveraging the latest developments in machine learning, neural networks and computer visionGet a rare & blue sky opportunity to design, build and scale some of these systems from scratchEXPERIENCES AND SKILLS:At least 3-5 years experience writing scalable and performant systems that deliver the output of machine learning models to downstream consumersStrong fundamentals in algorithms, data structures, statistics, predictive modeling, & distributed systems and the mathematical underpinnings thereofExperience with AWS technologies (including Redshift, S3, EC2, Lambda) in large-scale data warehousing and machine learning projectsStrong mastery of python and relevant ML librariesExcellent communication skills with the ability to distill complex issues and analysisMasters degree or PhD in Computer Science or another highly mathematical disciplineWe also have great benefits to make your life easier so you can focus on what you're best at:Competitive salaryGenerous stock option planMedical, dental and vision insuranceA company with a huge vision, a dynamic work environment, and a team of smart, ambitious and fun to work-with colleagues!Depending on your location:Daily catered lunchesAll the coffee you can imagineSnack-filled kitchenWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}