{"jobID": "2794245668", "jobLocation": "Arlington_VA", "jobTitle": "Principal Data Analyst (Web Analytics)", "companyRating": "4.4", "companyInfo": {"Website": "www.halfaker.com", "Headquarters": "Arlington, VA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": " Tracking Code  951-219  Job DescriptionHalfaker and Associates, an award winning high growth small business, creates innovative and customer-centric technology solutions in the areas of Cyber Security, Data Analytics, Software Engineering and IT Infrastructure to improve the health, security and well-being of all Americans. Our commitment to excellence and our vision to “Continue to Serve” has resulted in steady growth and an expanding client base across government agencies in the health, defense, security and intelligence sectors. Headquartered in Arlington, VA, we have employees nationwide and were recently named a 2017 Top Work Place by the Washington Post. Please take a moment to browse through our website and learn more about what it means to serve with Halfaker.  Halfaker has an opening for a Principal Data Analyst (Web Analytics) to join our talented, dynamic team. The key responsibilities for this position include: Lead a small team of Web Analytics associates, focused on monitoring and analyzing Google Analytics data to enable decision making by Federal Government leadersCollaborate closely with development teams to ensure that software architecture decisions enable effective web analytics data collectionLead analysis efforts of web analytics data, using Google Analytics and Google Tag Manager, to provide meaningful, actionable recommendations to Federal Government leadersMentor and coach Web Analytics team members Required Skills Highly motivated and analytical; proven problem-solving abilitiesAbility and enthusiasm for working in a fast-paced environmentExcellent critical thinking and analytical skillsExcellent formal business writing skillsAttention to detailWillingness and enthusiasm to learn new skills, new client environments, and grow domain expertise Required Experience Bachelor’s degree in Computer Science, Computer Engineering, Software Engineering, Systems Engineering, Management Information System, or similar field10 years of overall experience4+ years of industry experienceBachelor’s degreeMust be able to obtain Secret clearance, if neededMust be U.S. citizen Halfaker and Associates is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/ Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. Citizenship is required for most positions.Job Location  Arlington, Virginia, United States  Position Type  Full-Time/Regular"}