{"jobID": "2792130601", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Business Development Representative", "companyRating": null, "companyInfo": {"Website": "www.llamasoft.com", "Headquarters": "Ann Arbor, MI", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Like Stats?  Yeah, us too!  Check these:  600+ enterprise customers in 60 countries  50% of Fortune 100 companies are customers  23 of the Gartner Top 25 Supply Chain are customers  So, yes, were all about business. But were also all about sustainability, see our 2017 Green Award **  ICYMI: We were named to the 2017 Best and Brightest Company in the US of A and in Metro Detroits 2017 Best and Brightest Company list  Were well funded, fun and focused on building the very best in supply chain and we want YOU to help us build complex models that allow global companies to quickly, safely model supply chain impacts.  Dont believe us - read the Gartner Supply Chain Masters and youll learn that nearly all of the Gartner Supply Chain Top 25 use our solutions to tackle the most complex supply chains issues the world has ever seen.  Smart, energetic and ready to make your mark in a best in class enterprise software company? Join our herd! ** from Supply and Demand Chain ExecutiveThe Role: We are looking for a Business Development Representative (BDR) who is self-motivated and energetic to join our North American Business Development Team. The BDR will be responsible for generating business opportunities within a target list of large enterprise accounts. In this role, youll identify, qualify, and nurture new sales opportunities and help orchestrate an intelligent pursuit plan with assigned Account Executives and Sales Leadership. Job Description:Join a tight-knit team of driven and collaborative members, who truly live out the work hard, play hard work ethic and celebrate even the smallest wins as a team.Partner with designated Account Executives on targeted account research and lead generation for specific sales verticals.Assist and support the Sales Team in building and sustaining a 3-5x sales pipeline to quota.Secure new contacts via LinkedIn, email, telephone, etc., for inside sales campaigns for top target accounts as defined by Sales Director.Record new contacts, background, and all sales activity (cadence, tasks, engagement with prospects, etc.) in Salesforce.com.Proactively create demand for LLamasoft software solutions leveraging the following: value propositions, customer case studies, 3rd part commentaries, etc.Support prospect participation and recruitment in LLamasoft marketing initiatives such as SummerCon, industry events/webinars, tradeshows, etc.Email and telephone follow-up on regular Marketing and Sales Director campaigns.Provide weekly reports on metrics, feedback and activities.Collaborate with team on best practices, process improvement and education sessions; providing feedback.Achieve quarterly quotas set by Business Development Manager and Chief Marketing Officer.The Qualification:Highly motivated, independent individual, exuding a high sense of urgency at all times1 or more years in an Inside Sales role, preferably with a technology firm in a software sales environmentTeam player, interested in helping others with a can-do attitudeHigh comfort level, situational fluency, and senior presence with senior customer executives across procurement, logistics, IT, materials and financeCollege Degree in Business, Communications, Sales, other related fieldStrong communication, research and analytical skillsDemonstrated sales ability with prior work in a metrics driven environmentAbout LLamasoft: LLamasoft provides software and expertise to help companies design and improve their supply chain operations. We enable companies to model, optimize and simulate their supply chain operations, leading to major improvements in cost, service, sustainability, and risk mitigation. Supply Chain Guru®, LLamasofts flagship product, is the leading supply chain design and predictive analytics application available in the market today. LLamasoft is expanding its product offering into multiple design platforms as well as enterprise solutions.  Since 1999, LLamasoft has helped hundreds of global organizations in over 30 countries leverage their unique blend of technology and deep domain expertise to drive competitive advantage and savings across their supply chain operations.  LLamasoft offers a stimulating small company atmosphere where your efforts will have a significant impact on global logistics and our companys success. We are a fun, results-driven company that centers on developing high quality software, not work schedules and dress codes. We are driven by people who have a passion for technology and innovation. If you are excited about software development and looking for a fun and flexible environment in a growing company, please apply!  To apply for this position, please visit our online application portal at: http://www.llamasoft.com/careers.html  LLamasoft is an equal opportunity employer, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}