{"jobID": "2837555931", "jobLocation": "Farmington_Hills_MI", "jobTitle": "IT Support & Business Intelligence Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "IT Support & Business Intelligence Analyst Farmington Hills, MI AGC Automotive Americas (AANA) is a leading supplier of automotive glazing for the OEM and aftermarket industries and is part of the AGC Group, the largest global glass supplier employing more than 50,000 worldwide in approximately 30 countries.  The IT Support & Business Intelligence Analyst provides a combination of IT help desk support for a corporate office of approximately 100+ end users and identifies business intelligence, reporting and data analysis needs for the Automotive business segment of AGC located in Farmington Hills, MI. Responsibilities:Serves as the on-site single point of contact for end-users seeking technical assistance (computers/laptops/tablets, video conference, phone, internet, mobile, network, computer peripherals) at Corporate office of ~100 end usersUtilizes Companys service desk tracking software to ensure proper ticket creation, description and resolution are properly documentedAdheres to the deployment and use of AGC standard architecture and systems by end-users and work closely with AGC Communicates effectively with end-users throughout the entire lifecycle of support requests Performs LAN and WLAN troubleshooting, maintenance and repair with assistance from Shared Services Networking support teamPerforms necessary actions to maintain tape backup schedule and Disaster Recovery requirementsDesigns and creates BI reports and dashboards based on business needs and reporting requirementsTrains and supports end users on their reporting needs by using IBM Cognos tool and leveraging existing reportsWorks on automotive business unit reporting requirements and is the link between end users and IT development teams in IT shared services within a collaborative and matrixed organizationTravel less than 20%Must be able to move and lift objects weighting 30 lbsPerform other tasks and duties as assigned by managerQualifications:Bachelors degree in the field of computer science, information systems or a combination of other certification and relevant experienceFamiliarity with handling end-user accounts, permissions, access rights, and storage allocations in accordance with best-practices regarding privacy, security, and regulatory complianceExpertise with video conferencing design, setup and administration. LifeSize preferred Basic Knowledge of IBM Cognos reporting tool or similar will be a plus but not mandatoryShould display positive attitude to learn and pick up new skills and open to on the job learning ITIL Foundations or similar certification desirable We offer a competitive compensation package including base salary, structured bonus plan, comprehensive benefits and opportunities for career advancement  For more information and to apply, please visit: www.AGCcareers.com  Equal Opportunity Employer - To be considered applicants must be legally authorized to work in the US.  Please see above."}