{"jobID": "2754708364", "jobLocation": "San_Jose_CA", "jobTitle": "Pro. Services, Big Data Architect, NSW", "companyRating": "3.9", "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": "154000", "jobDescription": "Nokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things. Serving customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly transform the way people and things communicate and connect.NSW (Nokia Software)Job Position Summary Description:This team member will work with customers, Professional Services staff, and Sales to architect solutions and advise in the uses of various big data technologies along with other ETL, and system integrations. This architect will use their cross-industry, cross-functional, and cross-domain knowhow, to sketch out big data solution architectures centered on STIs Platform, then monitors and governs the implementation. Each Architect will carry a broad consulting experience in architecting high-performance enterprise solutions, sales support, customer interactions and has demonstrated the aptitude to specialize in one or more of the SI pillars: Big Data/IoT; Performance and Integration; Analytics; Geospatial and Application Lifecycle ManagementKey Responsibilities / Functions:Design the implementation approach, estimate project plans, and assist implementation with Nokia’s product suiteHelp program and project managers in the design, planning, and governance of implementing projectsServe as a principal technical client advocate and liaisonPerform analysis of business problems and technical environments, and use this in designing the solutionDevelop and maintain technical knowledge and lead software demonstrations to clientsWill explain work in plain language; working creatively and analytically in a problem-solving environmentAssist in providing ideas for product enhancements based on client feedbackDevelop staff to increase core competencies and delivery qualityLocation: Candidate should be located in: San Jose, CA; Austin, TX; or Murray Hill, NJRequired Qualifications: (Education, Technical Skills/Knowledge)A minimum of 10 years of experience architecting and implementing enterprise systems with +4 of them on Big Data SolutionsExperience in big data solutions like Hadoop, MapReduce, Hive, HBase, Cassandra, Teradata, and ClouderaExperience with ETL technologies such as Informatica, Talend, and PentahoExperience with a variety of databases such as Oracle, Green Plum, SAP BOBJ, BI, HANA, Teradata, and MongoDBExperience integrating systems to pull data into a data warehouse or big data solution using distributed technologies and/or message oriented middlewareA firm understanding of major programming/scripting languages like Java, Linux, PHP, Python, and RExperience in one of the large cloud-computing infrastructure solutions like AWS, EMR, and SparkDesired Qualifications: (Education, Technical Skills/Knowledge)Design of real-time and near-real-time applications preferredWeb/App Servers such as Tomcat, WebSphere, or Web Logic is a plusEducation:Bachelor’s Degree in Computer Science, Information Management, or equivalent experienceWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}