{"jobID": "2803128182", "jobLocation": "San_Antonio_TX", "jobTitle": "Senior Level Air Quality Environmental Scientist/Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.tetratech.com", "Headquarters": "Pasadena, CA", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (TTEK) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Tetra Tech is a leading provider of consulting, engineering, and technical services worldwide. Our reputation rests on the technical expertise and dedication of our employees-16,000 people working together across disciplines and time zones to provide smart, sustainable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech combines the resources of a global, multibillion dollar company with local, client-focused delivery in 400 locations around the world. We offer competitive compensation and benefits and are searching for innovative people to join our teams.Tetra Tech, Inc., an industry leader and nationally recognized engineering and consulting firm, is seeking a motivated, intelligent, and experienced professional to fill a Senior Level Air Quality Environmental Scientist/Engineer position at our Riverwalk, Texas office location.Responsibilities Include: Collect, analyze, and develop reports in support of environmental programs for federal, state, and local clients. Support Department of Defense and other agencies Air Quality Program to include: Air Emissions Inventories Title V compliance reviews Greenhouse Gas Inventories and reporting NSR, PSD, and Title V permitting. Support other environmental protocols as required. Project management and oversight. Technical writing. Data review, option evaluation, applicability review, and recommendation of best results. Client interaction and presentation of options and results. Production of deliverables. Project management, technical report writing, data analysis and client interaction are regular requirements associated with this position. Periodically there are requirements to present project findings to a client and relevant stakeholders. "}