{"jobID": "2823568016", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Financial / Data Analyst, Corporate FP&A;", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "71000", "jobDescription": "Senior Financial / Data Analyst, Corporate FP&A; Job Number: 113626014Santa Clara Valley, California, United StatesPosted: Jun. 20, 2018Weekly Hours: 40.00 Job SummaryThe Finance organization works with an immense amount of actual and forecasted financial data that can be difficult to compile and present in a meaningful way. With so many eyes on the performance of our company, it is imperative that we have the best tools and processes to quickly dissect and analyze all of our data accurately so that we may provide Apple’s senior leadership with the right information to make sound decisions. We need someone who can help build these tools that will drive decisions made at the highest levels.Key Qualifications 5+ years of relevant finance experience in a high performance organizationExtensive SQL knowledge and experience (SAP HANA a plus)Highly proficient in Tableau and ExcelSolid fundamentals in P&L; forecasting, budgeting, FP&A; conceptsReal Estate, CAPEX experience a plusAbility to communicate technical issues effectively with finance partners and business needs with technical partnersConceptualize long-term strategy for technical and scalable solutions and independently drive the success of a projectContinually challenge the status quo process and ensure continual value add & efficiency via automationProactive problem solver, expected to present problems and recommendations simultaneouslyAbility to maintain strict confidentiality around product launches, corporate forecasts and other strategic initiativesExtremely curious with strong ability to drive issues to root cause DescriptionThe Senior Financial Analyst will design, maintain, and innovate database solutions for various G&A; Finance teams. These solutions will be utilized to automate heavy manual processes, expedite the production of time-sensitive deliverables, and be the source of interactive and dynamic analytics and visualizations. This person will work within the Corporate FP&A; Reporting Innovations team to leverage existing database, Tableau workbooks, and best practices in order to replicate such solutions for our G&A; partners. Ideal candidates can quickly acclimate to different areas within Finance and provide quick and workable solutions towards building or enhancing analytics. Understand and identify the data needs of finance partnersModel the structure of the data to be housed within a databaseUse SQL to build views or procedures that automate lengthy calculations or data manipulationIdentify opportunities to automate manual processes via SQL/TableauCreate automated reporting tools that are intuitive, informative, and easy to maintain and update by non-SQL usersWork with dedicated IS&T; teammates to use their expertise, to build the tables and views, and to move objects or changes into the production environmentLeverage Corporate FP&A;’s SAP HANA database platform that can directly connect to other systems (BPC, SAP, HMS, EDW, Grid, etc)Be a focal point of improving our reporting practices across the Finance organizationEducationBachelor’s degree in a related field"}