{"jobID": "2604940482", "jobLocation": "San_Jose_CA", "jobTitle": "Machine Learning Scientist", "companyRating": null, "companyInfo": {"Website": "www.pit.ai", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Pit.AI Technologies is taking on one of the most exciting challenges of our time, namely solving intelligence, in one of the most competitive industries ever, hedge funds!  The team enjoys the duality of solving humongous research and engineering problems, while remaining focused on very concrete shorter-term breakthroughs. We believe in excellence, humility, trust and inclusion, and every team member has a veto power on who we hire.  We are backed by Y Combinator, prominent tech VCs David Lee & Zal Bilimoria, and legendary Renaissance Technologies co-founder Howard Morgan, to name but a few.  Pit.AI Technologies is hiring a Machine Learning Scientist. You'll be at the core of our effort to solve intelligence for investment management, and as such, you'll work very closely with the CEO/CTO to improve our current generation of AI-Quants.  You'll be expected to research new working algorithmic solutions to our proprietary statistical learning problem (which is similar to reinforcement learning), as well as solving large scale unsupervised learning problems on very noisy data sets.This is as much of an engineering role as it is a research role, and you'll be expected to have a critical impact on the bottom line, both in the short term and in the long term.  When tasked with solving a new problem, the ideal candidate will typically prefer thinking from first principles, and will favor simplicity and principled approaches over the latest 'hot' NIPS paper or arXiv submission he/she has read that appears remotely connected. At the same time, he/she is expected to have a profound understanding of the state-of-the-art, and should not shy away from mathematical complexity when it makes business sense.  Pit.AI Technologies supports publications of methodological findings to top machine learning venues. Requirements:Strong maths background, especially in probability theory and functional analysis, as evidenced for instance by a French DEA in maths, or the Cambridge Part III.Ph.D. / Post Doc in Machine Learning or Statistics from a top university/research group.Excellent record of methodological contributions to problems of flexibility, scalability or learning guarantees in any machine learning subfield (supervised learning, semi-supervised learning, unsupervised learning or reinforcement learning), for instance through publications in JMLR, NIPS, ICML, UAI, AISTATS, or through publicly available technical reports."}