{"jobID": "2817187701", "jobLocation": "Austin_TX", "jobTitle": "Sr. Big Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.homeaway.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Airbnb, TripAdvisor, 9flats.com"}, "estimatedSalary": "145000", "jobDescription": "HomeAway, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands. Job Responsibilities:Design, build, launch, and implement Hadoop solutions. Specifically, build and launch new data models that provide intuitive analytics to business partners.Perform data modeling and prepare data in databases for reporting through various analytics tools.Build distributed batch and stream compute data pipeline for the requirement using technologies such as Scala, Python, Spark, Hadoop, Hive, and Amazon Web Services.Work with multiple teams in HomeAway in understanding their Data Analytics Requirement.Collaborate and validate implementation with Data Analytics team and other technical team members.Set-up proper data governance and quality across the Data Analytics department and the business.Job Qualification:Bachelor's degree in computer science, engineering, or a related field5 years in Big Data frameworks including Hadoop, Hive and Spark5 years application development utilizing Scala and Java languages5 years in automation script development utilizing Python, Shell Scripting3 years in Batch and Stream processing using Spark and Kafka3 years Pipeline development on AWS using EMR and S3Nice to Have:Build tools such as Maven or SBTexperience in Rest API developmentBenefits & Perks:Competitive health and insurance benefitsCompetitive salaryAnnual target bonus or commissionPaid vacation and sick timeVacation rental on a yearly basis (taxable benefit)Employee Stock Purchase ProgramFree snacks and beveragesFrequent company update talks with our leadership teamFree listing on HomeAway.comElectronic, adjustable stand-up deskDiscounted Metro & Rail passCasual dress We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}