{"jobID": "2256988080", "jobLocation": "Santa_Rosa_CA", "jobTitle": "Housekeeper", "companyRating": "3.1", "companyInfo": {"Website": "www.mbkseniorliving.com", "Headquarters": "Irvine, CA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "12", "jobDescription": " Overview  Working at MBK Senior Living is more than a job-it is an opportunity to enrich the lives of seniors, their families, the professionals that serve them plus be a part of a dynamic and growing team! Our positions provide the opportunity for associates to share their passion and dedication while making a difference in the lives of our storied residents every day.  We are currently seeking a Housekeeper for our Oakmont Gardens community in Santa Rosa, CA. *This is a NOC shift position. The hours are from 11p-7:30a* The Housekeeper is responsible for cleaning all of the resident apartments, public areas and work areas within guidelines, policies and procedures of the community. May be directed by the Executive Director, Director of Environmental Services, Director of Housekeeping or other designee of the Executive Director. Must demonstrate superior customer service and maintain the high standard of cleanliness that has been established for the community. ResponsibilitiesEssential Job Duties (Include % of time for each responsibility):Clean all resident apartments, common areas and offices of the property to assure the building is clean at all times (includes, but is not limited to: furnishings, fixtures, ledges, room heating/cooling units, bathroom fixtures – bathtubs, toilets, showers, sinks, windows/mirrors, blinds, shutters, etc., in resident apartments; public bathroom areas, entrance/exit ways, recreational areas; floors to include sweeping, dusting, damp/wet mopping, stripping, waxing, buffing, disinfecting, etc.; carpets to include vacuuming, shampooing, deodorizing, and disinfecting; walls and ceilings by washing, wiping, dusting, spot cleaning, disinfecting, deodorizing, etc.; remove dirt, dust, grease, film, etc. from surfaces using proper cleaning and disinfecting solutions; hallways, stairways, and elevators; and discard waste/trash into proper containers andreplace trash receptacle liners, etc.). 100%Ensure that all appropriate caution/safety signs are properly set up and posted prior to performing duties that could cause slips/falls or any other safety risks, and taken down when job is completed and risk has been removed 100%Report any health, safety and /or sanitation concerns to the supervisor; including reporting any apartment repairs or conditions that need attention by other departments 20%Follow the work/cleaning schedules as closely as practical 100%Monitor and remove all trash and waste from inside areas of community to designated trash cans/areas with continued monitoring throughout shift 20%Keep work areas attractive and free of hazardous objects such as protruding mop/broom handles, and unnecessary equipment – putting all equipment away as soon as the job that requires it is finished 20%Use all appropriate safety and protective equipment and supplies when handling hazardous waste and/or chemicalsFollow all established PPE (personal protective equipment) policies when handling chemicals and/or cleaning; including wearing gloves, masks, aprons, etc. 100%Follow all established techniques, procedures and policies for properly storing, using and mixing chemicals, disinfectants, and solutions used for cleaning, and for the proper disposal of waste 100%Lock and control all housekeeping supplies and carts making sure that chemicals and/or hazardous materials are not left unattended, or accessible to residents or visitors 20%Follow established policies governing the use of labels and Material Safety Data Sheets (MSDS) 100%Assist in the marketing of the community by always displaying a positive and professional image through actions and dress and according to the MBK principles and core values 100%Encourage teamwork through open communication with co-workers and other departments 100%Display tact and friendliness when dealing with residents, families, and guests 100%Perform other duties as consistent with the position and as assigned by the Director of Environmental Services , Director of Housekeeping, and/or Executive Director 20%Non-Essential Job Duties:May need to assist in the moving of residents during emergency situationsDust, fluff, and straighten all furniture in public areas to ensure cleanliness and safetyQualificationsRequirements (Include education, experience, special skills, licenses, and certifications):Age 18 or over, or have the proper work permit and work authorization documentationHigh school diploma or GEDBackground clearances as required by government regulationsComplete a health screening and provide negative TB test results (must be within the last 6 months or within 7 days of employment)Prior housekeeping experience preferred but on the job training is available for candidates with the right attitude and desireMust be able to read, write, and speak EnglishAbility to follow oral and written directionsAbility to interact effectively with people of different ages and backgroundsPhysical Demands (Include lifting, carrying, pushing, pulling, bending, walking, standing, and sitting):Ability to use standard cleaning equipment consistent with the positionMust be mobile and able to execute the physical demands of the housekeeping position; including but not limited to standing for long periods of time, bending, kneeling, stooping, pushing, pulling, repetitive motion, etc.Must be able to lift cleaning equipment and products of 40+ pounds. Requires frequent carrying, pushing and pulling of cleaning supplies and carts. MBK Senior Living is a dynamic, growing company that opened its first senior living community in 2004. We currently have twenty-two communities in five states.  As an MBK community associate, you will enjoy the genuine spirit of caring and collaboration that makes each of our communities so well respected within their local neighborhood. In addition, you will become part of an ever increasing community of professionals who have the passion and dedication of building meaning­ful relationships with our residents and their families now and for years to come.  We offer a rich benefit package including; competitive salaries, 401k retirement plan with employer matching, comprehensive medical, dental and vision insurance, and paid time off.  If you are ready to meet the challenges of this critical role, we want to hear from you!"}