{"jobID": "2707885634", "jobLocation": "Chicago_IL", "jobTitle": "Senior Research Scientist - Statistical Modeling", "companyRating": "4.2", "companyInfo": {"Website": "www.8451.com", "Headquarters": "Cincinnati, OH", "Size": "501 to 1000 employees", "Founded": " 2015", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " The Senior Research Scientist will employ skills and experience to discover, create, and innovate. The senior research scientist will advance and apply leading-edge machine learning methods to rich data and domain knowledge in order to shape and progress our current and future research directions. The role has both strong foundational research and computational components.General DescriptionThe Research Scientist will employ skills and experience to improve, create and innovate data-driven modeling approaches for our price and promotion solutions, while anticipating and charting future research needs. The role has both strong research, modeling, and computational components. Additionally, the role will require exploring and examining data from multiple sources to uncover insight that will help price and promotion science.SpecificsThe Research Scientist will create solutions in areas of importance to 8451, including, but not limited to: Applying machine learning techniques (regression, classification, prediction, and clustering) to extremely high dimensional dataDeveloping extremely high dimensional cross category sales demand modelsTime series analysis and online learningModel validation and calibrationAnalyzing data from many sources, and applying statistical methods to gain insightsDriving applications of research to problems that arise in retail, manufacturing, and market scienceDeveloping resource allocation/optimization algorithms and recommender engines that utilize cutting edge forecasting models Project responsibilities run from requirement formulation, literature exploration, selection of methods, creation and prototype of solutions, and working closely with other Scientific Researchers, Scientific Developers, and Software Engineers to productionize the solution.Qualifying Experience & SkillsTypical Research Skills and Experience IncludeStrong statistical / machine learning background Solid background researching statistical machine learning methods, especially forecasting, supervised learning, classification and classification trees, Bayesian methods.Experience with high performance computingKnowledge of techniques for robust modeling of high dimensional data is essential Developing extremely high dimensional cross category sales demand models is preferredExperience with time series analysisModel validationComfortable with analysis of data on multiple scales from many sources including unstructured dataExperience in price, promotion, and assortment modeling is preferredExperience with optimization is preferred: both continuous and discreteDesired Computation Skills IncludeR and Python development or prototyping expertiseExperience with multi-threaded and cluster computingExperience with SQLExperience in C++ is preferredExperience with Unix/Linux environments.Ability to create computationally efficient solutions, applying techniques from statistics and machine learningExperience with Big Data concepts, tools and architecture.EducationThe successful candidate will have a PhD in computer science, computer engineering, mathematics, statistics, operations research, or related subject; and/or extensive work or other experience demonstrating expertise utilizing these skills. Alternative education with extensive experience demonstrating track record with R&D; projects will be considered.  84.51° is an Equal Opportunity Employer."}