{"jobID": "2764030858", "jobLocation": "Austin_TX", "jobTitle": "HPC Analytics Research Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.arm.com", "Headquarters": "Cambridge, United Kingdom", "Size": "5001 to 10000 employees", "Founded": " 1990", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Intel Corporation, Imagination Technologies, NXP Semiconductors"}, "estimatedSalary": "77000", "jobDescription": "We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. Job Description HPC Analytics Research ScientistThis role presents an excellent opportunity to engage in ground breaking research in high performance analytics applications, algorithms and co-design of purpose driven accelerators.AbouttheroleArm is entering a new and exciting growth phase to develop innovative technologies and capabilities for existing and new markets. To do this we need talented, innovative and motivated people to join our global team. At Arm you will work with the world’s best companies and government organizations as we build sector-leading products from our IP. You’ll share ideas with and learn new skills from the best research scientists in the world. We work in small teams, so your contributions will make a difference. This role offers you the chance to lead, challenge the status quo and ultimately change the world of HPC Analytics.WhatwillIbeaccountablefor?If you join the Arm Research team, you will collaborate with colleagues in Arm, academia, government, and industry to generate ground breaking new algorithms, applications and architectures that will fundamentally change how insights from massive static and dynamic data sets are derived. Collaborations will include domain experts in ML, cybersecurity, IoT, health care, and more. Job Requirements Education&QualificationsWorking towards or completed PhD in Computer Science and Engineering.Skills&ExperienceAbility to express ideas and communicate effectively (essential).Experience in Tensor and Graph analytics (essential).Experience in High Performance Computing (essential).Experience in machine learning and neural networks (aspirational)Excellent English language skills, both written and spoken.Whatarethedesiredbehavioursforthisrole?Arm is proud to have a set of behaviours that differentiate our talent in the marketplace. This reflects our creative culture and guide our decisions, defining how we work together to defy ordinary and shape extraordinary. These are embedded in all our roles and applicants are encouraged to showcase their attitudes during the application process:Deliveryofresults – You demonstrate a can-do attitude and you aim to overcome obstacles, acting with a sense of urgency because you’re passionate about what you do.Partner/customerfocus – Your tendency to put your partners and customers first in all that you do by understanding their needs and striving to achieve the best outcome for both.Creativity/innovation – Possessing curiosity and a passion for driving continuous improvement through spotting opportunities and seeking the views of others.Collaboration/communication – Your ability to forge relationships which are built upon mutual trust, open communication and sharing of information and success.Personalimpact/influence – You listen to different perspectives, evaluate, persuade and carefully shape your work to deliver truly impactful results.Team/personaldevelopment – You take time to drive your own development, while also encouraging team members and partners to do the same. Benefits Your particular benefits package will depend on position and type of employment and may be subject to change. Your package will be confirmed on offer of employment. Arm’s benefits program provides permanent employees with the opportunity to stay innovative and healthy, ensure the wellness of their families, and create a positive working environment.Annual Bonus PlanDiscretionary Cash Awards401(k), 100% matching on first 6% eligible earningsMedical, Dental & Vision, 100% coverage for employee only, shared cost for dependentsBasic Life and Accidental Death and Dismemberment Insurance (AD&D;)Short Term (STD) and Long Term (LTD) Disability InsuranceVacation, 20 days per year with option to buy 5 more.Holidays, 13 days per yearSabbatical, 20 paid days every four-years of serviceSick Leave, 7 days per yearVolunteering, four hours per month (TeamARM)Office location dependent: café on site, fitness facilities, team and social events Additional benefits include: Flexible Spending Accounts for health and dependent care, EAP, Health Advocate, Business Travel Accident Program & Commuter programs.  ARM, Inc. (USA) participates in E-Verify. For more information, please refer to www.dhs.gov/E-Verify  About Arm  Arm® technology is at the heart of a computing and connectivity revolution that is transforming the way people live and businesses operate. From the unmissable to the invisible; our advanced, energy-efficient processor designs are enabling the intelligence in 86 billion silicon chips and securely powering products from the sensor to the smartphone to the supercomputer. With more than 1,000 technology partners including the world’s most famous business and consumer brands, we are driving Arm innovation into all areas compute is happening inside the chip, the network and the cloud. With offices around the world, Arm is a diverse community of dedicated, innovative and highly talented professionals. By enabling an inclusive, meritocratic and open workplace where all our people can grow and succeed, we encourage our people to share their unique contributions to Arm's success in the global marketplace. About the office  The Arm Austin office employs staff from across all divisions of ARM and is considered the engineering hub for North America. Austin has the nickname of “Silicon Hills” thanks to the high number of tech companies in the area, and is also known as the “Live Music Capital of the World\". Events such as South by Southwest, Austin City Limits Music Festival and the F1 Grand Prix are but a few of the many activities that make Austin a top destination for both residents and travelers.  Austin, TX USA  Arm Inc.  Encino Trace  5707 Southwest Pkwy  Bldg 1 Suite 100  Austin, TX. 78735  See on Google maps "}