{"jobID": "2720413471", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " WhereTo is a venture backed startup that inspires and empowers today’s corporate travelers with an AI-based travel experience. We are a team of fifteen engineers, artists, and entrepreneurs re-imagining corporate travel from our HQ in San Francisco. Our commitment to innovation has attracted partnerships with Fortune 100 companies and won us accolades in TechCrunch, Life Hacker, and more.  We are looking for a Data Scientist to be a pivotal member of our engineering team. You will be working closely with product managers and developers who like to use lots of interesting technologies to develop core features used across the WhereTo platform. A great fit for this role is someone who is always intrigued by new technology and is constantly finding better ways to make sense of large amounts of data. Requirements Everything involved in analyzing a production data set, including: Writing code to transform massive raw data output into a structured, usable form Leveraging more traditional machine learning techniques to uncover hidden relationships in our data sets Conducting statistical analysis of results to prove / disprove hypotheses, and Write up reports that our other team members can use to deliver in a product Interface closely with the Product, Business Development, and Sales teams on our data sets for our customers and partnersRESPONSIBILITIES You have an undergraduate or graduate degree in computer science or similar technical field, with significant coursework in mathematics or statistics You have 1-2 years of industry data science experience You have successfully worked with complex data sets and are familiar with Hadoop / Spark You know the ins and outs of Python, especially as it applies to the above data processing frameworks You are capable of quickly coding and prototyping data pipelines involving any combination of Python, Node, bash, and linux command-line tools, especially when applied to large data sets consisting of millions of files You have a working knowledge of the following technologies, or are not afraid of picking them up on the fly: C++, Scala / Spark, R, Matlab, SQL, Cassandra, Docker You are comfortable with running and interpreting common statistical tests, and also with common data science techniques including dimensionality reduction and supervised and unsupervised learning You have great communication skills and ability to work with others You are a strong team player, with a do-whatever-it-takes attitudeBenefitsCompetitive salaryAn opportunity to get in on the ground floor with significant equity upsideMedical, Dental and VisionPaid annual vacationCheap flights to anywhere in the worldGenerous PTO to take advantage of those vacation spotsGym Stipend"}