{"jobID": "2729702683", "jobLocation": "Washington_DC", "jobTitle": "Technical Program Manager, Data for Development (D4D), DIAL", "companyRating": "3.5", "companyInfo": {"Website": "www.unfoundation.org", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " The World Bank, Amnesty International, International Rescue Committee"}, "estimatedSalary": "116000", "jobDescription": " The Digital Impact Alliance (DIAL) is a global alliance to enable the digital ecosystem to deliver greater scale, efficiency, and social impact as it creates more inclusive digital economies in emerging markets. Working with partners, DIAL generates evidence of what works through a series of demonstration projects, distils insights and tools to promote scale-up and replication, and provides mechanisms to encourage knowledge sharing, collaboration, and co-investment throughout the ecosystem.  DIAL is funded through a collaboration among the Bill & Melinda Gates Foundation, USAID and the Swedish International Development Cooperation Agency (Sida), and hosted within the UN Foundation in Washington, D.C.  DIAL is seeking a Technical Program Manager to join the Data for Development (D4D) team. DIAL provides the enabling environment for release of public goods such as open source software, analytical methods, data models, APIs, algorithms, dashboards and visualizations that will aid the D4D ecosystem in effective program delivery. The Technical Program Manager shall manage and coordinate cross-functional technical partners in the delivery of these integrated data analytics solutions to deployment. Such solutions will be designed for rapid deployment in humanitarian and development settings and will leverage structured, semi-structured and unstructured datasets, such as mobile operator data, geospatial data, digital platforms and routine/ aggregate datasets. The Technical Program Manager shall ensure that technical partners deliver high quality and fit for purpose products with continuous improvements, feedback mechanisms and field learnings through the development cycle from inception to post production support.  The Technical Program Manager will work closely with the Director of Technology in translating the technical and operational needs of DIAL and its partners such as MNOs, program partners in public health, agriculture, humanitarian response, country ministries and multilateral organizations to tangible, easy to deploy D4D solutions, at scale in priority low-income countries. Finally, they will work closely with the D4D team and key partners such as GSMA to craft a learning agenda capturing ecosystem experiences from program delivery. Work with a wide range of technology partners to define requirements of data for development solutions.Manage the software development lifecycle of data for development platforms from requirements elicitation to design, deployment, delivery, testing and maintenance.Assume leadership in identifying key technical and operational changes along software development lifecycle. Propose solutions and mitigating approaches to potential risks.Define KPIs to monitor the performance of technology partners (system integrators, analytics companies, country-implementation partners, program partners) through software development lifecycle from inception to post production support.Ensure that technical partners employ Agile/SCRUM development processes documenting key variants along the project life cycle.Provide leadership across x-functional teams within DIAL and key D4D actors including MNOs, development and humanitarian agencies, etc. to ensure that the design of the D4D solutions conform to the needs of end users (country governments, service providers and field practitioners).Work with DIAL partners to ensure alignment with regulatory regimes as related to local data protection and data privacy laws. Steer technology partners to provide best-in-class consultative guidance for data protection across the analytics process.Advocate for the development of D4D solutions that can be deployed across a variety of deployment environments (x-country and x-domain common data architectures).Ensure that technical partners develop thorough documentation to curate all activities along the development life cycle to make repurposing of deliverables easy and quick for redeployment.Assume responsibility and technical ownership of relationship with technical and engineering units within technology partner organizations.Enforce alignment with open access and open source principles and common technical architecture, standard indicators and data management approaches in the design and delivery of solutions.Support technology partners to synthesize intellectual property (IP) (e.g., algorithms, scripts, learnings, methods) and learnings, and co-design and deliver a set of open source, open-access approaches to enabling D4D in-country and globally.Provide thought leadership to DIAL, its donors, and broader D4D community around using data for social good. — 10+ years of experience as Technical Program Manager or Software Engineering Manager or equivalent role with experience as an engineer, software developer or data scientist.Experience with telecommunications data, geospatial data and digital domains.Experience working with third party technology vendors, system integrators, analytics firms to deliver full products.Experience in managing the development of large-scale digital platforms and data solutions, by partnering with product and solution engineering teams.Previous technical architecture experience using open source technologies preferred.Experience translating technical and engineering decisions into actionable tasks.Understanding of multiple technology platforms, data convergence solutions, Big Data, and Data Science and Machine Learning toolkits.Demonstrated experience with the following: approaches for analyzing structured and unstructured datasets, data integration and ETL/ELT processes, data science toolkits, advanced analytics, statistical packages, data visualization tools and cloud solutions.Expertise in providing consultative guidance in business solution design, development, implementation, and support among external partners including the management of multiple technology vendors in onshore-offshore models.Ability to work independently and collaboratively as part of a cross functional team, to develop common architecture, standards, and scalable data governance frameworks that adhere to regulatory guidelines across multiple stakeholders.Experience supporting deployment of enterprise/commercial solutions across infrastructure, platform, and application projects. Experience both modifying and enhancing legacy systems, and developing greenfield platforms and applications.Demonstrated leadership, strong interpersonal communications, relationship development, and conflict management skills.Passionate technical leader with ingenuity and resourcefulness with a track record of experiences in multiple global geographies.Balanced experience across people management, program management, product/ solution engineering and product management and marketing that includes advisory and hands on responsibilities to technical teams.Fluent in EnglishBachelor’s degree in related subjectsStrong interest in traveling to the Least Developed Countries (LDC) with the team up to 25% of the time. For full-time, benefit eligible employees, UNF offers an excellent range of benefits, including: A choice of two health plans through CareFirst (PPO or HDHP with HSA),dental insurance,vision discounts,flexible spending accounts,403b retirement savings plan with a generous matching contribution,group term and supplemental life insurance,short-term disability,long-term disability,health club discounts,commuter benefits, andemployee assistance program. Additionally, all benefit eligible employees have 12 paid holidays, 20 vacation days, 10 sick days, 3 personal days, and 8 weeks of parental leave.  The team will consider applicants living outside of the DC area who are interested in relocating to join the team, as well as individuals interested in working remotely from high tech hubs such as Seattle, San Francisco, New York City, or Portland. Non-US based candidates will be considered for long-term consulting roles."}