{"jobID": "2712172378", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist - AI-driven Enterprise SaaS", "companyRating": "4.1", "companyInfo": {"Website": "www.clari.com", "Headquarters": "Sunnyvale, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "178000", "jobDescription": "Data Scientist - AI Driven Enterprise SaaSClari is seeking a superstar Data Scientist to join our engineering team. You will combine software engineering, data analysis, statistical analysis, algorithm and machine learning disciplines to derive meaningful results in our problem space domain. The ideal candidate will have a deep knowledge of machine learning and data mining techniques along with practical applications of academic research for large-scale data analysis. You will implement data analysis algorithms and integrate them with production-software for use within our cloud-based customer-facing infrastructure.Tired of crowded markets, relentless price pressure, abandoned software, and unhappy customers? We were too. Let us introduce you to Clari.For more than 5 years now, weve been delivering results and transforming the way our customers sell, forecast, and close. Industry leading companies like Box, Juniper Networks, Symantec, Okta, Palo Alto Networks, and Hewlett Packard Enterprise use Clari in every 1:1, QBR and forecast call armed with AI-driven visibility and predictive insights that boost rep productivity, improve pipeline health, and increase forecast accuracy. The most successful sales teams run on Clari, from opportunity to close. With Claris AI platform, sales reps know where to focus, managers can immediately spot risk in pipeline, and execs forecast with confidence.Starting with the sales organization, were creating software that people love to use and solving BIG problems for our customers -- leveraging AI to transform the way they make decisions, how they work, and how they grow. Theres a huge opportunity ahead of us, and were about to blast off. Want a seat on the rocket?Responsibilities:Work within the product team to understand key high-value problems in the enterprise sales application domain that can be solved by applying data science.Evaluate various machine learning algorithms for accuracy and value for specic analytics problems.Apply and implement machine learning algorithms and techniques for creatively solving new class of problems. Build data science components using microservices architecture.Develop algorithms for feature extraction and feature engineering from multiple signal sources.Help develop a strong public prole, highlighting your Data Science work across industry forums, public conferences and meetups.Recommend data infrastructure architecture for driving large-scale data science algorithms.Requirements:Ph.D. in a relevant technical eld, Computer Science, Data Science, Machine Learning, Statistics, Mathematics, etc.Practical experience solving analytical problems using data-driven, quantitative approaches.Familiarity with algorithm scaling, complexity and parallelization techniques for addressing large data volumes using Hadoop, Spark etc.A passion for answering questions from analysis of data.Familiarity with data organization and methodical improvement in algorithm evaluation to derive conclusions. Keen sense of statistics, error rates, familiarity with statistical tness evaluations.Ability to communicate technical ndings based on complex quantitative analysis in a clear, precise, and actionable manner. Expert knowledge of analysis tools such as R, Matlab or SAS and packages such as NumPy and SciPy.Experience in Java, and/or Scala based component development and for large cloud-based software deployment and production systems.Familiarity with of SQL, NoSQL and data management.Why Clari?Clari is a fun and fast-growing Silicon Valley company. We were named as a 2017 Bay Area top workplace for the third consecutive year. Clari grew 3x in 2017 and was recognized as Gartner Cool Vendor in Gartners 2017 Tech Go-to-Market category and named in G2 Crowds Top 100 Software companies, Top 50 Mid-Market companies and Top 25 Silicon Valley companies.Heres why Clari may be the perfect next step for you.1. Culture: promoting personal growth, independence, and teamwork.2. Executive team: a savvy team on their third company with deep market experience.3. Customers: leading companies that run their business on Clari.4. Investors: top VCs Sequoia, Bain Capital, and Northgate that make up our superb and supportive board.Our team is made up of veteran entrepreneurs, brilliant engineers, tried-and-true sales professionals that have done this before and want to do it again, this time only bigger. Whats left to add? You.We are just a block from the Caltrain station in the heart of the Silicon Valley.Lets talk about whether Clari is the next logical next step for you."}