{"jobID": "2816834066", "jobLocation": "Pleasanton_CA", "jobTitle": "Staff Scientist, Manufacturing Sciences", "companyRating": null, "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": null, "jobDescription": " Job DescriptionJob Title: Staff Scientist, Manufacturing Sciences Requisition ID: 70036BR  Thermo Fisher Scientific Inc. (NYSE: TMO) is the world leader in serving science, with revenues of more than $20 billion and approximately 65,000 employees globally. Our mission is to enable our customers to make the world healthier, cleaner and safer. We help our customers accelerate life sciences research, solve complex analytical challenges, improve patient diagnostics, deliver medicines to market and increase laboratory productivity. Through our premier brands Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific and Unity Lab Services we offer an unmatched combination of innovative technologies, purchasing convenience and comprehensive services. Responsibilities:Work closely with business development, R&D;, manufacturing, quality and product management to develop and launch new RUO and/or regulated products that meet manufacturing and customer needs.Manage multiple projects and initiatives concurrently to meet product as well as process release/transfer timelines.Lead, plan and design experimental methods to achieve technical objectives as well as identify and solve complex problemsResearch, design and implement experiments for future products and lead process improvement efforts.Work with teams to investigate trends, perform statistical trend analysis, conduct root cause investigation, provide recommendations and implement corrective action where neededProvide technical support via knowledge of principles and theories through familiarity with competing technologies and/or products and review of current scientific literature.Collaborate with departments across the organization to resolve technical issues and support products.Prepare and present written and oral reports to managers, extended R&D; teams, and senior leadership.Perform other responsibilities to support the needs of the department, as assigned.Interact with suppliers, operations, logistics, QA, EHS, and R&D;Work with instruments that are used for oligonucleotide manufacturing such as oligonucleotide synthesizer, HPLC, MS, Spectrophotometer, PAGE, liquid handlers.Minimum Qualifications:"}