{"jobID": "2824669416", "jobLocation": "Dallas_TX", "jobTitle": "Strategic Operations Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.santanderconsumerusa.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1995", "Type": " Company - Public (SC) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Ally Financial, Exeter Finance, GM Financial"}, "estimatedSalary": "63000", "jobDescription": "Summary of Responsibilities: The Strategic Operations Data Analyst is responsible for performing analytical research and creating Key Risk Indicators (KRIs) and Key Performance Indicators (KPIs) in support of the Strategic Operations team commitment to the enhancement of the Risk Management and Internal Control Framework within the 1st Line of Defense. This includes the design and development of reports and dashboards. The Data Analyst will monitor trends and will escalate any potential risks observed in variances. The Strategic Operations Data Analyst will work closely with the Strategic Operations groups, IT and Business units to ensure complete, consistent and accurate information is captured and reported in order to support the monitoring, measurement, and mitigation of risk within the 1st LOD Operations area. Essential Functions:Responsible for production of reporting, ad-hoc analysis and Key Risk Indicators (KRIs) and Key Performance Indicators (KPIs) and performs analysis of the underlying data and highlights trends, issues and possible findings.Responsible for documentation of risk metrics and performance monitoring of metricsExtracts, analyzes, and interprets data using SQL and applied statistical techniques to assist the Strategic Operations group.Develops a thorough understanding of the firms operations, business practices,, and production systems to ensure accurate use of information within reports and data analysis.Review data elements used in reports to identify possible data quality and accuracy issues and escalates identify issues to his/her direct manager.Work with the data stewards to capture business rules and provide data quality requirements for the Strategic Operations group. Successfully complete all mandatory training programs within set timeframes and takes appropriate actions to ensure that assigned team meets requirements. Requirements:Bachelors degree in a related field required.Five (5) Seven (7) years of progressively responsible experience in Reporting and Data Analytics required.Demonstrated ability to merge, concatenate, clean, and prepare large datasets from multiple relational databases using SQL and ETL (Extract, Transform, and Load) tools.Experience working within reporting, risk management and data management functions.Advanced knowledge of MS Office Suite.Analytical, technical and problem solving skills, with strong attention to detail. Strong written and verbal presentation skills and ability to communicate well with senior management with minimal guidance.Strong collaboration, and time management skills.Ability to adapt to various work environments and project schedules.Ability to work effectively in a team environment with all levels of personnel.Strategic and tactical thinker with ability to multitask and prioritize.Special projects as requested.Performs other duties as assigned.Working Conditions: The working conditions described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Extended working hours may be required as dictated by management and business needs.Travel to multiple facilities may be required.May be required to lift, push, or pull materials weighing up to twenty (20) pounds.May be required to sit and review information on a computer screen for long periods of time.May require repetitive motions of the hands and wrist related to writing and typing at an electronic keyboard.May be required to sit and review information on a computer screen for long periods of time.May require repetitive motions of the hands and wrist related to writing and typing at an electronic keyboard.Employers Rights: This job description does not list all the duties of the job. You may be asked by your supervisors or managers to perform other duties. You will be evaluated in part based upon your performance of the tasks listed in this job description.  The employer has the right to revise this job description at any time. This job description is not a contract for employment, and either you or the employer may terminate employment at any time, for any reason."}