{"jobID": "2665855233", "jobLocation": "Chicago_IL", "jobTitle": "Azure Big Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "97000", "jobDescription": "Basic QualificationsMinimum 6 months of designing, building and operationalizing large scale enterprise data solutions and applications using one or more of Azure data and analytics services in combination with custom solutions - Spark, Azure Data Lake, HDInsights, SQL DW, DocumentDB, Search, Elastic Pool etc. Minimum 6 months of hands-on experience analyzing, re-architecting and re-platforming on-premise data warehouses to data platforms on Azure cloud using Azure/custom services Minimum 6 months of designing and building production data pipelines from ingestion to consumption within a hybrid big data architecture, using Java, Python, Scala etc. Minimum 6 months of architecting and implementing next generation data and analytics platforms on Azure cloud Minimum 6 months of designing and implementing data engineering, ingestion and curation functions on Azure cloud using Azure native or custom programming Minimum 6 months experience in performing detail assessments of current state data platforms and creating an appropriate transition path to Azure cloud Hands-on Azure experience with a minimum of 1 solutions designed and implemented at production scalePreferred SkillsBachelor's degree in Computer Science, Engineering, Technical Science or 3+ years of technical architecture and build experience with large scale solutions Minimum 6 months of experience in architecting large-scale data solutions, performing architectural assessments, crafting architectural options and analysis, finalizing preferred solution alternative working with IT and Business stakeholders 6 months of hands-on experience designing and implementing data ingestion solutions on Azure using Azure native services or using custom approaches 6 months of hands-on experience architecting and designing data lakes on Azure cloud serving analytics and BI application integrations 6 months of experience in designing and optimizing data models on AZURE cloud using Azure data stores such as Redshift, RDS Minimum 6 months of experience integrating AZURE security services with AZURE data services for building secure data solutions Minimum 6 months of experience introducing and operationalizing self-service data preparation tools (e.g. Trifacta, Paxata) on AZURE Minimum 6 months of architecting and operating large production Hadoop/NoSQL clusters on premise or using Cloud services Minimum 6 months architecting and implementing metadata management on Azure Architecting and implementing data governance and security for data platforms on Azure Designing operations architecture and conducting performance engineering for large scale data lakes a production environment Craft and lead client design workshops and provide tradeoffs and recommendations towards building a solutions Author blog entries and whitepapers on AZURE data solutions, architecture and strategic topicsCALL TO ACTION Now is the time to become a digital disrupter. The opportunity is herewhats stopping you from pursuing it?  Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).  Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  Accenture is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.  Equal Employment Opportunity:  All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Job Candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.  Accenture is committed to providing veteran employment opportunities to our service men and women."}