{"jobID": "2608761937", "jobLocation": "Hopewell_NJ", "jobTitle": "Data Science Lead", "companyRating": null, "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.  As key member of Global Biometrics Sciences team, candidate will be part of a cross-functional team of drug development scientists and data scientists focused on providing hands on skills, expertise and tools to facilitate access, integration, visualization, and exploratory analysis of complex and diverse data in support of clinical development activities and decisions.  This candidate will drive execution of exploratory analysis (hypotheses generating and hypotheses generated questions) for scientific considerations related to drug development and clinical study design. Through practical hands on work, this candidate will define approaches, processes, algorithms, and tools that support the analytics visualization and decision support needs of drug development scientists and projects. Candidate will play a key role in building the team with the necessary skills, build relationships with relevant stakeholders, and implement relevant tools and approaches.  Candidate will collaborate with Biostatistics leads and other members of drug development teams to ensure connectivity of exploratory analysis work in support of development, regulatory approval and market acceptance of Bristol-Myers Squibb (BMS) products.  This position may include functional management responsibilities.  Key Business Partners Statisticians, Statistical Programmers and vendors, Drug Development Teams, Regulatory, Pharmacovigilance and Epidemiology, Health Economics and Outcomes Research, Project Managers  Detailed Position Responsibilities Develop novel ways of integrating, mining and visualizing diverse, high dimensional and disparate data sets.Formulate, implement, test, and validate predictive models, and implement efficient automated processes for producing modeling results at scale.Discover stories told by data and present them to others through rich and intuitive visualizations.Builds successful partnerships and seamless interfaces within the department and the broader research and development organization. Communicates proactively and effectively around issues and risks and contributes to remediationEnsures quality of deliverables by consistently applying analysis and reporting standards, and driving compliance with regulatory requirements, corporate and departmental SOPs and work practicesProvides comprehensive programming leadership and analytical skills to clinical project teams, including deployment of programming strategies, standards, specifications and programmed analysis to comply with regulatory requirements, corporate and departmental SOPs and work practicesDrives the development and implementation of innovative strategies and technologies. Develops unambiguous and robust programming specifications for internal and external programming workIndependently develops, troubleshoots, and maintains complex programs and utilities in accordance with predefined specifications and BMS standardsProvides technical guidance to vendors concerning project standards, programming conventions/specifications and programming practices to ensure efficient and integrated project computing strategiesUnderstands software development methodologies and appropriately applies those methodologiesIdentifies opportunities for increased efficiency and consistency within GBS and provides SME support to continuous improvement initiatives within and beyond GBS Knowledge/Skills/Ability Outstanding technical and analytic skills, proficient at understanding and conceptualizing business problems and implementing analytic or decision support solutions Excellent communication, organizational, motivational, leadership, and interpersonal skills, capable of interfacing well at multiple levels within and across R&D; Demonstrated ability to develop and lead a team of expertsProficient with analysis tools and methods, structure decision making and decision support approachesDemonstrated proficiency working with business and technical teams including good understanding of translational medicine and its challenges in pharmaceutical R&D;Ability to summarize technically/analytically complex information for a non-technical audienceProven ability to develop and execute strategic and long-range plans across a wide scope within an organizationStrong 'can do' attitude, thrives in a dynamic, fast paced environment with many simultaneous projectsQualifications Desired Experience At least 3-5 years clinical/data science/statistical programming experience within pharmaceutical clinical development including support of significant regulatory filingsBroad expertise in statistical programming and developing computing strategies for statistical analysis & reportingExpert knowledge of programming languages and tools e.g. R, Python, Base SAS and advanced knowledge of SAS Stat and Graph, SpotfireExtensive knowledge of drug development process, clinical trial methodology, statistical concepts used in the analysis and submission of clinical data, and knowledge of industry practices and regulatory requirements.Other qualifications: Graduate degree in statistics, mathematics, computer science or equivalent experience.SDL2017"}