{"jobID": "2774957686", "jobLocation": "San_Jose_CA", "jobTitle": "Scientist II, Development", "companyRating": null, "companyInfo": {"Website": "www.planet-pharma.com", "Headquarters": "Western Springs, IL", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Contract", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "RESPONSIBILITIES: Under the supervision of a Principal Scientist in Development will be responsible for: Conduct and monitor laboratory experiments for verification and validation of prenatal diagnostics and screening tests for regulatory submission for Lab-developed Tests and Medical Devices for the domestic and international markets, including experimentation to support ongoing long term stability studies and to aid in troubleshooting of product -based issues.Essential Job Functions and Contributions include:Planning and execution of laboratory experiments for both individual and teambased projects. May act as lead for assigned projects or team.Analyzes experimental data using various data analysis software and/or applying quantitative methods.Uses technical writing skills to produce reports and documents for communication of the results and conclusions for internal use.Makes recommendations to resolve problems encountered during experimental procedures, utilizing alternative approaches to solve problems and develop new perspectives on existing solutions.Keeps informed of trends and developments in area of scientific responsibility.Participates in routine lab maintenance, lab safety, ISO, and QSR implementation.Requirements:REQUIREMENTS:Demonstrated proficiency in analytical skills, such as statistical method analysis of laboratory dataExcellent verbal and written communication skills with the ability to communicate clearly with team membersKnowledge of good laboratory practicesKnowledge of molecular biology laboratory techniques and conceptsAbility to follow established protocols and procedures within a regulated environment, e.g. CLIA, ISO, GMPEDUCATION AND EXPERIENCE:Bachelor's degree in Biological/Life Sciences, Chemistry, Biochemistry or related field, or equivalent combination of education and work experience.Minimum 2 years experience in molecular biology laboratory techniques. Preferred is 4 to 6 years of relevant experience.Experience in regulated devices or tests such as for FDA, CE, or other IVD highly preferred.Experience with laboratory automation preferred. Type:Temp/ContractLocation:San Jose, CASDL2017"}