{"jobID": "2554605968", "jobLocation": "Redwood_City_CA", "jobTitle": "Scientist, Applied Science", "companyRating": "3.6", "companyInfo": {"Website": "www.amobee.com", "Headquarters": "Redwood City, CA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": "About Amobee: Amobee is a technology company that transforms the way brands and agencies make marketing decisions. The Amobee Marketing Platform enables marketers to plan and activate cross channel, programmatic media campaigns using real-time market research, proprietary audience data, advanced analytics, and more than 150 integrated partners, including Facebook, Instagram, Pinterest, Snapchat and Twitter. Amobee is a wholly owned subsidiary of Singtel, one of the largest communications technology companies in the world which reaches over 640 million mobile subscribers. The company operates across North America, Europe, Middle East, Asia and Australia. For more information, visit amobee.com or follow @amobee Position Summary: Were changing the way the world thinks about online advertising and we are looking for talented engineers to join the Platform team and help us take it to the next level. Amobees Platform team develops all distributed and big data systems and applications to efficiently run Amobees online advertisement, data management, and analytics platforms.  The R&D; team at Amobee is building the next generation of digital advertising technologies that power billions of ad impressions every month. We are constantly innovating creating and applying technologies in several exciting cutting-edge areas: machine learning, constrained optimization, control systems, auction theory, game theory, collaborative filtering, experimental design, and information retrieval to name a few. Our mission is to use hard data and science to make quantum leap improvements in the performance of online ads, enhance user experience, enable efficient marketplaces, and improve the overall economics of online advertising.  The Scientist/Senior-Scientist will work with the rest of the team to research and invent the next generation prediction, optimization, and analytics technology. You are a brilliant, motivated self-starter and an extremely fast learner with top notch problem solving and analytic skills. You have a deep sense of curiosity and innate desire to dig deep into terabytes of data and love to play with the innards of complex algorithms, mathematical constructs and code. Required Qualifications:PhD degree in a closely related field (e.g.: computer science/engineering, optimization) with publications in the area is strongly preferredExperience in one or more of the following areas: machine learning, data mining, statistical modeling, optimization, algorithms, big-dataExcellent communication skills ability to present and communicate complex ideas in simple termsStrong statistical/math/analytical abilities; Exceptional problem solving skillsDesired Qualifications:Previous experience in the advertising industryKnowledge of JavaStartup experienceLocation: Redwood City In addition to our great environment, we offer a competitive base salary, bonus program, stock options, employee development programs and other comprehensive benefits. Please send a cover letter along with your resume when applying to the position of interest located at Amobee.com. We are an Equal Opportunity Employer. No phone calls and no recruiting agencies, please. #LI-FO1 #GD"}