{"jobID": "2837747654", "jobLocation": "Burbank_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.mastechdigital.com", "Headquarters": "Moon Township, PA", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Public (MHH) ", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Location: Burbank, CA Job Code: 162981 Posted: Jun 22, 2018 Description:  Mastech Digital provides digital and mainstream technology staff as well as Digital Transformation Services for leading American Corporations. We are currently seeking a Data Analyst for our client in the Healthcare domain. We value our professionals, providing comprehensive benefits, exciting challenges, and the opportunity for growth. This is a Contract position and the client is looking for someone to start immediately.  Duration: 12 Months Contract  Location: Burbank, CA  Compensation: Best Market Rates  Role: Data Analyst  Primary Skill: Data Analysis  Role Description: The Data Analyst would need to have at least 6-10 years of experience. In this role, you will provide data architectural leadership in developing enterprise data/process models, and logical/physical database designs. Required Skill Set:Business analysis.Business process modeling - enterprise to department level.Ability to interpret Entity Relationship Diagrams.Provide data architectural leadership in developing enterprise data/process models, and logical/physical database designs.Provide data and database development, maintenance, and production support.Participate in IT and Business project to define system requirements.Qualification: Must Have: Applications MS Access ATS (Admin/BPC) Microsoft AccessMicrosoft ExcelMicrosoft OfficeMicrosoft PowerPointATS (IT)Microsoft Office Enterprise Databases SQL - 2 years Productivity Software Microsoft ExcelMicrosoft Office Programming Languages PL/SQL - 2 yearsNice to Have: Database and Data Management ETL ToolsOracleRelational DatabaseSQL ServerResponsibilities:Develops accurate, easy to read, and useful information reports.Collects data, researches, and prepares advanced trend and data analysis reports.Designs and generates tracking and monitoring tools.Performs ad-hoc projectsUnder general supervision, this position exists to assist the organization in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing, and reporting data.Communicates and supports analytical findings.May assist with sophisticated statistical models and forecasting tools using these databases.Assists with the definition of complex multi-dimensional healthcare issues and develops time tables/processes for decision making.May translate needs, issues, and ideas into effective strategies and action plans.May formulate specific implementation plans and evaluates the effectiveness of actions/programs implemented.Develops creative alternative solutions.Strong Microsoft Office skills required. (Excel, Access both required)Three (3) years of experience in SQL or equivalent statistical analytical programming language required.Minimum two (2) or more years of related analytical experience required.Strong analytic and critical thinking skills, writing skills, communication skills, consulting skills, and ability to work within a team. Alteryx is preferred. Tableau is a plus. Education: Bachelor's degree in Computer Science, Electrical/Electronic Engineering, Information Technology or another related field  Experience: Minimum 6-10 years  Relocation: This position will not cover relocation expenses  Travel: N/A  Local Preferred: Yes  Recruiter Name: Vipul Srivastava  Recruiter Phone: 877.884.8834 (Ext: 2029)  Equal Employment OpportunitySDL2017"}