{"jobID": "2815406197", "jobLocation": "Battle_Creek_MI", "jobTitle": "Senior Analyst, Data Operations - Global Data Management & Governance", "companyRating": null, "companyInfo": {"Website": "www.kelloggcareers.com", "Headquarters": "Battle Creek, MI", "Size": "10000+ employees", "Founded": " 1906", "Type": " Company - Public (K) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "GLO000611 In this role as Senior Analyst, Data Operations, you will be a part of the Global Data Management and Governance (GDMG) team, which works to ensure that all Kellogg data assets are credible and available with development of policy and processes, measuring compliance, and enforcing standards. Bring your owner's mindset and play a critical role to support the efficiency of the operations team. In this role, you will work cross functionally to play a critical part in ensuring that our Master Data is certified, reliable, and easily accessible. This creates a strong foundation for agile analytics to harvest insights, which drive sustainable growth and profit. Your attention to detail, and pride for systems and data integrity will make you a great fit for our company and is a key ingredient to your success.  As a part of the great Kellogg community that sits at our Global Headquarters, you will have the opportunity to be involved in much more than your day-to-day responsibilities. Our culture is full of fun, flexibility, and teams that are playing to win. Get involved with Diversity & Inclusion groups, eat your way through our elaborate breakfast bar, and take advantage of our company store perks! HERE'S A TASTE OF WHAT YOU'LL BE DOINGMaster Data Expertise We are looking for someone who has a passion for data accuracy! Using strong analytical skills and attention to detail, you will be responsible for managing and analyzing complex Master Data in SAP relative to all aspects of material master setup and maintenance. Through accurate and timely setup and maintenance and rapidly changing priorities, you will enable and maximize business effectiveness across the company. Examples of this type of work includes (but is not limited to): validating and processing New Item Forms for the setup of new innovation, creating substitution tables, maintaining accurate values and statuses, and working with IT on system upgrades/testing and playing a key role in researching the root cause of system errors and providing resolution.Influencing Systems Consistency, Accuracy and Improvements You will be a significant contributor to ensuring our internal and external customers' requirements are met by representing the team on project work as required by the business. You will help drive consistency and accuracy through strong documentation and identifying process improvements. Understanding WinShuttle and other technical capabilities will enable the team to drive fast, accurate setup. This position is heavily relied on to standardize, simplify and automate processes while meeting all aspects of SOX 404 requirements.Communication You will have a significant number of contacts and partners across the organization that will be important to your success. These relationships include, but are not limited to: Data Integrity, EDI, Data Governance, Logistics Innovation, Customer Marketing, Finance, Order Management, Integrated Planning and IT. Through collaboration and agility, you will be adding key value towards our business goals.SDL2017"}