{"jobID": "2830327718", "jobLocation": "Egg_Harbor_City_NJ", "jobTitle": "Computer Scientist - mid level", "companyRating": null, "companyInfo": {"Website": "www.a3technologyinc.com", "Headquarters": "Egg Harbor City, NJ", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " A3 Technology is looking for a Software developer that has experience in full software development life cycle, requirements analysis, design reviews, integration, testing, installation and maintenance of complex computer systems to work with the Communication, Flight Service, Weather and Engineering Group Flight Service and Weather Engineering Teams.  This position provides expertise in software requirements analysis, design, design reviews, development, software testing, integration, installation, and maintenance of systems and sub systems. Additionally, provide expertise in the development and improvement of software development processes and provide field support of complex computer systems. Knowledge, Skills and Abilities:Required:Proficient of using C language on a Linux environmentAble to support software applications in LinuxProvide expertise in updating and developing communication applications using TCP/IP and HDLCSupport system, developmental, and integration testingMust be willing to travelFlexible work schedule available for second level supportPreferred:Proficient in languages Java, SQL, JavaScript, JSONProvide expertise in updating and developing web applications including HTML, 5/XHTMLExperience with C# in windows environment.Develop and manage Linux shell scripts to automate testing and operations.Educational Requirement:Bachelor of Science in Computer Science, Math or other Technical field and 30 semester hours of statistics, math or computer science and 7 years related experience orMaster’s degree and 5 years related experience."}