{"jobID": "2824038695", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.softclouds.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "Summary: SoftClouds is looking for a Jr. Level  Data Analyst to join our analytics platform team in designing and developing  the next generation data and analytics solutions. The candidate should have deep  technical skills as well as the ability to understand data and analytics, and  an openness to working with disparate platforms, data sources and data formats. Roles &  Responsibilities:Experience with MySQL, MS  SQL Server, or Hadoop, or MongoDB.Writing SQL Queries,  tables, joins.AWS, python, or bash shell  scriptingHave some experience  pulling data from Hadoop.Analyze data, system and  data flows and develop effective ways to store and present data in BI  applicationsETL experience a plus.Work with data from  disparate environments including Hadoop, MongoDB Talend and other SQL and  NoSQL data storesHelp develop the next  generation analytics platformProactively ensure data  integrity and focus on continuous performance improvements of existing  processes.Skills &  Qualifications:2  or more years of experience in software development1  year of experience in writing Data  applications using SparkExperience in Java and PythonFamiliarity  with Agile development methodology `Experience  with Scala is a plusExperience  with NoSQL databases, e.g., Cassandra is a plusExpertise  in Apache Spark & Hadoop.Expertise  in machine learning algorithmsEducation /  Experience:Bachelor's degree in a computer related field or equivalent  professional experience is required. Please  send your resume to careers@softclouds.com to  be considered.  SoftClouds  LLC is an Equal Opportunity Employer. As such, SoftClouds LLC is committed to a  policy of equal employment opportunity for employees and applicants for  employment. "}