{"jobID": "2336618593", "jobLocation": "Redwood_City_CA", "jobTitle": "Senior Machine Learning Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.genapsys.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Illumina"}, "estimatedSalary": "173000", "jobDescription": " At GenapSys we are working to change the world of healthcare and diagnostics. At GenapSys, we are developing a DNA-sequencing technology that will revolutionize the world of healthcare. Our system will enable fast, accurate, and ultra-low cost genetic tests in order to better understand (and ultimately treat) genetic diseases such as Cancer, Parkinsons, Diabetes, and Alzheimer's, just to name a few. GenapSys was founded by Dr. Hesaam Esfandyarpour and incubated over 6 years (2004-2010) at Stanford University.  Our team brings together an incredibly diverse and multidisciplinary set of backgrounds and skills from electrical and mechanical engineers to physicists, chemists, microfluidic engineers, molecular biologists, bioinformaticians, mathematicians and more. Together we will advance scientific and medical knowledge and improve human health through cheaper, faster, and more accurate DNA sequencing technologies. We are working cross-functionally to make a great impact in the world join us on that mission!  Were currently looking for a talented Senior Machine Learning Scientist who is eager and enthusiastic.The candidate would love challenging problems and if challenges seem exciting and you fit the requirement outlined below - please apply! ResponsibilitiesActively participate in design and modification of models for machine learningAnalyze prediction data and revise existing machine learning models and effortsProvide feedback to signal processing and algorithm teams for further improvementMonitor data integrity and quality and alert team members when inconsistencies arise and help troubleshoot the problemRequired QualificationsHands-on experience with development of Deep Learning models, various Neural Network concepts, classification algorithmsDemonstrated experience in one or more Deep Learning platforms: TensorFlow, Theano, Torch, DL4JStrong mathematical skills. Working experience in Statistics is a plusExperience with open source ML toolsStrong familiarity with Linux environmentPrior experience in developing Next-Gen Sequencing related solutions is a plusDemonstrated experience in one or more programming languages: Python, Java, Matlab, RPhD or MS in Computer Science, Computational Biology, Math, Physics or a related field with > 2 years experienceAbility to work collaboratively with primary analysis team, software developers, and the life science teamStrong communication skillsWhat we offer:An amazing mission: Enabling everyone to decode the living world!Competitive compensation and stock optionsCompetitive benefits: medical, dental and vision benefits for employees and dependents, fully sponsored life, short and long-term disability insurance, and 401(k) retirement savings plan.Free daily catered gourmet lunches and snacksWeekly fancy High Tea and happy hoursFree complex onsite gym membershipCasual, but high-performing work environmentA diverse and inclusive workplace where we learn from each other is an integral part of GenapSys' culture. We actively welcome people of different backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer and a great place to work. Join us and help us achieve our mission!Note to Recruiters and Placement Agencies: Genapsys does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Genapsys employee. Genapsys will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered the property of Genapsys."}