{"jobID": "2799828139", "jobLocation": "Arlington_TX", "jobTitle": "Lead Data Engineer - Batch and Stream Processing", "companyRating": "3.4", "companyInfo": {"Website": "www.gmfinancial.com", "Headquarters": "Fort Worth, TX", "Size": "5001 to 10000 employees", "Founded": " 1992", "Type": " Company - Public", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " We are expanding our efforts into complementary data technologies for decision support in areas of ingesting and processing large data sets including data commonly referred to as semi-structured or unstructured data. Our interests are in enabling data science and search based applications on large and low latent data sets in both a batch and streaming context for processing.  To that end, this role will engage with team counterparts in exploring and deploying technologies for creating data sets using a combination of batch and streaming transformation processes. These data sets support both off-line and in-line machine learning training and model execution. Other data sets support search engine based analytics. Exploration and deployment of technologies activities include identifying opportunities that impact business strategy, selecting data solutions software, and defining hardware requirements based on business requirements. Responsibility also includes coding, testing, and documentation of new or modified scalable analytic data systems including automation for deployment and monitoring. This role participates along with team counterparts to architect an end-to-end framework developed on a group of core data technologies. Other aspects of the role include developing standards and processes for data engineering projects and initiatives. Job DutiesEvaluate, research, experiment with batch and streaming data engineering technologies in a lab to keep pace with industry innovation while assessing business impact and viability for use cases associated with efforts in handWork with data engineering related groups to inform on and showcase capabilities of emerging technologies and to enable the adoption of these new technologies and associated techniquesDefine and refine processes and procedures for the data engineering practiceWork closely with data scientists, data architects, ETL developers, other IT counterparts, and business partners to identify, capture, collect, and format data from the external sources, internal systems, and the data warehouse to extract features of inCode, test, deploy, monitor, document, and troubleshoot data engineering processing and associated automationDefine data engineering architecture both hardware and software reflective of business requirements to be included in end-to-end solution architectureEducate and develop ETL developers on data engineering so as to enable transition to data engineer and practiceKnowledgeGeneral working knowledge of networking concepts including TCP/IP, Subnetting, Routing, DHCP, Command line and DNS.Knowledge of PC hardware and software.Must have a broad understanding of enterprise computer hardware/software and corporate information systems.Strong knowledge of operating systems, applications and associated hardware (e.g., Windows Desktop OSs, Windows Server OSs, OS/, UNIX/Linux).Understanding of enterprise computer hardware/software and information systems.Working knowledge of WAN security and design.Working knowledge with directed analytic graph stream processing using Beam, Flink, Nifi and/or Samza.SkillsAbility to accept change and to adapt to shifting organizational challenges and priorities.Ability to coach, develop and lead others.Ability to evaluate problems and issues quickly, and to make recommendations for courses of action.Ability to make independent decisions and use sound judgment in relation to the management of team members.Ability to prioritize tasks and ensure their completion in a timely manner.Analytical and troubleshooting skills.Excellent analytical and troubleshooting skills.Strong interpersonal, verbal and written skills.EducationBachelor’s Degree or higher degree in computer science or other quantitative discipline requiredExperience3-5 years of software engineering to include Java, Scala, and Python required5-7 years hands-on experience with ETL and Business Intelligence technologies such as Informatica, DataStage, Ab Initio, Cognos, BusinessObjects, or Oracle Business Intelligence requiredHands-on experience with SQL, data modeling, and relational databases such as Oracle, DB2, and Postgres requiredWork ConditionNormal office environment; fast-paced office environment; flexible schedule with possibility of working long hours; limited travel may be required to support business needs"}