{"jobID": "2815889786", "jobLocation": "Parsippany_NJ", "jobTitle": "Real-world Data Analysis Scientist - REMOTE OPPORTUNITY!", "companyRating": null, "companyInfo": {"Website": "www.pelotonadvantage.com", "Headquarters": "Parsippany, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview: Peloton Advantage, LLC, is an industry-leading medical communications company located in Parsippany, NJ. Our medical and account teams provide strategic support to pharmaceutical company clients and produce high-quality journal articles, abstracts, posters, supplements, slide presentations, monographs, and other educational materials. Department Overview: The HEOR – Value Evidence Generation department is charged with designing, developing and/or conducting HEOR and real-world data (RWD) studies, models and analyses, strategic insights, abstracts/posters/publications and value communications tools throughout the product lifecycle with the goal of providing clients and their stakeholders with high-quality HEOR data to support decision-making. Position Overview: The Real-world Data Analysis Scientist will have competencies in carrying out comprehensive, rigorous, statistical analyses including, but not limited to, multivariate regression modeling, logistic regression modeling, Cox regression modeling, ANOVA, propensity score matching and other techniques, using diverse data sources including, but not limited to, electronic health records (EHRs), claims databases, prospective cohort/registry data, cross-sectional survey data as well as clinical trial/pragmatic trial data. Research topics may include, but not be limited to, practice patterns, treatment inertia, unmet needs/treatment gaps, comparative effectiveness, adherence/persistence, cost/burden-of illness, quality of life/utility assessment, preference/discrete choice experimentation, treatment satisfaction, meta-analysis and predictive modeling. The Real-world Data Analysis Scientist will have proven abilities developing research protocols, statistical analysis plans and study reports, and will have in-depth knowledge and experience with SAS.  Whenever necessary, the Real-world Data Analysis Scientist may be asked to serve as an external Subject Matter Expert (SME) from the department at client or industry meetings. The position is a Contractor position with the potential to evolve into a fulltime opportunity.Specific Duties, Activities, and Responsibilities:Lead all aspects of data analysis from drafting data analysis plans through conducting statistical analyses, writing study reports and ultimately disseminating results at scientific congresses and in peer-reviewed journalsCollaborate and partner on RWD statistical analysis with external Scientific Leaders (SLs), Academic Research Organizations (AROs) and client HEOR TeamsProvide internal inter-departmental education on statistical analysis methodologies and techniques to improve proficiency in this area across teamsWork closely with writing staff to ensure accurate, high-quality, on-target messaging derived from statistical analysesDevelop statistical analysis solutions for account team(s) based on product lifecycleServe as a role model for others with respect to professionalism and personal productivityProvide statistical analysis services to assigned accountsAttend status meetings as necessaryComply with company standardsProcure and maintain appropriate travel documentationMaintain consistent attendanceMaintain timely submission of time sheetsPosition Requirements: Education or Equivalent (minimum required to perform job): A doctoral degree in Biostatistics, Epidemiology, Health Services Research, Public Health or other comparable health-related area with a focus on quantitative analysisKnowledge/Skills Requirements:3+ years of relevant work experienceProven track record of developing high-impact statistical analyses in the HEOR/RWD settingExperience with writing protocols, data analysis plans and study reportsAbility to fully interpret and communicate statistical analysis resultsAbility to function as the Subject Matter Expert (SME) within the company with regard to statistical analysis, RWD and RWEExcellent collaboration and communication skills with internal and external stakeholders, collaborators and partnersAbility to meet deadlines while working on multiple parallel projectsAbility to work independently as well as in a team structureBusiness Environment: Position is Remote  Hours 8:30am – 5pm  Travel: up to 20% domestic and/or international (including periodic travel to New Jersey HQ site and/or client sites)"}