{"jobID": "2700043961", "jobLocation": "Columbia_MD", "jobTitle": "Sales Data Analyst Intern", "companyRating": "3.4", "companyInfo": {"Website": "www.vectorworks.net", "Headquarters": "Columbia, MD", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Autodesk, Dassault Systemes, PTC"}, "estimatedSalary": "47000", "jobDescription": "What’s in it for you? Calling all energetic, results-driven students: Vectorworks, Inc. seeks a Sales Data Analyst Intern to join our team for an engaging internship opportunity this summer. The intern will work with the Sales and Channel Operations team to improve data quality, system performance and operational workflows. If you have the skills and enthusiasm for data management experience, keep reading! In this role, you should expect to:Monitor integrated systems for data irregularities and errorsPerform User Acceptance Testing for Salesforce development projectsSupport Sales and Marketing analytics projectsDocument current sales, marketing, and operations systems and workflowsReview, refine, and enhance internal customer master dataEvaluate and test new software solutions and process improvementsWhy do you want this job? Because you are:A hard-working and dedicated college junior, senior, or recent graduate (no more than 6 months upon graduation) who is looking to gain valuable work experience in the field of sales, marketing, and businessCreative, innovative, and willing to work with a team in a fast-paced environmentA self-starter with the ability to show initiative, multi-task, prioritize, and meet deadlinesWhy do we want you? Because you have:A GPA above 3.0Excellent research, writing, and organization skillsHigh motivation and the ability to work easily in both large team environments and independentlyAbility to analyze, measure and report on program engagement metricsExperience using data to analyze and solve problemsExperience working with PowerPoint, Excel, and WordMotivated, well-organized, detail-oriented and flexibleAble to successfully collaborate with multiple personalities and communicate with all levels of the organizationAbility to work under pressureAbility to interact effectively with people from different culturesInterest in learning how a global channel operates to build marketing programs that can be deployed across international markets and industriesExperience with marketing automation platforms such as Hubspot, Pardot, Marketo or similarWorking knowledge of FileMaker, Tableau and/or other data analysis toolsExperience working with SAP Business One, SalesForce.com, or other similar accounting and/or CRM solutionsWorking knowledge of rational database creation, management and SQLEligibility requirements for internships:Internships require working a minimum of 16 hours per week with a maximum of 40 hours per weekYou must be at least 18 years of age, and enrolled in an undergraduate program entering your junior or senior year, enrolled in a graduate program, or be a recent graduate (no mor than 6 months upon graduation)This is a paid internship and compensation will be based on applicant's qualifications. We currently do not provide housing, relocation, or transportation reimbursementInterns are not eligible for company benefits2018 Internship sessions:Summer: June 4 – Aug. 24Fall: Sept. 10 – Dec. 14Vectorworks Inc. is an Equal Opportunity/Affirmative Action Employer"}