{"jobID": "2695818644", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Data Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.edmunds.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 1966", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TrueCar, Cars.com, Kelley Blue Book"}, "estimatedSalary": "155000", "jobDescription": " At Edmunds were driven to make car buying easier. Ever since we began publishing printed car guides in the 60s, the company has been in the business of trust, innovating ways to empower and support car shoppers. When Edmunds launched the car industrys first Internet site in 1994, we established a leadership position online and have never looked back. Now, as one of the most trusted review sites on the Internet, millions of visitors use our research, shopping and buying tools every month to make an easy and informed decision on their next car. For consumers, we bring peace of mind. For dealers, we make tools to help them solve their problems and sell more cars. How do we do it, you ask? The key ingredients are our enthusiastic employees, progressive company culture and cutting-edge technology. Want to join the team? Read on to find out how! You + Open Source Technologies + Data Explosion Use your Java/Scala development experience to help us manage the data explosion dilemma! You will be joining a strong, determined and results oriented Data Engineering team that is transforming Edmunds from IT to Data driven. What Youll Do:Devise scalable, maintainable and reliable services that process very large quantities of structured and unstructured data in real-time.Unify streaming and batch processing modes into one cohesive framework.Key deliverables include processing, integrating, monitoring and alerting modules that fit into a unified and reliable Big Data infrastructure. (Want to know an example of a typical problem you could be facing? Answer: architecting a real-time and self-supporting solution to a complex data flow and data processing pipeline) What You Need:Understanding of software engineering best practices, object-oriented analysis & design, and design patterns & algorithmsExpertise in Java/Scala. Knowledge of Spark, Structured Streaming, HBase, Airflow and Maven is a plus.Proactive attitude in the execution of your goals and ability to diligently follow through in removing roadblocksAbility to learn and adapt to new processes and technologiesNow the big question - why would you want this job? heres why:Youll get to work with our remarkably talented staff and rich systemsPotential to shape the future of a rapidly growing companyYoull have a very tangible impact on the company and the whole car buying process (think big!!)Lastly we are just right sized not too small to be scraping for cash/survival and not too large to become part of the corporate grind.Working @ Edmunds.com: Employees think its a pretty great place to work and some pretty impressive publications think it is too: we have been recognized as one of the best places to work by the Fortune Magazine and Great Places to Work, LA Business Journal (for the last 6 years!), Computerworld, and Built in LA. We've also been identified as one of the best workplaces specifically in Technology and also for Diversity and Asian Americans. In fact, our CEO, Avi Steinlauf, was rated as one of Glassdoor's Highest Rated CEOs! If youre interested in learning more and joining our mission, wed love to hear from you! Edmunds will consider for employment qualified candidates with criminal histories in a manner consistent with the requirements of all applicable laws. *LI-POST"}