{"jobID": "2536371430", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.grubhub.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (GRUB) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " DoorDash"}, "estimatedSalary": "113000", "jobDescription": " About The Opportunity Got a taste for something new? We’re Grubhub, the nation’s leading online and mobile food ordering company. Since 2004 we’ve been connecting hungry diners to the local restaurants they love. We’re moving eating forward with no signs of slowing down. With more than 80,000 restaurants and over 14 million diners across 1,600 U.S. cities and London, we’re delivering like never before. Incredible tech is our bread and butter, but amazing people are our secret ingredient. Rigorously analytical and customer-obsessed, our employees develop the fresh ideas and brilliant programs that keep our brands going and growing. Long story short, keeping our people happy, challenged and well-fed is priority one. Interested? Let’s talk. We’re eager to show you what we bring to the table.  Some Challenges You’ll Tackle Working with high volumes of data to efficiently process and expose for analysisCollaborating with other engineering teams on strategies for dataWork with cutting edge data processing technologiesUnderstand our stakeholder (Finance, Marketing, Product) requirements and write complex and efficient code to transform raw data into an easy to approach data marts.Doing deep dives on business verticals where you become one of the foremost experts on that vertical in the companyAnalyze data to measure impacts of data schemas and use it to iterate on improvementsTranslate from technical to business, and vice versa. You need to be able to speak with the least technically-minded client (internal or external) and make technology make sense to them. Then turn around and do it the other way You Should Have Excellent knowledge on SQL, data modelling and patterns.5-7 years experience with Python or another general purpose programming languageBackground in writing ETL jobs within a Business Intelligence contextA bachelor's degree, preferably in a computer-related discipline.Enthusiasm for the job. Are you excited about data? Do you love your users? Good, the same goes for usGot these? Even better: - nice to haves (not required)Experience big data processing with Spark and other big data tools a plusExcellent communication skills, including the ability to crystallize and broadly socialize insightsProblem analysis and problem-solving skillsRigorous attention to detail and accuracyExposure to Amazon AWS or another cloud providerAdaptability and collaborative skills And Of Course, Perks! Unlimited paid vacation days. Choose how your time is spent.Never go hungry! We provide weekly GrubHub/Seamless credit.Regular in-office social events, including happy hours, wine tastings, karaoke, bingo with prizes and more.Company-Wide Initiatives encouraging innovation, continuous learning and cross-department connections. Grubhub is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: DOL Poster. If you are applying for a job in the U.S. and need a reasonable accommodation for any part of the employment process, please send an e-mail to TalentAcquisition@grubhub.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this e-mail address."}