{"jobID": "2821587699", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.tekmark.com", "Headquarters": "Edison, NJ", "Size": "501 to 1000 employees", "Founded": " 1979", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " TEKsystems, Kforce, Princeton Information"}, "estimatedSalary": null, "jobDescription": " Job Description:-Client is seeking a Data AnalystSummary:-The Data Analyst will be part of an agile team using Scrum. Our teams include software engineers, QA engineers, product development managers, and scrum masters. -A typical day consists of brief standup meetings, roughly 80% coding & building new features on your own and sometimes in a pair programming environment. -The other 20% of your time will be spent helping with technical issues, planning for releases, or assisting with technical issues.Responsibilities:-Use data mining, analytics and business judgment to help identify, prioritize, structure and solve complex data problems-Create dashboards, reports, and analyses that explain what happened and why-Perform ad hoc analyses and data extraction requests; actively build processes, tools and metrics dashboard to make data more accessible-Extract insights from data to improve the product experience and operational efficiency-Actively build processes and tools to make data more accessible-Drive the monitoring, analysis, and improvement of website and other products performance-Work in a cross functional team to implement data-driven plans designed to maximize ROI Qualifications:-Undergraduate degree in either Computer Science, Operation Research, Applied Mathematics, Economics or another quantitative discipline; Masters preferred-2+ years of experience analyzing very large, multi-dimensional data sets using SQL/PSQL-2+ years of experience creating visualization using Looker(preferred), Chartio, Tableau, QlikView.-Solid experience in Excel for data analysis and visualization-Comfortable working in a fast-paced, dynamic environment while juggling multiple projects-Good interpersonal communication and presentation skills-Self-motivated, detail-oriented and passionate Nice to have:-ETL-Data Visualization-SQL-Python-Data Analysis and Modeling-AWS"}