{"jobID": "2775717686", "jobLocation": "Culver_City_CA", "jobTitle": "ISC - Data Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.ipsos.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (IPS) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": " Data Engineer  Location: Culver City, CA  Division: Ipsos Science Center R&D;  The Ipsos Science Center is a uniquely positioned group within Ipsos. We develop software tools and perform analyses both for clients and internal teams, respond to advanced analytic requests, and consult on a broad range of statistical and behavior science best practices. Working in a collaborative and supportive environment, we seek to expand what is possible in market research with data science.  We're looking for a highly capable, data-literate person. We need someone who is a better statistician than most programmers and a better programmer than most statisticians. We are looking for someone with the communication skills to suggest analysis appropriate for a problem, develop a prototype, polish it if it works, stand up an API if it's worth distributing, build visuals on top as needed, and work through the challenges along the way. We're looking for a detail-oriented developer who has the flexibility, capability, and curiosity to collaboratively work across the process. In short, we're looking for a full-stack engineer for the analytic stack. As a Data Engineer, you will:Enhance and maintain existing tools used by the larger organization as well as the local team.Design and develop new tools for internal users and external clients.Work closely with team members on ad-hoc projects.Collaborate on researching, implementing, and testing new algorithms and approaches.Required SkillsRequirements:Proficiency in advanced R and/or Python programming, including the ability to develop packages/libraries and maintain existing ones.Bachelor's degree in Computer Science, Mathematics, Statistics, or related.Comfortable working in a highly collaborative, consensus-oriented environment.High-level familiarity with analytics and statistics, extracting and surfacing value from quantitative data.Strong eye for detail and excellent time-management skills.Pluses:Professional or academic experience with analytics or machine learning, e.g. caret, scikit-learn.Experience creating and deploying web applications, e.g. flask, web2py.Experience designing and developing static and dynamic visualizations, e.g. d3.js, ggplot2Working knowledge of SQL and experience with database design and administration.Experience with Linux server and system administration.Experience with collaboration tools (e.g. Atlassian suite) and version control systems (e.g. Git).Experience integrating R and/or Python with each other and C\\C++.Large dataset manipulation. Experience in distributed storage and computing.Advanced degree (M.S.), but by no means required.Experience in the field of Market Research. #LI-LM1SDL2017"}