{"jobID": "2834870203", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer-MDM", "companyRating": "3.5", "companyInfo": {"Website": "www.motorolasolutions.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1928", "Type": " Company - Public (MSI) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Cisco Systems, Huawei Technologies, IBM"}, "estimatedSalary": "85000", "jobDescription": "Title Data Engineer-MDM  02-Jul-2018 City Chicago,USA Job DescriptionAs a Data Engineer, you will support the Lead Data Architect providing technical aptitude and inputs as necessary. You will be responsible for performing specific analysis and planning projects, making recommendations on standards for design and development to build, maintain and leverage the data model, ensuring integration with established data standards.  What you will be doing: Enrich and maintain a holistic MDM and Data Governance model and roadmap for enterprise adoption, ensuring performance, velocity, volume, and operational significance across MSI: Develop and document data models and gather data requirements for various initiatives.Build and maintain data dictionary and / or metadata repositories.Deliver and publish logical and physical data models for a given solution or project initiative.Work with other product team(s) to define data lineage and relationship metrics.Use SQL extensively to research, understand and relate distributed data repositories across enterprise.Develop and maintain data artifacts and act as a liaison between ETL, data integration or BI team(s) to support development of data solutions.Partner effectively with MDM (Master Data Management), BI (Business Intelligence) and other stakeholders (SMEs, Sponsors, Solutions architects, etc.) to design solutions / fill gaps.Be a cause for ensuring data governance processes and controls by working with project and business leaders to analyze the impact of future changes on critical data and mitigate any potential risks to data quality. We require a passionate individual who is always learning, who is always looking for a better way, and strives to put their best work forward each and every day.  Desired Skills: Strong analytical, conceptual, and problem-solving abilities.Strong interpersonal skills with the ability to interact with others in a collaborative and consistently positive manner, while exercising discretion and diplomacy.Strong level of critical and logical thinking, analysis, and / or reasoning to identify underlying principles, reasons, or facts.Well organized and thorough, with an ability to facilitate effective communication among different levels of staff.Strong troubleshooting skills, able to gather necessary details / requirements in order to determine a proper approach.Ability to work against a committed plan providing timely and realistic status updates and completion estimates.Ability and desire to work with cross-functional teams to ensure a high quality and high performing ecosystem.Experience in the following areas are a plus: Oracle Product Hub.Oracle Customer Hub.Oracle Supplier Hub.Oracle Customer Customer Data Management Cloud.Oracle Enterprise Data Quality or Information Data Quality.Job ID7090BRCountry United States Basic RequirementsBachelor's Degree with 2+ years Data Management experience in Master Data, Data Architecture, Data Governance, or Data Quality.Experience in Relational Databases and Enterprise Software Integration concepts.Experience in SQL in at least one of the following: SQL Server, Oracle, DB2, or Redshift.Relocation Provided None Position Type Experienced Job Category Information Technology Department DescriptionOur IT organization isn’t just here to support our business. We’re here to reinvent it – by changing the way our customers, partners, and employees interact with our company. To do that, we’re looking for people who bring great ideas and who make our partners’ ideas better. Intellectually curious advisers (not order takers) who focus on outcomes to creatively solve business problems. People who not only embrace change but who accelerate it.  Maintaining a strong and vibrant culture in the midst of today’s dynamic business environment is critical to the success of any company. The BI and Data Analytics team is a strategic component of Motorola Solutions’ IT, responsible for pivoting reporting to a self-service model for secure and easy access for trusted data and future state analytics.  In addition, our team is responsible for transforming numbers and statistics into actionable information for our stakeholders. We help stakeholders predict, plan, and adapt their business strategies to meet real-time challenges and confidently help navigate past whatever obstacles come their way. We take a holistic approach to data and offer a broad range of MDM integration and analytics capabilities, including: Data Quality, Data Management and Architecture (DM&A;), Information Delivery, Digital Finance Technology, and Advanced Analytics enablementTravel Percentage Under 10% Company Overview On any given day, every moment matters to someone, somewhere. And every moment, Motorola Solutions’ innovations, products and services play essential roles in people’s lives. We help firefighters see around buildings and police officers see around street corners. We keep utility workers connected and visible to each other with real-time voice and data communication across the smart grid. And we provide the situational awareness first responders need when a moment brings catastrophe. We help people be their best in their moments that matter. State/Region/Province Illinois EEO Statement Motorola Solutions is an Equal Opportunity Employer committed to no discrimination because of race, color, creed, marital status, age, religion, sex, national origin, citizenship, sexual orientation, gender identity or expression, genetic information, disability, protected veteran, or any other legally protected characteristic. "}