{"jobID": "2728681714", "jobLocation": "Oakland_CA", "jobTitle": "Account Executive (AE) Oakland-based", "companyRating": null, "companyInfo": {"Website": "www.broadly.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "*** Need one-call deal closer with stamina (min. 80 to 100 cold calls daily), comprehends our platform & mission, able to clearly communicate the benefits of our solution to small business owners & win! ***HI, WERE BROADLY!We are a mobile-first platform enabling local businesses to deliver a five-star customer experience. We believe that businesses who are more responsible, more engaged, and more customer-centric are more likely to attract modern consumers, build trust within their communities, and grow revenue.OUR MISSION:We champion your local business. We believe in your positive impact on the community. We connect you with modern consumers, simplify your operations, and help them grow.WHO ARE YOU?You have 18+months experience INSIDE salesYoure conditioned to Power Hours, there will be two per dayYou have a positive, can-do attitude and accept nothing less than the best from yourselfWHATS THE JOB, REALLY?Cold calling 100+ small business each workdaySetting your own demosSalesforce expertisePitching our value propositions using join.meExcellent communication skills - no fear of the phoneAbility to effectively prioritize tasks and manage time within a fast-paced environment #startuplifeWHAT DO WE LOOK FOR?The key to being successful at selling Broadly is having a positive attitude. Sales is cyclical and collaborative, so you use your natural optimism and your drive for personal best to thrive and help the team in a positive way. We are akin to a sports team; it takes all positions on the court/field to truly win. You'll join as a stakeholder in our company so we hope you invest in the short and long haul and keep your eyes the bigger picture. Our goals are weekly, monthly, quarterly and annually so dig in, ramp up and make a difference in every metric!BENEFITS?Flexible Time Off: We believe that a balance between work and life is essential to happiness and success, so work hard and take the time you needHealth Coverage: We offer competitive coverage plans for medical, dental and vision, because youre worth itFood: We serve catered lunch every week, gather for company happy hours and stock the office with bountiful snacksFitness: Gym subsidy, commuter benefitTravel: Ask us about our International Travel StipendTeam Bonding: Weekly Happy Hours, Quarterly All Hands and more!Equity: Yeah, youll be a stakeholder, we all are!Compensation: 96K OTEUNCAPPED COMMISSION. Skys the limit.Broadly is committed to providing and promoting equal opportunity for all employees and applicants. We comply fully with the spirit, as well as the letter, of all applicable local, state, and federal laws and regulations implementing the national objective of equal employment opportunity. Broadly does not discriminate in employment opportunities or practices on the basis of race, color, citizenship status, national origin, ancestry, gender, pregnancy, sexual orientation, gender identity, genetic information, age, religion, creed, physical or mental disability, marital or domestic partner status, veteran status, political or religious affiliations, height, weight, or any other characteristic protected by law. We value diversity and encourage all qualified candidates to apply."}