{"jobID": "2794797383", "jobLocation": "Herndon_VA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.expel.io", "Headquarters": "Herndon, VA", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data Scientist Engineering How would you like to surface the “truths” locked up in high quality labeled data? You’d spend your time working with experts, building capabilities that improve their day-to-day lives and the lives of our customers. How would you enjoy competing with those same analysts: you make their lives easier… and they come up with increasingly clever challenges? In the end, everyone wins.  Plenty of data science jobs in the world provide tremendous opportunity to work with diverse data sets, explore data relationships, bridge between structured and unstructured data, and ultimately deliver absolutely nothing a customer ever sees.  This is not that job.  We can’t afford to spin our wheels. The information security space has some fascinating challenges buried within and across mountains of data. To start with, we have basic artifacts like logs and malware. As advanced security products have proliferated we’ve seen a tremendous uptick in large event streams: files written, processes launched, DNS lookups and responses, libraries loaded across every host in an enterprise… it just keeps going. The challenge most security companies face remains figuring out what’s good and what’s bad. The challenge from there is in effectively communicating how good or bad something is without using floats. After all, we believe if the value of what we’re doing isn’t obvious to customers, we’ve failed.  Imagine a world in which all the security decisions being made by a SOC were labels available to you: confirmed bad data, good data, false positives and negatives, and even completed incident/investigation reports. Now imagine if you had API layer that abstracted away the intricacies of individual security vendors. Yeah, we think that’s a pretty cool place to start too. If your mind is reeling with ideas, we’d love to hear from you. Interested? Apply via careers@expel.io.What Expel Can Do For You Place you front-and-center facing one of the most challenging security problems companies are facing right now: effective security operations in an environment with too many tools and too little expertisePosition you to directly impact our strategy and delivery around advanced technology and machine learningProvide you an opportunity to make technology decisions that have a direct impact on our company and our customersConnect you to those most impacted by your work, everydayEmpower you to teach others what responsible, non-hyped machine learning is and how it can make an impactProvide an entertaining, small and highly transparent startup environmentChallenge you to push the boundaries of our security vision What You Can Do For Expel Ensure our customers get (and perceive) maximum value from our workContribute to a shared vision for productionized machine learning that impacts everything from detection to operational efficiencyWork with operations to make sure that we can easily deploy, monitor, manage all of our machine learning capabilitiesFoster an atmosphere of joyful experimentation and continuous learning and improvement.Stay aware of emerging techniques, algorithms and papers that might benefit expel. What You Should Bring With You A sense of humor about how over-used ML and AI are… look, there are things it can and can’t doAbility to collaborate and work with teams throughout the organization4+ years with machine learning algorithms. You hate when gradients vanish or explode, you have a love hate relationship with dimensionality. As an expert, you can discern when it is appropriate to create an algorithm, and when multinomial logistic regression is probably good enough, but also when you need to reach deeper into one-shot learning using siamese networks. Above all else you want to see machine learning make a company impact.A fundamental curiosity around how great engineering teams function, how SOC operations work, and what provides great security value to customersLove and respect for python and all it can do for youAn appreciation for some deep learning and visualization frameworks that have cropped up over the years. Obviously, everyone loves sklearn learn and matplotlib, but there’s your favorite amongst the newer frameworks, such as TensorFlow, Keras, PyTorch, etc Additional InformationThis role is based out of our offices in Herndon,Virginia. If you’re convinced we’d be making a huge mistake by not talking to you about working remotely, do let us know.  We’re only hiring those authorized to work in the United States.  We’re an Equal Opportunity Employer: You’ll receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.  We do not currently sponsor immigration visas. Interested? Apply via careers@expel.io.Careers Index  Engagement Manager Senior Data Scientist Manager, Digital Marketing Software Engineer (Front-End) Software Engineer – Back End Software Team Site Reliability Engineer – Infrastructure Team Software Engineer (Device Integrations) Account Executive Associate SOC Analyst"}