{"jobID": "2696133753", "jobLocation": "San_Mateo_CA", "jobTitle": "Associate Actuarial/Health Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.collectivehealth.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Associate Actuarial/Health Data Analyst We are looking for an associate health data analyst or actuarial analyst to join the Collective Health’s Analytics team. This position requires the individual to be genuinely curious about the health industry and the underlying data that drives it. Experience (real world or classroom) in working with data is a must, as well as the perseverance to work through various data wrangling processes and obstacles. This person’s work will assist in the delivery of various analytical solutions across variety of internal and external stakeholders.  If many or most of the following items apply to you, we'd love to talk: Self starter that enjoys solving hard problemsFamiliarity with SQL and relational database logicFamiliarity with coding (R, Python, etc.)Interest in the health industry spaceInterest in turn data into informationDegree in a quantitative field: computer science, economics, mathematics, statistics, etc.Possibly pursuing an actuarial career0-2 years of experience working with health claims data Collective Health is a technology company working to create the healthcare experience we all deserve. Founded in 2013, our team of engineers, designers, product managers, and actuaries are redefining the $1 trillion market of employer-sponsored health benefits with data-driven and people-focused products. Our complete health benefits solution helps great companies like Activision Blizzard, Palantir, Restoration Hardware, and Pinterest take care of their people by harnessing the power of design and technology. Based in San Francisco, CA, we’re backed by some of the best investors in Silicon Valley including Google Ventures, Founders Fund, NEA, and Redpoint Ventures. For more information, visit us at https://www.collectivehealth.com. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}