{"jobID": "2794744269", "jobLocation": "Santa_Monica_CA", "jobTitle": "Clinical Laboratory Scientist Apprentice", "companyRating": "3.8", "companyInfo": {"Website": "www.uclahealthcareers.org", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Cedars-Sinai Medical Center, Loma Linda University Medical Center, Harbor Hospital"}, "estimatedSalary": "32", "jobDescription": "ResponsibilitiesThe Clinical Laboratory Scientist conducts a wide variety of technical procedures in the Santa Monica UCLA Lab. Other responsibilities include method development-modification-parallel testing, collaboration on or independent preparation of test procedures, repair of laboratory instruments, sample processing, reagent preparation, data entry and phlebotomy duties. Perform tests in: routine chemistry, hematology, urinalysis, infectious diseases analysis, peripheral blood and body fluid cell morphology, routine coagulation and Blood Banking. Perform various quality control tasks and computations. Operate laboratory instruments. Develop and maintain records of instrument maintenance and quality control performed. Maintain all laboratory equipment in good working order by following established preventive and routine maintenance schedules. Initiate and perform troubleshooting and minor repair on laboratory instruments. Maintain records of laboratory tests performed. Prepare written reports and/or technical summaries. Record and review data for accuracy, completeness, and suitability.QualificationsA current California Clinical Laboratory Scientist License or enrollment in a CLS apprentice program is required. Two years recent experience performing testing in a high volume testing lab. Recent demonstrated technical competence in high volume chemistry/hematology required. Abnormal Hematology experience preferred. Must have working knowledge of lab safety and test methodologies used in chemistry, hematology, urinalysis, infectious disease testing. Knowledge and experience with: Sysmex Hematology, Roche Chemistry, Siemens Chemistry, Sysemx/Siemens Coagulation. Skill in practical application of fractions, percentages, ratios, and proportions to be used in making reagents and in performing calculations. Able to perform activities such as moving equipment for repair; transportation of reagents, blood products, or supplies, pipetting, etc. as required. Able to perform repetitive tasks (i.e. computer data entry)."}