{"jobID": "2729536744", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Science Manager (Product and Marketing Decision Science)", "companyRating": null, "companyInfo": {"Website": "www.udemy.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT UDEMYWith a mission to improve lives through learning, Udemy is a global marketplace for learning and teaching online. More than 20 million students learn from an extensive library of over 65,000 courses taught by expert instructors. Whether learning for professional development or personal enrichment, students can master new skills through self-paced, on-demand courses, while instructors have a way to share their knowledge with the world. For companies, Udemy for Business offers subscription access to a collection of business-relevant courses as well as a simple platform to host and distribute their own content in one central place.Were a close-knit bunch that enjoys problem-solving and collaboration, and we share a serious commitment to delivering the best possible learning and teaching experiences. Udemys culture encourages innovation, creativity, passion, and teamwork. We also celebrate our milestones and support each other every day.Founded in 2010, Udemy is privately owned and headquartered in San Franciscos SOMA neighborhood with offices in Dublin, Ireland, Sao Paulo, Brazil, and Ankara, Turkey. Compensation includes full-time salary, equity compensation plan, and competitive benefits including healthcare, commuter benefits, parental leave, and a discretionary time off policy.DESCRIPTIONData scientists draw on a combination of quantitative methods and product intuition to find actionable insights that drive key product decisions at Udemy. What makes a course great? How do course ratings influence a students likelihood to enroll? What are the drivers of long-term customer satisfaction? What are the bottlenecks in the course creation process?As a data science manager at Udemy, youll be responsible for growing and leading a team of data scientists to partner directly with product, design, and engineering teams throughout the company. This role isnt about working in a single well-scoped area. Rather, were looking for a sharp, independent data leader with a talent for drawing structure out of ambiguity, a relentless focus on driving meaningful business impact, and a passion for improving lives through learning!Responsibilities: Recruit, hire, and retain an amazing team of high caliber data scientistsProvide hands-on technical guidance and career mentorship for team membersCollaborate with other data leaders to define Udemys long-term data strategy/visionPartner with cross-functional leaders to shape the product roadmap and drive executionMaintain high quality standards for data science work and recruitingBuild Udemys technical brand through talks, blog posts, and publicationsQualifications:3+ years of experience managing and growing high performance data science teams7+ years of hands-on industry experience in a product or marketing analytics contextAbility to communicate effectively with non-technical stakeholdersStrong knowledge of applied statistics and machine learningProficiency with SQL and 1+ programming languages (e.g., Python or Scala)Udemy in the News:Fortune: Naspers Just Invested $60 Million In This Online Education StartupForbes: Learn At Work From Gary Vee, Seth Godin and Guy KawasakiUSA Today: Tech jobs are thriving nationwide -- up to 7.3MEntrepreneur: Workplace Stress Is at a Record High. Here's What's Causing It."}