{"jobID": "2758225796", "jobLocation": "Austin_TX", "jobTitle": "Vice President, Data Science & Analytics", "companyRating": null, "companyInfo": {"Website": "www.homeaway.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Airbnb, TripAdvisor, 9flats.com"}, "estimatedSalary": null, "jobDescription": "HomeAway seeks a leader with a global mindset to be our Vice President of Data Science and Analytics. In this role, you will lead our large and growing organization through optimization of our marketplace and ongoing efforts to drive product and marketing decision-making using econometrics and data science. You will play a key role in driving programmatic initiatives throughout every aspect of the company.HomeAway, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands.Your opportunities for impact:Collaborate with executive leadership on HomeAways strategy. Work across the broader Expedia Group technology leadership to define and optimize our data science and business intelligence strategy. Build and lead a large, deeply talented team of data scientists, analysts, statisticians, developers and economists. Oversee ongoing development and deployment of a robust A/B testing framework based on sampling and hypothesis testing techniques. Generate huge return on investment by using Machine Learning techniques to increase marketplace and advertising efficiencies. Build novel technology features such as automated ad delivery systems and chatbots. Push data science to throughout our business, including but not limited to:Ranking and relevance. Automated content summarization and generation. Personalization and segmentation. Computer vision, including virtual and mixed reality. Financial forecasting. Media mix modeling, data driven attribution supporting TV, SEM, Display, Social. Pricing and yield management.This role requires you to have extraordinary interpersonal skills, emotional intelligence and the ability to inspire and engage multi-functional teams in a complex and rapidly evolving environment. You lead by example, encouraging and inspiring your teams to build creative solutions at scale. Youll be expected to foster a culture of trust, living and breathing our values of: Scientific Mindset, Openness, One Team, Participation and Mastery.Who you are:A senior Data Science leader with a growth mindset and experience leading large global teams of 50-100 people. Expert knowledge in Artificial Intelligence; Machine Learning, Natural Language Processing, Deep Learning, etc. Ability to quickly develop, foster and influence relationships as well as navigate large complex organizations (across HomeAway and Expedia Group brands). Excellent storytelling and presentation skills with ability to convey the data science strategy and vision to the executive team and our customers. Ability to strategically guide and influence teams to apply the right machine learning, statistical or econometric model to solve HomeAways most important business challenges. Thought leader with domain expertise in digital advertising, ranking systems and e-commerce marketplaces. Sharp business insight with knowledge of financial accounting, financial forecasting and profit/loss management. Masters or PhD in Computer Science, Economics, Statistics, , etc. OR Bachelors of Science with substantial direct e-commerce marketplace experience.Benefits:Competitive health and insurance benefitsCompetitive salaryAnnual target bonus or commissionPaid vacation and sick timeVacation rental on a yearly basis (taxable benefit)Employee Stock Purchase ProgramFree snacks and beveragesFrequent company update talks with our leadership teamFree listing on HomeAway.comElectronic, adjustable stand-up deskDiscounted Metro & Rail passWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}