{"jobID": "2816086711", "jobLocation": "Los_Angeles_CA", "jobTitle": "Mediabrands Data & Technology - Senior Analyst, Analytics", "companyRating": "3.5", "companyInfo": {"Website": "www.ipgmediabrands.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2007", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "Position Summary The Senior Analyst will lead measurement, analytics and reporting for a specific account (or accounts). She/he will lead the set up, operation, and optimization of social media measurement, analytics, listening and other appropriate tools. His/her job will not only include pulling data from tools, but also (and more importantly) deriving insights and trends from the data. She/he will partner with the Strategy team to determine the long-term impact of data across specific accounts and the brand portfolio. She/he will partner with the Community Management/Account team to implement recommendations and determine day-to-day impact of data. Essential FunctionsLeverage social listening tools (Brandwatch, Netbase, Crimson Hexagon, Sysomos) to derive social media insights and engagement analytics for existing accountsProvide cadenced social media weekly and monthly reporting on the health of our clients’ social media presenceProvide social paid media reporting support for paid-social teamIn partnership with strategists and analysts, provide in-depth research support for deep insights on behalf of our clients, partner agencies, and the broader industry.Qualifications Education: Bachelor's degree required Work Experience: 2+ years’ experience in role Key Skills: Good written English skillsProficiency in Excel & TableauExperience with social listening tools (Boolean language) Prior experience with Brandwatch, Netbase, Crimson Hexagon or Sysomos a plusProven track record in meeting deadlines.Proven ability to work cooperatively and proactively with staff inside and outside the department.About Us Mediabrands Data & Technology believes that better science and better art deliver better outcomes to our clients in the media moments that matter most. We are a creative media agency, committed to blurring the lines between media and creativity, between data and content, between science and art. We are a global media network and operate in over 100 countries, with 4,800 people innovating on a roster of clients including Johnson & Johnson, Coca-Cola, Fiat Chrysler Automobiles, Merck, ALDI, CVS Health, ExxonMobil, BMW and Sony."}