{"jobID": "2762079957", "jobLocation": "Washington_DC", "jobTitle": "Safety Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.amtrak.com", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1971", "Type": " Other Organization", "Industry": " Transportation & Logistics", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SNCF, Bombardier Transportation"}, "estimatedSalary": "69000", "jobDescription": " Your success is a train ride away.  Amtrak connects businesses and communities across the country and we move America's workforce toward the future. We employ more than 20,000 diverse, energetic professionals in a variety of career fields throughout the United States. The safety of our passengers, our employees, the public and our operating environment is our priority and the success of our railroad is the result of our employees.  Are you ready to join our team? SUMMARY OF DUTIES: The Safety Data Analyst provides analytical and reporting services to System Safety and various groups within Operations with the goal of achieving risk identification, mitigation strategies and/or improved processes to eliminate injuries, hazards and risk in the workplace. This person will be part of the team that provides essential safety information to the organization and will develop a full understanding of the multiple data sources the team relies on to accomplish their analytical tasks. With minimal guidance, he/she will be able to translate the safety and business needs into data questions and build queries and reports and dashboards. The Safety Data Analyst will be responsible for demonstrating Amtrak's values and leadership philosophy while providing customers with excellent service and meeting performance targets that are driven by and aligned with the Strategic Plan goals in Safety and Security. ESSENTIAL FUNCTIONS:Works as part of the safety analytics team in performing data collection and statistical analyses, creates and maintains internal safety data dashboards and reporting solutions that provide meaningful insight to safety data trends and generate predictions that are actionableReviews and validates safety data to ensure quality, assist and/or provide guidance to remedy quality issuesProvides formal data preparation and quantitative analytical summaries for communications, presentations, and adhoc reports as neededDevelopment and continuous improvement of protocols and statistical analysis plans to support the planning, design and execution of continuous improvement projects that have been identified as key companywide safety trends or issuesIdentifies best practices through analysis and reviews trends and analyzes information to develop and implement safety plans as neededUnderstands the need and interpretation of quantitative analysis as it relates to behavioral safety analyticsMaintain documentation and lessons learned, best practices, and quality improvement documentationFollows best practices for data acquisition and leads data improvement projectsWORK EXPERIENCE:Analytic skillsKnowledge of, or willingness to learn, a BI tool, such as SAP Business Objects or TableauOral and written communication skillsFacilitation, coordination, and interpersonal skillsSelf-motivated and able to work independentlyEffective interface and coordination with stakeholders, including division and department supervision, union personnel, and contractors.Administrative and organizational skillsPREFERRED WORK EXPERIENCE:Ability to analyze, interpret, summarize, communicate, and provide recommendations on quantitative and qualitative train operations, and safety data.Background in transportationExcellent oral and written communication skillsCOMMUNICATION AND INTERPERSONAL SKILLS: Must have excellent oral and written communication skills  Requisition ID:36049  Posting Location(s):District of Columbia; Maryland; Virginia  Personnel Area:DC06  Job Family/Function:Transportation  Relocation Offered:No  Education Requirements:Bachelors Degree  Travel Requirements:Up to 25%  Employment Experience Requirements:5 - 7 years of experience  Amtrak employees power our progress through their performance.  We want your work at Amtrak to be more than a job we want it to be a fulfilling experience where you find challenging and rewarding opportunities, respect among colleagues, competitive pay, benefits that protect you and your family, and a high performance culture that recognizes and values your contributions and helps you reach your career goals.  We proudly support and encourage U.S. Veterans to apply for Amtrak job opportunities.  All positions require pre-employment background verification, medical review and pre-employment drug screen. Amtrak is committed to a safe and drug-free workplace and performs pre-employment substance abuse testing. All new hires are required to undergo a hair drug test which detects the presence of illegal drugs for months prior to testing. We appreciate your cooperation in keeping Amtrak safe and drug-free.  In accordance with DOT regulations (49 CFR section 40.25), Amtrak is required to obtain prior drug and alcohol testing records for applicants/employees intending to perform safety- sensitive duties for covered Department of Transportation positions. If an applicant/employee refuses to provide written consent for Amtrak to obtain these records, he/she will not permitted to perform safety-sensitive functions.  Note that any education requirement listed above may be deemed satisfied if you have an equivalent combination of education, training and experience.  Amtrak is an Affirmative Action/Equal Opportunity Employer and we welcome all to apply. We consider candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability (including blindness), or veteran status.  POSTING NOTES: Transportation || CorporateSDL2017"}