{"jobID": "2733816230", "jobLocation": "San_Francisco_CA", "jobTitle": "Account Executive - PayPal", "companyRating": null, "companyInfo": {"Website": "www.teradata.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (TDC) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " EMC, IBM, Oracle"}, "estimatedSalary": null, "jobDescription": " Are you passionate about making companies smarter? Teradata provides end-to-end solutions and services in big data, analytics and data warehousing enabling companies to become a data-driven business. We are looking for people who share our vision to join our team of more than 10,000 associates around the globe.  Account Executive-Client Management  The Account Executive is responsible for establishing and maintaining relationships with Teradata customers with the objective of increasing revenue. The Account Executive will be the primary relationship manager for approximately three to eight accounts.  To be successful, you need to be an adept salesperson, capable of engaging in business and technical conversations at multiple levels of the organization. You should have an in-depth understanding of the buyer journey and the ability to lead a complex, multi-pronged sale in a highly consultative manner. Finally, if you are naturally analytical and enjoy digging into business models and helping customers quantify their investment decision then this is the role for you!  Key Areas of Responsibility Responsible for setting and maintaining the account strategy for the overall engagement with the client.Understands the clients key business initiatives, areas of concern, technology stack, and competitive environment. With this knowledge, recognizes how Teradata solutions could be applied and can articulate the value of these solutions.Manages the selling process across all areas of the business and closes sales of hardware, software, and servicesLeads the direction for the account team responsible for account planning, business development meetings, managing the selling process and closing sales opportunitiesEngages with internal resources to bring in expertise and specialized sales resources as neededBuilds and manages relationships with client decision makers including but not limited to the C-suiteCoordinates team engagement with client, mapping each resource to most valuable opportunities and serves as an escalation point for high priority client issuesMaintains knowledge of Teradata products and solutions as well as competitive offeringsCoaches and develops Junior Account Executives and Solution Architects  SkillsBachelors Degree or equivalent work experienceSuccessful track record of up-selling to existing customers and prior sales experience with large, complex enterprise customersSignificant technical and industry knowledge in order to drive sales conversations with both IT and business decision makersAwareness and comprehension of the latest advanced analytics techniques and how they apply to business decisionsCustomer relationship management experience, particularly at the C-suite levelProven skills in effectively managing and developing relevant messaging for business buyersAbility to apply critical thinking to develop and solve business challengesPrior experience in managing sensitive and highly political environments balancing the needs of the customer while ensuring the business remains profitableAbility to effectively prioritize key activities and delegate as neededIndustry knowledge- providing Innovative and creative capabilities in industry leading solution strategies and predicting/forecasting possible business problems Preferred Skills Masters DegreePrior experience with Teradata solutions and technologies This position is working in a virtual office environment, including home office & customer site. A combination of independent work and team collaboration will be required. Travel is also expected.  Our total compensation approach includes a competitive base salary, 401(k), strong work/family programs, and medical, dental and disability coverage.  Teradata is an Equal Opportunity/Affirmative Action Employer and commits to hiring returning veterans."}