{"jobID": "2606582369", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.hoteltonight.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "193000", "jobDescription": "HotelTonight makes it remarkably easy to book great hotels at amazing last-minute rates on your mobile device, for tonight, tomorrow and beyond. Our goal is to be the premier and most loved way to book a place to stay and we're looking for a Senior Data Scientist to help do just that.If hotel rooms are the fuel that powers HotelTonight, data is the oil that makes it fire on all cylinders. Leveraging this data in the right way is what will differentiate HotelTonight and make it the leading hotel booking app on the planet. Thats where you come in.As the only Data Scientist on the Engineering team, you will work closely with leaders across Product and Engineering to drive business decisions using data. We'll harness the intelligence acquired from your insights to create more personalized and relevant products for our millions of users.WITHIN 1 MONTH, YOU WILL Identify the immediate needs of the Machine Learning infrastructure, with a focus on setting up the ecosystemWITHIN 3 MONTHS, YOU WILLEvolve and personalize our search ranking algorithms by applying Machine Learning and statistical modelingWork closely with Product Development leadership to drive business decisions using data - you'll turn data into insights and help to craft personalized products based on those insights that will impact our millions of usersLearn all about the dynamic marketplace and user behaviorWITHIN 12 MONTHS, YOU WILLBuild out our machine learning platform from its infancy, eliminating redundancy and inefficiency in order to make our marketplace more dynamic, intelligent and predictiveIterate and create new Machine Learning models on the hotel side - work closely with our Hotels product team to build features like dynamic pricing, marketplace insights, etc.Continue to find opportunities to show relevant and personalized content to our users - collaborate with our Booker product team to find ways to activate and engage usersWHAT WE'RE LOOKING FOR IN YOU3-5+ years in a Machine Learning/Advanced Analytics environment pushing production-level codeAdvanced knowledge of SQL, Python, R (or similar language); familiarity with Machine Learning/Advanced Analytics techniques such as regression, classification, clustering and time seriesStrong communicator - you can break down high level technical concepts for anyone to digestDemonstrated capacity for developing and understanding strategyStartup mentality - youre not afraid to roll up your sleeves, dig into the code, and implement your ideasBonus: M.S. or other advanced degree in Computer Science, Engineering, Artificial Intelligence, or other technical fieldWHAT YOU'LL GET FROM USAn official Best Places to Work (we're in the top 10!)The opportunity to define mobile commerce and change the way people book travelA people-focused organization dedicated to making sure you're challenged, learning, growing, and recognized for all the great work you doThe camaraderie of a driven, agile team that is building something disruptiveExcellent health, dental, vision and 401k plans, and stock options tooFun stuff - quarterly travel stipend, flexible time off, subsidized cell phone plans and fitness memberships, and the opportunity to spin the HT Roulette wheel to win a spontaneous weekend getaway!We are on a mission to radically transform hotel bookings. Doing this requires us to think differently and to question conventional approaches, therefore its essential to have a diverse team of the very best people with all types of backgrounds and experiences to bring the best ideas to life. We are committed to maintaining an environment where all of our team members have the opportunity to be heard, to make an impact and to do the best work of their lives."}