{"jobID": "2783174123", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst - Business Intelligence", "companyRating": "2.9", "companyInfo": {"Website": "www.twitch.tv", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "132000", "jobDescription": "Data is central to Twitch’s decision-making process, and analysts are a critical component to evangelize data-driven decision making in all of our operations. As an analyst at Twitch, you will be shaping the way that business performance is measured, defining the way we transform our data, and scaling analytics methods and tools to support our growing business, leading the way for high quality, high velocity decisions throughout the company.For this role, we’re looking for an experienced analyst to join our central analytics team, which is focused on business intelligence, data governance, and empowering staff throughout Twitch to use and trust our business data. Your work will include not only defining and enhancing our aggregate layer, but also connecting into BI tools that enable users to discover and analyze the data. In the process, you will have the opportunity to interact with technical and non-technical staff members throughout the company, and your effort will have a direct impact on hundreds of stakeholders at Twitch.Responsibilities Create and maintain the logic and processes to support trustworthy and efficient consumption of Twitch’s business data in aggregate form.Deploy solutions that enable internal teams to understand, explore, and analyze Twitch’s business data.Aggressively optimize for impact by focusing on work output that scales well.Be an effective mentor for both your team and the company through your deep domain and process expertise, and your broad understanding of our data structure and stores, increasing the data literacy of stakeholders throughout Twitch.Maintain a culture of high quality output and exceptional customer service: effectively communicate at all levels, ensure that work gets done well and on time, respond to unexpected obstacles and reallocate time as necessary.Identify opportunities for developing new data sources, and provide technical leadership around making those data sources high quality and broadly available.Requirements 4+ years of experience in analytics, data engineering, or related role.Strong proficiency in SQL, ETL, and data modeling in a business environment with large-scale, complex data sets.Fluency in data analysis, including defining KPIs and communicating about data to inform the success of the business and its features.Detail-oriented with superior organizational skills. Demonstrated ability to manage and prioritize workload and roadmaps.Comfortable giving definition to ambiguous problems. Can do this independently with limited guidance.Excellent written and verbal communication skills.Perks Full benefits, including medical, dental, vision and life401(k) savings plan with a company matchCatered daily lunch and dinners (and hearty breakfasts three times a week)Unlimited snacks and drinksMonthly in-office massagesCorporate gym membershipCommuter benefitsFlexible time off policyWeekly happy hours and opportunity to attend one gaming event or tournamentTop of the line technology to help you build your own workspaceTwitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at: http://twitch.tvWe are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.#LI-SM1"}