{"jobID": "2761564078", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.eaglerayinc.com", "Headquarters": "Chantilly, VA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " OverviewFEMA’s Protection and National Preparedness (PNP) is responsible for the coordination of preparedness and protection-related activities throughout FEMA, including grants, planning, training, exercises, individual and community preparedness, assessments, and lessons learned. PNP includes both the National Preparedness Directorate (NPD) and Grant Programs Directorate (GPD). GPD manages non-disaster preparedness grants to measurably improve capability and reduce the risks the Nation faces in times of man-made and natural disasters. NPD provides the doctrine, programs, and resources necessary to prepare the Nation to prevent, protect, mitigate, respond to and recover from disasters; while minimizing the loss of lives, infrastructure, and property. This is done through the National Preparedness System, which outlines an organized process for all partners to move forward with preparedness activities and achieve the National Preparedness Goal. NPD is also responsible for providing the guidance and support necessary to prepare the Nation to respond to incidents resulting from either natural causes or malicious acts, in order minimize the loss of lives and property. As a division within NPD, the National Preparedness Assessment Division (NPAD) has a mission to advance all hazards preparedness by assessing and communicating the investments, activities, and accomplishments as they relate to national preparedness. The purpose of this task order is to provide the support necessary to assist NPAD in assessing national preparedness. Preparedness is the shared responsibility of our entire nation. The whole community contributes, beginning with individuals and communities, the private and nonprofit sectors, faith-based organizations, and all governments (state, territorial, tribal, local (STTL), regional/metropolitan, insular area, and Federal).Responsibilities Responsible for supporting the design, development, review, and approval of NPAD products as tasked.Support data collection development and management requirements, tool development, integration, outreach, and capture for NPAD products, as tasked.Support methodology design for NPAD products to achieve outcomes and outputs.Support the assessment of data collected and application of approved methodology to generate conclusions and analysis that lead to development of NPAD products as tasked.Support CIP Capacity Building tasks to include guidance and policy, process improvement, engagement strategies, stakeholder engagement, training, and technical assistance.Support the development of NPAD products as tasked. Responsible for ensuring products are clear, concise, compelling and applicable to the appropriate audience and accessible to all.Support stakeholder engagement strategy.Support the development of outreach materials for products for internal and external distribution.Provide flexible support to emerging requirements and priorities within NPAD. QualificationsRequried:Public TrustBachelor's degree or greater.5+ yrs. experience.Demonstrates data collection and analysis skills.Demonstrates stakeholder engagement and outreach experience.Outstanding written and oral communication skills. Equal Opportunity Employer/M/F/Disability/Vet/Sexual Orientation/Gender Identity"}