{"jobID": "2831646128", "jobLocation": "Plano_TX", "jobTitle": "AT&T; Advertising&Analytics; Senior-Big Data Software Engineer (AdCo)", "companyRating": "3.4", "companyInfo": {"Website": "www.att.jobs", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Public (T) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Verizon, T-Mobile, Sprint"}, "estimatedSalary": "97000", "jobDescription": " Overall Purpose  Responsible for the development of high performance, distributed computing tasks using Big Data technologies such as Hadoop, NoSQL, text mining and other distributed environment technologies. Familiarity with JVM-based function languages including Scala and Clojure; Hadoop query languages including Pig, Hive, Scalding, Cascalog, PyCascading; along with alternative HDFS-based computing frameworks including Spark and STORM are desirable.  Key Roles and Responsibilities  Uses Big Data programming languages and technology, writes code, completes programming and documentation, and performs testing and debugging of applications. Analyzes, designs, programs, debugs and modifies software enhancements and/or new products used in distributed, large scale analytics and visualization solutions. Interacts with data scientists and industry experts to understand how data needs to be converted, loaded and presented. Works in a highly agile environment. Additional Information: Principal Functional Skills / Competencies associated with this Title: Agile DevelopmentApplication Design, ArchitectureApplication Development (Web)Application Development ToolsApplication Programming Interface (API)Big Data Software EngineeringData Mining and Data ScienceEmerging TechnologiesInformation Security ManagementProgrammingRequirements AnalysisSoftware Development Life CycleStatistics and Actuarial ModelingTestingUser Interface Design Note: Additional skills / competencies may be added to this specific requisition. During the application process, you will be asked to provide your proficiency and experience with all the skills / competencies associated with the requisition.  Job ID 1822986 Date posted 05/26/2018"}