{"jobID": "2829539289", "jobLocation": "Addison_TX", "jobTitle": "Data Reporting Analyst", "companyRating": null, "companyInfo": {"Website": "www.paladin-inc.com", "Headquarters": "Dallas, TX", "Size": "501 to 1000 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TEKsystems, Randstad US"}, "estimatedSalary": null, "jobDescription": " Paladin Consulting is currently hiring a Data Reporting Analyst to join our team working onsite at our client's office located in Addison, TX  We work with companies that offer environments for our employees to contribute, learn, and advance their career. We treat you like you are part of the family.  Job Title: Data Reporting Analyst  Work Location: Addison, TX  Duration: Long term 12 months+  Education/Experience Required: Bachelors Degree preferred or equivalent experience #17-00366Job Description & Responsibilities: We are looking for a passionate Data Reporting Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions.  Responsibilities will include: Interpreting data, analyzing results using statistical techniques and providing ongoing reports  Acquiring data from primary or secondary data sources and maintaining databases/data systems  Identify, analyze, and interpret trends or patterns in complex data sets  Filter and \"clean data by reviewing reports,and performance indicators to locate and correct problems and identify significance  Work with management to prioritize business and information needs  Locate and define new process improvement opportunities  Contributes to and takes part in training and development activities within the team and on a personal basis.  Develops and maintains constructive and cooperative working relationships with internal team members, key corporate personnel and stakeholders.  Skills & Qualifications: Proven working experience as a data analyst or business data analyst  Some Technical expertise preferred regarding data models, database design development, data mining and/or segmentation techniques  Strong knowledge of and experience with reporting packages and databases (SQL Server etc)  Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc) preferred  Familiarity with the VBA and SQL languages that power the Microsoft Excel, Access and SQL Server applications preferred  Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy  Adept at queries, report writing and presenting findings  BS in Mathematics, Economics, Computer Science, Information Management or Statistics preferred  Additional Skills: Ability to exercise sound judgment and decision making skills to consider the relative costs and benefits of potential actions and to provide recommendations and assist in execution of optimal solutions.  Excellent written and verbal communciaiton and comprehension skills, including the ability to clearly explain complex department processes and demonstrate the appropriate levels of disclosure to a wide audience who may or may not be familiar with client's distribution process.  Ability to work well under pressure and effectively handle multiple, concurrent demands and appropriately prioritize responsibilities.  Cultivates effective working relationships with team. members in and outside the department.  Motivation to approach all tasks with enthusiasm, seizing opportunities to learn new skills or knowledge in order to improve your personal performance.  Able to work independently with minimal supervision on specific projects within agreed time limits.  To be flexible, responding quickly and positively to changing requirements including the performance of any tasks requested of you and the ability to remain calm in difficult situations.  For more information or to view other opportunities, visit us at www.paladininc.com.  Paladin is an EEOC employer. We drug test and background check!"}