{"jobID": "2638448900", "jobLocation": "Herndon_VA", "jobTitle": "Data Scientist (Machine Learning)", "companyRating": null, "companyInfo": {"Website": "www.techbridgeit.com", "Headquarters": "South Jordan, UT", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client, a systems integration company based in northern VA, focuses primarily in data science, machine learning, correlation, deployment, performance testing, information technology security solutions, system integration, and test automation. They are looking for a Data Scientist (Machine Learning) to assist their clients with complex projects. This candidate will be working at the enterprise level and with one of the leading Fortune 500 companies in the nation focused in the next generation of advanced engineering. Responsibilities:Feature Engineering - review, analyze and compute data elements that contribute to predictions.Model Development - train, develop and validate Machine Learning models that provide predictions with high confidence level /accuracy.Documentation and presentation skill.Requirements:Expertise with Machine Learning model development that leverages TensorFlow, keras, and Python.At least 3 years' experience building descriptive, predictive, and prescriptive models with data.Experience working in a Linux computing environment.Experience applying data mining and machine learning techniques in a professional context.Strong familiarity with data preparation, processing, classification, and prediction.Excellent written and oral communication skills.Experience working with Big Data.Occasional local travel required. Be a part of the ConsultNet difference. As a leading national provider of IT staffing and solutions, ConsultNet delivers exceptional services to startup, midmarket and Fortune 1000 companies across North America. Since 1996, we've partnered with clients to create rewarding opportunities for our consultants, successfully building teams that have surefire results.  In the past two years alone, we have placed more than 1,500 consultants in contract, contract-to-hire, or direct placement opportunities. We understand communication is key to finding the right job that matches your skills and career goals. For us, it's not just the work that we do; it's how we do the work. Our breadth of offerings extends to multiple IT positions in major markets throughout the country, see more at www.consultnet.com.Id: 18-00844"}