{"jobID": "2829535845", "jobLocation": "San_Diego_CA", "jobTitle": "Post Doctoral Research Scientist-Immunology", "companyRating": "3.8", "companyInfo": {"Website": "www.lilly.com", "Headquarters": "Indianapolis, IN", "Size": "10000+ employees", "Founded": " 1876", "Type": " Company - Public (LLY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Responsibilities It is an exciting time to join Lilly. Our San Diego site is growing in key areas. The Biotechnology & Immunology research group focuses on discovering innovative biotherapeutic medicines treating autoimmune diseases and related complications. We are seeking a highly motivated and dedicated scientist with deep understanding of immunology and inflammatory diseases who also shares our passion to help patients live with a higher quality of life. You will work in a highly collaborative environment at the Lilly San Diego and surrounding academic community.  We are seeking a Post-doctoral Research Scientist with a strong background in immunology and inflammatory diseases, preferably with experience studying cellular immunology, CRISPR-Cas9 technology, genomics and/or proteomics. In addition to being suitable for publication, the work you will do will involve understanding the key mechanisms that drive human autoimmune disease such as IBD, leading to drug target identification and validation. Are you looking to extend your educational experience in an established pharmaceutical company with the energy and pace of a biotech? Are you ready to gain valuable industry experience while collaborating with academic institutions? We are looking for highly engaged scientist to help further the understanding and treatment of autoimmune disease. This position may be right for you.  In this role you will have the opportunity to utilize these skills:  Human innate immune cells including macrophage, dendritic cell differentiation as well as T-, B- cell differentiation  Characterize in vitro immune responses relevant to human autoimmune diseases. Perform flow cytometry characterization, cell sorting, analysis of gene expression and epigenetic change.  Generating gene-edited cells with CRISPR-Cas9 technology.  Utilizing functional antibodies and specific small molecules to study targets of interest in cell based assays (e.g. primary human cells).  Actively collaborate with external academic laboratories to source ideas, patient specimens, and technologies.  Record, analyze and communicate scientific ideas and data and also publish in peer-reviewed journal.  41750BR  Basic Qualifications Ph.D in Immunology or related scientific discipline  Additional Skills/Preferences  Has deep expertise in working with primary human/rodent tissue/cells.  Knowledge and experience of in vivo pharmacology with various autoimmune/inflammatory disease models is a plus.  Cell-based assay development experience with special emphasis on functional genomic methods for target validation (e.g. shRNA, CRISPR-Cas9, flow cytometry).  Track record of scientific success proven by authorship on publications in excellent journals.  Additional Information  This position is not permanent. It is for a fixed duration of 2 years with the potential to extend annually for up to 4 years"}