{"jobID": "2813916689", "jobLocation": "Dallas_TX", "jobTitle": "Claims Data Analyst (QA, Non-IT)", "companyRating": "2.8", "companyInfo": {"Website": "www.nationalgeneral.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1939", "Type": " Company - Public (NGHC) ", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Employee Type: Seasonal/Temp Location: Dallas, TX Job Type: Policy Operations Experience: Not Specified Date Posted:6/10/2018Job DescriptionEssential Duties and Responsibilities: Following is a summary of the essential functions for this job. Other duties may be performed, both major and minor, which are not mentioned below. Specific activities may change from time to time.  Assist management on quality assurance programs, as well as special requests.  Independently plan, design, perform all aspects for quality assurance testing following departmental standards and procedures, including walkthrough of processes, setting objectives, defining scope, designing tests and performing the quality assurance testing.  Perform risk assessments, including identification, evaluation, and documentation of business risks, policies, procedures, and controls.  Analyze quality assurance evidence to provide management with an evaluation of the adequacy of compliance with financial and operational policies, procedures, and controls and make recommendations for improvement.  Communicate effectively with all levels of management; to ensure full understanding of objectives, risks, controls, and observations.  Prepare clear and concise quality assurance reports and other communications.  Complete ad hoc projects as requested by management.  Support regulatory assurances and policies, procedures, and controls testing;  Conduct quality assurance testing including compliance, financial and operational quality assurances, claims and contracting quality assurances, provider quality assurances, functional quality assurances and others as directed.  Provide support for fraud investigations.  Provide support to the corporate internal audit department for SOX audits.  Lead internal quality assurances of operations, and consult with process management on solutions.  Facilitate periodic audits system access permissions and permissible purpose for access to systems/information,  Periodic audits of access changes based on job change and/or terminations.  Periodic access review of our TPA's system access.  Work independently on quality assurance engagements.  Prepare working papers and written quality assurances reports.  Hold preliminary discussions of quality assurance results with business partners to verify facts and discuss recommendations. This includes attending meetings with all levels of management; to ensure full understanding of objectives, risks, controls, and observations.  Appraise the adequacy of the corrective action taken and work collaboratively with business partners to assist in developing business process changes to address recommendations.  data mining technology to quality assurances/projects.  Support the implementing of an annual quality assurance plan. Minimum Skills and Competencies: The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  College Degree or equivalent education, training and work-related experience  5-10 years of experience in health insurance with experience in internal quality assurance, internal audit, public accounting or regulatory compliance.  Ability to work on multiple, concurrent projects, as part of a team or independently, and research, understand, and evaluate the company's operations, rules and regulations.  Demonstrate a high level of personal integrity and reflect an appropriate level of judgment, maturity, and confidentiality.  Successfully interact with all levels of personnel in a positive, constructive manner.  Strong analytic skills and an inquisitive personality.  Effective oral and written communications with management  Ability to travel as necessary  Job Requirements About National General Holdings: National General Holdings Corp. is headquartered in New York City. National General traces its roots to 1939, has a financial strength rating of A - (excellent) from A.M. Best, and provides personal and commercial automobile, homeowners, umbrella, recreational vehicle, motorcycle, supplemental health, and other niche insurance products. We are a specialty personal lines insurance holding company. Through our subsidiaries, we provide a variety of insurance products, including personal and commercial automobile, homeowners, umbrella, recreational vehicle, supplemental health, lender-placed and other niche insurance products.  National General is a fast paced, dynamic, and entrepreneurial organization. Our team members live by and exemplify what we call the 4Es. At National General, we are Energized, Engaged, Empowered, and we Execute every day in order to provide an exceptional experience for our customers! We are passionate about our organization and the value that we add every day. A successful candidate with National General will embody the 4Es. Our team is poised to outperform the competition. We are National General Insurance and with us you can be extraordinary! Come join our team!  Companies and Partners  Direct General Auto & Life, Personal Express Insurance, Century-National Insurance, ABC Insurance Agencies, NatGen Preferred, NatGen Premier, Seattle Specialty, National General Lender Services, ARS, RAC Insurance Partners, Mountain Valley Indemnity, New Jersey Skylands, Adirondack Insurance Exchange, VelaPoint, Quotit, HealthCompare, AHCP, NHIC, Healthcare Solutions Team, North Star Marketing, Euro Accident.  In addition to a phenomenal career opportunity, National General Insurance offers an excellent benefits package including: Paid TrainingMedical, Dental, Vision benefitsWellness ProgramsLife and Short/Long Term Disability Insurance401k w/ Company MatchCompany Paid Holidays & Generous Time-off policyEmployee Discount ProgramCareer Advancement and Development OpportunitiesOn-site Healthcare Clinic (Winston-Salem and Cleveland offices)On-site Fitness Center (Cleveland and Dallas offices)Subsidized parking (Cleveland office) National General Holdings Corp. is an Equal Opportunity (EO) employer - Veterans/Disabled and other protected categories. All qualified applicants will receive consideration for employment regardless of any characteristic protected by law. Candidates must possess authorization to work in the United States, as it is not our practice to sponsor individuals for work visas.  In the event you need assistance or accommodation in completing your online application, please contact NGIC main office by phone at **************. -"}