{"jobID": "2795606169", "jobLocation": "San_Francisco_CA", "jobTitle": "Payroll + Benefits Associate", "companyRating": null, "companyInfo": {"Website": "www.methodhome.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are people against dirty® (PAD), and we’ve always done things differently. We are fearless thinkers, mad scientists and adventurous designers who believe that making soap leads to brave ideas, bold inventions and beautiful bubbles.  We are small, but we have big plans to make the world a cleaner, greener, more colorful place. And we invite everyone to join us as we pioneer a future where doing business is doing good for all. THE ROLE Based in San Francisco and reporting to the People Operations Manager, this role is responsible for the more financial side of the people equation as a key link between the People + Environment (P+E) and Finance teams. This role will be responsible for full-cycle payroll and benefits administration. Beyond the traditional boundaries of HR, we want to ensure that work life at method is driving the greatest value for our people and for the company. This position provides an amazing opportunity to both learn about and influence our culture. AREAS OF RESPONSIBILITY Own all aspects of full-cycle payroll administration: Process semi-monthly + weekly payrolls for 250+ multi-state exempt and non-exempt employees (US + Canada) including: new hires, terminations, deductions, garnishments, direct deposits + fringe paymentsEnsure data integrity in the HRIS database + time tracking system (UltiPro)Manage the UltPro customer service relationshipMonthly, quarterly + annual payroll reporting + account reconciliations; lead the year-end review process to capture all taxable payments and ensure accurate W-2’sSubmit accurate + timely payroll-related filings: S.F. Tax Credit, S.F. HSCO, EEO-1 Reporting + S.F. Business Tax FilingOwn record keeping: scanning, filing + e-filing of all personnel records Own all aspects of benefits administration: Administer 401(k), FSA, workers’ comp + transit programs as well as drive internal communication + educationPrepare annual total comp statements for individuals, ensuring accuracy + clear communicationTrack + explain variance between actual expenses + personnel plan/forecast Assist with finance + own applicable reporting: Support annual business planning + budgetingProvide timely support for audits (financial, bank, 401k, workers comp, etc.) Make it a great place to work: Act as a leader + ambassador of our celebrated culture (our #1 competitive advantage!)Work reception once a month* *we are not joking. at method, everyone in San Francisco takes a spin as receptionist. costumes welcome.  QUALIFICATIONS: EXPERIENCE:2-4 years of business experience in payroll, accounting or human resourcesMinimum 1 year of experience as owner of full cycle payroll processingExperience with + desire to become the in-house expert on hr-related software applicationsProven ability to collaborate with people across all levels and functionsMaintains a solutions-based approach to customer serviceAbility to anticipate needs + innovate in a high volume, fast-paced environmentExperience in a mission-based, entrepreneurial environment a plusAbility to exercise extreme diplomacy + confidentialityREQUIREMENTS:Intermediate knowledge of ExcelFanatical devotion to organization, details + tight deadlines while managing key initiativesClear written + verbal communicationsCreativity + a sense of humor– able to put a method-style spin on thingsA great attitude + positive outlookEDUCATION:Bachelor’s degreePAD PERKS: Our values are at the heart of everything we do. Here are a few of the  ways we Care like a Mother for every person against dirty: Rockstar health insurance benefits packageJollydays: competitive vacation bundleGenerous retirement match + pre-tax savings options3 Care Days (a.k.a. Volunteer Time-Off) a year, to be a force for goodGlobal Ping Pong Tournament + Prom...you heard that right-- let's dance FURTHER INFORMATION  LOCATION: San Francisco  HOURS: full time, exempt (salaried)  REPORTS TO: People Operations Manager"}