{"jobID": "2764143783", "jobLocation": "Lansing_MI", "jobTitle": "On-Call Job Coach", "companyRating": null, "companyInfo": {"Website": "www.peckham.org", "Headquarters": "Lansing, MI", "Size": "1001 to 5000 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description:*Staff jobs are NOT a part of Peckham's vocational rehabilitation efforts. These positions are supportive roles. Therefore, applicants do not need to have a barrier to employment to be eligible for these roles.*  The Job Coach provides job and work-related training services for internal Peckham programs and external community agencies. The primary responsibilities of this position include, but are not limited to, training persons with disabilities on job specific tasks, documenting client progress, providing professional quality progress reports to staff and supervisors, and advocating for all program participants. This position will ensure that all requests for Job Coach services are met and maintained to the satisfaction of our customers. The Job Coach should be a positive representative of, and community ambassador for, Peckham, Inc. to all program participants and customers. This is an on-call position that will require scheduling flexibility. Jobs may be assigned within 24-48 hours. Length of coaching assignments and time of work schedules may vary significantly.  MAJOR DUTIES AND RESPONSIBILITIES include the following: Provide intensive one-on-one job training to program participants at various community work sites and at Peckham facilities as requested.On call status: Be available for last minute, job coaching assignments that may last from a few days through a few months.Must have reliable transportation for frequent travel to job sites.Must have telephone, answering machine/voice mail, Cell phone highly recommended.Must have access to the internet and computer with MS word and ms excel (or MS office) software for all required paperwork.Must be able to communicate electronically, via email, and provide daily and weekly reports electronically.Provide professional quality daily and weekly progress reports on client’s employment skills progress.Maintain a positive relationship with all work related professionals; (employment & rehabilitation specialists, Clients/team members, and employers).Provide on the job skills training to program participants to ensure that all job coach contracts and requests will be honored.Fill in for other Job Coaches, or departments.Follow up on all required paperwork of daily and weekly team member/client progress for the Employment Specialist/Rehabilitation Counselors.Keep a record of the hours spent on each assignment; not working past assigned hours without prior approval of your direct supervisor.Maintain weekly contact with your direct supervisor and customers.Update status of team member/client’s progress on all training assignments.Email time sheets to the direct supervisor on time. Submit copies of the time sheet to the customer. Record all hours assigned worked and not worked.Maintain records, keeping track of assignment information as it’s provided on the Job Coach Request Form.Attend all monthly Job Coach training meetings.Seek additional training opportunities to enhance job coaching and training skills.Other duties as assigned. SUPERVISORY RESPONSIBILITIES:  This position has no supervisory duties.  QUALIFICATIONS  To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  COMMENTS  Must have excellent interpersonal skills and enjoy cultural diversity in the workplace.  This position requires passing and maintaining security background checks. Must have access to reliable transportation. This position utilizes a team approach for all projects and promotes Peckham’s vision, values, and services to all customers and stakeholders.  EDUCATION and/or EXPERIENCE  2-5 years of experience and/or training in a human service field; or equivalent combination of education and experience.  Must be able to use a computer and understand general technology. Ability to learn how to log on to a computer remotely and to use Peckham systems, including Microsoft Outlook, Workday, Cornerstone, etc.)  TECHNOLOGY SKILLS  All applicants must have basic computer skills including an ability to open and read emails, send emails with attached documents, MS Office Suite familiarity, the ability to complete on-line trainings independently and the ability to connect with websites. Peckham will provide training for using our intranet systems but the above mentioned skills are a prerequisite. Daily access to email communications is also required  LANGUAGE SKILLS  Ability to read, analyze, and interpret guidelines. Ability to write reports, business correspondence.  MATHEMATICAL SKILLS  Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals.  REASONING ABILITY  Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.  PHYSICAL DEMANDS  The physical demands of this position may be reasonably accommodated for individuals with disabilities on a case by case basis.  WORK ENVIRONMENT  While performing the duties of this job, the employee is occasionally exposed to outside weather conditions. The noise level in the work environment is usually moderate. Worker Sub-Type:Staff MemberLocation:Lansing, MIBusiness Line:Other StaffTime Type:Part timeScheduled Weekly Hours:0"}