{"jobID": "2810232611", "jobLocation": "Detroit_MI", "jobTitle": "Data Mining Analyst, Analytics Consulting", "companyRating": "3.3", "companyInfo": {"Website": "www.ttec.com", "Headquarters": "Englewood, CO", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (TTEC) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Teleperformance, TaskUs, Convergys"}, "estimatedSalary": "69000", "jobDescription": " TTEC is seeking a Data Mining Analyst for our Analytical Consulting team. The primary responsibility of this role is to provide analytic support to a key Fortune 500 client, focusing on prospect and customer marketing efforts while producing actionable, data-driven insights to the sales and CRM client teams.  The candidate we are seeking will possess a strong technical aptitude to work with various data sources and end-user systems in a client-facing role. This candidate will also have marketing experience, with a solid understanding of CRM and analytic concepts. In addition, the ability to work with data to build ad hoc reports and analysis is required.  An ability to turn data into insights and recommendations is a must. ResponsibilitiesProvide day-to-day support for two key areas; Sales development and CRMSupport ad-hoc analytic/data needs across the organizationAccess, extract, scrub and analyze internal and external data sources and systemsIdentify acquisition opportunities to increase the account baseProfiling of existing customers and prospects to identify targets for new product launches and marketing campaignsSupport other automotive client initiatives that may lead to cross-divisional opportunities such as lifecycle management, segmentation, loyalty, and customer value Job Requirements  Analytic thinker with a proven ability to mine data and translate data into insights and recommendations Comfortable working in a team-oriented, deadline-driven environmentStrong technical ability working with data; SAS or SQL preferredExperience mining large-scale databases, files or datasets utilizing querying tools/languages (SQL, SAS, PL/SQL, Oracle, Teradata)2-4 years relevant experience preferredSolid understanding of mining data to develop insights that lead to marketing recommendationsBusiness Reporting/Dashboarding (Tableau, Power BI, Cognos, other)Exposure with marketing B-to-C or B-to-B is preferredDemonstrated ability to interpret analytic output and translate into actionable insightsStrong proficiency in Microsoft Excel and PowerPoint requiredExcellent verbal and written communication skills; an ability to explain and educate client team on data processes, concepts and resultsBusiness, economics, or quantitative methods background preferablePrior consulting experience a plusTableau experience a plusWho We Are: TTEC is a pioneer in customer experience, engagement and growth solutions. Our 50,000 employees serve customers in more than 80 countries and 50 languages across social, mobile, and digital channels. We utilize a holistic approach, applying solutions from our four customer experience segmentsConsulting, Technology, Care and Growthto help companies provide an amazing experience to their customers, inspire customer loyalty, and grow their business. Our employees live by a set of customer-focused values that guide relationships with clients, their customers and each other. What We Offer:Variable incentive bonus plan, 401K company match, tuition reimbursementGlobal career mobility, employee recognition programs, professional developmentState of the art technology which allows for seamless global connectivityRich wellness program and health incentives Lead Everyday w Do the Right Thing w Reach for Amazing w Seek First to Understand w Act as One w Live life Passionately #LI-RD1 Notice to external Recruiters and Recruitment Agencies: TTEC (formerly TeleTech) does not accept unsolicited headhunter and agency resumes. Headhunters and recruitment agencies may not submit resumes/CVs through this web site or directly to any employee. TTEC (formerly TeleTech), and any of our subsidiaries, will not pay fees to any third-party agency or company that does not have a signed agreement with TTEC (formerly TeleTech).  Employment Requirements: TTEC (formerly TeleTech) requires all employees hired in the United States to successfully pass a background check and depending on location and client program a drug test, as a condition of employment. TTEC (formerly TeleTech) is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.  '1431220"}