{"jobID": "2827027204", "jobLocation": "Houston_TX", "jobTitle": "Senior Data Analyst (Geographic Information Systems)", "companyRating": "3.3", "companyInfo": {"Website": "www.woodmac.com", "Headquarters": "Edinburgh, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " McKinsey & Company"}, "estimatedSalary": "100000", "jobDescription": " Job ID: 20180625-12009-CK  Company Name: Wood MackenzieDescription: EMPLOYER: Wood Mackenzie, Inc.  POSITION: Senior Data Analyst (Geographic Information Systems)  WORKSITE: 5847 San Felipe, Suite 1000, Houston, TX 77057  DUTIES:  Responsibilities include: creating maps and visualizations for research, consulting and marketing; updating and producing maps, visualizations and GIS data for all regional offerings, ensuring requirements and deadlines are met; identifying and recommending GIS data quality and efficiency initiatives in regions which will achieve ROI and business benefits; improving Extract, Transform and Load (ETL processes used to deliver GIS data to clients; assisting with the design and implementation of product enhancements; developing GIS expertise and recommending new applications; providing support to sales and account management with GIS client queries and data sets.  REQUIREMENTS:  Master’s degree in Geography, Geology, Remote Sensing Business Systems, Spatial Analysis, GIS or closely related field and two (2) years of experience in the job offered or two (2) years of experience with ESRI products V10 and above (ArcSDE, ArcGIS Desktop, ArcGIS online, ArcGIS Server, ArcGIS Extensions, Modelbuilder and Python), cartographic, GIS and data visualization.  CONTACT: Detria Mitchell  Sr. HR Business Partner  Wood Mackenzie, Inc.  5847 San Felipe, Suite 1000  Houston, Texas 77057  Qualified applicants should submit resumes to detria.mitchell@woodmac.com.Requirements: Expertise Research Education Bachelors (or equivalent work experience) Job Type Full Time Location TX-Houston Years of Experience 3-5 Years"}