{"jobID": "2617347076", "jobLocation": "Menlo_Park_CA", "jobTitle": "Auction and Delivery Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "155000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.The massive scale and heavy engagement of the people using our products make the Facebook platform an ideal place for marketers to build their brands. It also makes the platform an ideal place to conduct analyses and research to learn how to improve marketing in the new mobile world. The successful candidate will focus on investigating and understanding the current best practices for advertising on Facebook as well as inventing new strategies. The team is both theoretical and practical as we work with product engineers and with our top tier advertisers to build our understanding and to test ideas.  The ideal candidate for this data science focused position will be passionate about Facebook and Instagram and have worked in either Marketing or Advertising. Have a proven track record of analyzing and deriving insights from data. They would be intellectually curious, a great communicator, data-driven, a fast learner and able to move fast while keeping focused on high impact projects. Applicants should have a strong quantitative understanding, a strong data a talent for taking complex concepts and distilling them into clear accessible learnings.  This role is full-time and located at our Menlo Park, CA headquarters. Responsibilities:"}