{"jobID": "2677217138", "jobLocation": "Plano_TX", "jobTitle": "Financial Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.bravotech.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Financial Data Analyst BravoTECH, a leader in IT staffing and staff augmentation services, seeks a Financial Data Analyst for our preferred client in their Plano location. Summary:The individual in this role is responsible for modeling complex problems, discovering insights and identifying opportunities using statistical, mining, and visualization techniques.In addition to advanced analytical skills, this individual should be proficient with integrating and preparing large, varied datasets and communicating results.Required Skills:Business Analyst skill setAdvanced Excel knowledgeStrong understanding of financial management processes, software, applications, tools, and systems with a vision toward process improvementProcess, cleanse, and verify the integrity of data used for analysis.Develop ideas for automated anomaly detection and correction systemsOrganize and wrangle large datasets from multiple systems to develop actionable insightsCreate meaningful data visualizations that communicate findings and potential for business impact to key decision makersPreferred Skills:Advanced programming language skills as well as Visual Basic for Applications (VBA), Structured Query Language (SQL), SQL Server, Microsoft Access and Microsoft Excel technologiesExperience with data visualization tools such as TableauAct as a data advisor in such areas as data system architectures, data governance, and developing a master data management programExperience with Workday, SAP, and/or Service NowCompensation is commensurate with years of experience:***Please note: All applicants may be subject to a criminal history check and drug screen. About BravoTECH: BravoTECH is an Equal Opportunity Employer. Headquartered in Dallas, Texas, BravoTECH has provided technology staffing and consulting services to clients throughout the country since 1996. BravoTECH’s client-centric business model, driven by quality metrics, ensures consistent, predictable service results. As a result, the firm has realized steady growth and maintained many long-term relationships with its clients. In addition, our Recruiter Specialization Model -- in which recruiters devote 100 percent of their time to developing relationships within one or two technical skill set areas – allows us to quickly locate and secure the highly-skilled technical resources our clients demand. BravoTECH is a WBE and HUB certified company and an Equal Opportunity Employer."}