{"jobID": "2814944528", "jobLocation": "Dallas_TX", "jobTitle": "Senior Marketing and Analytics Manager", "companyRating": null, "companyInfo": {"Website": "www.themedicusfirm.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Private Practice / Firm", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Merritt Hawkins, Fidelis Companies, Arthur Marshall"}, "estimatedSalary": null, "jobDescription": "Excellent Opportunity to Join a Growing Firm! Do you think outside the box? Are you a master of process optimization? A direct marketing guru? What else is important to you? Maybe a relaxed, casual, fun work environment? More work life balance? What about the opportunity to contribute to a growing company? All of the above is important to us, if it’s important toYOU ----APPLY NOW! Should you choose to accept an opportunity with us, you may find yourself saying goodbye to your dry cleaner because we wear jeans, shorts, and even flip flops to work all year! ESSENTIAL DUTIES AND FUNCTIONS:Analyze the results of physician outreach campaigns to improve response rates on job opportunity offersImprove targeting of direct marketing efforts-both digital and direct mailOffer insights to improve the creative for both digital and direct mail marketing materialsPerform A/B tests to refine messaging and creative to drive better response rates from marketing campaigns.Manage relationships with vendors where we advertise our job opportunities and analyze the return from our marketing spendStreamline processes to drive greater efficiency in marketing activitiesManage small teamDevelop and manage annual budget for the departmentWork closely with recruiting team to efficiently manage the flow of marketing campaign requestsMonitor physician marketing KPI's - number of quality new candidates, candidate response rates and website conversionsManage candidate sourcing vendor relationshipsRequirementsBachelor’s degree preferredStrong organizational skills and ability to handle multiple tasks concurrently2-4 years’ experience in a marketing roleExperience with A/B tests, direct marketing and vendor relationships necessaryExceptional attention to detailHighly process orientedHave a positive attitude, flexibility and willingness to work with a teamPossess a passion for team development, growth and coachingSelf-starter with strong problem solving skills that can work in an ever shifting environmentExperience with SEO a plusAbility to work effectively in a fast paced environmentBe willing to commute to our North Dallas office on a daily basisThe Medicus Firm is a retained physician search firm unlike any other. Our resources and recruitment experience make us one of the biggest and best retained physician search teams in the industry. Our unique approach to physician search reduces our clients' financial exposure while providing excellent customer service, and more importantly, results! We are award winning for Client AND Employee Satisfaction! We offer a casual office and flexible schedule opportunities.The Medicus Firm has been voted one of the “Best Companies to Work for in Texas” for the past nine years. We’ve received the Inavero/Career Builder “Best of Staffing” award five times for Client Satisfaction. We won a spot on Modern Healthcare’s list of the top 100 “Best Places to Work in Healthcare” for the past 6 years and we’ve been awarded as a Top 100 Places to Work in Dallas by the Dallas Morning News for three years! Last but certainly not least we are very proud to be included on the Forbes list of Best Professional Recruiting Firms for 2017!Check us out!Our Site: https://www.themedicusfirm.com/work-at-tmf/Facebook: http://www.facebook.com/TheMedicusFirmTwitter: http://twitter.com/themedicusfirm Due to the high volume of resumes received not all inquiries will receive a response.  The Medicus Firm does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits."}