{"jobID": "2838105230", "jobLocation": "Fort_Worth_TX", "jobTitle": "Big Data Business Analyst", "companyRating": null, "companyInfo": {"Website": "www.pyramidci.com", "Headquarters": "Alpharetta, GA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TEKsystems, Collabera, Artech Information Systems"}, "estimatedSalary": null, "jobDescription": "Job Description Immediate need for a talented Big Data Business Analystwith experience in the ITIndustry.  This is a 12 month contract opportunity with long-term potential and is located in Fort Worth, TX. Please review the job description below and contact me ASAP if you are interested. Job ID: [16-24593]Responsibilities:Evaluate client deliverables related to requirements specification, process analysis, system-based and manual controls, functional design, and test plans for a Big Data projectUnderstand sensor data from Mechanical devises to created data extraction specification routines.Write and help business users write effective user stories.Define security requirements.Review business process and information security controls to help provide effective, efficient, and secure access to information within applications.Clearly communicate business functional issues to various levels of clients and internal staff.Establish standards by which deliverables are measured, understand the process used to create deliverables, review deliverables against established standards, and identify gaps and root causes.Qualifications:Two years of experience as a business analyst during the system and/or user acceptance testing planning.Bachelor’s degree in an appropriate major science or engineering.Demonstrated experience assisting other organizations in reviewing or implementing information technology infrastructure library standards.Ability to formulate and express ideas clearly and effectively in verbal and written presentations.Knowledge of Predictive modeling and statistical score cards.Knowledge of the Data Sciences is a plus.Knowledge of Preventive maintenance of mechanical devices is a plus. Our client is a leadingITorganization and we are currently interviewing to fill this and other similar contract positions. If you are interested in this position, please apply online for immediate consideration."}