{"jobID": "2836833779", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.spins.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": " SPINS, a Chicago-based SaaS company, is seeking a Senior Data Scientist to join its growing Client Solutions team.  By leveraging SPINS industry-leading proprietary data and analytics, our technology enables deeper, more engaged relationships between Retailers, Brands and Consumers through our platform, web, and mobile products. WHO ARE WE?We eat collaboration and curiosity for breakfastWe communicate quickly and succinctlyWe believe in roles instead of jobsWe take initiative independently and hurdle challenges togetherWe discuss, debate, decide and do with the same rapidity as we iterate our platformWe are a talent ecosystem whose health is predicated on each individuals ability to support every other individuals successWHO ARE YOU?Someone energetic, empathic and earnestSomeone who wakes each morning thinking of which opportunity they will grab todaySomeone that refuses to give up when the path isnt pavedSomeone that consistently delivers quality work on scheduleSomeone who would rather build the right tool to do the job than wait until theyre handed oneA creative thinker as adept at looking at the Big Picture as they are at the detailsAn obsessive perfectionist that knows when to put down the paintbrush and shipThe kind of person that can expertly use an Onion headline as an analogy in a serious strategy meetingWHAT DO WE NEED? You will create robust, scalable data science solutions that scale across the SPINS business. This senior role is expected to lead the development and execution of new data science methodologies for SPINS clients and retail partners.  You will be working in a hands on role, using python to uncover meaning and insight that leverage SPINS proprietary data. You will develop and drive the data science efficiency of the organization by contributing to a reusable codebase that can be leveraged in other projects across the organization.  Ideally, you thrive on continuous innovation when value is determined by client results. You must have a passion for digging into data using the latest tools and methodologies and an appetite to continuously learn and share new techniques to deliver value to our clients.  The Senior Data Scientist will report to the Director of Data Science Solutions and will be located in the SPINS headquarters, in the River North neighborhood of Chicago. WHAT ARE YOUR REPONSIBILITIES?Create innovative and efficient techniques that better solve problems common to our retail partners and clientsPartner with internal and external stakeholders to develop tools and services such as data models, dashboards, decision aids, and business case analysis to support programs, creative direction, and recommended solutionsExplain statistical principles that underpin the insights you generate from SPINS dataYOU ALREADY:Have 4+ years of retail data analysis experienceHave 2+ years of experience using python in a data context (iterators, pandas, scikit-learn, etc.)Have a professional quantitative background with an education that stresses analytical thinking and quantitative methods (STEM)Are passionate about innovating new ways to answer novel problemsAre comfortable with being given the self-autonomy to work independently and experiment with new ideas and new ways to design and implement data science solutions to advance business goalsHave confidence in making data-driven recommendations to clients & retail partners based on independent synthesis of a broad range of dataFamiliarity with Docker is a plus"}