{"jobID": "2795790655", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Sr. Data Scientist DATE 31 Mar LOCATION San Francisco COMPENSATION $125,000.00 KEY SKILLS DESCRIPTION Job Title & Location Sr. Data Scientist  D.C. Metropolitan Area / San Francisco Salary Range or Specified Number + Bonus $125,000 + 10% EOY Bonus Job Description Currently looking for a Sr. Data Scientist to join our team of big data fanatics. Our team supports an industry leading cloud software developing company. We are looking for someone who is extremely hands on and ready to make an immediate impact. All candidates should have:5+ years of experience in Software Engineering / BI / Data Warehouse design and development using modern Relational and NoSQL databases like MySQL, PostgreSQL, and MongoDB.2+ year of experience in Big Data Engineering using tools like Hadoop, Hive & Map ReduceCreating scalable systems that ingest data from multiple sourcesExperience with Apache Spark, Kafka, or similar fast / real-time toolsAbility to translate complex data sets and distribute that information across multiple departmentsExperience with distributed systems and cloud architecture using AWSExceptional Candidates will have:Bachelors degree or greater in Computer Science or similar areasData Modeling and Data Science experience building predictive modelsHands-on Machine learning development experienceExperience with Python, Unix, or statistical software packages (R, SAS) for data manipulationConfidence with tools such as R, Scala, or MATLABDaily Duties Include but not limited to: - Design and implement new Machine Learning tools  - Design and execute statistical models that see into the future  - Communicate results to diverse audiences effective writing and visualizations  Gather necessary data to experiment and examine hypothesis to solve business ques While a resume is preferable we also welcome tentative enquiries from well-qualified persons. To speak with an  agent please contact one of our regional offices. Utmost confidentiality and discretion is assured."}