{"jobID": "2758178530", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.6", "companyInfo": {"Website": "www.siluria.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "155000", "jobDescription": "Summary Data Scientist is responsible for Siluria's emergent Data Science Platform, including the growth, integration, and maintenance of the Python code base for organization of data from lab, pilot, and demonstration-scale chemical reactor systems. The code pulls data from unstructured and structured databases measured by sensors, meters, and analytical tools, reconciles the data, calculates performance metrics, and generates visualizations. This position is also responsible for supporting experimental campaigns through experiment-specific analysis work and data-driven model development. Essential FunctionsReports to Senior Director, Development.Lead the development and maintenance of the Siluria Data Science code base.Drive adoption of data science tools and data management that includes data extraction/processing/storage, exploratory data analysis, machine learning tools to make predictions based on trends in the data, and visualization for publishing to internal customers.Write robust code that uses object-oriented design patterns and follows PEP-8 style guidelines.Manage source code using GitHub.Support analytical team and data quality.Work cross-functionally with research, development, and business divisions.Help implement general safety guidelines and procedures as part of Siluria’s ZERObjective safety initiative.All other duties as assigned by the managerSupervisory Responsibility Mentor junior team members and lead team functions as necessary. Required Education and ExperienceCS, data Science, or Engineering degree required, and5+ years of related experience and/or training.The ideal candidate should have:Strong computer science background,Experience using python—as well as libraries like pandas and the SciPy packages,some experience with SQL and other database technologies,Statistics training,Experience developing models to derive insights from data, andAbility to drive a project and work both independently and in a team.Additional experience in process engineering, machine learning, or visualization tools like D3.js is preferred.Work Environment Work is mostly carried out in an office environment.Some work is performed in a research and development pilot laboratory and at the company's demonstration plant.Work carried out in a laboratory might involve working near chemicals and moving mechanical parts. Potential hazards include hot surfaces, rotating/moving equipment, pressured equipment and high voltage. The noise level in the lab work environment will be moderate to high.  Safety, environmental and health concerns are priority in this job. Employee will be required to follow the appropriate safety protocols and to wear appropriate personal safety protection equipment. This equipment will vary based upon the work location and type of work being performed but often will include safety glasses and protective clothing and at timesfire retardant clothing, chemical and/or cut resistant gloves and hearing protection. Physical Demands While performing the duties of this job, the employee is regularly required to talk or hear, stand, sit, walk; use hands to finger, handle or feel; and reach with hands and arms. The employee might need to sit and type for extended amount of time and might occasionally need to climb the stairs, stoop, kneel, or crouch. Taking breaks, actively thinking about ergonomics and using ergonomics tools is necessary in this job.  Occasionally, employee may need to lift and move containers or pieces of equipment (up to 25 pounds).  Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus. Position Type/Expected Hours of Work This is a fulltime position. Days and hours of work are Monday through Friday, 9 a.m. to 5 p.m. Occasional evening and weekend work may be required as job duties demand. Travel Up to 10% of the time. Some local travel between San Francisco and Hayward on an as needed basis as part of the job."}