{"jobID": "2836632901", "jobLocation": "Arlington_TX", "jobTitle": "Data Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.modulant.com", "Headquarters": "North Charleston, SC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Data Engineer Our DFW based client is seeking a Data Engineer to join their outstanding team that has at least 2 years of expereince working with Big Data technologies, specifically Hbase and Spark.  HEALTHY FULL TIME SALARY + BENEFITS + BONUS with a strong stable company that is a recognizable household name.  We'd love to hear from you to tell you more about our industry leading benefits, as well as the team that will be dedicated to helping you achieve your career goals from start to finish! *US Citizens and all other parties authorized to work in the US are encouraged to apply. We are unable to sponsor or work on a Corp-to-Corp basis.*Job Description:Knowledge5+ years overall IT experience2+ years of hands-on experience with software engineering to include Java, Scala, and Python2+ years of hands-on experience with processing large data sets with Kafka, RabbitMQ, Flume, Hadoop, HBase, Cassandra and/or Spark or similar distributed system2+ years of hands-on experience with NoSQL data stores such as MongoDB, Cassandra, HBase, Redis, Riak or other technologies that embed NoSQL with search such as MarkLogic or Lily EnterpriseBachelors or higher degree in computer science or other quantitative discipline or equivalent work experienceSkillsAbility to quickly prototype and perform critical analysis and use creative approaches for solving complex problemsExcellent written and verbal communication skillsJOB DUTIESContribute to the evaluation, research, experimentation efforts with batch and streaming data engineering technologies in a lab to keep pace with industry innovationWork with data engineering related groups to inform on and showcase capabilities of emerging technologies and to enable the adoption of these new technologies and associated techniquesContribute to the definition and refinement of processes and procedures for the data engineering practiceWork closely with data scientists, data architects, ETL developers, other IT counterparts, and business partners to identify, capture, collect, and format data from the external sources, internal systems, and the data warehouse to extract features of interestCode, test, deploy, monitor, document, and troubleshoot data engineering processing and associated automation*US Citizens and all other parties authorized to work in the US are encouraged to apply. We are unable to sponsor or work on a Corp-to-Corp basis.* Modulant provides a competitive benefits package including health, dental, vision, 401k plan and paid time off.  Modulant is an equal opportunity employer. All qualified applicants, who are eligible for employment, will receive consideration for employment without regard to race, color, religion, national origin, gender, gender identity, sexual orientation, age, status as a protected veteran, or status as a qualified individual with disabilities. Modulant does not require, request, suggest, or cause an employee or prospective employee to take or submit to any lie detector test.  Work environment and physical demands/General office environment, including ability to: See and read computer screensConcentrate for long periodsRemain in a sedentary positionSit for long periodsCommunicate via computer and telephone, and/orLift and move computer equipmentNot a great fit? Other opportunities also available - Check out our jobs page at www.modulant.com/about/careers/current-openings. **APPLY TODAY AND LEARN MORE ABOUT OUR INDUSTRY LEADING BENEFITS! As a professional seeking a position, you will have a Modulant Team that includes a Talent Sourcing Specialist, Senior Recruiter, and Client Manager all dedicated to understanding your individual career goals. We have deep client relationships that translate to the best opportunities for leading IT and Engineering professionals. Your Modulant Team will take the time to understand your needs thoroughly and only present your profile with permission. We represent you and act as your exclusive agent throughout the process. Before you work with a recruiter who is looking to just fill jobs consider having an entire Team dedicated to your pursuit of career growth and advancement. Modulant builds winning teams and YOU deserve only the best representation! "}