{"jobID": "2802980023", "jobLocation": "Hopewell_NJ", "jobTitle": "External Data Specifications Manager (eDSM)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives. Department Title and Description: Data Management, which is part of Global Development Operations, is accountable for the verification, validation and quality control of data gathered (both external and clinical) during the conduct of Phase I-IV clinical trials for ECTR, GDO and MDO. The data collected forms the basis of subsequent safety and efficacy analysis and must adhere to regulatory requirements and guidance. Key Responsibilities and Major Duties:Management of study start up activities for clinical data from external sources.Drives (with the protocol team) the completion of the study start up activities related to data sourced both from the eCRF and external vendors.Collaborates with the various functions to develop standards and ensure consistency and efficiency of the clinical protocols within an indication or program for study startup standards and documentation.Drives and owns the timelines, associated deliverables and serves as the External Data Subject Matter Expert at the study level.Drives the development of the database in collaboration with study build team and Global Biometric Sciences.Reviews the protocol to identify data collection needs. Remains critical to the protocol development and review process to ensure the most efficient data collection strategy is implemented.Identifies any new external data types and develops them in conjunction with key stakeholders (e.g., Biomarker Leads, GBS, and Global Standards).Reviews the specifications used to build the electronic Case Report Form (eCRF), visit schedule and derivations.Functions as the primary contact with external vendor staff for protocol level electronic data transfers. This includes preparing data transfer specifications from standard templates and ensuring vendor provides data compatible with the clinical database management system to allow for data integration.Communicates and resolves external data issues with vendor staff and Clinical Team, as appropriate.Demonstrates a strong understanding of the overall project goals, the indication studied and the purpose of the assigned study in meeting the objectives of the project.Proactively identifies and resolves issues noted during study startup which impact the overall timelines and informs the appropriate team members and coordinates follow-up.Engages the Data Management Lead and/or Protocol Manager to assist in the resolution of more complex issues.Understands how the issues of a single study can impact the overall project.Manages matrix relationships to resolve operational issues at protocol level.Skilled in the use of technology.Is able to function independently, in addition to coaching other team members, within an environment that relies heavily on knowledge regarding the external data process for information and communication.Effectively uses available tools to gather information needed to manage study activities and develop deliverables.Supervisory Responsibility: NA Key Stakeholders/Contacts: Clinical teams, statisticians, scientists (Biomarkers, PK/PD,...), Central Clinical Laboratories and other 3rd party service providers. Qualifications:Two to four years of data management, programming or regulatory experience in a pharma research or central clinical lab organization.B.S, Medical Laboratory Scientist (MLS), Medical Technologist (MT) or other scientific discipline preferred.Comprehensive understanding of clinical drug development process, including PK, PD and Laboratory testing terminology. Strong analytical skills to facilitate detecting and resolving data problems.Experience in management of multiple simultaneous projects in a matrix environment."}