{"jobID": "2686982445", "jobLocation": "Austin_TX", "jobTitle": "Senior Scientist, Development", "companyRating": null, "companyInfo": {"Website": "www.asuragen.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Luminex, Natera"}, "estimatedSalary": null, "jobDescription": " Asuragen is seeking outstanding Ph.D.-level scientists to join our Product Development group that is charged with verifying and validating PCR-based assays for the detection and quantification of nucleic acid biomarkers. This high-impact position will help expand Asuragen’s molecular diagnostics portfolio that currently influences over 15 million patient management decisions each year.  The Product Development Senior Scientist position combines strong technical know-how about amplification technologies with design control processes and regulatory compliance to guide the development of diagnostic systems that integrate reagents, instruments and software. Working as part of a cross-functional team, this role is expected to receive prototype assays from Asuragen’s Research group and then achieve verified and/or analytically validated products through carefully designed and documented internal and external studies. Key responsibilities include developing assay design inputs/outputs, determining assay failure modes, setting data-driven performance tolerances, and designing, executing and interpreting studies that address assay accuracy, precision, analytical sensitivity and specificity, and other relevant verification or validation activities while documenting results consistent with FDA and international regulatory requirements. Successful candidates will join a fast-growing company of nearly 160 employees focused on enhancing patient care through the development of cutting-edge diagnostic assays in disease areas spanning genetic disorders and cancer. Qualifications:A Ph.D. degree in biology, chemistry, biomedical engineering, or related fieldExpertise in developing and optimizing PCR-based assaysWorking knowledge and, ideally, demonstrated application of CLSI, ISO and FDA guidelines for product developmentAbility to analyze complex data with relevant statistical methods and clearly communicate to technical and non-technical audiencesAbility to drive successful project outcomes through intra- and inter-team collaborationsAbility to assimilate information from multiple sources and present clear and specific recommendations to management and project teamsAbility to establish and maintain external relationships with key opinion leaders and/or subject matter expertsExcellent written and verbal communication skillsA passion for improving patient care through diagnostic technologies, particularly in genetics and oncologyPreferable Experience and Skills:At least 2-4 years post-Ph.D. laboratory experienceExpertise in developing high plexity DNA or RNA PCR assays for use with samples such as blood or FFPE tissue, especially those that can detect SNP/SNV, indel, and/or CNV markersEffective management of one or more junior scientistsPrior experience with developing products within a formalized project management structureExperience in developing regulated molecular diagnostic tests, especially FDA-approved tests, is a plus About Asuragen  Asuragen is a molecular diagnostics company that is using genomics to drive better patient management through best-in-class clinical testing solutions. The Company enlists a breadth of technologies and talent to discover, develop and commercialize diagnostic products and services with efficiency and flexibility for internal projects and partners in biotechnology and pharmaceutics. Asuragen is located in Austin, Texas, which is consistently ranked in the top 10 of “best of” lists of US cities and offers a superior lifestyle along with top-notch technology, educational, and business benefits. The Company provides a competitive salary, medical, dental, disability and life insurance, a 401(k) plan with company matching, an employee bonus plan, and a tuition reimbursement plan."}