{"jobID": "2635449176", "jobLocation": "Branchburg_NJ", "jobTitle": "Data Engineer- III", "companyRating": "3.6", "companyInfo": {"Website": "www.primussoft.com", "Headquarters": "Duluth, GA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "136000", "jobDescription": "Title: Data Engineer- IIILocation: Branchburg-NJ-USADuration: 5+ Months (Possibility of Extension)Description: The individual will be responsible for engineering of the Mobile Private Networks (MPN) routing and switching environment in support of the wholesale gateways to ensure both capacity needs and strategic features and functionality are met. This position includes responsibilities such as researching, identifying and engineering the site-specific configurations of the associated wholesale routing, switching and gateway environment at multiple locations. The individual must be detail oriented, think critically to solve issues in real-time and focused on the goals of adding capacity while maximizing customer uptime and minimizing impact.  MPN Transport Engineer  Overview  The individual will be responsible for engineering of the Mobile Private Networks (MPN)  routing and switching environment in support of the wholesale gateways to ensure both  capacity needs and strategic features and functionality are met. This position includes  responsibilities such as researching, identifying and engineering the site-specific configurations  of the associated wholesale routing, switching and gateway environment at multiple locations.  The individual must be detail oriented, think critically to solve issues in real-time and focused  on the goals of adding capacity while maximizing customer uptime and minimizing impact. Responsibilities · Engineer the routing and switching environment in a Mobile Switching Center (MSC) to  support the rollout of new virtual wholesale gateways.  · Produce timely and accurate configurations for MPN routers and switches which are in  line with established designs.  · Submit associated security, NMS, billing, etc. tickets and requests to other engineering  teams and follow up through ticket execution.  · Technically lead the project rollout by coordinating with internal and external teams to  set dates and drive changes into the network.  · Solid experience and proficiency in technical project leadership skills, the ability to build  productive relationships and the capability to lead cross functional team technical  discussions to a productive conclusion.  · Acts independently and as member of a highly technical team to advance the rollout of  the wholesale gateway capacity.  · Work with the performance and planning team to keep existing wholesale gateways  below engineering KPIs.  · Think critically and make technical and business decisions which drive progress forward  while putting customer uptime first.  · Develops resolutions to complex problems that require the frequent use of creativity.  · Focus on high availability, resiliency, security, efficiency, and operational supportability  while meeting or exceeding the project schedule.  · Exercises judgment in selecting methods and techniques for obtaining results.  · Is accountable for the project results, summarizing the project status and  documentation. Familiar with the Agile process, Kanban boards and Jira. Qualifications: · 5+ years of experience with operating and engineering a Cisco routing and switching  environment.  o Cisco ASR1000/9000 routers, Cisco ASR5000/5500 gateways and Cisco Nexus 7000/9000. · Detailed knowledge and direct operational experience with TCP/IP (v4 & v6), BGP, OSPF,  QOS, MPLS, AAA, and Diameter protocols.  · Experience in SDN, NFV, Openstack, Docker and Container deployments as well as the  FCAPS model to support service level orchestration.  · Experience with orchestration tools such as Itential Pronghorn, Cisco Network Services  Orchestrator (NSO) are a plus.  · Ability to learn new technologies quickly. Ability to perform independent analysis and  plan for implementation, paying special attention to details and objectives.  · Excellent communications, interpersonal, organizational, and problem solving skills.  · Meticulous attention to detail, with results-oriented focus.  · Wireless carrier experience or working knowledge of 3G & 4G telecommunications.  · Cisco certifications are a plus"}