{"jobID": "2830005322", "jobLocation": "Washington_DC", "jobTitle": "Software Development Manager, Professional Services", "companyRating": "4.2", "companyInfo": {"Website": "www.washingtonpost.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1877", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " New York Times, Google, Politico"}, "estimatedSalary": "133000", "jobDescription": " Arc Publishing is a product engineering group at the Washington Post. We build software to meet the needs of the Washington Post, while also making the same software available to other publishers around the world via software as a service.  The Arc suite of products provides publishers with the tools they need to author, maintain and publish content to meet the ever changing demand of news readers. Arc is quickly becoming the leader in publishing focused software development.  Built 100% on AWS, the Arc platform follows a microservice architecture. All of our software teams use devops to deliver and maintain products. Our processes are lightweight which allows our teams to innovate quickly to bring new ideas to market. New features and products are deployed to our customer base every day.  The Professional Services arm of Arc is looking for a software development manager to join our growing global engineering team. In this role, you will manage a team of professional services engineers who are building solutions and facilitating clients in migrating to Arc. ResponsibilitiesManage full stack teams of software engineers that design, implement, instrument, test, deploy and support their own code.Be responsible for the overall planning, execution, and success of complex technical projects in an Agile process.Coach team members on a daily basis, set goals and conduct performance reviews.Own the full lifecycle of your team's QA and Operations.Have a deep understanding of how our products and client solutions are built and sometimes contribute technically to client soutions.Have an understanding of client needs and design solutions for how to achieve them.Assist teams to maintain a balanced support workload.Work with Technical Delivery Managers to maintain a roadmap and project plan that meets the demands of our clients.Turn the roadmap into staffing needs and a hiring strategy.Implement a technical strategy that ensures future success of your products and teams.Contribute to design and architecture of systems that span multiple teams and/or products.QualificationsBA/BS in Computer Science or related technical field or equivalent practical experience.Several years in an engineering management or senior engineering team lead roleSeveral years of client facing experience, either doing Professional Services or Sales EngineeringExperience architecting and implementing scalable SaaS web applications on AWS.Exceptional written and oral communication skills INDVAR"}