{"jobID": "2837577464", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.experis.com", "Headquarters": "Milwaukee, WI", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Robert Half, Adecco, Robert Walters"}, "estimatedSalary": null, "jobDescription": " Experis has partnered with one of the highly reputed Industry leaders in the IT domain and we are helping our client in identifying a Data Analyst. It's a 4 Months contract (with possible extension), this is based out of Chicago, IL  If you are someone who wants to make an amazing career and work on cutting-edge technologies, you are passionate about application development -- Here is the opportunity for you!! Great Company to work with!! Job Overview:Data AnalystChicago, IL4 MonthsDescription: Overview of daily responsibilities: The data analyst will be responsible for working with the Enterprise Data Management and business teams to facilitate scoping new data-focused projects including creating data catalog, data management requirements documentation, current and future state data architecture diagrams, as well as providing thought leadership in data architecture discussions, capturing meeting notes and translating discussions into firm technical requirements. Specific project details: The analyst will manage projects related to HR data and Customer Service Delivery - irregular operations reporting, catering, and in-flight, airport operations and additional data projects as it relates to customer travel experience. Years of experience: 3-5 years' work experience in data management and data architecture, and advanced SQL expertise. Experience with Big Data technologies (Hadoop) and/or analytics & statistical tools is a plus. Education requirements: Bachelor's degree at a minimum  Experis is an Equal Opportunity Employer (EOE/AA)"}