{"jobID": "2788953293", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.viasat.com", "Headquarters": "Carlsbad, CA", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Public (VSAT) ", "Industry": " Telecommunications", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Harris, Gogo, Inmarsat"}, "estimatedSalary": "99000", "jobDescription": "Job ResponsibilitiesViaSat is in the business to connect the world. We are a global provider of satellite broadband and wireless services, infrastructure, and technology. We securely connect consumers, businesses, governments, and military to the internet — anywhere in the world. Our more than 3,700 global team members are dedicated to do what others in the industry view as impossible. We imagined and launched the world’s highest-capacity communications satellite and continue to set the standard in developing technologies that address the toughest challenges.As a Data Scientist you will leverage your analytical, math, engineering, and statistical skills to uncover insight into user experience and network behavior. You will work with large data sets from multiple sources including the network flows, deep packet inspection classification, security analysis, customer care, and sales. You will design data pipelines and ETL processing to collect the data necessary data for deep analysis. You will analyze and visualize business insights into reports and graphs for fellow team members, management, and executives. You will compare the expected performance to the measured and suggest sources of the discrepancy for further analysis.Requisition16646BRRequirementsExcellent understanding of several statistical and machine learning modelsExtensive experience with data analysis tools such as R, Python, MatlabFamiliarity with Big Data technologies such as Spark, Impala, HadoopBS/BA in a data related field or equivalent experiencePreferencesStrong communication and presentation skills – you must be able to explain and present hypotheses and analysis results to a wide audience in a clear and concise manner.Knowledge and experience with predictive modeling including: Multivariate Regression, Logistic Regression, Combinatorial Optimization, Stochastic Processes, Complex Analysis, Principal Component Analysis and Time Series Analysis.Experience with Matlab, R , or WekaMS/PhD in a data related field such as mathematics, computer science, physics, or similar**ViaSat is an EEO/AA/Disability/Protected Veteran Employer. U.S. Citizenship or Lawful Permanent Residence status may be required for certain positions. For positions requiring U.S. Citizenship or Lawful Permanent Resident status, verification of such status will be required upon accepting employment."}