{"jobID": "2828210158", "jobLocation": "Mountain_View_CA", "jobTitle": "Product Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.waymo.com", "Headquarters": "Mountain View, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Waymo is the self-driving technology company with a mission to make it safe and easy for people and things to move around. Building on software and sensor technology developed at Google, Waymo is now launching the world’s first fully self-driving transportation service that will take members of the public from A to B at the touch of a button.  Waymo takes an integrated approach to building the world’s first self-driving car, with researchers, product managers, and technical program managers working side by side. We seek to understand the needs of our users and the opportunities of the technology to ensure we build the best product. From self driving behavior to user interfaces, we work to inspire the product vision and then make it a reality.In this data science role you'll: Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advanced analytical methods as needed. Conduct end-to-end analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentationsProvide insights at scale. Use data available from millions of miles of driving to understand user preferences and behaviorsBuild data tools and visualizations to enable better decisions using available dataInteract cross-functionally with a wide variety of people and teamsDirecting and providing technical support to data scientists and engineers working on content automationWe'd like you to have:MSc in computer science, natural language processing, or machine learning and 8+ years of professional experience in the field OR PhD preferred with 5+ years of experienceExtensive experience working with various datasets, familiarity with common schemas, and an understanding of both the power and shortcomings of data. Experience and comfort working with sparse data sets to make product decisionsExperience with statistical programming (e. g., R, Python) and database languages (e. g., SQL)Strong background in statistics and applied Machine Learning. Experience with large data datasets preferredExperience articulating business questions and using mathematical techniques to arrive at an answer using available data. Experience translating analysis results into actionable recommendationsExperience working in a fast-paced startup type business"}