{"jobID": "2690638501", "jobLocation": "Pasadena_CA", "jobTitle": "Science Data Archive and Analytics Manager", "companyRating": null, "companyInfo": {"Website": "www.swaintechs.com", "Headquarters": "Horsham, PA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Science Data Archive and Analytics ManagerLocation: Pasadena, CA; NASA Jet Propulsion LaboratoryBenefits Offered: Vision, Medical, Dental, 401K  Employment Offered: Full-TimeJob Description:The Science Data Archive and Analytics Manager will manage the Physical Oceanography Distributed Active Archive Center (PO.DAAC) and report organizationally to the Group Supervisor of the Project Leadership and Management Group within the Science Data Systems and Instrument Software Section and programmatically to the Manager of the Integrated Earth Mission System Office. As stewards of NASAs oceanographic data, PO.DAAC is responsible for long-term archive and dissemination of instrument and science data and related information that are utilized by a broad set of end user science communities. The PO.DAAC is an operational project that is under continual evolution due to changes in technology and big-data challenges - upcoming priorities for the project include: i) ensuring the SWOT mission archive and user services are successfully implemented; ii) migration of PO.DAAC into a cloud-based architecture; and iii) maintaining a focus on value-added science services.Responsibilities:Being accountable for the project coordination and planning, implementation, budget, staffing, metrics and schedulesDeveloping and negotiating the Annual Work and Budget Plan, and developing long-range plans for evolving technology/operational capabilities. Work closely with: the sponsor and key personnel at the Earth Science Data and Information System (ESDIS) Project located at the Goddard Space Flight Center (GSFC), NASA HQ sponsors, and the NASA oceanographic and hydrological communities to establish requirements, goals, and deliverablesFostering and maintaining close connections with the wider Oceanographic and Hydrological User Community both within and outside of NASA in order to build the appropriate levels of service and tools for data discovery, access, and analysisProviding leadership and direction to the PO.DAAC team, to the external interfaces between the PO.DAAC and NASA Flight Projects, and between the PO.DAAC and foreign partnersDeveloping new business through discussions with Flight Projects, ESDIS, and NASA HQMaintaining management oversight of the PO.DAAC to ensure timely reporting of status of resources and schedule to Laboratory and NASA managementPerforming special reviews and make special reports as requiredRepresenting the Laboratory to NASA, other government agencies, industry and institutions on matters pertaining to the projectEducation/Experience:Ph.D. degree in Physical Science, Earth Science or related technical discipline, with 8+ years work experience or, Master degree in similar discipline with 10+ years work experience, or BA/BS degree in similar discipline with 12+ years work experienceProven ability to lead and manage a multi-disciplined team in the design, implementation and operations of a science data systemSignificant system-level technical expertise related to Earth science data processing, data analysis, data management and data disseminationExtensive experience working with earth observation satellite missions and collaboration with science and engineering teams within JPL and across the worldDemonstrated ability to form strong working relationships with management, science, instrument, and mission system teams at JPL, as well as at external agencies and institutionsProven ability to establish the vision and goals of the project and ensure these align and meet with the expectations of the NASA sponsor, science user communities and JPLExcellent communication, interpersonal and teaming skillsPrior experience establishing project tasks and driving them to completion, creating budgets and schedules, tracking costs, managing resources, and working with financial systems and toolsKnowledge of new developments in data management, archiving, and access technologiesFamiliarity with ocean observing and hydrology techniques, methods and research issuesFamiliarity with JPL institutional processes and practicesAbout Swain Techs: Make a difference with Swain Techs. As you consider a career at Swain Techs, you will find countless opportunities to contribute to solutions that are changing the world in real and measurable ways in our technical, engineering, and enterprise IT core business areas.Why Swain Techs?Swain Techs is an award winning 8(a) certified small business with over a decade of exceptional performance.Headquartered in Horsham, PA with offices in Washington, DC., Virginia, Delaware, New York and Florida Swain Techs has been awarded several prime contracts with U.S. Navy-NAVAIR PMA 250, the Department of Health and Human Services (HHS), the Defense Logistics Agency (DLA), the Department of Commerce-US Patent and Trade Office (USPTO) and the U.S. Customs and Border Patrol (CBP) We are among the fastest 5000 growing companies in the US for 2014 and 2015 according to Inc. Magazine. We are CMMi ML3 appraised for Development & Services plus Service System Development and ISO 9001:2008 certified.We know that our continued success begins with you. Swain Techs is always looking for bright, energetic, entrepreneurial people to join our team. If you are looking for an exciting environment, where your opinion is highly valued and you are fanatical about customer service, we would love to talk with you.Come and discover what makes Swain Techs a great place to work.  Visit our website http://swaintechs.com/careers"}