{"jobID": "2816341282", "jobLocation": "Newark_NJ", "jobTitle": "Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.primussoft.com", "Headquarters": "Duluth, GA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": " Role: Data Engineer  Duration: 6+ months contract  Location: Newark, NJ 07102  Hours per week : 40  Job Description:  Audible is seeking a highly talented Data Engineer (DE) within the Data Engineering group. We need your help to build systems to enable data-driven decision making at Audible.  Our Data Engineering team owns and develops the technology platform that offers decision makers both performance metrics and analysis as well as the self-service capability to perform independent analysis on a wide array of internal and external datasets in order to identify opportunities, trends and issues, uncover new insights, and fine-tune operations to meet business goals.  Responsibilities:  Build and maintain the infrastructure to answer questions with data, using software engineering best practices, data management fundamentals, data storage principles, recent advances in distributed systems, and operational excellence best practices.  Work closely with stakeholders to understand their requirements and design the right solution  Work closely with other teams, analyze source systems, define underlying data sources and transformation requirements, design suitable data models and document the design/specifications.  Build/maintain systems and datasets that analysts and scientists use to generate actionable insights.  Demonstrate passion for quality and productivity by use of efficient development techniques, standards and guidelines  Peer reviews of work. Actively mentor more junior members of the team, improving their skills, their knowledge of our systems and their ability to get things done  Basic qualifications  Strong Computer science background required. A Bachelors degree or higher in computer science or equivalent is required  10+ years of experience in a Data Warehouse (DWH) environment with data integration/ETL of large and complex data sets  Design and coding skills in a scripting language (e.g. Python/Perl/shell scripting) on Unix/Linux Platforms.  Proficiency in SQL and database technologies such as AWS Redshift  Data modeling skills such as Star/Snowflake schema design for DWH  Expertise in performance tuning and scaling in a DWH environment  Hands on experience with recent advances in distributed computing such as MapReduce, MPP architectures, NoSQL databases.  Familiarity with Business Intelligence (BI) platforms such as MicroStrategy, OBIEE or equivalent  Good interpersonal and communication skills. Ability to work with different teams for sourcing of data.  Ability to learn fast, work independently with little supervision and deliver on time quality products  Preferred qualifications  Extensive knowledge of BI platforms such as MicroStrategy, OBIEE or equivalent  Experience working with Agile methodologies in a DWH/BI environment  Thanks & Regards  Parul Chhabra  Primus Software Corporation  Direct: 678 -666- 4393 | Fax: 770-234-4163  Email: parul.chhabra@primussoft.com  www.primussoft.com | 3061 Peachtree Industrial Blvd, Suite 110 Duluth, GA - 30097  Let's connect, LinkedIn: https://in.linkedin.com/pub/parul-chhabra/b1/42b/527"}