{"jobID": "2805388839", "jobLocation": "Chicago_IL", "jobTitle": "Policy Analyst (Data Scientist)", "companyRating": "4.0", "companyInfo": {"Website": "www.uchicago.edu", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1890", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " Employer The University of Chicago  Location Chicago, IL  Posted Jun 05, 2018  Institution Type Four-Year Institution  You need to sign in or create an account to save  New York  Department  13760 Urban Crime Labs  About the Unit  Crime Lab New York (CLNY) is an independent, non-profit research center of the University of Chicago. We gather experts from around the nation, spanning disciplines, to develop data-driven approaches and generate rigorous, objective, scientific evidence about what works in reducing crime and addressing critical problems facing society. We partner with city agencies, civic organizations and others to use data to identify, develop and evaluate interventions that can be measured and replicated. Our work employs innovations in natural experimentation, randomized controlled trials, behavioral economics, and machine learning. We use these tools to help policymakers identify and target interventions, make the best use of public resources, and benefit New York's most disadvantaged citizens. The University of Chicago's Crime Lab New York has a strong commitment to using science in the service of cities to improve the quality of urban life. We regularly seek out passionate, data-oriented, public service-minded individuals to join our team. Crime Lab employees are committed to creating a collaborative, high energy office that is open and welcoming to individuals of all backgrounds and life experiences. We prioritize developing a workforce that is as diverse as the city in which we work. For more information about the Crime Lab New York, go to ***********************.  Job Information Job Summary: Crime Lab New York is seeking a data scientist to work on our portfolio of projects applying statistical inference, econometrics, and machine learning to pressing challenges in public policy and criminal justice. We're seeking a smart, motivated, and detail-oriented person who is qualified to work on all aspects of a project - ranging from raw data cleaning and basic descriptive analysis to developing predictive models and evaluating the effects of public policies. This position offers the opportunity to work directly with leading researchers and policy-makers on projects with immediate real-world impact. In addition, the data scientist will collaborate closely with PhD-level economists and computer scientists, as well as Crime Lab leadership. Responsibilities: Contributes to the design and implementation of an efficient and reproducible data processing pipeline  Builds and rigorously evaluates statistical models using best practices of machine learning and statistical inference  Works with partners and members of the research team to propose and implement analytical approaches to solving specific research questions  Cleans, transforms, merges, and matches between large and complex research and administrative datasets  Performs sampling, power analysis, and randomization  Prepares project memos, summaries, presentations, reports, and other work products for dissemination targeting both policymakers, academic researchers, and other stakeholders, as needed Competencies: Advanced knowledge of machine learning, statistics, or econometrics. The ideal candidate will have expertise in either machine learning or econometrics, and will have exposure toand excitement to learn aboutthe other  Strong interpersonal skills  Strong initiative and a resourceful approach to problem solving and learning  Ability to work independently and as part of a team in a fast-paced environment  Sound critical thinking skills  Strong attention to detail with superb analytical and organization skills  Excellent written and verbal communication skills, with the ability to present data in a simple and straightforward way for non-technical audiences  Additional Requirements Education, Experience or Certifications:Education: Bachelor's or Master's degree required in computer science, statistics, data science, economics or a closely related field Experience: Two years experience required (experience in school counts towards requirement) Technical Knowledge or Skills: Proficiency with statistical data analysis using Python or R is required; ability to work in both is preferred Required Documents: Resume  Cover letter  Unofficial transcripts  A sample of data work, such as a final report for a class project, link to a GitHub repo, or blog post  NOTE: When applying, all required documents MUST be uploaded under the Resume/CV section of the application.  Benefit Eligibility  Yes  Pay Frequency  Monthly  Pay Range  Depends on Qualification  Scheduled Weekly Hours 5 Union  Non-Union  Job is Exempt?  Yes  Drug Test Required?  No  Does this position require incumbent to operate a vehicle on the job?  No  Health Screen Required?  No  Posting Date 2018-06-04-07:00 Remove from Posting On or Before 2018-12-04-08:00Posting Statement: The University of Chicago is an Affirmative Action/Equal Opportunity/Disabled/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University's Notice of Nondiscrimination.  Staff Job seekers in need of a reasonable accommodation to complete the application process should call ************ or submit a request via Applicant Inquiry Form.  The University of Chicago's Annual Security & Fire Safety Report (Report) provides information about University offices and programs that provide safety support, crime and fire statistics, emergency response and communications plans, and other policies and information. The Report can be accessed online at: *********************************** Paper copies of the Report are available, upon request, from the University of Chicago Police Department, 850 E. 61st Street, Chicago, IL 60637.  Full time JR01653 About Us  The University of Chicago is an urban research university that has driven new ways of thinking since 1890. Our commitment to free and open inquiry draws inspired scholars to our global campuses, where ideas are born that challenge and change the world.  We empower individuals to challenge conventional thinking in pursuit of original ideas. Students in the College develop critical, analytic, and writing skills in our rigorous, interdisciplinary core curriculum. Through graduate programs, students test their ideas with UChicago scholars, and become the next generation of leaders in academia, industry, nonprofits, and government.  To learn more about the university click here ************************ PI*********"}