{"jobID": "2792127976", "jobLocation": "Washington_DC", "jobTitle": "Technical Support Representative", "companyRating": "3.0", "companyInfo": {"Website": "www.metalogix.com", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "22", "jobDescription": " Metalogix is the leading provider of software solutions to move, manage, and protect content within enterprise collaboration platforms in the cloud and on-premise. We are a Microsoft Gold Partner specializing in content migrations, content management, protection, and governance solutions. Our team members are experts in Microsoft Exchange, Office 365, and SharePoint. We hire only the best and brightest Microsoft application experts come join a team that has been awarded the NorthFace Scoreboard Award for Outstanding Service 4 years in a row.  We are searching for a motivated Technical Support Representative with a passion for transforming our customers experience from good to great.  Primary Responsibilities: Provide technical consultation to mid-size and enterprise clients promptly and professionally.Responsible for adhering to all standard operating procedures (SOP) and adhering to support Service Level Agreements (SLA).Ensure all Salesforce cases are logged and updated, addressed/resolved and followed up on as-needed.Refined technical skills in one or more Metalogix products.Collaborate with clients to solve technical issues/challenges.Demonstrate ownership and the ability to follow-through on commitments made to your clients.Contribute to the repository of knowledge articles based on subject matter expertise.Facilitate trouble-shooting with client via web-based conferencing tools.Self-motivated to learn and expand product and technical troubleshooting skills.This is a shift-based position with rotating on-call responsibility scheduled approximately every five-six weeks. Qualifications: Bachelor degree preferred (will consider experience in lieu of degree)1 year working with SharePoint is preferredSuperior customer service, organization and critical thinking skills.Exceptional oral and written communication skills with a focus on listening and questioning.Ability to manage multiple tasks in a fast-paced environment with competing priorities.Knowledge of Microsoft suite of products and subject matter expertise in MS SharePoint, MS Exchange, or MS Office 365.Ability to sense urgency and provide a quality action-based response.Salesforce experience a plus!Strong work ethic. Metalogix is an Equal Employment Opportunity employer valuing diversity and what it brings to the workplace. All qualified applicants regardless of race, color, religion, gender, sexual orientation, marital status, gender identity or expression, national origin, genetics, age, disability status, protected veteran status, or any other characteristic protected by applicable law are encouraged to apply."}