{"jobID": "2823787860", "jobLocation": "Troy_MI", "jobTitle": "Data Scientists Modeling", "companyRating": "4.1", "companyInfo": {"Website": "www.altair.com", "Headquarters": "Troy, MI", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (ALTR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": " Altair ProductDesign is a global, multi-disciplinary product development consultancy of more than 700 designers, engineers, scientists, and creative thinkers. As a wholly owned subsidiary of Altair Engineering, Inc. (www.altair.com), this cross-functional organization is best known for its leadership in combining human and machine creativity to fuel innovation, automate processes, and develop new methods. Altair ProductDesign firmly advocates a user-centered, team-based design approach, and utilizes proprietary simulation and optimization technologies to help clients bring innovative, profitable products to market faster. Required:Skilled in applying advanced econometric modeling techniques including;Discrete choice analysis methods,Market segmentation/cluster analysis,Conjoint analysis modeling,Predictive modeling, and, Systems estimation methods / optimizationBayesian models,Stochastic models,Social network models2+ years of experience in at least two of the following languages: R, Python, MATLABSkills Preferred:Good oral and written communication and presentation skillsAbility to work in a team-oriented environment that places a high priority on delivering collaborative work products for our business partnersExperience Required:3+ years of quantitative modeling experience. in advanced market research techniques at both theoretical and practical levels; identify, collect, and synthesize research on consumer willingness-to-pay, market structure, market participants, and competitive outcomes o construct and validate econometric analytic models, including logit, nested/multinomial logit models, blending consumer optimization with behavioral influences, for use in prediction and scenario analysis, and, develop market solutions for automotive business applications.Experience Preferred:2+ years of post-graduate work experience (in a business or post-doc setting) involving complex econometric modeling and analysisDemonstrated skills in manipulation and data mining / pattern recognition of large structured and unstructured data setsPrevious experiences (>= 1 year) working in a regulatory setting is a plus.Education Required:Ph.D. in a quantitative field such as , Applied Economics/Econometrics, Applied Mathematics, Quantitative Social Science, Quantitative Finance"}