{"jobID": "2684839472", "jobLocation": "Redwood_City_CA", "jobTitle": "Senior Scientist, Reagent Manufacturing and Quality Control (IVD - Tech. Transfer)", "companyRating": "3.1", "companyInfo": {"Website": "www.genomichealth.com", "Headquarters": "Redwood City, CA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (GHDX) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "168000", "jobDescription": "As a Senior Scientist within the Reagent Manufacturing and Quality team, you will be an integral part of Genomic Health’s Operations group, with responsibility for the development, validation, and transfer of new manufacturing processes and quality control test methods, both for new products and our existing genomic tests. In this role, you will lead and participate in cross functional teams contributing to the development of IVD and LDT products under design control, in accordance with ISO 13485 and Good Manufacturing and Laboratory Practices (GMP/GLP). You will participate in requirements definition, risk analysis, reagent and QC method development, manufacturing development and scale-up, optimization, troubleshooting, and verification and validation activities related to manufacturing and quality control testing.  The high complexity nature of the work demands in-depth understanding of reagent and consumable development, manufacturing, and analytical and functional test methods for quality control, and strong working knowledge of ISO 13485 and other applicable regulatory requirements for medical devices such as PMA and 510(k). This position requires excellent leadership, collaboration, written and verbal communication skills, attention to detail, ability to multi-task, and flexibility to adapt to changes in priority and schedules are essential. RESPONSIBILITIESLead and participate in efforts to support the development of IVD products under design control in conformance with ISO 13485(2016) or FDA PMA or 501(k) requirements. Partner with Genomic Sciences, Biostatistics, and other functions in the development and use of appropriate test methods for characterizing the composition, functional performance, and stability of reagents and consumables required for the  development and launch of new products. Collaborate closely with colleagues in Quality, Supply Chain Management, Biostatistics, Process Engineering, R&D;, and other functions to facilitate effective, efficient process transfer and ensure supplier and OEM vendor quality. Partner with Supply Chain, Legal, and Quality personnel to effectively establish and manage Contract Manufacturing Organization (CMO) relationships for reagent manufacturing. Create required documents such as reagent manufacturing and quality control testing procedures, incoming material specifications, and performance verifications, and protocols and reports for studies required to transfer reagent products  into production (e.g. stability, specification-setting, manufacturing process optimization, and related studies). Assist in or lead investigation and resolution of reagent / consumable-related issues, including assessment of impact, root cause identification, and appropriate corrective and preventive action. Ensure consistent compliance with applicable regulations and quality-related best practices in development, validation, use, and documentation of assay development, analytical and functional quality control test methods for reagent lot  qualification, stability studies, and related activities. Train and mentor team members in IVD product development and manufacturing transferAdditional responsibilities as assigned.QUALIFICATIONS:Minimum Bachelor’s degree in molecular biology, biochemistry, chemistry, engineering or an associated relevant field with 10+ years relevant industrial experience. Advanced degree preferred. Strong background in biochemistry and molecular biology methods with experience in reagent development, manufacturing, and QC for nucleic acid isolation, purification and quantitation, qPCR, and next generation sequencing  assays. A track record of success in scale up and manufacturing transfer projects for new CE-IVD molecular diagnostic products under ISO 13485 and/or FDA Quality System Regulations (QSR) is required. Experience with IVD product development activities for PMA submission a plus.Highly motivated, detail oriented individual with consistent record in solving technical problems effectively and efficiently.Superb communication, collaboration, and leadership skills are required.Ability to maintain open, constructive communication and collaboration with colleagues, management, and suppliers.Ability to prioritize and adapt to changing priorities while maintaining a high standard on quality.Ability to work in a fast paced, multidisciplinary and dynamic environment and capable of handling multiple activities simultaneously. Physical Requirements Standing or sitting for long periods of time may be necessarySome lifting (greater than 25 pounds) may be necessary.Considerable amount of time using various types of laboratory equipment including microscopes, microtomes, blades, strainers, pipettes May perform repetitious actions using lab toolsSome time spent using near vision to view samples at close rangeUse of various chemicals may be used to perform dutiesAt times, stress may be experiencedUse of computer and some time may be spent concentrating, reading, or analyzing data, or applying scientific rulesMay be exposed to hazardous materials, tissue specimens and instruments with moving parts, lasers, heating and freezing elements, and high speed centrifugation . Company Profile:Genomic Health is a global provider of genomic-based diagnostic tests that address the overtreatment of cancer, one of the greatest issues in healthcare today. Our goal is to improve the lives of people with cancer by providing personalized, biological information that helps them get the right treatment at the right time, and to avoid unnecessary treatments and their side effects. In this way, our work is truly life, changing.Our Oncotype IQ Genomic Intelligence Platform is a portfolio of diagnostic tests that help physicians and patients answer specific and critical treatment questions throughout the cancer journeyWe currently offer Oncotype tests addressing breast, colon, prostate and lung cancers and hundreds of thousands of patients from over 90 countries have benefited from our tests.The Oncotype DX breast cancer test is considered standard of care in the US and is included in all major international clinical guidelines for breast cancer treatment.We are expanding our portfolio of tests to include additional liquid- and tissue-based tests through clinical research and internal product development as well as strategic partnerships.Join the Genomic Health Team, and have the unique opportunity to make a difference in the lives of patients with cancer, while developing your career potential. We embrace our unique culture characterized by our Core Values of Community, Truth Seeking, Being Ahead of the Curve and Winning to be the best in the world at what we do. We maintain competitive total rewards programs designed to satisfy our employees’ work life and personal life needs. All qualified applicants will receive consideration for employment without regard to race, sex, gender identity, color, religion, national origin, protected veteran status, or on the basis of disability."}