{"jobID": "2829519240", "jobLocation": "Wixom_MI", "jobTitle": "Outside Sales Representative (Wixom, MI)", "companyRating": null, "companyInfo": {"Website": "www.rshughes.com", "Headquarters": "Sunnyvale, CA", "Size": "201 to 500 employees", "Founded": " 1954", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " W.W. Grainger, DXP Enterprises, HD Supply"}, "estimatedSalary": null, "jobDescription": " R.S. Hughes Company, Inc. is seeking a highly motivated Outside Sales Representative to join our team. R.S. Hughes Company, Inc. expects our Outside Sales people to be the leaders in their territory. In this role, you will be responsible for maximizing and growing revenue and profits within your assigned geographical territory by selling to existing customers and acquiring new business. This is a great opportunity to work collaboratively with internal and external partners to improve business and create solutions that serve both R.S. Hughes Company, Inc. and our customers. Responsibilities:Actively managing and growing a dedicated sales territory.Partnering with Inside Sales team to meet or exceed division sales goals.B2B cold calling on a continuous basis.Building long-term, productive, and mutually beneficial relationships with new customers.Conducting contract negotiations.Requirements:Business to Business sales experience.5+ Years successful experience selling a product in an outside sales role.Industrial, industry and product knowledge preferred but not required.Strong organizational skills.College degree preferred, but not required.Excellent written and verbal communication skills.A valid driver's license.Compensation:  Our merit based salary/bonus program offers exceptional growth opportunities. We provide a comprehensive medical, dental, life insurance, wellness benefit, short term disability plan, paid vacation and a 401(k) retirements savings plan.  To submit your resume for immediate consideration, please apply online. Once you complete the application, you will receive an email to complete at online assessment. Completion of this assessment is required to be considered for this role. We are looking for an Outside Sales Person for a territory in our Detroit division located in Wixom, MI. Who We Are: Founded in 1954, R.S. Hughes Co., Inc. is a dynamic, North American distributor of industrial supplies. With 50 warehouse sites in the United States and Mexico , we maintain an extensive inventory of adhesives, abrasives, electrical, static control, tapes, labeling and safety products. We are proud to represent products from leading manufacturing companies including 3M, Henkel Loctite, General Electric, Brady, Kimberly Clark, Ansell Edmont, and many others. We specialize in sales and service solutions to manufacturing companies in both OEM and MRO applications.  R.S. Hughes Co. is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, or national origin.  EOE/M/F/Vet/Disability"}