{"jobID": "2811306899", "jobLocation": "Rancho_Cordova_CA", "jobTitle": "Senior Data Analyst, VSP Vision Care", "companyRating": "3.4", "companyInfo": {"Website": "www.vspglobal.com", "Headquarters": "Rancho Cordova, CA", "Size": "1001 to 5000 employees", "Founded": " 1955", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "VSP Global is comprised of five complementary businesses that combine high-quality eye care insurance, high-fashion eyewear, customized lenses, ophthalmic technology and retail solutions, with employees in over 23 countries. No matter the role, we’re all focused on a singular mission: to help people see. Learn more by visiting https://vspglobal.com/cms/careers/ General Summary  Under minimal direction, performs research and analysis. Works independently to improve data quality, data collection and analysis processes; develops data modeling methodologies and report design to meet diverse and changing business needs. Participates and leads strategic and tactical projects with VSP and Family of Company business partners, external business partners and/or clients. Acts as a liaison and/or consultant with internal and external business partners on data integrity and/or software tools.  Essential Functions  Performs advanced data analysis including sampling, modeling, and evaluation of statistical metrics  Performs project conceptualization, design, methodology, data mining, analysis, risk adjustment, presentation of report results and development of business recommendations  Researches and evaluates trends, forecasts, interventions and impacts. Formulates recommendations for VSP and VSP Global programs, and provides information for decision and project support  Develops recommendations for key messages to external workgroups and strategic business partners and/or clients  Identifies doctor education and outreach opportunities and participates in efforts to educate business partners and other key stakeholders  Works closely with Executives and Management as well as corporate committees on policy development, project proposals, corporate strategies, and/or performance metrics enhancing decision making capabilities  Provides consultation on system design and analysis to achieve business objectives  Serves as a mentor to others, particularly in the areas of data analysis, eyecare industry research, resolution of complex business and technical problems, and technical skill development  Job Specifications  Typically has the following skills or abilities:  Bachelor’s degree in economics, statistics, information systems or other related fields, or equivalent experience  Five years experience using analytic tools to perform statistical analysis  Five years of programming experience using various systems  Five years of experience in study design, data mining, data modeling and statistical methodologies  Demonstrated ability to proactively develop, communicate and recommend solutions based upon analysis performed  Excellent written and verbal communication skills with the ability to network, negotiate and build relationships with internal and external business partners and to express complex analytical and technical information to a variety of audiences at all levels  Ability to act as a mentor and/or technical expert for the team and business partners  Proficiency in manipulation, interpretation and analysis of large databases and report production and automation  Experience in the Health Care industry with knowledge of medical claims coding is preferred  Proficiency with Microsoft Suite applications such as; Excel, Access, Visual Basic, etc  Must be an independent self-starter and possess excellent organizational skills  Ability to multi-task and work in a team environment  Proven ability to effectively communicate information to a wide variety of technical and non-technical individuals or groups at all levels of the organization  Regularly exercises discretion and independent judgment in the performance of his/her job duties  Preferred Skills  Demonstrated ability to find creative solutions to resolve analytical and data requests  Familiarity with Client Satisfaction Survey Process  Experience working with Siebel Data  Familiarity with Data Warehouse tables such as consumer, group, claims and provider  Ability to interpret requests from clients, brokers and internal customers  Experience using ReportCaster and WebFOCUS  Working Conditions / Physical Demands  The working environment is generally favorable. Lighting and temperature are adequate, and there are no hazardous or unpleasant conditions caused by noise, dust, etc The above information in this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.  VSP Global is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to gender, race, color, religion, sex, national origin, gender identity, sexual orientation, disability or protected veteran status. We maintain a drug-free workplace and perform pre-employment substance abuse testing."}