{"jobID": "2792295667", "jobLocation": "Reston_VA", "jobTitle": "Jr Level Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": "Description:The Leidos Health Products & Solutions Operation has an opening for a Jr. Level Data Analyst with experience in the commercial healthcare or related industry to support the design, integration, testing and delivery of the Leidos healthcare enterprise platform.  Responsible for collecting, interpreting, and analyzing statistical information. Duties include using statistical software (SAS, SPSS, etc.) to create and maintain tabulations, graphical summaries and formal statistical estimates and tests.  Develops solutions to complex technical issues and problems that impact multiple area or disciplines.  Regularly employs ingenuity and creativity to develop new technical solutions and systems in order to achieve functional objectives.  Effectively communicates with internal team members across multiple areas and client team members.  May communicate with parties external to the organization (e.g., sub-contractors, vendors, etc.).  Works to influence project/team leaders regarding solution design, process and/or approaches.  Work requires expert knowledge of and ability to apply advanced technical principles, theories, and concepts in doing data analytics.Qualifications:REQUIRED Bachelor's Degree and a min of 2 yrs relevant experienceExperience in developing data requirements and architectures for data integration, storage, reporting, analytics, and sharing.Experience in developing data standards, metadata and reference data architecturesExperience with analytic data preparation methods, including data profiling, data quality, data transformationExperience with relational and non-relational database management and data warehousing systemsExperience with big data processing mechanisms and tools, including for data ingest, storage (e.g. Hadoop, spark), data governance of structured, unstructured, semi-structured dataAbility to work in the context of a team based environment and typical software development lifecycle processes.Experience preparing deliverable documents related to data architecture (e.g. data dictionary)Experience in Java, spring frameworkPREFERREDExperience with Cloud computing (e.g. Azure, Microsoft Azure) based data managementUnderstanding of data concepts related to subject areas such as manufacturing, sales & marketing, financeExperience developing Master Data Management solutions  *Summer referral eligibleLeidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}