{"jobID": "2826564085", "jobLocation": "Plano_TX", "jobTitle": "Data Analyst II", "companyRating": "3.5", "companyInfo": {"Website": "www.insight.com", "Headquarters": "Tempe, AZ", "Size": "5001 to 10000 employees", "Founded": " 1988", "Type": " Company - Public (NSIT) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CDW, PCM, SHI International"}, "estimatedSalary": "58000", "jobDescription": " BASIC FUNCTION OF JOB  The Data Integrity Specialist is responsible for data entry and maintenance for our integrated enterprise system (SAP). As part of the Data Integrity team, this position is responsible for the accurate entry of data into SAP. The Data Integrity team is responsible for the efficient and effective management of part master data. This will require an individual with exceptional attention to detail, intermediate to advanced computer skills, in-depth knowledge of our business, products and processes.  WORK PERFORMED  To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required.  Essential Functions of the Job:  Product Data – Responsible for managing product information levels to established standards Maintain data to meet company standards Data includes images, technical specifications and other data elementsEnsure automated data feeds successfully populate materialsManually populate non-automated data as necessary via proprietary systemIdentify system enhancements to improve automated processes and quality of informationPerform audits to ensure accuracy of assigned manufacturers or categoriesCommunicate with providers and manufacturers to ensure complete product data is supplied Request necessary informationIdentify areas of improvement and provide feedbackReview data standards for assigned manufacturers and/or categories Implement data standard improvements through manual and automated means to meet needsProvide customer service support for both external and internal customersSupport and validate teammate adherence to master data policies. Material Maintenance – Responsible for maintaining product catalog to established standards; Performing Price File Maintenance Review automated data feeds for successful materials creation Ensure materials are created correctly via download processIdentify and communicate reasons for automated failures to improve processManually process download failuresDetermine if Sales requests meet Insight Catalog Policy Review opportunities and determine if it is appropriate business for InsightProvide guidance to address future opportunitiesEnsure materials are not added to the catalog that do not fit Insight strategyManually create non-automated materials proactively or reactively according to company policy Create materials via proprietary systems and/or SAPDetermine appropriate source, costing and categorizationProcess internal requests for creationDiscontinue materials that are no longer available and/or based on company policy Other projects – Responsible for completing additional projects and assignments as required by the department All other assigned duties MINIMUM REQUIREMENTS  Education and/or Experience:  Associates degree or above from a college or university; or 3 years industry work experience.  KNOWLEDGE, SKILLS, AND ABILITIES  Following are the skills, knowledge and abilities necessary to perform this job Advanced spreadsheet skillsAbility to analyze and troubleshoot information for resolutionAbility to work well in cross-functional teamsAbility to multi-task in a fast-paced environmentAbility to meet aggressive service-level agreementsAbility to take a complex process or technology and create easy-to-follow copyExcellent written and verbal communication, with strong editing skillsKnowledge of AP styleVast knowledge of technical writing and styles associated with itCollaborating with marketing and IT on search engine relevancy as it relates to parts data’s influenceProficiency with MS Word, Excel, Outlook and SAP.Ability to write reports and/or business correspondence.Ability to effectively present information and respond to questions from groups of managers, customers, other employees.Ability to effectively present information to other departments and manufacturer representatives.Ability to read, analyze, and interpret business documents.Ability to effectively communicate via email, phone and in person.Ability to understand processes and identify areas of improvement.Ability to multi-task and demonstrate strong organizational details. The position described above provides a summary of some the job duties required and what it would be like to work at Insight. For a comprehensive list of physical demands and work environment for this position, click here. About Insight Insight’s success begins with our people making meaningful connections every day. Our culture lives in our teammates. Insight is looking for great people who will embrace our values of Hunger, Heart and Harmony. Hunger to create new opportunities for our clients. Heart to make a positive impact in people’s lives. Harmony to celebrate each other’s unique contributions to bring solutions to clients.  Join our team as we work to deliver the best solutions through Intelligent Technology™, the new IT. Global technology provider of IT hardware, software and service solutionsFortune 500 company founded in 19885,400 teammates worldwide, operating in 22 countriesOne of The Valley’s 2016 Healthiest Employers (Phoenix Business Journal)2016 HP US Personal Systems Reseller of the Year, 2016 Microsoft Federal Channel Partner of the Year, 2016 Cisco Gold Certification in North America, Microsoft’s No. 1 Global Licensing Solution Provider Today's talent leads to tomorrow's success. Learn about careers at Insight: jobs.insight.com.  Insight is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation or any other characteristic protected by law."}