{"jobID": "2837844515", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst - Financial Intelligence", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About the Role In this position, you will get an amazing opportunity to play a critical role in implementing/building a wide array of financial systems. Your performance is measured by the insights you give, effectiveness of communication, and the initiative to drive ideas and implement them into action. What Youll Do Work with Accounting, FP&A;, engineering, data science, product management teams and other business stakeholders in mining and analyzing financial and entity-level data to extract key trends and insights.Build scalable queries to support and analyze the data powering our financial products.Collaborate with finance stakeholders to troubleshoot/analyze complex calculationsBuild models that will better detect anomalies, and resolve financial imbalancesPerform analysis on recommendations produced by machinesDesign and create visualizations to present actionable insights related to data sets and business questions at handBuild end to end data pipelines and self serving dashboards. Automate whatever you can!Get a deep understanding about the process and data flows involved; document and train internal personnel to institutionalize the learnings of the data analytics practice. What Youll Need Bachelors degree with 2 yrs experience or Master Degree with 1 yr experience in Economics, Math, Computer Science, Statistics, Management Science or other quantitative field.Experience with building dashboards in R Shiny or Tableau or other data visualization tools such as D3Demonstrated experience of a good scripting language such as R or PythonStrong data, statistics, and analytical skills with a good grasp of SQL. Experience with Hive & Presto is a plus.A passion for hacking things together in order to solve the hardest problemsStrong communication and organization skills Bonus Points If You understand how to execute, build, and get things done with limited resourcesYou have experience with OLAP tools eg., TM1, Hyperion etc.You have exposure to machine learning About the Team We build and implement all finance systems, with teams specializing in process, product, implementation, project management and analytics."}