{"jobID": "2802102427", "jobLocation": "Chicago_IL", "jobTitle": "Business Analyst - Data Center with Laka and Company", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Chicago Interviews but with Laka and Company  ChicagoInterviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description**PLEASE NOTE APPLICATION RULES, POLICY GUIDELINES AT BOTTOM OF POSTING BEFORE APPLYING TO ENSURE YOUR APPLICATION CAN BE PROCESSED AND CONSIDERED. IMPORTANT----You MUST include a full and formal resume----using your LinkedIn profile as an option rather than a resume will not allow us to provide you full consideration.  Please do NOT email us directly and avoid this site as there are required applications questions that are you must complete for consideration.  DUTIES: You will be responsible for: (1) Acting as a lead ‘technical’ IT business/systems analyst focused on technical IT infrastructure initiatives, IT security initiatives, application software delivery, and business process re-engineering in an Agile environment; (2) Direct stakeholder engagement and relationship management; (3) Requirements elicitation and collaboration with technical resources in translating business requirements into technical specifications; (4) Assessing AS-IS business process, culture, and capabilities; (5) Creating BPMN (Business Process Model and Notation) compliant business process diagrams; (6) Creating enhancement to existing process and identifying solutions to existing gaps to drive successful evolution towards TO-BE business process implementation; (7) Managing, tracking, and communicating project execution; (8) Monitoring User Acceptance Testing (UAT), project communication and documentation, and ensuring timeline/deadline/solution delivery agreements are successfully adhered to; (9) Managing projects across the enterprise SDLC; (10) Working closely with executive leadership to identify improvements, enhancements, and optimization on an consistent basis; (11) Acting as a technical business analyst approximately 50-60% of the time and a project manager 4-50% of the time in a medium sized IT environment.. REQUIRED: Please-please-please-please do NOT apply if you are a project manager or a formal IT manager or leader. As much as we appreciate the MASSIVE initial response, if you take the time to read the actual requirements, and understand the real profile this hiring manager has established, you will understand that this role is nowhere near viable for project managers or formal IT managers and leaders. **THIS ROLE IS FOR TECHNICAL INFRASTRUCTURE BUSINESS ANALYSTS WHO have technical infrastructure experience and acumen. MUST have at least 7 years of STRONG/CURRENT IT industry experience in a small to medium sized IT environments with strong technical INFRASTRUCTURE exposure. By technical INFRASTRUCTURE we mean: networking, IT operations, data centers, servers, hubs, routers, switches, LAN/WAN, telecommunications, etc.  MUST have at least 3 years as a STRONG/CURRENT technical business analyst of IT INFRASTRUCTURE initiatives from owning requirements elicitation through to implementation with excellent stakeholder relationship management in a small to medium sized IT environment (20-125 people in IT) as a non-manager.  MUST have at least 3 years of STRONG/CURRENT technical project management of IT INFRASTRUCTURE initiatives in a small to medium sized IT environment (20-125 people in IT) as a non-manager.  MUST have STRONG/CURRENT/RECENT experience as a technical business analyst approximately 50-60% of the time, while acting as a technical project manager 10%-50% of the time.  MUST have STRONG/CURRENT USE CASE and TEST CASE experience with excellent communication and interpersonal skills.  MUST have STRONG/CURRENT skill with MS Project, MS Office, and Visio.  MUST have EXPERT level skill in articulating project scope, business/stakeholder needs, cost/benefit as well as be adept at conducting data and process analysis and contributing to strategic planning efforts to ensure process handoffs are smooth, effective controls are in place, and process and solutions delivery is realized and fully optimized.  Pluses: Bank/financial, loan, credit, mortgage industry. PMP. CSM. Jira. Agile. BI. APPLICATION PROCESS AND CRITERIA:**Only applicants currently residing within the US can be considered. Applicants from outside of the US cannot be considered for this role.**This is a FULL-TIME W2 corporate IT employment opportunity with salary/bonus/benefits. This is NOT a consulting nor contracting role nor Corp to Corp (C2C) role nor can resumes from consulting firms be considered.***RESUMES WITH COMPLETE FULL CONTACT INFORMATION INCLUDING FULL NAME, FULL RESIDENTIAL ADDRESS, PHONE NUMBER, AND EMAIL ADDRESS CAN ONLY BE CONSIDERED IN ORDER TO FULFILL FEDERAL EOE AND AUDIT COMPLIANCE POLICY AND PROCESS. RESUMES WITHOUT THIS REQUIRED INFORMATION WILL NOT BE CONSIDERED.***LINKEDIN \"RESUMES\" CANNOT BE CONSIDERED AS THEY LACK THE NECESSARY CONTACT INFORMATION AND DO NOT PROVIDE THE NECESSARY SUBSTANCE FOR EVALUATION AND PROCESSING. APPLICANTS WHO USE THE LINKEDIN VERSION OF A RESUME WILL NOT BE ABLE TO BE CONSIDERED FOR EMPLOYMENT FOR THE ROLE THEY APPLY FOR.***The online questionnaire associated with this role MUST be completed fully. Applicants who do not complete this questionnaire cannot be considered.Company DescriptionLaka Company is a firm that specializes in helping firms identify, attract, hire, retain, and develop the best possible talent for the Accounting/Finance, Executive Leadership, Human Resource/HR/Talent Acquisition, IT/Technology, Manufacturing/Logistics/Supply Chain, Marketing, and Operations marketplace.  We are able to provide strategic and tactical professionals to the 'C' level office and we perform contingency, container, and retainer based search projects.  We also help firms evaluate their workflow, process, and interview methodology and help them identify areas that can be improved upon, areas that are performing exceptionally well, and create unique metrics more core to the candidate experience to provide feedback that has been missing historically.  Much can be done to make the hiring experience more rewarding, satisfying, effective, competitive, and successful for all parties involved and that is where we come in.  We create a win-win for the employer, and the employment candidates by helping drive process improvement and adaption of competitive hiring \"best practices\". By helping firms perform more effectively while introducing them to candidates they cannot normally approach on their own, we create a formula and process that truly raises the bar on quality and prompt hiring.  Helping our clients change, evolve, and perform at higher standards is a very rewarding experience---especially when it benefits the entire organization and the candidate's hiring experience which in today's social media world, is essential and critical.  It's also respectful and courteous, and the way it should be done.  And that makes our whole existence worthwhile!  Apply"}