{"jobID": "2756456196", "jobLocation": "Mountain_View_CA", "jobTitle": "Business Analyst, Hardware Data Services", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "111000", "jobDescription": "Help serve Google's worldwide user base of more than a billion people. Business Analysts provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You weave stories with meaningful insight from data. You make critical recommendations for your fellow Googlers in Engineering and Product Management. As a self-starter, you relish tallying up the numbers one minute and communicating your findings to a team leader the next.  As a Business Analyst, you will gather, assess, and manage data about every part of Google’s hardware supply chain, and transform it into insights, analysis and reporting. You are comfortable working with data and have the ability to analyse complex details of data formatting, query massaging and bulletproofing pipelines. You’re also a self-driven performer and you thrive on creating structure and value out of complex and ambiguous technical challenges with little guidance.  Google's mission is to organize the world's information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user's interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people's lives better through technology. Responsibilities Work with non-technical business users to understand their analytical needs, document and prioritize requirements, and to help them effectively use the data and analytical tools that the team has developed.Design, develop and support data warehouses, dashboards, data pipelines and reporting tools for operational and business impact data. Design and enforce access control for all the data.Work with business stakeholders and engineer teams to validate data, identify gaps and contribute in changes in business processes and data pipelines to fix data gaps.Develop visualization based on user needs on Google dashboards or Tableau.Manage projects and drive analytical projects end to end. Write and review technical documents, including requirements, schemas, design documents for existing and future data systems. Qualifications Minimum qualifications:"}