{"jobID": "2819738969", "jobLocation": "Jersey_City_NJ", "jobTitle": "HR Business / Data Analyst", "companyRating": "5.0", "companyInfo": {"Website": "www.crossfireconsulting.com", "Headquarters": "Yorktown Heights, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": " Can you picture yourself working for one of America's Ideal Employers? Our client is at the center of the world's financial markets and is well known for innovation and openness. They encourage diverse opinions and have a focus on teamwork and providing top value to their clients. They foster a culture of collaboration, creativity, and achievement. DURATION: Indefinite: Contractor who (if qualified) could possibly be temp to perm; NO sponsorship candidates consideredINTERVIEW PROCESS: conduct phone interview first, then onsite interview for the right personPrincipal Responsibilities:Conduct data aggregation, monitoring, analysis and reporting to help strengthen HR controls over riskProvide data and analysis in response to regulatory requestsSupport and generate actions to build risk awareness, unearth control gaps and optimize complianceDevelop and maintain metrics, dashboards and other mechanisms to track and communicate strategic milestonesSupport design and/or maintenance of repositories for HR policy and Employee Relations related informationSupport event planning for ER, cross-HR, HR leadership team, offsite and other activities that further the strategy and health of the divisionResearch HR best practices, industry trends and other topics and present recommendationsVarious ad hoc projects and assignmentsEducation, Training &/or Certification:Bachelor degree with focus in human resources, business, or related area preferred 2-3 years of relevant work experienceKnowledge and Skills Required:Strong analytical skillsStrong Microsoft Office skills including advanced ExcelExcellent written and verbal communication capabilitiesHigh degree of accuracy and attention to detailEfficient project management including follow-up; ability to effectively handle sensitive information and protect confidentialityEnthusiastic self-starter who is team oriented."}