{"jobID": "2798404563", "jobLocation": "Stanford_CA", "jobTitle": "Research Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "med.stanford.edu", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": "79218Stanford University’s Division of Primary Care and Population Health, in collaboration with investigators at VA Palo Alto’s Center for Innovation to Implementation, is seeking a Research Data Analyst 2 to contribute to evaluations of health care delivery innovations and studies of health system change, chronic disease management, and patient facing eHealth technology. The analyst will use SQL and SAS to develop, merge, and manage datasets, and conduct statistical analyses for health services research projects at Stanford and in the VA Health Care System. Duties include:Prioritize and extract data from a variety of sources such as notes, survey results, medical reports, and laboratory data, and maintain its accuracy and completeness.Merge data from large administrative datasets, including Medicare and Veterans Health Affairs databases.Determine additional data collection and reporting requirements.Design and customize reports based upon data in the database. Oversee and monitor regulatory compliance for utilization of the data.Use system reports and analyses to identify potentially problematic data, make corrections, and eliminate root cause for data problems or justify solutions to be implemented by others.Create complex charts and databases, perform statistical analyses, and develop graphs and tables for publication and presentation.Serve as a resource for non-routine inquiries such as requests for statistics or surveys.Provide documentation based on audit and reporting criteria to investigators and research staff.- Other duties may also be assigned. Desired Qualifications: Proficiency in SQL and SASFamiliarity with other statistical software (e.g., R, Python etc)Proficiency in Windows/OS, Word, Excel, PowerPoint.Ability to use statistical and database computer programs to construct and manage datasets and databases relevant to research projectsExperience with organizing and summarizing results using tabular or graphic representations as well as narrative description.Ability to undertake assigned tasks in support of research needs which may include: measure development, attending study meetings, assisting in administrative or data editing tasks, consulting with other teams, and serving as a consultant on programming topics.Preferred: Master’s degree in statistic or health field (e.g., Statistics, Biostatistics, Public Health, or related field with coursework in data management and statistics); experience with large administrative datasets, including Medicare and Veterans Health Affairs data.EDUCATION & EXPERIENCE (REQUIRED): Bachelor's degree and three years of relevant experience or combination of education and relevant experience. Experience in a quantitative discipline such as economics, finance, statistics or engineering. KNOWLEDGE, SKILLS AND ABILITIES (REQUIRED):In-depth knowledge and experience using and applying analytical software, database management system software, database reporting software, database user interface and query software, and data mining software.Basic statistical ability.Strong listening, verbal and written communication skills.Ability to manage multiple activities in a deadline-oriented environment; highly organized, flexible and rigorous attention to detail.Ability to use logic to calculate data; efficiently construct a database or scrutinize the form of a question.Ability to work with data of varying levels of quality and validity.Demonstrated ability to produce data in a clear and understandable manner meeting user requirements.Ability to work effectively with multiple internal and external customers.Ability to take a leadership role on projects and with users/clients.CERTIFICATIONS & LICENSES: None PHYSICAL REQUIREMENTS*:Sitting in place at computer for long periods of time with extensive keyboarding/dexterity.Occasionally use a telephone.Rarely writing by hand.- Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job."}