{"jobID": "2799333335", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Staff Data Engineer", "companyRating": "2.9", "companyInfo": {"Website": "www.intelliprogroup.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": "Description: Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the worlds population. Huawei has over 150,000 employees, approximately 70,000 of which are engaged in Research & development. Huawei operates a global network of 14 regional headquarters, 16 R&D; Centers, 28 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future... faster.  About this position  The AI Platform team at the Huawei Research America is seeking Contractors to conduct fundamental and applied research in Intelligent data analytics, Hardware/Co-processor acceleration, Large scale platform optimization, Cloud-based AI framework, Service-oriented Intelligence, and Distributed computing systems.  We are interested in all components of a large scale Big Data Analytics system and AI Platforms, including but not limited to machine learning algorithms, large scale data analysis frameworks, architectural acceleration, performance optimization on Multicore/GPU/FPGA, Open Source Big Data Ecosystems, Big Data Visualization, etc. We are leading researchers and engineers from worldwide to create adaptive and high performance big data and AI engines for real applications, such as financial fraud detection, anomaly detection in security control, acceleration in telecommunication networks, user-behavior modeling, etc.  This position enables one to work with team members with backgrounds in analytics and systems, Distributed Systems, Business Intelligence, parallel architecture, etc., as well as collaborating with academic partners in universities. We encourage researchers actively creating software/systems to solve real-world problems, and contributing to high-quality open-source communities, and actively publishing papers. We are recruiting senior data scientist/engineers with multi-disciplinary backgrounds to contribute to the growth of the company and the success of our society.  Responsibilities  Design, develop and improve acceleration techniques for heterogeneous platforms Work with team members providing technical leadership Implement and benchmark large scale AI algorithms over xPU/FPGA Improve performance of our adaptive engine on various platforms Provide technical guidance to your fellow team members Preferred Technical and Professional Experience:  3+ years experience in development on FPGA/ASIC/GPU 2+ years experience in distributed/parallel computing environment 1+ years experience in machine learning or data analytics Experience in Big Data frameworks, database server development is a plus Basic knowledge in linear algebra, deep learning, statistics Required Education: MS or Doctorate Degree"}