{"jobID": "2809619661", "jobLocation": "Sunnyvale_CA", "jobTitle": "Staff Data Scientist - Search / Relevance", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "175000", "jobDescription": "Position DescriptionIn this role you will  · Act as a thought leader to identify right problems to solve for our customers  · Design and implement state of the art Machine Learning approaches  · Work as a tech lead and define the roadmap for yourself and co-workers  · Develop end-to-end ownership of major customer facing technologies  · Stay up-to-date with the state of the art techniques of Machine Learning, Information Retrieval  · Become an expert either in NLP or Computer Vision  · Push the boundaries of Machine Learning to benefit internal and external community  · Be a brand ambassador for @WalmartLabsMinimum Qualifications• PhD in computer science or similar field with 5+ years of experience Highly proficient in Python or JavaExtremely hands on in building Machine Learning productsExperience in building data products and crunching terabytes of dataA good portfolio of machine learning projects with a significant impact on the bottom lineExperience in working as a tech leadBlog posts, papers or conference talks showing your involvement in the communityAdditional Preferred Qualifications• Familiarity with Deep LearningContributions to open source ML projectsCompany SummaryThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.Position SummaryThe search algorithms team @WalmartLabs is dedicated to the mission of helping millions of customers every day in finding the right products. We are at the forefront of attacking one of the most complex problems of e-commerce. Whenever a user types in a query or browses through product categories on the web site, phone or the iPad, our service goes to work. We mine billions of search queries and tens of millions of products to find the most relevant products for our customers. Team members take end-end responsibility in analyzing large amounts of data, creating complex models, improving their accuracy and deploying these models to serve customers. As part of this team, you'll solve some of the most fascinating and impactful problems in machine learning, information retrieval, NLP or computer vision problems. The algorithms you develop will champion customers need to express their intent and our goal to understand their preferences, implicitly or explicitly across devices and modalities (voice, text, image etc.). You will develop and deploy machine learned models, to engage and converse with our customers and to understand their goals and expectations to enable them to make the right purchase decision. Your work will be visible to millions of customers and you will have a direct impact on the goals of the Fortune #1 enterprise. If you speak and think machine learning then we want to talk to you. Come join our team and be part of this exciting journey. "}