{"jobID": "2800474407", "jobLocation": "Chantilly_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Abile Group has an exciting and challenging opportunity for a Data Scientist on an upcoming contract supporting the Intelligence Community. Junior through SME levels of each position will be hired even though the position is only posted at the Mid Level.  Abile Group, Inc. was formed in July 2004 to partner with the Intelligence Community and their Contractors in the areas of Enterprise Analytics & Performance Management, IT & Systems Engineering and Program & Project Management. We have significant experience with the Federal Government and are an EDWOSB dedicated to our employees and clients. We are looking for high performing employees who enjoy providing advice and guidance along with solutions development and implementation support, crafted by combining industry best practices with the clients’ subject matter experience and Abile’s breadth of expertise. Abile Group is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, veteran status, disability, or national origin. The right candidate will possess the following skills and capabilities and be ready to handle all responsibilities independently and professionally. Identification and tagging, complex event processing (CEP), and the application of analysis algorithms on distributed, clustered, and cloud-based high-performance infrastructures.Exercises creativity in applying non-traditional approaches to large-scale analysis of unstructured data in support of high-value use cases visualized through multi-dimensional interfaces. Handle processing and index requests against high-volume collections of data and high-velocity data streams.Has the ability to make discoveries in the world of big data. Requires strong technical and computational skills - engineering, physics, mathematics, coupled with the ability to code design, develop, and deploy sophisticated applications using advanced unstructured and semi-structured data analysis techniques and utilizing high-performance computing environments.Has the ability to utilize advance tools and computational skills to interpret, connect, predict and make discoveries in complex data and deliver recommendations for business and analytic decisions.Experience with software development, either an open-source enterprise software development stack (Java/Linux/Ruby/Python) or a Windows development stack (.NET, C#, C++).Experience with data transport and transformation APIs and technologies such as JSON, XML, XSLT, JDBC, SOAP and REST.Experience with Cloud-based data analysis tools including Hadoop and Mahout, Acumulo, Hive, Impala, Pig, and similar.Experience with visual analytic tools like Microsoft Pivot, Palantir, or Visual Analytics.Experience with open source textual processing such as Lucene, Sphinx, Nutch or Solr.Experience with entity extraction and conceptual search technologies such as LSI, LDA, etc.Experience with machine learning, algorithm analysis, and data clustering.Clearance Required: TS/SCI w/active CI Poly Degree and Years of Experience:Bachelor’s degree or equivalent plus 6 years experience (Years correspond to level applying; Entry, Journeyman, Senior and Expert) Required Certifications:None Skill Requirements: Positions posted at Mid Level - Required Skils based on level applying (Entry, Journeyman, Senior and Expert)"}