{"jobID": "2760288615", "jobLocation": "Stanford_CA", "jobTitle": "Data Management Analyst", "companyRating": "4.0", "companyInfo": {"Website": "med.stanford.edu", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "78432Job Code: 4744  Job Grade: G  The Quantitative Sciences Unit (QSU) is an interdisciplinary collaborative statistics unit in the Biomedical Informatics Research Division within the Department of Medicine at Stanford University. The mission of the QSU is to facilitate cutting-edge scientific studies initiated by Stanford investigators by providing expertise in biostatics and informatics, to mentor and educate clinical investigators in research methods and to mentor data scientists. To optimally achieve this mission, the QSU members become fully integrated into individual research teams.  The QSU is seeking a highly motivated, hard-working and professional data analyst to join their team. The successful candidate will join a vibrant team of academic data scientists working on a wide variety of collaborative projects in medicine. Under general supervision, the incumbent will perform the most complex technical work associated with a wide variety of analytical data and produce routine, single data sources’ information requests. The incumbent will work closely with senior statisticians to interrogate databases for the purpose of creating analytic files, performing quality control and data cleaning, managing data and doing data analysis under supervision of a statistician. This position holds excellent career development opportunities. Duties include:Assess and produce relevant, standard, or custom information (reports, charts, graphs and tables) from structured data sources by querying data repositories and generating the associated information. Distribute and disseminate reports to applicable agencies, researchers, management and other internal end-users.Develop and produce dashboards, key performance indicators, and other recognized metrics used to monitor and report organizational performance.Collect, manage and clean datasets related to the report generation.Research and reconcile data discrepancies occurring among various information systems and reports.Participate in the implementation of data standards and common data elements for data collection.Identify new sources of data and methods to improve data collection, analysis and reporting.May test prototype software and participate in approval and release process for new software.Create data dictionaries and libraries that document how data are housed.Apply statistical models to the data to summarize data according to analysis plans.- Other duties may also be assigned DESIRED QUALIFICATIONS:Advanced degree/Master’s Degree in Applied Math, Biostatistics, Statistics or related fieldAt least one year of experience collaborating with biostatisticians and clinical and lab-based investigators on studies.Familiarity with statistical packages like SAS and R.Experience collaborating under minimal supervision in a team environment on data-related issues for clinical studies.Experience with programming languages such as SQL or Python for database manipulation.Experience with JAVA programming language for application development.Ability to communicate technical information to all audiences.EDUCATION & EXPERIENCE (REQUIRED): Bachelor's degree or a combination of education and relevant experience. Experience in a quantitative discipline such as economics, finance, statistics or engineering. KNOWLEDGE, SKILLS AND ABILITIES (REQUIRED):Basic knowledge and demonstrated experience using and applying analytical software, database management system software, database reporting software, database user interface and query software, and data mining software.Ability to collect data using a variety of methods, such as data mining and hardcopy or electronic documentation study, to improve or expand databases.Strong listening, verbal and written communication skills.Ability to manage multiple activities in a deadline-oriented environment; highly organized, flexible and rigorous attention to detail.Ability to use logic to calculate data; efficiently construct a database or scrutinize the form of a question.Ability to work with data of varying levels of quality and validity.Demonstrated ability to produce data in a clear and understandable manner meeting user requirements.Ability to work effectively with multiple internal and external customers.PHYSICAL REQUIREMENTS*:Constantly perform desk-based computer tasks.Frequently sit, sort, file paperwork or parts, grasp lightly, and use fine manipulation, lift, carry, push and pull objects that weigh 10 pounds or less.Occasionally write by hand, twist, bend, stoop and squat.Rarely stand, walk, reach or work above shoulders and use a telephone.- Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job.WORKING CONDITIONS: May work extended hours during peak business cycles.  WORK STANDARDS (from JDL) Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.Subject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University's Administrative Guide, http://adminguide.stanford.edu."}