{"jobID": "2830505861", "jobLocation": "Dearborn_MI", "jobTitle": "*258814 - Data Scientists Analysts", "companyRating": "4.0", "companyInfo": {"Website": "www.rgbsi.com", "Headquarters": "Troy, MI", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Kelly Services, TEKsystems, Randstad US"}, "estimatedSalary": "80000", "jobDescription": " RGBSI, a leader in the staffing industry, is dedicated to providing the highest quality of services to our clients and employees. We are proud to be the primary staffing partner to top companies in the automotive, aerospace, IT, media&entertainment;, sports, energy, and finance industries. As a result of our clients' continued growth, we are looking for energetic, personable professionals to partner with these leading US companies. Position Description:Position Overview/Description:Global Data, Insight, and Analytics (GDIA) organization is looking for motivated and talented individuals with a background in Data and Analytics to work on supply chain analytics problems.This is a dynamic and challenging opportunity to apply the latest tools and methods in Big Data and Data Science to a variety of business problems at Ford.In this role, you will collaborate with partners in product development, purchasing, warranty, material planning and logistics, and other activities to define problems, identify data, establish predictive and prescriptive models, and deliver optimal solutions.You will have the opportunity to work with some of the brightest global subject matter experts that are transforming the automobile industry.Responsibilities:Support the development and delivery of analytic models using skills such as data acquisition and management, algorithm design, and model development&refinement;Acquire deep understanding of the business problems and translate them into appropriate mathematical representationsEncode mathematical abstractions into prototype computer programs or modelsEnsure overall quality of the data&solutions; throughout the analytic development processInterpret results and communicate them to technical and non-technical audiences, cross-functional teams and executive leadershipSkills Required:Background in industrial engineering, operations research, statistics, mathematics, computer science, econometrics or related quantitative fieldsSkills Preferred:Experience applying operations research, mathematics, and/or statistics approaches to supply chain and sourcing problemsProject management experience and strong leadership skills such as business acumen and strategic vision a big plusComfortable working in an environment where problems are not always well-definedInquisitive, proactive, and interested in learning new tools and techniquesStrong oral, written and interpersonal communication skillsWell-organized, independent and ready to work with minimal supervisionHave a desire to excel and work with talented peopleExperience Required:2+ years' experience with mathematical programming, optimization techniques, data mining, or statistical analysisProficiency in analytic languages and frameworks such as R, Python, Qlik, MATLAB, SAS, R, CPLEX or JavaProficiency in database query and management tools (SQL, Alteryx, etc.)Education Required:Bachelor's Degree in industrial engineering, operations research, statistics, mathematics, computer science, econometrics or related quantitative fieldsEducation Preferred:Graduate degree preferred We offer attractive, competitive compensation and benefits including, medical, dental, vision, longevity bonus, holidays, 401k, Short Term Disability, AD&D; and Tuition Reimbursement. If you take pride in your work and are committed to personal and professional success we want to talk to you. Please visit www.rgbsi.com to learn more.  RGBSI is a Multi-National Corporation headquartered in Troy, MI with branches throughout the USA, Canada, China, Germany, Mexico, Singapore, UK, and India."}