{"jobID": "2833299433", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Principal Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.Position Overview:The qualified candidate is an independently thinking, highly motivated scientist with strong knowledge of the immune system and investigative experience in the assessment of alterations in immune status and function. This person will contribute to the advancement of drug candidates across the portfolio by providing immunotoxicology expertise to discovery and drug development teams to help address key scientific issues associated with potential safety liabilities related to alterations in immune function, understanding mechanism, and providing human risk assessment. The candidate will also serve as representative of Drug Safety Evaluation (DSE) on drug development teams for immunomodulatory drug candidates evaluating and preparing regulatory submissions, providing a knowledgeable perspective to project teams and DSE management on scientific and regulatory toxicology issues likely to impact the drug development process, and serving as study director or monitor on toxicology studies.The candidate will be responsible for designing and implementing the scientific and toxicologic evaluation of selected drug candidates, such as immunomodulators and protein therapeutics; design and coordinate mechanistic and toxicology studies to support project and discovery working groups; and develop mechanistic approaches and utilize molecular and emerging technology platforms to address toxicity issues that arise, particularly those associated with the immune system. The candidate will also be actively engaged in influencing the external environment through presentations, publications, and leadership roles in external scientific organizations.Job responsibilities include: Support DSE Toxicology project representatives on development teams as Immunotoxicology subject matter expert;Serves as Toxicology Project Representative and CRO Study Monitor;Responsible for the scientific and toxicologic evaluation of selected drug candidates;Designs and coordinates mechanistic and toxicology studies to support project and discovery working groups;Develops mechanistic approaches and utilizes molecular and emerging technology platforms to address toxicity issues that arise, particularly those associated with the immune system;Integrates available mechanistic, biochemical, toxicological, immunological, clinical, statistical, toxicokinetic, and pathologic data into study reports for regulatory submissions;Meets reporting metrics and provides summary updates to management;Assures compliance with GLP and SOPs, safety and animal welfare guidelines.Qualifications: PhD in a relevant discipline (immunology, immunopharmacology, immunotoxicology) with a minimum of 10 years relevant experience.Comprehensive knowledge of animal and human biology and physiology, especially clinical and functional changes associated with toxicity and mechanism of action of disease or toxicity.Effective written and oral communication skills. Ability to manage multiple research activities.Provides and accepts inputs on study design and data interpretation and fosters a spirit of team work.Demonstrated ability to solve complex scientific problems."}