{"jobID": "2631684565", "jobLocation": "Fresno_CA", "jobTitle": "Material Handler", "companyRating": "3.2", "companyInfo": {"Website": "www.ulta.com", "Headquarters": "Bolingbrook, IL", "Size": "10000+ employees", "Founded": " 1990", "Type": " Company - Public (ULTA) ", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Sephora, Victoria's Secret, Bath & Body Works"}, "estimatedSalary": "14", "jobDescription": " Under close supervision, ships, receives, stocks and fulfills orders of product in the distribution center, while following company policies and guidelines. Typically tasks are completed through the use of an RF scanner. Use your skills, experience & talents to be part of something BEAUTIFUL! As a Material Handler you will perform the following essential functions… Accurately picks and packs orders using established work practices. Restocks picking bins with product brought from reserve storage. Accurately sorts, counts, and receives all merchandise. Safely moves product to and from pallet racks with powered material handling equipment. Safely works with conveyors to accurately build pallets of cartons to ship out. Loads or unloads trucks. Organizes warehouse storage space effectively. Works in a clean and orderly manner at all times. Adheres to safety, quality and production standards. Uses material handling equipment, including but not limited to Forktrucks, Orderselectors and Powered Pallet Jacks, will certify on equipment. Uses a scanner to direct work (pick, pack, receive, move) Uses hands and fingers to handle, or feel; repeatedly reaches overhead with hands and arms to accomplish tasks; uses hearing to listen for safety hazards and instructions. Safely lifts and/or moves boxes, product or equipment weighing up to 50 lbs., repeatedly. Consistently lifts, bends, stands, walks, stoops and kneels; occasionally crouches, crawls and climbs stairs during an 8 hour or 10 hour shift and during extended overtime shifts as needed. Uses close vision, distance vision, peripheral vision and depth perception while performing warehouse functions. Works overtime as determined by business needs during the week and/or weekends. Uses basic interpersonal skills in accomplishing tasks. Follows instructions quickly, safely and accurately. Works effectively in a team environment. Effectively communicates and understands basic written and oral instructions, in English. Effectively communicates, understands oral instructions, reads and interprets documents such as safety rules, operating and maintenance instructions and procedure manuals, in English. Demonstrates flexibility in daily task assignments and performs other general warehouse tasks, as assigned.Experience we are looking for… Must be at least 18 years of age. Basic math skills including the ability to accurately add, subtract, multiply and divide. Must be self-motivated. Must successfully complete training and obtain certification in assigned area.Preferred Job Requirements High school diploma or GED; 1 year or more related experience and/or training; or equivalent combination of education and experience. Knowledge of RF (radio frequency) scanners. Basic computer skills.Other Constant exposure to loud noises. Occasionally work in high places. Exposure to variable temperatures. Exposure to dusty environment. May be exposed to strong scents related to cosmetic or fragrance. May be required to work in narrow aisles or trailers.Requirements"}