{"jobID": "2788810726", "jobLocation": "Redwood_City_CA", "jobTitle": "Research Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.capitalgames.com", "Headquarters": "Sacramento, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": " Electronic Arts Inc. is a leading global interactive entertainment software company. EA delivers games, content and online services for Internet-connected consoles, personal computers, mobile phones and tablets. We are EA And we make games – how cool is that? In fact, we entertain millions of people across the globe with the  most amazing and immersive interactive software in the industry. But making games is hard work. That’s  why we employ the most creative, passionate people in the industry. The Challenge Ahead: The EA Digital Platform Intelligent Systems Group is responsible for providing unified AI resources across  all franchises within Electronic Arts. Our group develops AI and data driven solutions to game team  problems. From data modeling to agent building, we utilize a modern, cloud-based tech stack with bestin-  class tools to provide solutions and platforms empowering the future state of game development,  marketing, sales, and player experience. What’s in it for you?Glad you asked! We love to brag about our great perks like comprehensive health and benefit packages, tuition  reimbursement, and 401k with company match and, of course, free video games. And since we realize it  takes world-class people to make world-class games, we offer competitive compensation packages and a  culture that thrives on creativity and individuality. At EA, we live the “work hard/play hard” credo every  day. Our next NLP Scientist at EA should have: • PhD. in Computer Science with a focus on natural language processing (NLP) or other topics  related to the game genre  • Track record of having developed novel AI algorithms, major journal publications a plus  • Hands-on experience in building intelligent systems that solve real problems  • Strong problem solving ability  • Strong programming skills (object oriented and functional paradigms)  • Experience with any bot development frameworks such as Watson, api.ai, or Alexa  • Experience with large scale distributed programming paradigms – experience with the Hadoop  stack(HDFS/MR/Pig/Hive) a plus  • Experience with analytic tools such as Spark, R, SAS, Matlab or SPSS a plus  • Experience with SQL and MPP databases  • Excellent written and verbal communication and skills  EA is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status or veteran status. We will also consider for employment qualified applicants with criminal records in accordance with applicable law."}