{"jobID": "2730840405", "jobLocation": "Glenview_IL", "jobTitle": "Sr Scientist, R&D; - Packaging", "companyRating": null, "companyInfo": {"Website": "www.kraftheinzcompany.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (KHC) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our CompanyThe Kraft Heinz Company is revolutionizing the food industry – we will be the most profitable food company powered by the most talented people with unwavering commitment to our communities, leading brands and highest product quality in every category in which we compete. As a global powerhouse, Kraft Heinz represents over $26.5 billion in revenue and is the 5th largest food and beverage company in the world. At Kraft Heinz, to be the BEST food company, growing a BETTER world is more than a dream – it is our GLOBAL VISION. To be the best, we want the best – best brands, best practices and, most importantly, the best people.It's a Question of TasteDo more, be more. Whatever your aspirations, experience something exceptional at Kraft Heinz. We'll give you the freedom to determine your own direction and deliver in your own style. Outperform our expectations and you'll move forward faster than you ever thought possible. Come ready to dream. Come eager to grow.  Get a taste of what your career could be at kraftheinzcompany.com/careers.Job DescriptionRole Overview This Packaging Development position will primarily support the Canada Zone Retail Cheese businesses, be based in Glenview, IL and work on brands such as Cracker Barrel, Philadelphia, P’tit Quebec, Kraft, and others. The role provides opportunities to lead packaging development initiatives for innovation, renovation, and maintenance of packaging to advance growth, ensure quality objectives and ensure business continuity for Kraft Heinz.  The candidate will be scoping and executing technical projects to meet business initiatives focused on New Product Development. This includes designing and executing tests, analyzing data, drawing conclusions, documenting, communicating results, and commercializing products. Communication and teamwork skills are essential in this role, which operates in a dynamic and cross-functional environment with partners in Marketing, Operations, R&D;, Sales, Procurement, Finance, Supply Chain, external ingredient/product suppliers, co-manufactures and business partners. The candidate will need to be comfortable working across all packaging formats (flexible, rigid, corrugate, microwaveable, etc.). The candidate must also have a technical background and be able to apply prior learning or scientific principles to new situations.  This position requires an individual to manage multiple assignments/ tasks concurrently and demonstrate the ability to complete work with minimal guidance. The candidate is expected to lead his or her projects and exhibit a collaborative mindset to apply innovative solutions. Ready? Responsibilities:The candidate will lead packaging development projects from concept to commercializationWork closely with cross functional teams, acting as packaging lead to drive execution across multiple projects while maintaining and achieving timelines to ensure speed to marketManage multiple projects with complex scope concurrentlySupport general brand maintenance to ensure business continuity across multiple categories as needed.Interface with all related technical experts and US/Category packaging scientists to understand and leverage technologies and applications.Manage technical timelines, provide clear and timely communication, raise issues and risks, and develop contingency plans leveraging project management skillsAssess IP opportunities for Zone as part of the IP review teamConduct lab tests, pilot plant and large scale tests within manufacturing facilities to optimize formulation and/or process.Write specifications, with attention to detail, that deliver consistent, high-quality products.Maintain clear and thorough technical documentation.Act as a technical mentor to junior developers on the team.Be a big dreamer.Qualifications:BS/MS - Packaging, Chemical Engineering, Material Science or related fields4+ years of experience in packaging development for consumer product industryDesire for experience in the food industryAbility to work effectively in a team environmentExpert understanding of packaging material interactions/functionality.Executional excellence and personal leadership.Highly motivated problem solver and the drive to deliver objectives in a complex environment.Ability to plan, put together well thought out design of experiments, anticipate next steps and incorporate course corrections when hurdles appear.Excellent verbal and written communicationExecutional excellence, personal leadership and prioritization skillsAbility to learn new materials and processes quicklyWilling to travel up to 30%. Travel could include (but not limited to): within United States and Canada to internal plants, co-manufacturers, and suppliers.EEO Policy Kraft Heinz is an EO employer - Minorities/Women/Vets/Disabled and other protected categories.  IND123Location(s)Glenview R&D; Center"}