{"jobID": "2691010994", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Data", "companyRating": "3.7", "companyInfo": {"Website": "www.change.org", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "With over 240 million users in 196 countries, Change.org is the worlds largest technology platform for social change. Our team spans 18 countries and empowers hundreds of millions of people to have a voice and fight injustice. Were a social impact business, and were aiming to build a world where no one is powerless and where creating change is a part of everyday life.Change.org is looking for a Director of Data to build a vision for data science, data engineering and the data platform, own the roadmap, and manage major initiatives.In this role you will own the data platform, lead groundbreaking R&D; projects to leverage massive structured, unstructured, transactional and real-time data sets from a variety of sources, analyze financial and customer usage patterns, and make actionable recommendations using machine learning, data mining, business understanding and common sense. This role reports directly to the VP of Engineering and will manage a team of data scientists and data engineers.Responsibilities:Build a vision for data science, data engineering and the data platform. Own the roadmap, and manage major initiatives and milestones around modeling for various areas.Own data modeling infrastructure and define model building and hand-over process with the Data team and other engineering stakeholders.Lead, manage and grow your team, with a focus on results and retention.Engage and participate in external data science meetups and events to share knowledge and promote Change.org engineering brand.Requirements:Masters' degree in mathematics, statistics, computer science or related field with a minimum of 7 years of experience.Significant experience with a general-purpose programming language (such as R, Python, Hadoop, MapReduce or other big data frameworks).Demonstrated strong business, analytical and technical expertise.Strong track record of successful data science and/or data engineering projects.Experience turning ideas into actionable designs and delivering solutions to end users.Experience building large scale data/machine learning infrastructure.Experience in the use of statistical packages and machine learning libraries.Business competencies: strong interpersonal skills, leadership, pro-activity, capacity to build a vision, conceptual thinking, innovation, problem solving, teamwork, and change management.Strong verbal and written communication skills and excellent presentation skills.This is a full-time opportunity. The position is located in San Francisco, CA, U.S.A.Change.org is committed to being a diverse and inclusive workplace. We encourage applicants of different backgrounds, cultures, genders, experiences, abilities and perspectives to apply.All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, sexual orientation, gender, gender identity, age, physical disability, or length of time spent unemployed."}