{"jobID": "2826651116", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist", "companyRating": "4.8", "companyInfo": {"Website": "www.housecallpro.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "Data ScientistSan Diego, CAAt Housecall Pro, we are focused on making the lives of service professionals better by helping them to incorporate technology into their daily workflow. Housecall is the platform through which our customers’ on-premise service work is coordinated and transacted. We are the operating system for service labor across the US and Canada.As a Data Scientists on the Analytics team, you will drive business decisions across the company by using data and providing insights. You'll work closely with teams across the organization (Marketing, Sales, Product, Retention, etc) on projects around multi-touch attribution modelling, lead scoring, churn prediction, sales driver and feature recommendations - just to name a few! You will implement your models into production and drive the customer journey and product experience.Our Analytics team is extraordinary. Empathetic, hard working and focused on easy data and information access. Housecall Pro is a data-driven company and we are the \"insights engine\" of the organization, helping HCP and the HCP service professionals to optimize and to grow their businesses. ResponsibilitiesDrive cross functional data science projects from beginning to end: build relationships with partner teams, frame and structure questions, collect and analyze data, as well as summarize and present key insights in support of decision makingApply machine learning (ML) and analytical techniques to create scalable solutions for business problemsBuild models from the ground up, from data exploration through feature generation, to model construction and optimization Deliver actionable insightsPartner with Product and Engineering teams to define, scope, and implement projects in production Build the next generation of data products at HousecallDesign and evaluate A/B tests to quantify impactQualificationsMaster’s or PhD in computer science, electrical engineering or related fields (statistics, applied math, computational neuroscience)Previous experience in a ML or data scientist role and a track record of building ML modelsExperience designing and developing production level code using PythonExcellent understanding of statistical and machine learning modelsBusiness acumen"}