{"jobID": "2700193751", "jobLocation": "Foster_City_CA", "jobTitle": "Research Scientist I, HIV", "companyRating": "3.1", "companyInfo": {"Website": "www.gilead.com", "Headquarters": "Foster City, CA", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public (GILD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": " For Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job.Job DescriptionSpecific Responsibilities:  Seeking a highly motivated, creative and collaborative individual with a strong passion for and dedication to discovery of new life-saving medicines. The candidate will join our internal efforts focused on the research and development of novel HIV therapeutics, including small molecule drugs and biologics, with a potential to achieve the ambitious goal of cure or remission of HIV infection. The successful candidate will collaborate with an experienced multidisciplinary team of scientists to explore and develop new tools, models and approaches, and using those for conducting key biological studies to advance team objectives in developing novel HIV cure therapeutics. Primary responsibilities will include: designing, performing and validating novel cell-based immunology assays for human and non-human primate studies, evaluating new targets and therapeutic approaches in a fast-paced team environment, interpreting results, proactively troubleshooting technical issues and recommending potential solutions based on experimental observations and/or literature reviews.  In addition the successful candidate would be expected to: Build strong internal scientific expertise, and introduce new techniques and models for the evaluation of therapeutic strategies targeting HIV replication and reservoirsConduct in-depth characterization of cellular and humoral immune responsesDevelop, execute and troubleshoot assays.Design, coordinate and execute key in vitro and in vivo proof-of-concept studies including in mouse and NHP modelsIdentify, evaluate, and support relevant external collaborationsParticipate in multidisciplinary team effortsPresent regular research updates to project teams and R&D; management Gilead is a fast-paced, data-driven, scientifically rigorous organization and the role will suit a scientist who is able to thrive in this type of environment.  Knowledge, Experience and Skills: PhD in immunology or relevant life science disciplineMinimum of 2 years post-doctoral experience focused on innovative research in immunology with proven achievements in industrial or academic settingsStrong level of understanding and expertise in viral immunology, and/or evaluation of immunotherapeutics including vaccinesExperience with a broad array of technologies to support assay development and discovery research is highly desired. Hands-on experience in cell culture and/or virology techniques such as primary cell isolation and culture, immune cell functional assays including ELISpot assays, multi-color FACS, ELISA/Luminex, as well as molecular biology techniques such as RNA/DNA isolation, qPCR and cloning. Experience in assay development, ability to evaluate quality of the data, recognize anomalous results and interpret experimental outcomes is essential. Excellent verbal communication and interpersonal skills. Communicate effectively within the Virology group and functional groups within Research.  #LI-KW1For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}