{"jobID": "2803800769", "jobLocation": "Washington_DC", "jobTitle": "Manager, Global Partnership Marketing", "companyRating": "3.8", "companyInfo": {"Website": "www.monumentalsports.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": "Monumental Sports & Entertainment (MSE), located in Washington, D.C., is one of the largest integrated sports and entertainment companies in the country with one of the most diverse partnership groups in all of sports. MSE owns and operates seven professional sports teams: the AFL’s Baltimore Brigade and Washington Valor, NBA's Washington Wizards, NBA G League’s Capital City Go-Go, NBA 2K League’s Wizards District Gaming, NHL's Washington Capitals and the WNBA's Washington Mystics. The company is also co-owner of aXiomatic, which has controlling interest in global esports franchise Team Liquid, and owns and operates Capital One Arena in Washington, D.C. MSE also manages Kettler Capitals Iceplex, the state-of-the-art training facility for the Capitals and EagleBank Arena on George Mason University's campus. A new sports and entertainment venue in Southeast D.C. on the St. Elizabeth’s East campus, in collaboration with the District of Columbia and Events DC, will feature a first-in-class training facility for the Wizards and Mystics and will additionally include a 4,200-seat arena which will serve as the new home court of the Mystics and Go-Go. MSE also co-owns and operates Monumental Sports Network (MSN) with the NBC Sports Group. MSN is the mid-Atlantic region’s top destination for exclusive fan experiences and creative sports content across desktop, tablet, mobile and OTT streaming devices. Visit www.monumentalsports.com.MSE proudly promotes its core values for all those that interact with the company. As a member of our team:You will provide first-class customer service and value for our fans.You will champion a double-bottom line that engages, unifies and gives back to the community we serve.You will work tirelessly to build generationally exceptional teams that compete for championships year after year and create lifelong memories for our fans.You will measure performance with specific objectives and metrics and our analysis and decisions are compelled by data.You will prize leadership, but you should value teamwork and collaboration and transparency even more. We treat each other with respect. We act with honesty and integrity. We remain humble.You will innovate. We are nimble and first to market. We are not averse to risk.You will have fun. We are in the business of happiness.Overview: The Global Partnership Marketing Manager delivers unique value to Monumental Sports & Entertainment’s global partners through the business management and implementation of all contractual assets. Primary focus is to clearly demonstrate return on partner business objectives in order to ensure maximum partnership retention and renewal rate.Responsibilities:Manage each MSE brand (Washington Capitals, Washington Wizards, Washington Mystics, Washington Valor, Baltimore Brigade, Capital City Go-Go, Wizards District Gaming, Capital One Arena and Eagle Bank Arena) and its associated assets as it relates to the Global Partnership Marketing Manager’s portfolio of assigned accounts.Develop positive relationships with existing partners and strategically craft incremental sponsorship opportunities by identifying new co-branded business opportunities and activations.Build client brand briefs and work closely with all internal departments to generate the most effective partnership idea offerings and execution tactics based on the client’s needs.Prioritize and implement all assigned Monumental global partners’ contractual elements.Ensure the timely delivery of all partner marketing deliverables per agreement.Track deliverables and prepare all post season recaps for assigned accounts.Ensure that all processes and procedures are completed, quality standards are met, and that projects are fulfilled perfectly to increase partner renewals.Other duties as assigned.Minimum Qualifications:Bachelor's degree.Minimum of three years in a marketing position with a consumer brand, agency or media property.Ideal candidate will be able to develop and maintain corporate relationships, with senior level managers/clients.Ideal Candidate will have in-depth working knowledge of Microsoft Word, Excel, PowerPoint, Access, Salesforce/KORE and Outlook.Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public.Must be highly organized with ability to multi-task.Must have strong interpersonal communication skills.Retail sales promotion or marketing experience preferred.Capable and available to work extended hours including nights, weekends, and holidays as necessary.We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}