{"jobID": "2701744036", "jobLocation": "Arlington_VA", "jobTitle": "Junior Business Development Associate (Market Data Analyst)", "companyRating": "4.4", "companyInfo": {"Website": "www.halfaker.com", "Headquarters": "Arlington, VA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": " Tracking Code  877-219  Job DescriptionHalfaker and Associates, an award winning high growth small business, creates innovative and customer-centric technology solutions in the areas of Cyber Security, Data Analytics, Software Engineering and IT Infrastructure to improve the health, security and well-being of all Americans. Our commitment to excellence and our vision to “Continue to Serve” has resulted in steady growth and an expanding client base across government agencies in the health, defense, security and intelligence sectors. Headquartered in Arlington, VA, we have employees nationwide and were recently named a 2017 Top Work Place by the Washington Post. Please take a moment to browse through our website and learn more about what it means to serve with Halfaker.  Halfaker has an opening for a Junior Business Development Associate (Market Data Analyst) to join our talented, dynamic team. The key responsibilities for this position include: Conduct Business Development (BD) pipeline/opportunity data entry and updates, adherence to naming conventions, and alignment to BD processes, ensuring data integrity, accuracy, and qualityContinuously conduct thorough market research, competition research, and pricing/rate research, and subsequently conduct detailed analysis across research variableWork closely with company leaders to learn nuances of PTW models and processes, in order to independently update and maintain price-to-win (PTW) models based on research and data analysis findingsFormulate reliable data points and reasonable PTW assumptions to assist capture team in determining PTW on relevant opportunitiesWork closely with GWAC/IDIQ Manager to ensure comprehensive understanding of the company’s current and target GWACs and IDIQsResearch upcoming key task orders and recompetes on company GWACs and IDIQs and provide information and recommendations to decision-makersCollect and file GWAC and IDIQ task orders and pipelines and relevant data points in appropriate trackers and folders Required Skills Ability to learn new analytical subjects quickly and independently and apply knowledge acquired to performance across assigned work areasAbility to independently conduct thorough research and analysis of data and written information; ability to synthesize large amounts of information/research and analysis findings and present logical conclusions accordinglyExcellent analytical skillsSuperior attention to detail Required Experience 0-3 years of work experience requiredAnalytical background requiredProven record of high achievement and commitment to quality workProven record of desire and ability to learn new subjects Halfaker and Associates is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/ Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. Citizenship is required for most positions.Job Location  Arlington, Virginia, United States  Position Type  Full-Time/Regular"}