{"jobID": "2738743324", "jobLocation": "Chicago_IL", "jobTitle": "Game Data Analyst, Monetization", "companyRating": "3.7", "companyInfo": {"Website": "www.warnerbros.com", "Headquarters": "Burbank, CA", "Size": "5001 to 10000 employees", "Founded": " 1923", "Type": " Company - Public (TWX) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " NBCUniversal"}, "estimatedSalary": "65000", "jobDescription": "Posting  Job Title Game Data Analyst, Monetization Time Warner  Division Warner Bros. Entertainment Group WB Business Unit NetherRealm Industry Games – Development & Publishing Area of  Interest Game Development/Publishing Location United States - Illinois - Chicago Requisition # 163728BR Position  Type Full Time Company Overview Warner Bros. has been entertaining audiences for more than 90 years through the world’s most-loved characters and franchises. Warner Bros. employs people all over the world in a wide variety of disciplines. We're always on the lookout for energetic, creative people to join our team. Business Unit Overview The creative team that brought Mortal Kombat and Injustice to life is now NetherRealm Studios, part of the Warner Bros. Interactive Entertainment family. With over 20 years of creation under our belts, NetherRealm’s mission remains the same; to create cutting edge entertainment and deliver industry leading tech, game art and overall gaming experiences. NetherRealm Studios is a collaborative and creative environment, constantly striving to up the ante on what is possible in interactive entertainment. We encompass the best of both worlds – a team of dedicated professionals with years of experience, who are also at the forefront of an industry taking over the entertainment landscape. The passion and energy that made Mortal Kombat a reality is still on display every day in our offices, our hallways and most definitely the studio’s arcade room! Posting Job Description NetherRealm studios is a top video game developer for both console and mobile. We have a growing portfolio of hits that includes Mortal Kombat and Injustice. As we continue to expand, we are looking to add an enthusiastic, talented, and experienced professional with a passion for understanding users’ behavior through data.  NetherRealm Studios seeks a Data & Monetization Analyst to join our team. In collaboration with our existing Analytics Department, the Analyst will work closely with the development teams for the full lifecycles of our products.  This position requires excellent project management, communication, and documentation skills. The ideal candidate will demonstrate passion for discovering interesting facts through data and sharing them with others. Daily tasks include gathering requirements from project stakeholders, drafting schemas and tables, working with the ETL and reporting process, and developing documentation.  The Data and Monetization Analyst must be comfortable working with large sets of data related to acquisition, engagement, and monetization. The Analyst will coordinate with external BI engineering and QA teams to ensure the data pipeline can meet our needs and work with internal design, development, and product management to translate the results of data analysis into compelling designs that compliment and further elevate fun game experiences. Analytic reports are in high demand by multiple entities. This position will collaborate on everything from planning the way we record events in-game, monitoring the ETL process, and ensuring the final report satisfies the intended audience.  The Analyst will need strong communication skills and an ability to be a contributor working with a wide variety of internal departments. They will be comfortable with all levels of ownership, from hands on design to providing high-level guidance and feedback. Detail-oriented and organized, the ideal candidate will thrive in a fast-paced and evolving environment that offers the opportunity to work hands-on with world-class brands, and contribute concretely to the success of our games. What part will you play?Answer questions about our products by querying our databases and packaging the answers in an easily digestible way for our internal teams.Identify in-game events that affect business KPIs including revenue, retention, use acquisition, k-factor, and lifetime value.Collaborate with other analysts in drafting table schemas and dimensional models to measure the variables necessary for later analysis.Design, build, and maintain analytics documentation including requirements from various departments as well as timeline.Organize staff meetings while drafting meeting minutes and syndicating action items.Work with Confluence, PowerPoint, and other tools to ensure project details and analytical value is being communicated to all stakeholdersPerform market research, competitor teardowns, and write up trend summaries.Monitor progress by playing builds in development as well as reviewing ongoing player behavior reports and trends.Brief the team regularly on key learnings and new insights that can be applied across games.What do we require from you?BA/BS Degree in Business, Finance, Statistics, Economics, Computer Science, or MathematicsMinimum 2-3 years as a data and/or monetization design contributor or similar role (product, design, analytics, etc.) in the games industry, in mobile, PC, or consoles.Strong background in analysis fundamentals through previous work experience, collegiate thesis, and/or passion projects.Strong familiarity with mobile application ecosystems and operating systems like iOS and Android.Experience with project managing multiple deliverables that each have their own separate stakeholders, environments, and operational teams.Experience designing, building, reporting, and maintaining project documentation.Must be comfortable reading, interpreting, explaining, and responding to data; background in statistics, data mining, or other quantitative discipline is highly valued.ETL knowledge desired from schema generation, event design, ETL processing, to reporting.Business Intelligence tools experience a bonus: SQL, Tableau, Looker, Python, C++.Comfortable presenting complicated material to diverse audiences; strong ‘soft skills’.Passion for analytics.Passion for gaming.Ability to collaborate with colleagues across different disciplines and locations to achieve results.Ability to work in a fast-paced environment and prioritize work to meet specific deadlines required.“Team First” personality with excellent interpersonal and communication skills. “No job is too small” attitude.Must be self-motivated and results-oriented.*The Warner Bros. Entertainment Group of Companies is an equal opportunity employer and considers all candidates for employment regardless of race, color, religion, sex, national origin, citizenship, age, disability, marital status, military or veteran's status (including protected veterans, as may be required by federal law), sexual orientation, gender identity or any other category protected by law."}