{"jobID": "2827045618", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Client Manager - US", "companyRating": null, "companyInfo": {"Website": "www.position2.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Location San Francisco Client Relationship Management Establish trust with CLIENT’s key interface and executive team.Understand CLIENT’s business goals and KPIs – communicate these internally to delivery teams.Act as a valued business partner ensuring overall client satisfaction and long-term retention.Proactively manage contracted services per statement of work. Understand, anticipate, manage and quickly respond to needs and requests of clients day-to-day.Help BD team grow account and seed new opportunities (both new clients as well as existing clients.Develop and maintain effective communication mechanisms to articulate performance, e.g., weekly/monthly/quarterly meetings and analysis reports. Working with the Delivery and Project Management Teams Contribute to internal communications and meetings to help close the loop on the cycle of presentation, proposal, closure and service kick-off.Provide overall co-leadership to individual delivery teams.Work with delivery project management team to ensure quality and timely service execution.Provide quality assurance of all client deliverables.Work with project manager when appropriate to resolve project challenges. Marketing Thought Leadership Consistently and proactively identify client need. Good balance between being strategic and tactical.Develop strategies that are linked to long-term digital/online marketing plans and objectives.Lead delivery teams towards thinking creatively and innovatively to develop client campaigns and initiatives.Exhibit the intellectual curiousity, interest and ability to understand digital marketing trends, new demand frameworks, various client success stories and package these up to share with CLIENT management. Desired Skills and Experience Five to ten years of US marketing experience. Marketing Agency experience a strong plus.Ability to manage long-term clients in various industries, e.g., B2B and B2C.Deep experience and understanding of online/digital marketing, e.g., SEO, PPC, SMM, content marketing, marketing automation, analytics, web design and webmaster service, creative services.Strong presentation, verbal and written skills as well as proven ability to independently prepare, and guide a delivery team to prepare, a GTM plan.Ability to motivate, work with, and support a delivery team in India.Mitigate risks and resolve any client issues effectively.Self-motivated with excellent problem solving and critical thinking skills.Ability to track and be accountable for service deliverables. Perks Flexible work schedule. This job requires evening calls with delivery teams in India. So, the company offers somewhat flexible work schedule although daily office hours are a requirement.Lean startup culture, but our team is growing. We work and play hard.Fun team and office environment. We are all foodies and load the office with healthy snacks.Domestic travel. How to Apply Email your resume to careers@Position2.com. Please mention the position applied for in the subject line of the email"}