{"jobID": "2797994826", "jobLocation": "San_Francisco_CA", "jobTitle": "Mid-Level Environmental Scientist/Planner", "companyRating": null, "companyInfo": {"Website": "www.integral-corp.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Integral Consulting Inc. (www.integral-corp.com) is an international science and engineering firm providing multidisciplinary services in the fields of environmental science and engineering, health, ecology, aquatic sciences, geology and hydrology, atmospheric science, and environmental chemistry. We are currently seeking a Mid-Level Environmental Scientist/Planner for our San Francisco, CA office.  Qualified candidates will have at least a B.S. degree in Environmental Planning, Environmental Studies, Environmental Toxicology, or a related field. The ideal candidate will have 2-5 years of experience in environmental consulting. The candidate should have direct experience and knowledge of California regulations, assisting in research for NEPA and CEQA planning documents; preparing or assisting in preparation of technical sections of NEPA and CEQA planning documents, and knowledge of environmental permits (CWA 404/401, NHPA 106, ESA Section 7). Experience with air quality evaluations, site assessment, and/or risk assessment as well as field activities, including surface and groundwater sampling, storm runoff and sediment sampling, and biological monitoring, and preparing technical reports is beneficial.  Selected candidate will assist in data gathering; conduct impact analyses; write sections for CEQA/NEPA documents; assist in preparing permit applications; coordinate with sub-consultants and project team members; and interface with regulatory agencies. Responsibilities could include assisting with other aspects of site remediation projects and supporting field activities as well as assisting Project Managers with budget and schedule tracking and other project management duties.  Competitive salary is commensurate with experience. Integral Consulting Inc. provides an exceptional benefits package with company-subsidized insurance, and an exciting work environment with opportunities for significant professional growth. To apply, please visit our Careers webpage at http://www.integral-corp.com/careers. Applicant information will be kept strictly confidential. All offers of employment are contingent on candidates passing an employment history screening and, if applicable, a degree verification. Offers of employment for some positions may also be contingent on candidates passing a federal, state, and county criminal background and Watch List screenings and a drug and alcohol screening. Candidates for whom this is a requirement will receive written notice. All screenings will be done in accordance with all local, state and federal laws.  Integral Consulting Inc. is an equal employment opportunity employer and is committed to a proactive program of affirmative action and diversity development. Integral Consulting Inc. provides equal opportunity in all of our employment practices to all qualified employees and applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, disability, marital status, military, veteran or VEVRAA protected veteran status, or any other category protected by federal, state, and local laws. The “EEO is the Law” poster can be viewed here: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf."}