{"jobID": "2757507981", "jobLocation": "Redwood_City_CA", "jobTitle": "Senior Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.shopkick.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "176000", "jobDescription": " Shopkick is the most engaging rewards program, with an enthusiastic community of users who spend more time in-app and web than any other shopping experience. For consumers, we bring moments of joy to everyday shopping, dining, and leisure activities by offering fun ways to earn rewards (that we call kicks). They are similar to points in a mileage rewards program and can be redeemed for a wide variety of gift cards. For brands and retailers, we drive sales by providing high consumer engagement along the entire path to purchase--without the use of margin dilutive coupons. Our unique pay for performance model has been proven to deliver high ROI, driving incremental traffic, visits to shelves and stores, and sales across platforms: online, mobile and in-store. Some of our leading partners include Best Buy, Clorox, Coty, GSK, Georgia Pacific, Marshalls, Nestle, Purina, TJ Maxx, and Unilever, among others. Shopkick is available for free on the iPhone from the App Store and for Android on Google Play.  Shopkick is in search of a Senior Data Engineer. The Senior Data Engineer will be working with a team of Engineers, Data Analysts, and Data Scientists and will report to the Director of Architecture. The successful candidate will evangelize good data practices across the company, and work on a cutting-edge stream-based data platform running in the cloud. Essential duties and responsibilities may include, but are not limited to: Provision and configure a Spark cluster in GCP for machine learning projectsApply a machine learning model to a stream of data flowing through StreamSetsAnalyze reporting requirements and design appropriate tables in our data warehouseCreate tools to enable A/B test analysisBuild a quick, scalable in-house funnel analysis toolParticipate in architecture reviews to make sure that data considerations are taken into account in all new projectsQualificationsB.S., M.S. or Ph.D. in Computer Science or similar applied technical fieldExcellent programming skills using Python, Scala, or Java3+ years experience with big data technologiesFamiliarity with SQL and NoSQL technologiesExperience with Tableau, Superset or other reporting toolsExperience with algorithms; understand general machine learning/data mining conceptsExperience managing a Production Hadoop clusterExperience with Google Cloud Platform is a plusAny unsolicited resumes/candidate profiles submitted through our website or to personal email accounts of employees of Shopkick are considered the property of Shopkick and are not subject to payment of agency fees."}