{"jobID": "2830844303", "jobLocation": "Ada_MI", "jobTitle": "Apartment Maintenance", "companyRating": null, "companyInfo": {"Website": "www.mvg.com", "Headquarters": "Dayton, OH", "Size": "501 to 1000 employees", "Founded": " 1963", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Miller-Valentine Group, a leader in providing real estate solutions for both commercial and multifamily markets throughout the Midwest and Southeast, is seeking EXPERIENCED and MOTIVATED individuals who are looking for a rewarding and stable career. We offer comprehensive benefits including Medical, Dental, Vision, Life & Disability, Flexible Spending and Wellness Program.PTO within 6 monthsPaid Holidays401k + MatchTraining and Development programs Miller-Valentine Group, Residential Property Management division, is seeking a full time Residential Property Maintenance Technician for our luxury apartment community, Stone Falls of Ada, located in Ada MI.PRIMARY RESPONSIBILITIES: Provide property maintenance needs including repair of basic carpentry, plumbing, electrical mechanical systems.  Respond to resident or management Service Requests for occupied apartments.  Maintain apartment units at occupancy ready status.  Preserve physical integrity of the community ensuring a safe, secure, and comfortable living environment. REQUIREMENTS:Minimum of 2 years maintenance experience. Apartment maintenance is ideal.HVAC Certified is highly desirable.Proven plumbing, electrical and painting experience.Must have own tools and transportation, and ability to respond to after-hour emergencies. Our Multifamily division has been developing, building and managing quality housing for more than 30 years, producing over 15,000 multifamily units from urban neighborhood revitalization to luxury living. Visit our website at www.mvg.com or www.yournextplacetolive.com . Miller-Valentine Group is an Equal Opportunity Employer/M/F/D/V and is looking for diversity in candidates for employment.APPLICATION INSTRUCTIONSPlease email your resume in .doc, .docx, .pdf, .txt, .rtf, .html, or .ascii format to the address below. If you wish to enclose a cover letter, please include it in the body of your email message.Email Your Resume© 2018 Miller-Valentine Group  Applicant Tracking System Powered by"}