{"jobID": "2828676034", "jobLocation": "Chicago_IL", "jobTitle": "Business Projects Analytics Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.luriechildrens.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2012", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " General Summary of Position Responsibility:  Assist with internal strategic projects playing a key role in the market expansion strategy of Lurie Children’s Hospital. Works in close concert with Lurie Children’s Physicians, Nursing, Corporate Outreach, Marketing and Strategy leadership and clinical teams to promote Lurie Children’s programs, services, providers, and expand outreach and community partnerships and engagement and grow awareness of Lurie Children’s brand. Develop and maintain competency in the use of market intelligence software to understand current market trends, analyze activity and uncover new opportunities for growth of Lurie Children’s primary care and sub-specialty services.Share market intelligence with hospital leadership, providing feedback and preparing reports as requested.Work with Medical Center leadership to develop inputs for ambulatory growth, physician recruitment and space planning strategy.Work with Outreach team to prepare annual partnership assessments, develop inputs new location strategy, and evaluate potential strategic opportunities.Collaborate closely with operational process owners to develop and refine strategic plans to effectively achieve the desired outcomes including budgetary needs.Performs job functions adhering to service principles with customer service focus on innovation, service excellence and teamwork to provide the highest quality service to our patients, families, co-workers and others.Other job functions as assigned.Bachelor’s degree in Business Administration or equivalent required. Master’s degree in business administration or health care administration/management highly preferred.A minimum of 5 years professional work experience, with health care industry experience preferred.Demonstrated skills in strategy, business development, outcomes measurement, and relationship building.Possesses a broad understanding of and active interest in the pediatric healthcare market place and ability to identify threats and opportunities based upon changes in the market place.Demonstrates strong interpersonal skills and the ability to work effectively with multiple levels of organizational staff from front line to senior leaders."}