{"jobID": "2721898927", "jobLocation": "Chicago_IL", "jobTitle": "Manager, Data Engineering", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "110000", "jobDescription": " About the role  The Data Engineering team helps our clients drive the right decisions for their business through data and analytical insights. It ensures that clients can access, interpret and analyze data to come up with intelligent courses of action in all areas of their business.  As Manager of Data Engineering, you will help our clients turn information into insights. You will manage the design, development and implementation of data analytics and modeling strategies and ensure that Avanade teams and clients know how to manipulate and analyze complex data. Our clients will look to you for help in developing the predictive analytic capabilities needed to outperform their competition.  Day-to-day, you will: Work with sales teams to provide subject matter expertise and solution support on proposalsManage the requirements gathering, analysis and design phases of engagementsConduct quantitative and qualitative analyses of large and complex dataDeliver data to end users using common desktop programsProvide thought leadership around best practices in analytics platforms, business intelligence, data management and Big DataProduce reports that show key performance indicators, improvement opportunities, and problem root causesIdentify new analytics tools and techniquesCreate and maintain report forms and formats, information dashboards, data generators, canned reports and other end-user information portals and resources. About you  You are a data geek who knows how to get to so what? You understand how to turn piles of data into actionable insights that our clients can use to out-maneuver their competition. You can explain complex analytical concepts in nontechnical language that business people can understand.  You likely possess these key skills and qualities: Experience working with analytical models or techniques and the ability to apply these methods to solve business problemsExperience working with statistical and data visualization tools and techniquesExperience in structured problem-solvingStrong project and people management skillsAdvanced Microsoft SharePoint, PowerPivot, SQL Server Reporting Services and Excel skills. You likely have at least five years of quantitative analysis in a business setting, including building statistical models. Your credentials will be strengthened with at least three years in a management role and three or more years working in management consulting. You likely have a Bachelor's degree in data science, economics, statistics or a related field and, ideally, a Masters degree.  About Avanade  Avanade leads in providing innovative digital services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem. Our professionals combine technology, business and industry expertise to build and deploy solutions to realize results for clients and their customers. Avanade has 27,000 digitally connected people across 23 countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation. Learn more at www.avanade.com.Qualifications"}