{"jobID": "2791185770", "jobLocation": "Chicago_IL", "jobTitle": "Business / Data Analyst - Nielsen / IRI Experience", "companyRating": null, "companyInfo": {"Website": "www.creativecircle.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " The Creative Group, Aquent, 24 Seven Talent"}, "estimatedSalary": null, "jobDescription": "Position Business / Data Analyst - Nielsen / IRI ExperienceLocation Northern SuburbsStarts ready to interviewDuration Full TimeStatus Full TimeRate $60-$70K + 5% DOE Our client just north of the city is seeking a Business / Data Analyst with 3-5 years of experience to join their team on a fulltime basis.  This client is accessible by both the Purple line and Metra + will have flexibility to work from home 1 day a week + has an amazing benefit package and culture.  Must have Nielsen syndicated POS database experience to be considered!  The Business / Data Analyst will be responsible for: Develop insight-led category recommendations through analysis of promotions and pricingUnderstand major customer performance and develop presentations to expand current businessProvide analysis and recommendations to customers and the business with regards to range management, promotions, pricing and displayBuild/optimize regular reporting (monthly, quarterly)Create short, mid and long-term plans to include budget and resource requirementsPrepare and deliver new product roll out presentations to priority customers and develop ongoing relationshipsThe ideal Business / Data Analyst:CPG experienceClient facing, comfortable telling a storyData driven, analytical, strong presenter able to articulate data concepts to non-expert audiencesExpert using Nielsen and IRI analytical toolsAdvanced MS Excel and PowerPointHighly organized to manage various priorities Submit resume (and samples if applicable) to: cc131@jobalert.creativecircle.com"}