{"jobID": "2837717482", "jobLocation": "San_Leandro_CA", "jobTitle": "CNA Certified Nursing Assistant Full Time Nights SFBA", "companyRating": "2.8", "companyInfo": {"Website": "www.kindredhealthcare.com", "Headquarters": "Louisville, KY", "Size": "10000+ employees", "Founded": " 1985", "Type": " Company - Public (KND) ", "Industry": " Health Care", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Select Medical, Genesis HealthCare"}, "estimatedSalary": "15", "jobDescription": " Description:  Kindred Transitional Care Hospitals has a career opportunity for you as a Certified Nursing Assistant! As a division of Kindred Healthcare, we play a vital role in the recovery process for chronic, critically ill and medically complex patients who require acute care and rehabilitation over an extended period.  Your career growth begins when you join an interdisciplinary team, where doctors, nurses, therapists and other experts work together to form individualized care plans for our patients and residents. Opportunities through our development programs, training seminars and university partnerships, not only allow for continual career growth but emphasize our commitment to investing in our employees and developing future healthcare leaders.  The goal of our team is to deliver intensive, multidisciplinary care and transition patientsâ home or to a lower level of care as quickly and safely as possible. Each employeeâs dedication is essential to meet and exceed the needs of each patient, resident and family we serve. Ranked as one of Fortune magazineâs âMost Admired Healthcare Companyâ for 8 years, Kindred welcomes you to join our team and build a career that touches lives.  As a Certified Nursing Assistant / CNA you will\\: Assist nursing staff with patients' personal care, emotional support, and activities of daily living.More complex duties performed under supervision of professional nursing personnel. cna, cna nursing assistant can, caregiver, home health aide, direct care, pca, Certified Nursing Assistant, Certified Nurses Assistant, Certified Nurse Assistant, CNA, Nursing Assistant, Nurse Assistant, NA, Hospital, Healthcare, Long Term Acute Care, Transitional Care Hospitals, Aid, Aide, Assistant, Assisted Living Facility, Caretaker, Caregiver, care giver, Certified Medical Assistant, Certified Nursing Assistant, Certified Nurses Aide, CMA, CNA, CAN job, Companion, Customer Service, Direct Care, Direct Support Professional, Daily Living, Entry Level, Entry Level Job, Facility, Healthcare, Helper, HHA, HHA job, Home Care, Homecare, Homecare Assistant, Home Care Assistant, Home Health, Home Health Aide, Homemaker, Home maker, Hospice, Hospice Aide, Hospital, housekeeping, PCA, PCT, PCW, Patient Care Aide, Patient Care Attendant, Personal Care Aid, Personal Care Aide, Personal Care Attendant, Personal Care Worker, Preparing meals, Private Duty, Private Duty Aide, PRN, PDM, Part Time, Part-Time, Retail, Running errands, sitter  #MON-HD  #LI-HD  Qualification:  As a Certified Nursing Assistant / CNA you will have\\: Completion of course for nursing assistants.Current Nursing Assistant Certification.BCLS Certification.Minimum six months experience in acute or long term care facility. If you are a current Kindred/RehabCare employee Click Here."}