{"jobID": "2744026524", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst - Morningstar Experience", "companyRating": "3.3", "companyInfo": {"Website": "www.solugenix.com", "Headquarters": "Brea, CA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": "Solugenix is a professional staffing and IT consulting firm, committed to meeting the needs of its candidates and clients. When you join Solugenix, you join the longest serving independent IT consulting firm in the nation, distinguished by a history of industry innovation. Long before they were commonplace, our pioneering systems became the DNA of today’s technologies. From firsts in cell phone billing systems, to web-based mapping and routing solutions, to fast food help desks, Solugenix drives IT solutions around the world.At Solugenix, you become part of an expert team making a difference by delivering value for some of the world’s largest firms in finance, medical device, pharmaceutical, consumer packaged goods industries and more. Join Solugenix today and become part of an established team poised to continue creating innovations for the future of our world! CHOOSE INNOVATION. CHOOSE VALUE. CHOOSE SOLUGENIX!Looking for candidates with financial services experience and experience with financial services systems such as Morningstar/Bloomberg/Capital IQ or similar.Title: Data Analyst with Morningstar experienceLocation: Los Angeles, CADuration : 12 MonthsMode of Hire: Telephonic & Face to Face(Mandatory)Position Comments: -Candidates with financial services experience and experience with financial services systems such as Morningstar is a plus. - Will perform data gathering, data transfer, data analysis and data cleansing -Assist in streamline business process and building business solutions. - Strong SQL experience and SQL queries - Programming experience is a plus and experience with programming languages such as Java or Python. - Will perform data automation. - Experience with Tableau is a plus. Job Description: Data AnalystThe Data Analyst partners closely with business, functional and technical resources to ensure only quality deliverables are put into production and also provides ongoing support of solutions. -Acts as a primary project resource with a focus on data cleanup and data governance. -Partners with business and functional resources to obtain a better understanding of current data issues and pain points. Develops a plan that alleviates pain points and improves the ability for the business to record and utilize data within Salesforce.com. Ensures that IT partners are building the solution in accordance with business needs. -Bridges the gap between the business and the Business Intelligence (BI) group to ensure that data is gathered, entered and saved in a manner consistent with business and BI needs. -Drives the development of solutions which will aid in the data capture, data cleansing, data monitoring, and reporting of customer data (dealers and financial advisors) and/or product data (mutual funds). -Coordinates and prioritizes daily activities and workload related to large and/or strategic projects. Deliverables may include a Data Cleansing Plan. -Manages and coordinates data development activities and projects. -Collaborates with IT partners to resolve production and data quality issues. -Applies validation and enrichment concepts to improve the quality and completeness of data. Develops and implements standard data quality and governance procedures. Deliverables may include: Governance model and procedures; Data quality standards; Introduction of appropriate reporting and transparency capabilities required to understand and manage the quality, storage and usage of information. Participates and may lead components of projects:-Works with leadership to help identify the project vision and how it translates into the project scope -Provides project leadership and point of accountability for project results -Delivers effective and consistent project communication to key stakeholders  A Successful Candidate:-Exercises good judgment when applying business and procedural knowledge in a complex environment -Demonstrates strong analytical and problem solving skills; ability to distill complex information into key points -Demonstrates the ability to work in a team environment; initiative to work and learn independently and proactively contribute to department goals; and ability to lead others while maintaining effective business relationships with associates throughout the organization -Demonstrates strong detail orientation, organizational, and multi-tasking skills; ability to effectively manage an unpredictable workload and meet established deadlines -Demonstrates strong written and verbal communication skills with a diverse group of associates; strong presentation skills; strong inter-personal skills -Demonstrates strong computer skills, especially a strong command in the Microsoft suite including Excel, PowerPoint, Word, and Visio -Requires a minimum of 5 years of relatable experience -Requires a Bachelor’s degree -General knowledge of mutual funds or experience in the investment management industry is preferred but not requiredBest Regards,Vinay Iruvanti,Technical Recruiter,vinay.iruvanti@solugenix.com 949-287-8287 - provided by DiceData Analyst, Morningstar, Data Gathering, Data Analysis, Data Cleansing, SQL, Java/Python"}