{"jobID": "2721723456", "jobLocation": "Irvine_CA", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.shipwire.com", "Headquarters": "Sunnyvale, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Data Analyst / Pricing ConsultantUnited States |  Irvine,  California  Job ID: 18539Job DescriptionPosition at Ingram MicroIngram Micro touches 80% of the technology you use every day with our focus on Technology Solutions, Cloud, and Commerce and Lifecycle Solutions. With $43 billion in revenue, we have become the world’s largest technology distributor with operations in 56 countries and more than 30,000 associates. We continue to strategically expand our global reach with 32 acquisitions since 2012.Join our Global Business Intelligence and Analytics team for an exciting opportunity to play an integral role in predicting emerging customer needs and developing innovative solutions for client corporations around the globe.We provide a unique competitive advantage through our data-driven consultation approach in shaping go-to-market strategies. Our culture of innovation and our meticulous execution helps our partners realize increased revenues and profitability for their business initiatives. Our team is highly specialized in digital marketing, data visualization and data sciences that can yield valuable market insights and craft effective strategies to capitalize on market opportunities at the right time.Your role:Define pricing strategy solutions and identify how pricing facts, data and decisions link to overall business goals.Analyze the macro market and internal business factors to strategically price products to maximize revenue and/or profit for countries around the globe.This role would be responsible for business planning and attainment which will require working cross-functionally between Sales, Finance and Product Owners.Utilizes reports of findings and creates appropriate materials to communicate the findings. He or she will maintain a broad understanding of Ingram Micro’s business model along with becoming educated on particular vendors, customers, and internal division’s business models and needs.As a Pricing Consultant II, the focus will be to define pricing issues and identify how pricing facts, data and decisions link to overall business strategy issues.Leverage B2B pricing experience to lead clients through sales improvements through Pricing.Act as a thought leader, providing practical recommendations and contributing to team discussions on implications of analysis; identifying implementation challenges.Champion and support new projects communicating its value and engage others to participate.Understand client’s objectives and translate business need into the pricing strategies.Present analytical findings to business leaders.What you bring to the role:Bachelor’s degree in a quantitative field such as: Statistics, Operations Research, Econometrics or Applied Mathematics and Advanced degree (MS or PhD) preferred.3+ years of experience in pricing or pricing consulting.Knowledge of basic statistics such as standard deviation, mean.Awareness of Machine learning and data mining and the ability to speak to its uses.Experience in analyzing large data sets, identifying trends and patterns preferred.Synthesize findings, develop recommendations and communicate results to clients and internal teams.Experience with cleaning, aggregating, and pre-processing data from varied sources.Experience with SQL queries for standard as well as ad hoc data mining purposes highly desired.Specialization in at least one of the following; database design, architecture and/or data integration.Subject matter expertise in at least 2 of the following: price optimization, price elasticity and customer segmentation. *This is not a complete listing of the job duties. It’s a representation of the things you will be doing and you may not perform all of these duties.Ingram Micro Inc. is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other protected category under applicable law."}