{"jobID": "2335792153", "jobLocation": "Battle_Creek_MI", "jobTitle": "Systems Integration Analyst/Data Integrity", "companyRating": null, "companyInfo": {"Website": "www.ageatia.com", "Headquarters": "Schaumburg, IL", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description This position is accountable for Data Analysis of the Customer Contract to the CRM 7.0 Promotion. to determine any issues and corrections regarding the CRM E1P Pricing Conditions or to determine if Promotions are missing. This role will identify data integrity issues, with a focus on Customer Contracts and Promotional compliance This position is part of the Sales Business Management Team, Data Integrity & Controls and reports to the Senior Manager Data Integrity and Controls Have a base understanding of the Sales Hierarchy details for DSD, Specialty, NSD and Sales Management in ECC E1P and CRM Territory Hierarchy in C1P as required for OI resolution Identify SAP and CRM data relevancy and usage to drive system accuracy, data analysis and to provide updates on contract issues to the Data Integrity Team. Understanding of, off invoice and other sales processes and functional interdependencies. Recognize and escalate issues identified as risks or opportunities for business improvement related to SAP/CRM/BWP. Identifies, develops and communicates data integrity issues or risks by providing communication with each business area. Responsible for utilizing SAP/CRM/B1P/B3P to identify detailed issues to the Data Integrity Team or IT for problem resolution for data loads and data systems accuracy. RequirementsSkills: Excel, Communications with Sales teams (or systems users), Email, systems or data maintenance experience preferred Experience: Prefer 5 years related working or educational experience Strong analytical and communication skills Advanced skills in MS Office, Sales Business understanding preferred SAP/BW Reporting experience preferred Systems conversion experience preferred Data integrity experience preferred Education: HS with Degree favorable"}