{"jobID": "2562400745", "jobLocation": "Milpitas_CA", "jobTitle": "Scientist", "companyRating": null, "companyInfo": {"Website": "www.vium.com", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us: Are you looking to disrupt the drug development process while leveraging automation, custom hardware and sensors, deep learning and big data? Yes? Heres the chance for you to make this a reality. Vium empowers biomedical investigators with technology that accelerates the preclinical drug discovery and development pipeline. Researchers can design, run, and analyze experiments that rapidly surface insights and high volumes of quality data. The platform improves the speed and reproducibility of preclinical research so that it is more predictive of how drugs perform in humans. The result is that better therapies get moved more quickly to patients who need them. Founded in 2013, we have a proven product, an awesome team, happy clients, smart investors and advisors, and plans to double in 2018 and beyond. The Role: We are seeking a highly motivated Scientist with experience to join our team. Meaningful Things Youll Do:Push the limits of the Vium technology to develop and validate creative, disease relevant in vivo assays.Design, execute, interpret and discover novel features from in vivo animal models.Work in close coordination with the technology team to achieve goals.Monitor, review and critically interpret published work to guide internal research.Be a thought leader for Vium by publishing scholarly articles, speaking at conferences.Flexibility to work with models and in therapeutic areas that are outside of expertise.Work effectively with external academic, foundations, biotechnology, and pharma partners.Education and Experience:Ph.D.Minimum 4+ years in immunology/inflammationExtensive experience conducting rodent experimentsA proven track record of productivity, effective verbal and written communication and interpersonal skillsEnjoy working as part of a team and making those around you successfulMore About Our Culture: Were a group of talented individuals across multiple disciplines, coming together to deliver great engineering! We:Say what well do and then do it! As a growing team, weve increased collaboration between roles of development and operations.Have an attitude of shared responsibility and value building quality into the development process.Have a wide range of interests, which is why were in this company in the first place.Are focused on results more than hours-in-a-chair-at-the-office.Have great values and sense of community, while encouraging growth.Love what we do and love being part of a team that rewards trying new things.What We Offer:Good salaries and benefits. Who doesnt want that?Stock optionsCatered lunch most days and a fully stocked kitchen with healthy snacks and delicious drinks (Hungry anyone?)Relaxed office in Milpitas with a casual environmentCompany team building days, fun parties, including time in the summer when we can spend time with friends and family. Our corporate office is in San Mateo and the remote-controlled lab is in the South Bay  If you are interested in applying for this role, please submit your CV along with a cover letter stating why you feel you are qualified for this job. Thank you."}