{"jobID": "2699069666", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.completegenomics.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": "Job Title: Sr. Scientist (Fixed Term) Job Summary This is a position for a motivated scientist with extensive hands-on experience in molecular biology techniques, biochemistry of DNA processing enzymes, and reagent handling processes. The position includes development, validation, and/or tech transfer of the company’s proprietary sequencing chemistry for fast and low cost genome sequencing. The scientist will interact on a daily basis with teams working on different biochemistry, instrument and software development aspects of our technology. Major Duties and ResponsibilitiesPerform various R&D; assignments that require knowledge of molecular biology and biochemistry knowledge, concepts, and techniques.Design, research, develop and implement DNA sequencing chemistries.Participate and contribute in weekly group meetings on experimental design, activity planning, and troubleshooting, including reporting experimental results.Execute experimental work plans in collaboration with other group members, providing technical expertise, material and hands-on support as needed to achieve departmental goals.Collaborate and communicate experimental results with other development and production groups.Perform other work related duties as assigned.Minimum QualificationsBachelor's degree in molecular biology or related field with a minimum of five years of experience; or Master’s degree with a minimum of 3 years of experience; or equivalent combination of education and experience.PhD degree in a life science (Biology, Biochemistry, Molecular Biology, Genetics) or related field with a minimum of 2 years of experience; or equivalent combination of education and experience.Experimental Biochemical or Molecular Biology hands-on skills are essential, as well as experience with Good Laboratory Practices and aseptic techniques.Familiarity with systems and processes used in molecular biology production environments, including use of SOPs and LIMS.Excellent analytical, organizational, and planning skills, with great attention to detail and record-keeping in both lab notebook and electronic documentation.Ability to carry out and develop standard operating procedures involving basic and advanced laboratory techniques, calculations, materials measurement, operation of laboratory equipment and record keepingAbility to follow protocols and pay attention to detail, with good problem solving and analytical thinking skills requiredDemonstrated strength in working within a team and with cross-functional partners, as well as ability to work effectively independently. Should be well organized, self-motivated and possess excellent time management skills.Excellent interpersonal and communication skills, both verbal and written.Ability to multitask and adapt to rapidly changing requirements, priorities and tight schedules.Strong technical ability and demonstrated proficiency in performing and troubleshooting complex molecular biology systems.Functional capability with standard data analysis tools.Competency in Microsoft Office applications and general computing skills required.Preferred QualificationsMicroarray experience is a plus.Hands-on experience with robotic platforms and process automationExperience with product development in a life science company.Demonstrated experience operating and troubleshooting various liquid handling systems or process automation systems in either R&D; or production environments.Experience with product development stage gate processes, and design control. Complete Genomics does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website, employees or Human Resources.  Complete Genomics will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Complete Genomics and will be processed accordingly without fee.  Complete Genomics has the sole discretion to determine with whom we will enter into a contract. If you wish to work with Complete Genomics, please contact the Human Resources department at careers@completegenomics.com . All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status."}