{"jobID": "2739596738", "jobLocation": "Somerville_NJ", "jobTitle": "Senior Data Scientist, Data Sciences and Advanced Analytics R&D; Technology", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "124000", "jobDescription": " Medical Devices, a division of the Johnson & Johnson Family of Companies, is recruiting for a Senior Data Scientist, Data Sciences and Advanced Analytics R&D; Technology. This position is in either Somerville, NJ or Irvine, CA and reports to the Head of Data Sciences in R&D; Technology.  Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in health care to touch the lives of over a billion people every day, throughout the world.  Medical Devices represents more than 60 manufacturing sites and 26,000 employees who plan, source, manufacture and deliver high-quality and cost-effective medical products to our customers around the globe each day. Work of the MD organization supports a multitude of product platforms, new products and delivery systems that are used in a wide range of procedures throughout the healthcare industry, including interventional cardiology, electrophysiology, minimally invasive surgery, hospital sterilization, clinical laboratory testing, diabetes management, joint replacement surgery and vision care.  The global Medical Devices R&D; Technology organization works closely with the R&D; organization and innovation groups to deliver innovative technology solutions to advance product development and medical device solutions to transform global health. The Data Sciences department is focused on unleashing the value from data and enable data driven applications and innovation for the Medical Device franchises in R&D; and Commercial applications.  Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer.  We are looking for an outstanding Senior Data Scientist expert who is interested designing, developing, and fielding advanced analytics solutions that innovate and have direct impact to Patients, Medical Devices and healthcare technology solutions. The role requires both, in depth and hands on knowledge of existing advanced analytics practices and approaches including Machine Learning & Artificial Intelligence and the creativity to discuss innovation opportunities with business partners and shape cutting edge applications and proposals. The Principal scientist needs to be comfortable to work in a multidisciplinary environment to drive business solutions.  There are many opportunities to explore and analyze data and build insightful solutions using data in the Medical Devices business. This drives the excitement and passion of data scientists at Medical Devices as they can help business units identify opportunities and lead them to leverage data to create business value. We are looking for a specialist in Advanced Analytics who explores opportunities in Medical Devices and stays on the cutting edge of data science research, artificial intelligence and big data technologies by leading, implementing and creating novel solutions to influence decisions at various levels in the organization and help shape medical device solutions of the future.  The Senior Data Scientist will:  Directly participate in the delivery of data-driven research projects that have a direct impact on business results or product design for Medical Devices globally.  Will be the analytical lead and actively contribute to highly visible, complex projects, programs or solutions that are critical to Medical Devices.  Explore the space of analytical opportunities for a given problem and execute with a sound analytical strategy.  Work effectively as part of a team and collaborate across business and functional groups to share results and leverage the work of project members to meet checkpoints and accomplish team objectives on time.  Acquire, augment, analyze and act on complex, high-dimensional data sets using high performance computing and advanced algorithms as required.  utilize a strong understanding of the current and future state technology and applications in all aspects of a scientific challenge.  Manage relationships with partners across the various functions of the enterprise.  Contribute/perform analyses on health care data sets in collaboration with business partners.  Works closely with colleagues to keep up-to-date with the latest approaches and advances in data science and evaluate vendor tools and external data sets as required  • Directly participate in the delivery of data-driven research projects that have a direct impact on business results or product design for Medical Devices globally.  • Independently hypothesize, design and execute projects or analyses with hands-on involvement.  • Routinely work with complex, high-dimensional data and integrates and analyzes data sets using high performance computing and advanced algorithms as required  • Will be the analytical lead and actively contribute to highly visible, complex projects, programs or solutions that are critical to Medical Devices.  • Works closely with colleagues to keep up-to-date with the latest approaches and advances in data science and evaluate vendor tools and external data sets as required  • Utilize a strong understanding of the current and future state technology and applications in all aspects of a scientific challenge.  • Manage relationships with partners across the various functions of the enterprise.  • Work effectively as part of a team and collaborate across business and functional groups to share results and leverage the work of project members to meet checkpoints and accomplish team objectives on time.Qualifications• M.D. or Ph.D. degree in Computer Sciences, Computer Vision, Data Science, Statistics, Machine Learning & Artificial Intelligence, Medical Informatics, Computational Biology or a related discipline is required.  • A minimum of 3 years of combined industrial/postdoctoral experience is required.  • Familiarity with large datasets, handling of biomedical datasets and understanding of data analysis workflows is required.  • Strong working knowledge of data mining algorithms including supervised and unsupervised machine learning techniques including random forest, clustering, neural networks & deep learning is required.  • Proficient with one or more programming language such as Java, R, Python or Scala is required.  • Experience with Natural Language Processing or text analytics methods is preferred.  • Familiarity with cloud computing is required.  • Experience with advanced technologies such as Robotics, IoT, AR, VR is preferred.  • Understanding of technological landscape in advanced analytics and computing is required.  • Excellent communication, interpersonal, verbal, and written skills are required.Primary Location United States-New Jersey-Somerville Other Locations North America-United States-California-Irvine Organization Ethicon Inc. (6045) Job Function Info Technology Requisition ID8975180415"}