{"jobID": "2818865798", "jobLocation": "Warren_NJ", "jobTitle": "Country Medical Affairs Senior Scientist-Oral Healthcare", "companyRating": null, "companyInfo": {"Website": "www.gsk.com", "Headquarters": "Brentford, United Kingdom", "Size": "10000+ employees", "Founded": " 1830", "Type": " Company - Public (GSK) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, AstraZeneca, Merck"}, "estimatedSalary": null, "jobDescription": "Your Responsibilities:Position Summary: The purpose of this role is to support the delivery of medical excellence within the regional Clinical Development Medical Affairs (CDMA) organization to deliver business results and ensure effective deployment of Medical Governance framework across the GSK Consumer Healthcare business focused in Oral Healthcare.  This position will support the Regional Medical Affairs lead and department delegates in driving the efficiency and effectiveness of the CDMA Community, plus ensuring that collaboration with the various business functions that rely on the CDMA functions to drive and implement product strategies including Global Category Leads, Regional Commercial Leads, Regional Commercial Operations Directors and GM’s, Safety, Legal, Regulatory, Corporate Compliance functions is performing optimally.  Key Position Responsibilities:  Enhancing Global Medical Community Operating Model to drive results for GSK Consumer Healthcare  Implementing process improvement plans to enhance organizational efficiency and continuous improvement.  Supporting delivery of KPIs to measure success / improvement areas  Supporting the Country Medical Affairs Principal Scientist in delivering the annual goals and objectives  With oversight from Regional MA lead and/or Country Medical Affairs Principal Scientist drive medical communication and publication strategy across the Oral Healthcare category.  At a regional level, drive project execution timelines within budget  Key contributor to Regional Medical Affairs Team continuous improvement initiatives  Planing and executing scientific engagement activities in Oral Healthcare  May act as an interface on behalf of GSK with external organizations including Health Authorities, External Experts, Oral Healthcare Associations (e.g., ADA, ADHA, OHA)  These activities will involve building networks with and working closely with representatives from cross-functional teams within Regions and Local Operating Countries (LOCs).  Other Key Responsibilities:  With oversight from the Country Medical Affairs Principal Scientist lead provide medical input to region regulatory applications, new product development and clinical activities, and business development and acquisition initiatives  Provide medical and technical training of region affiliates about GSK Consumer Healthcare products and competitors  Act as a GSK medical voice in all interactions with consumers, physicians, dentists, dental hygiensts, dental societies, institutions and government bodies. Includes though not limited to: Medically support customer enquiry systems which respond to enquiries and complaintsMedical input to answer consumers relations questions and complaints as requiredWorking with the medical information department to evaluate consumer contacts to identify trends and product’s opportunities/ weaknessesCollecting, analyzing and communicating medical information to regulatory, medical, sales, marketing and commercial functions, enabling opportunities to be effectively exploited, while complying with all relevant regulations and professional standards  Partner with Pharmacovigilance team in order to ensure that GSK activities are conducted in accordance with applicable law and Company policies  With oversight from Country Medical Affairs Principal Scientist support Medical Affairs activities including but not restricted to:Input on medical concepts, ethics and consumers safety and well-being,Development of accurate, technically supported and business oriented product claimsMedical input to data collection and analysis of GSK products and competitorsDevelopment, evaluation and coordinating medical approval of promotional materials  Why You?  Basic qualifications: BS Degree in Dental Hygiene or PharmD, or PhD  4 years of clinical experience in Oral Healthcare  Demonstrated business acumen  Demonstrated project management and organizational skills.  Proactive multiple tasks simultaneously, make decisions and respond to tight timelines, with ability to anticipate and plan, handle.  Preferred qualifications: DMD/DDS Medical Affairs industry experience (at least 3 years) operating in a commercial environment, preferably in the Pharma, OTC and/or Oral Healthcare space.  4 years of strong, multi-discipline experience including dental healthcare, clinical development, operations, project management or other functions in order to act decisively to manage the operational needs of the Global Medical Community with minor direction.  Current dental or dental hygiene licensure  Ability to manage and influence discussions with others  Ability and eagerness to challenge status quo; make quick decisions; and lead/operate successfully in an empowered organization.  Strong communication, influencing and negotiations skills. Ability to facilitate alignment and collaboration across groups/regions.  Strong verbal and written communication skills in English  Strong computer literacy including competent in Microsoft Office software"}