{"jobID": "2261934296", "jobLocation": "Santa_Clara_CA", "jobTitle": "Swim Instructor", "companyRating": null, "companyInfo": {"Website": "www.bayclubs.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who We Are: We believe life is made up of moments: playing bocce with friends, going for a dip on a hot summer day, and saluting the sun just because its up. Somewhere along the way, someone told us that those moments are for Saturdays, not Mondays. That we should work fifty weeks each year just to save up for two weeks of happiness. At the Bay Club, we believe these moments are for every daybecause we believe in living life happy. And that means focusing on what really matters like family, good health, and finding the time to have fun. What We Do: Founded in 1977, the Bay Club enjoyed many industry firsts, eventually moving beyond strictly fitness to forge a unique niche in the hospitality realm by incorporating resort level programs and services into our clubsand by grouping complementary properties into amenity-rich campuses. Bolstered by a pioneering spirit, a forward-thinking company culture, and a belief in helping members to live life happy, the Bay Club has created a modernized country club experience through innovations such as the 77 Social Club and Connect Workplace Suites, along with thoughtful amenities, including an in-club Starbucks café and outdoor lounges with shuffleboard courts and fire pits.  The Bay Club Company is headquartered in San Francisco, with clubs from Marin to San Diego and a team of more 3,000 associates who are guided by integrity, innovation, growth, and community. Sparked by imagination and a progressive culture, the Company has entered a growth plan that has taken it from 12 clubs to more than 20 properties in an 18-month period, with continued accelerated growth anticipated over the next five years. And were looking for talented and motivated individualswho also believe in living life happyto join our quickly growing team! What We Can Offer You:Competitive compensationMedical, dental, and vision plansAdvancement opportunitiesComplimentary full use of Bay Club facilitiesDiscounts on services, lessons, amenities, and F&B; products.About the Position The Aquatics Department at Bay Club Santa Clara, is currently seeking a motivated and ambitious Swim Instructor. Under the direction of the Aquatics Director, a Swim Instructor is responsible for providing private and group swim instruction to clients; maintaining a safe and effective learning environment while focusing on the fulfillment of clients swimming goals; achieving personal revenue goals; and providing the best customer service and hospitality to members and guests. ResponsibilitiesProvides instruction; provide specific and corrective feedback to each client at each sessionDesign and deliver effective and rewarding sessions and workoutsMaintain accurate, current records on all clients progress; follow progression guidelinesEnforce all pool rules and aquatics center and club policiesMaintain a consistent work schedule; arrive punctually for sessionsProvide excellent communication with the parents of swimmers as well as all members and staffActively participate in events, programs meetings and trainingHelp keep pool deck clean, safe and organizedFollow all safety procedures and precautionsQualificationsCurrent Red Cross Lifeguarding, CPR, AED & First Aid certifications or Swim Coach Safety TrainingExperience in Competitive Swimming as a participant or a coachUnderstand the current best practices in learn-to-swim skills, competitive swim techniques and childhood developmentSales and Marketing Knowledge of principles and methods for showing, promoting, and selling services. This includes marketing strategy and tactics, and sales techniquesKnowledge of water hazards, lifesaving techniques and first aid, recognize hazardous situations, and adopt effective courses of actionRequires proficient swimming ability and the proper application of rescue and first-aid techniquesStrong interpersonal skillsHours: Will vary.Physical RequirementsWork is typically performed outdoors in varying and occasionally extreme (hot) weather conditions.Ability to arrive at work on time for all scheduled work shifts required. Ability to work weekends, evenings, and holidays required.Must be flexible, adaptable, and readily able to adjust to changes in work environment.Position requires daily public contact.Must be able to work in a hot environmentMust occasionally sit for extended periods and regularly walk around the facilityMobility around and in the pool.Contact Please submit resume, cover letter, and details regarding your availability on the application form here An Equal Opportunity Employer The Bay Club Company (TBCC) provides equal employment opportunities without regard to race, color, religion, national origin, age, ancestry, disability, marital or family status, medical condition, AIDS or AIDS related condition, sex or sexual orientation, gender identity or expression, veteran status, genetic information or any other consideration made unlawful by federal, state, or local laws. "}