{"jobID": "2757057741", "jobLocation": "Washington_DC", "jobTitle": "Junior Software Engineer", "companyRating": "3.1", "companyInfo": {"Website": "www.peraton.com", "Headquarters": "Herndon, VA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " OverviewThis position will directly support the Computer Security Section of the Naval Research Laboratory as it conducts advanced research and development to maintain information superiority of the DoD and US Navy.  This customer's research attempts to bridge the gap between infrastructure protection requirements and the current state of information security. They respond to the immediate security requirements of the Navy and DoD, and maintain a vision for emerging technologies that would affect the information battle space of the future.ResponsibilitiesRESPONSIBILITIES:Develop and implement security architectures for enterprise systemsCreate and implement federated identity management and access control solutions for data sharing among different organizationsProvide data protection mechanisms that satisfy need-to-knowPerform vulnerability assessments of systemsDevelop applications using tools such as JDBC and TOMCAT (non-exhaustive list) to enable access to databases housing enterprise data to support the development of security measures for a Joint Military project.Candidate must be proficient in the development of applications in Java with the capability to handle massive data inputs from various platforms and other sources.Proficiency with the development of security measures in a heterogeneous environment is a plus. QualificationsREQUIRED QUALIFICATIONS:Master's Degree in Computer Science, Computer Engineering, Mathematics or other Computer related degree with heavy focus on research.0 - 2 years of relevant experience.SECURITY CLEARANCE:This position requires the candidate be able to obtain a Secret clearance and the ability to maintain the clearance. About PeratonPeraton provides innovative, reliable solutions to the nation’s most sensitive and mission-critical programs and systems. Peraton has significant experience providing highly differentiated secure communications, space, and technology solutions to key customers, and has become a trusted partner on missions that are critical to the security priorities of the United States. Capabilities include complex software and technology services and solutions, as well as end-to-end mission operations abilities, including Software Systems Development, Cyber, Modeling & Simulation, Mission Operations, Signal Intelligence (SIGINT), and Quick Reaction Capabilities (QRC) / Research & Development. The company is headquartered in Herndon, VA, with approximately 3,500 employees across the U.S. and Canada.EEO StatementWe are an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law."}