{"jobID": "2691007174", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.addepar.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": "The Data Solutions team is responsible for integrating clients portfolios into Addepar, consulting clients on their trickiest portfolio data challenges, and ensuring data quality and timeliness. To fill this role we are looking for individuals who have exceptional analytical skills, portfolio accounting or securities knowledge, excellent verbal, written, and client presentation skills, and bring an engineering approach to all problems they encounter.Responsibilities Partner with data providers and development teams to configure business logic for new financial data integrationsBuild and maintain integrations that transform custodian data into Addepar Global Financial FormatOnboard new clients by identifying unique portfolio or reporting needs and enabling them in the Addepar systemParticipate in broad company initiatives to stand up new product functionality or servicesCollaborate with our Client Solutions team and Data Engineers to resolve data issues that impact our clientsRequirementsDeep knowledge/experience of the financial industry, securities modeling, post-trade processing or back-office systemsFacility with programming languages such as Java or RStrong SQL or Excel skills with the ability to learn other analytic toolsFamiliarity with scripting languages (e.g. Python) and understanding of object oriented programming concepts a plusAbility to to problem solve and understand key drivers of Addepar businessAdhere to Addepar values and team collaboration mentalityAddepar is the financial operating system that brings common sense and data-driven investing to our financial world. Addepar gives asset owners and advisors a clearer financial picture at every level, all in one place. It handles all types of assets denominated in any currency. With customizable reporting, financial advisors can visualize and communicate relevant information to anyone who needs it. Secure, scalable, and fast, Addepar is purpose-built to power the global financial system. Hundreds of single and multi-family offices, wealth advisors, large financial institutions, endowments, and foundations manage over $1 trillion of assets on the Addepar platform. Addepar has offices in Mountain View, New York City, Salt Lake City, and Chicago.At Addepar, we rely on a range of backgrounds, experiences, and ideas. We value diversity, and were proud to be an inclusive, equal opportunity workplace."}