{"jobID": "2659378819", "jobLocation": "Mahwah_NJ", "jobTitle": "Water Quality EIT/Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.hdrinc.com", "Headquarters": "Omaha, NE", "Size": "10000+ employees", "Founded": " 1917", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "About Us At HDR, we specialize in engineering, architecture, environmental and construction services. While we are most well-known for adding beauty and structure to communities through high-performance buildings and smart infrastructure, we provide much more than that. We create an unshakable foundation for progress because our multidisciplinary teams also include scientists, economists, builders, analysts and artists. That’s why we believe diversity is our greatest strength. HDR is proud to be an equal opportunity workplace and an affirmative action employer.  Watch our 'About Us' video  We believe that the way we work can add meaning and value to the world. That ideas inspire positive change. That coloring outside the lines can illuminate fresh perspectives. And that small details yield important realizations. Above all, we believe that collaboration is the best way forward.  HDR’s Water Quality Practice focuses on the application of physics, chemistry, biology, and modern mathematical modeling to understand the fate and transport of pollutants in the natural environment. One-, two-, and three-dimensional water quality models and processing tools, including visualization and animation routines, are routinely applied to problems associated with nutrients, dissolved oxygen, pathogens, metals and organic contaminants. Projects may include the design and execution of field monitoring efforts.  The primary responsibilities of the Water Quality EIT/Scientist include: Acquire, organize and analyze environmental data from a variety of sources.Set up and execute mathematical models.Perform quality-control checks on model input and results.Develop statistical and graphical (static and animations) comparisons of model results and dataParticipate in project meetings, proposal preparation, report writing and presentations. Keyword(s) Water Quality Scientist, Water Quality Modeler, job #148519,  *L-MP1 Qualifications • B.E./B.S. in environmental engineering / science required; M.E./M.S. in applicable area a plus. Would prefer candidates with 1 years relevant work experience, but will consider entry level candidates with strong educational credentials, particularly with a M.E./M.S.If educational background is in engineering, an EIT is preferred.Strong analytical and problem-solving skills.Strong oral and written communication skills.Excellent computer skills, including MS Excel and Word;Programming and debugging skills (e.g., MATLAB, VB/VBA, FORTRAN) are preferred.  • Self-motivated intellectual curiosity and the ability to learn through increasing levels of project responsibility Ability to work with self-direction in a project team environmentGIS skills a plus. Why HDRAt HDR, we know work isn’t only about who you work for; it’s also about what you do and how you do it. Led by the strength of our values and a culture shaped by employee ownership, we network with each other, build on each other’s contributions, and collaborate together to make great things possible. When you join HDR, we give you license to do the same. We help you take charge of your career, giving you multiple growth opportunities along the way."}