{"jobID": "2831584861", "jobLocation": "Chicago_IL", "jobTitle": "Principal Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "161000", "jobDescription": "Be a part of the revolution to integrate data-driven solutions to enable AbbVie’s approach to better medicines through machine learning (ML) and artificial intelligence (AI). This position will head a team of technical experts dedicated to enabling the R&D; pipeline – from identifying the right molecular target to supporting patient selection. The Information Research Team is looking for an intellectually curious and experienced data scientist who can easily communicate across disciplines, champion modern approaches, and strategically develop technological solutions in a high-speed environment. This position is responsible for engaging stakeholders and leading them through a journey to explore and implement various AI techniques like Natural Language Processing (NLP), Neural Networks, and Deep Learning. This position is responsible for the design, execution, and delivery of transformative new capabilities to accelerate every aspect of the drug development process by applying modern machine intelligence and data analysis technologies.Key Responsibilities Include:Effectively function as a principle investigator, generating new scientific or technological proposals and leading those efforts. Think creatively to solve difficult problems that exist throughout the R&D; pipeline and champion new technologies to achieve project goals.Act as a scientific expert in AI/ML. Explore future directions of machine intelligence and keep abreast of the latest developments. Supervise a team of technical experts and be independently accountable for the effective performance of the team/individuals.Work collaboratively alongside senior leadership in multiple business units to understand problems and plan strategy with execution roadmaps (e.g. Clinical, Regulatory, Biomarkers).Understand and adhere to corporate standards regarding applicable Corporate and Divisional Policies, including code of conduct, safety, GxP compliance, and data security.Advanced degree in a quantitative discipline applying mathematical and computational approaches to a physical or biological science. PhD in Computer Science or related field and 8+ years of relevant experience in the pharmaceutical industry. Experience with image analytics a plus.3+ years of experience in direct management of team members, including assisting in the development, training and assignment of work/projects to other team members.Aptitude and proficiency in using AI platforms, technologies, and techniques (e.g. TensorFlow, Apache MXnet, Theano, Keras, CNTK, scikit-learn, H2O, Spark MLlib, etc).Comfortable in both Windows and Unix environments.Passionate about the application of artificial intelligence techniques to tackle difficult technical problems in an agile manner.Demonstrated ability in one or more programming languages like Python, Java, R, or ScalaExceptional ability to clearly communicate ideas and findings to both technical and non-technical audiences.Excellent interpersonal skills - enthusiastic about sharing knowledge and collaborating with other teamsEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}