{"jobID": "2787723875", "jobLocation": "Foster_City_CA", "jobTitle": "Research Scientist I, Formulation and Process Development", "companyRating": "3.1", "companyInfo": {"Website": "www.gilead.com", "Headquarters": "Foster City, CA", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public (GILD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": " For Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job.Job DescriptionSpecific Responsibilities and Skills:The candidate will be expected to lead development projects, and demonstrate hands-on technical expertise/leadership in the laboratory, independently champion technology development projects, be involved in new formulation evaluation and optimization, define formulation platforms, and write/review development summary reports.The candidate will oversee or execute the R&D; stability of final dosage forms, characterize degradation pathways and products, as well as conduct compatibility studies with drug-delivery devices (pre-filled syringes, auto-injecting systems, etc.) and other container closure systems.The candidate will contribute to the development of stability-indicating assays, confirm the stability of final dosage forms, characterize degradation pathways and products as well as conduct compatibility studies with drug-delivery devices (pre-filled syringes, auto-injecting systems, etc.) and other container closure systems.The candidate will be responsible for conducting biochemical and biophysical characterization of proteins and their degradation products with a focus on evaluating the stability and comparability of molecules via methods such as ion exchange, size-exclusion, and reverse phase HPLC methods, as well as differential scanning calorimetry, capillary electrophoresis, spectroscopic based methods (UV/VIS, FTIR, CD, etc.) and particulates (flow imaging, light obscuration, RMM), and other physical and spectroscopy techniques.May lead Drug Product technology transfer from process development to clinical and commercial manufacturing sites, serve as the technical representative during fill/finish operations and participate in technical troubleshooting. Assist in technical review of batch records for lot release and CMO summary reports.Experience with Regulatory Filings including authoring relevant sections of INDs/CTDs and/or BLA/MAA is desiredThe applicant should be an effective communicator of ideas, project goals and results to team members across cross-functional roles/departments. Ability to proactively identify issues and develop solutions in a highly collaborative, multidisciplinary environment.Candidates should be self-motivated and organized, familiar with the relevant literature, enjoy scientific investigation and thinking, proactively identify issues, and develop solutions.The applicant is also expected to exercise considerable latitude in determining objectives and approaches to assignments.Essential Duties and Job Functions:Applies drug product formulation development principles and techniques to products and problems.Works under supervision of more senior scientists or scientific directors to analyzes laboratory experimentation and advance the development of state-of-the-art techniques to characterize drug product formulations and processes.Presents results of work, interprets data, and draws conclusions regarding presented material and nature of work.Maintains full working knowledge of principles and theories, applying such knowledge to the direction that supports company interests.Demonstrates emerging ability in developing methods, techniques and evaluation criteria for obtaining results and interpreting experimental outcomes.Thinks critically and creatively and is able to work independently, determine appropriate resources for resolution of problems and have strong organizational and planning skills.Participates in group meetings. Presents results of work, interprets data, and draws conclusions regarding presented material and nature of work.May make contributions to scientific literature and conferences through publication and presentation of research results.Demonstrates excellent writing and communication skills (both verbal and technical) and strong interpersonal skills.Knowledge, Experience, and Skills:PhD in a related scientific discipline with 0 to 3 years of industry experience.BS or MS degree with extensive industry experience.#LI-JS1For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACTYOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACTPAY TRANSPARENCY NONDISCRIMINATION PROVISIONOur environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}