{"jobID": "2837713520", "jobLocation": "Springfield_VA", "jobTitle": "Statistician/ Data Scientist Level IV with TS/SCI clearance", "companyRating": "3.4", "companyInfo": {"Website": "www.gdit.com", "Headquarters": "Fairfax, VA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " SAIC"}, "estimatedSalary": "136000", "jobDescription": " Requisition ID 2018-41682  # of Openings 1  Job Function Program Management  Security Clearance Level Top Secret/SCI with Polygraph  Full/Part Time Full Time Job Description Serves as a top level technical or functional expert, often working on multiple projects and programs.  Position Overview  Provide statistical and mathematical support in assisting NGA analyze and interpret a wide range of data to help NGA understand and improve our customer's experience.  Ability to leverage a range of data sources (e.g., Web traffic, customer requests for information, survey responses, production databases, etc.) for an understanding of what drives a positive customer experience.  Provide insights that will be used to inform NGA strategy and decisions, in partnership with teams examining Website design, customer interactions, featured content, and future GEOINT products and services.  Works with various stakeholders to develop business questions and identify the data necessary to analyze to answer those questions. Collaborate across a diverse team of statisticians/data analysts.  Utilizes industry standard communication and visualization tools to visualize and communicate complex quantitative information and analysis to senior executives.  Applies business analytics and customer segmentation techniques in any corporate function, e.g. marketing analytics, consumer analytics, operations analysis, human capital analytics, or other relevant fields.  Uses data mining for structured and unstructured information to join and explore relationships in disparate data sets.  Applies advanced analytics capabilities to derive insights from a combination of unstructured, semi-structured, and structured data. Maintains, moves, and manipulates data between applications, using appropriate software: Apache Spark, ElasticSearch, R, Python, Kibana and others as technology evolves.  Strength in collaboration and teamwork within, between, and across organizational boundaries.  Demonstrates good oral and written communication skills, along with good interpersonal skills and an ability to work cooperatively and effectively as a team member. Serves as a top level technical or functional expert supporting one or more clients and unlimited user groups.Performs highly specialized technical tasks associated with cutting-edge technologies.Works with user groups to solve business problems with available technology including hardware, software, databases, and peripherals.Applies expert functional knowledge and experience to significant business projects or processes.May perform business development activities, including providing technical input to proposal efforts.Provides guidance and training to less experienced staff.May serve as a technical task or project leader.May have supervisory responsibilities.Maintains current knowledge of relevant developments in area of expertise.Participates in special projects as required.EducationBachelors Degree in a related discipline.Masters Degree preferred. Bachelor of Science degree or higher in statistics, mathematics, image science, remote sensing, earth science, physical science or related technical or scientific field; or similar course of study at an accredited school (or substituted education and experience) Qualifications10-15 YEARS OF EXPERIENCE IN AREA OF EXPERTISE. Expert-level proficiency Familiarity with MS Office, data mining, ability to develop and manipulate, and maintain databases.10 years demonstrated experience using COTS statistical software (SPSS, SAS, MatLab etc.), COTS desktop software (MS Office and Access), and the Windows operating environment. Of particular importance is software packages used for advanced statistical analysis of operational data and tools for data visualization.Ability to develop and lead teams in the support of GEOINT regional offices and divisions.Proven ability to interact and provide technical support to Office-level leadership and management internally as well as externally For more than 50 years, General Dynamics Information Technology has served as a trusted provider of information technology, systems engineering, training and professional services to customers across federal, state, and local governments, and in the commercial sector. Over 40,000 GDIT professionals deliver enterprise solutions, manage mission-critical IT programs and provide mission support services worldwide. GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class. #ISDCJ #DPOST . Options"}