{"jobID": "2795653704", "jobLocation": "Los_Gatos_CA", "jobTitle": "Sr. Product Manager, Data Platform", "companyRating": "3.3", "companyInfo": {"Website": "www.roku.com", "Headquarters": "Los Gatos, CA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Company - Public (ROKU) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "160000", "jobDescription": " Roku is looking for a Sr. Product Manager to define and drive the evolution of Rokus data platform and to take responsibility of Rokus new data products.  The candidate will drive the productization process by working closely with engineering, data science and business teams at Roku. The Role and ResponsibilitiesDefine and lead overall data platform strategyDevelop a deep understanding of the needs of the data platform from internal stakeholders and Roku customers, and engage at a detailed technical level to drive product requirementsDrive projects around data privacy related areas that include enhancement of data privacy programs, privacy impact assessment, inventory and education on data flows and lead overall readiness around regulationsAuthor PRDs, feature guides and release plans to enable the team to develop products/features on time and within budgetDrive feature prioritization, process improvements, and product development with an eye on key KPIsProactively provide customer and business context to engineering teamPerform in-depth analysis of data products and use quantitative insight to drive improvements in both data quality and designStay on top of general technology trends; translate them into POVs, share with product and business teams, devise ways to assimilate trends internallyRequired Experience / Qualifications:5-10 years of experience in product management or in consulting with a focus on data analytics, application of big data, media and enterprise softwareStrong analytical skills and experience with data driven product design and decision making. Strong data base querying skills and data visualization (i.e. Tableau, Looker).Understanding of common privacy industry standards/ regulations (e.g. GDPR, VPPA, COPPA, SOX), especially as it relates to building a program and/or managing internal controls, risk assessments, business processes or operational auditingExperience in Ad Tech or in areas such as content recommendation/personalization is a big plusExperience in working with digital marketers, data scientists and media salesData-driven and an entrepreneurial self-starter who deals well with ambiguityStrong, influential cross-functional team leaderExcellent problem solving skills and ability to work independentlyMinimum of a Bachelors degree (preferably in engineering); MBA preferredBased in Los Gatos with the ability and willingness to travel #LI-OR1"}