{"jobID": "2620486336", "jobLocation": "Parsippany_NJ", "jobTitle": "Environmental Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Job Summary A premier regional environmental consulting and remediation firm, is seeking motivated environmental professionals to join their expanding team. Candidates must possess a BS degree in environmental science, geology, engineering or a related discipline, have completed OSHA 40-hour HAZWOPER training and have a minimum of 5 years of relevant experience and background with an environmental, engineering and/or remediation company. Job Responsibilities:With senior oversight, handles most aspects of case management / project management for commercial and industrial project work;Prepares technically accurate, complete and concise work plans based on evaluation of site data needs;Performs or manages the implementation of project work plans including staff briefing, scheduling, subcontractor coordination and sample collection;Evaluates, analyzes and interprets technical data relative to project-specific goals, creates and interprets accurate data display graphs and figures, completes basic fate and transport analysis, and identifies data gaps and data needs leading to development of Remedial Action Workplan;Works with and mentors junior staff to ensure all resources are in place for proper fieldwork and reporting execution;Develops and manages budgets, evaluates budget vs. plan and analyzes cost control efficiencies;Communicates with clients, third party and regulatory agents regarding project status, schedules and compliance issues; andEnsures adherence to client and corporate contract specifications in all activities including Health, Safety, Security, and EnvironmentRequirements:A Bachelor's degree or higher in Geology, Environmental Science or a related discipline5 to 12 years of related experience. Must include fieldwork and office based experience in environmental consulting field;Must possess excellent communication and technical writing skills and be able to independently prepare a complete deliverable report with a focus on QA/QC;Must have working knowledge of New Jersey's environmental regulations;Must be able to work with minimal supervision on field sampling, remedial system O&M;, and related site characterization projects; and excellent communication skills are a must and mechanical aptitude is a plus.Bottom line requirements:BS degree in environmental science, geology, engineering or a related discipline?5 - 12 years of relevant experience and background with an environmental, engineering and/or remediation company?Experience writing reports from the phase 1 process all the way up to final Remedial Action reports?"}