{"jobID": "2688973113", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Machine Learning Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.groundtruth.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "157000", "jobDescription": "Senior Machine Learning Engineer Mountain View, CA  GroundTruth, formerly xAd, is a global location technology company that drives results with real data. We believe in the power of place. Build your brand, increase sales and more by building off what real people are doing in the real world, mapped using our proprietary Blueprints technology. GroundTruth delivers superior consumer insights by seeing more people and places than anyone else, with an unrivaled first-party database of 95 million active monthly users and 17 million active daily users, across 100 million places and points of interest. GroundTruth currently serves 21 countries globally. Learn more: www.GroundTruth.com What you will do: Explore, develop, and productionize machine learning algorithms such as classification, regression, clustering, optimization, etc.Develop and maintain data pipelines in service of modeling and analysis. What you must have: 2+ years in a full-time software development job in industry.Fluent in Python.Significant experience with SQL; some relational databases or NoSQL data stores.Experience writing sizable software focusing on statistical modeling, machine learning, data processing and analysis.Strong interest in system design, automation, performance tuning, and other software engineering practices.Familiarity with open source machine learning libraries such as scikit-learn, TensorFlow, and Spark MLlib.Masters degree or higher in Computer Science, Statistics, or another quantitative field. How you can impress us: Familiarity with big data tools such as Hadoop, Hive, Spark.Experience with distributed computing.Substantial experience in C++.Skills in data visualization and statistical graphics.Open source software (e.g. in your Github account) that shows good style, clean architecture, mastery of programming tools, and sizable amount of work. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}