{"jobID": "2746599099", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst (U.S. Customs & Border Protection)", "companyRating": "3.8", "companyInfo": {"Website": "www.lmi.org", "Headquarters": "Tysons Corner, VA", "Size": "1001 to 5000 employees", "Founded": " 1961", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Booz Allen Hamilton, Noblis, MITRE"}, "estimatedSalary": "63000", "jobDescription": " The Data Analyst provides support to U.S. Customs and Border Protection (CBP) in data analysis, data visualization, and reporting and communication of analytical results to improve the effectiveness and efficiency of human resources (HR) functions, to include recruiting and hiring. The Data Analyst works on CBP client site in downtown Washington, D.C., N.W. Perform data analysis in support of CBP's HR activitiesApply data models and automated analytical processes to generate reports and analysis to inform HR program stakeholders and HR decision-making.Retrieve, validate, format, and organize a variety of data from many sources to track CBP applicants through the hiring process and calculate process and outcome metrics.Conduct data analysis to answer standard or recurring inquiries and identify trends, correlations, and other relationships in data sets.Work across various stakeholders to understand data trends, sources, and analysis goals and connect data to HR business processes and program outcomes.Conduct detail-oriented tasks and analysis projects as part of a team and under the supervision of a team leader.Create supporting materials for analysis projects (assumptions, briefings, handouts, written documents, user guides, etc.).Collect and distill project data to create understandable analytical reports.Generate charts and reports to performance against target, surges and shortfalls, comparisons, and trends over time.Create data dashboards to give visibility of results to CBP leadership.Bachelor’s Degree with at least 2 years of experience in data collection, validation, and analysisProficient in the collection and distilling of project data in order to create understandable analytical reportsExperience with data visualization methods and approachesProficient in the use of Microsoft Office products, such as SharePoint, Word, Excel, PowerPoint, Access, Outlook, Project, Visio, etc.Excellent skills in gathering and analyzing data, especially quantitative dataExperience working with large data sets to distill informationExcellent oral and written communication skillsActive CBP single-scope background investigation (SSBI) is strongly preferred. Ability to obtain a suitability determination through the CBP SSBI process is required."}