{"jobID": "2633260158", "jobLocation": "Westlake_TX", "jobTitle": "Sr. Data Scientist", "companyRating": "2.4", "companyInfo": {"Website": "www.solera.com", "Headquarters": "Westlake, TX", "Size": "5001 to 10000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": " MissionSr. Data Attribution AnalystWho We Are Founded and continuously led by inventor and entrepreneur Tony Aquila, Solera is a global leader in digital technologies that connect and secure life's most important assets: our cars, homes and identities. Since its inception in 2005 as a garage-based startup, Solera has grown aggressively with over 50 acquisitions across its platforms The company's current product solutions include Audatex, Autodata, AutoPoint, CAP/HPI, Colimbra, Digidentity, Enservio, Explore Data, Hollander, Identifix, Inpart, LYNX and TitleTec, as well as the company's flagship Digital Garage application. Today, Solera processes over 300 million transactions annually for approximately 235,000 partners and customers in over 80 countries. Unified by a strong culture that values uncommon entrepreneurial thinking and continuous \"do-it-different\" innovation, Solera's global workforce of 6,700+ associates come from diverse forward-thinking industries that include automotive technology, artificial intelligence, software development, data sciences, cybersecurity, cognitive design, and digital identity protection. For more information, please visit solera.com. The Solera Way Solera’s uncommon culture is based on three simple principles: Think 80/20 (Focus), Act 30/30 (Efficiency), and Live 90/10 (Accountability). We define our mindset using Our 3H’s: Humility, a Hunger to succeed, and a desire to Hunt for opportunities to win. We train our volunteers to engage with each other modulating between their intellect (IQ) and emotional intelligence (EQ) using our 3Fs: Facts, Finesse, and Force. Solera has become a global technology leader that is constantly growing in the double digits. The principles, drills, and values associated with the Solera Way have been fundamental to Solera’s success and our ability to grow, continuously change, and innovate. Are You Uncommon? The Data Scientist/Attribution Analyst will be responsible for developing a consistent, scalable methodological approach for measuring the partial impact of our clients’ marketing communications across online and offline touch points. This role will own delivering, implementing and managing all elements of marketing attribution for our clients.Position 80sWhat You’ll Be Doing At Solera, we believe in providing clarity and focus to what our volunteers are responsible for – their mission. The 80’s, as we call them at Solera, are the employee’s priorities associated with their role or mission. The mission 80’s for this role, are: Develop Algorithmic approach to evaluate marketing communication performance using variety of statistical or machine learning approachesPartner with domain knoledge experts to extract required communication history and results to create datasets approcpriate for advanced analyticsConduct EDA to evaluate data and understand associated business issues Additional responsibilities of the role include: Develop algorithmic approach to evaluate marketing communication performance using variety of statistical or machine learning approachesPartner with domain knowledge experts to extract required communication history and results to create dataset(s) appropriate for advanced analyticsConduct EDA to evaluate data and understand associated business issuesDevelop and present results to internal teams to evaluate alternative methodological approachesAssist in the deployment, evaluation, monitoring of results across products and clientsInteract with and support a variety of teams and individuals within the organization to make data-driven business decisions aimed at growth. QualificationsAre You Qualified?5+ years of experience in generating and presenting insights from marketing data; experienced in online advertising analytics and optimization required.Attribution modeling and predictive modelingWeb analytics implementation and tag management software such as Google Tag Manager.Experience working with DMP and/or online attribution vendorSkill working with commercial or open source analysis packages (Python, SAS, R)Knowledge of and skilled in data preparation. Must have skills in SQL, Pandas or similarOutstanding communication skills with the ability to influence decision makers and build consensus with teamsFamiliarity with statistical tests and small samplesAbility to think critically, solve problems, an understand broader business issuesSelf-motivated and ability to work independentlyConvey strong leadership skills with demonstrated ability to effectively interface, influence, and build alignment with individuals, multi-discipline teams, and multiple levels within a companyManage large, complex projectsEducation:Master’s Degree (PhD preferred) in related quantitative fieldOur Space We believe that offices should be destinations where people want to be… places where people want to work, play and, collaborate. That is why we spend a lot of time on enhancing our workspaces. Solera’s work environments are intersections of the old and the new… of the past, present, and future. They are spaces designed to stimulate creative thinking, innovation, and cross-functional collaboration.  We also embrace wellness. Whether it is our onsite or offsite workout centers, nutritional meals and beverages, or endless snacks for focus and energy. This wellness plan is our commitment to healthy living, which spans across our office environments."}