{"jobID": "2828985937", "jobLocation": "Mount_Laurel_NJ", "jobTitle": "Environmental Engineer/Scientist/Geologist", "companyRating": "4.1", "companyInfo": {"Website": "www.geiconsultants.com", "Headquarters": "Woburn, MA", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " GEI is a leading consulting engineering firm ranked #92 in the ENR top 500 (2018). We serve hundreds of Government, Energy, Industry and Institutional clients, and have completed 50,000 project engagements throughout the United States, Canada, and more than 20 other countries. Founded in 1970, our privately held, employee-owned company consists of over 800 employees located in 37 offices across the United States. GEI s technical experts are involved in dozens of specialty services emanating from our traditional core practices which include geotechnical, environmental, infrastructure, water resources and ecology. GEI continues to grow and expand, both in our technical services offerings and geographic coverage. GEI seller-doers are considered some of the leading subject matter experts (SMEs) in their respective fields. Summary: GEI s Mount Laurel, NJ office is seeking a mid-level Environmental Engineer/Scientist/Geologist. Under supervision of senior staff, this individual will provide support to ongoing field and office-related efforts. Field activities may include: drilling of soil borings and installation of groundwater monitoring wells; collection of groundwater, sediment, soil, soil vapor and air samples; operation of air monitoring equipment; testing to evaluate groundwater aquifer characteristics; and remedial construction oversight and management. Office tasks include: project planning and management; client, subcontractor and agency interaction; review and interpretation of data; preparation of work plans and reports; development of investigation and remedial strategies; and remedial design. Primary responsibilities: Support environmental site assessments, remedial and pre-design investigations, test borings, well installations, environmental sampling of various media, aquifer testing, pilot tests, and technical oversight of subcontractors.  Support construction management services including coordination with design engineers and clients, specification and submittal review, and project tracking and documentation. Responsibilities also include participating in or leading construction team meetings, acting as a client liaison, assisting with the preparation of final engineering or construction completion reports.  Support data management and analysis, technical report development, and assist in preparation of technical presentations and proposals to clients and regulators.  Support the development/refinement of investigation and remedial strategies for various types of sites and contaminants, and the design and installation of remediation systems.  Project management tasks including budget preparation and tracking, staffing and scheduling, and interaction with subcontractors, clients and regulatory agency representatives.  Assist with proposals and business development activities for the region. Qualifications: B.S. in Environmental Engineering, Environmental Science or Geology; M.S. is a plus.  EIT or P.E. is a plus.  A minimum of 4 years of previous professional experience in environmental consulting.  Excellent technical report writing and communication skills.  Experience with spatial analysis and visualization software such as CAD, GIS, Leapfrog Hydro, EVS, etc., and Equis or other databases is a plus.  40-hour HAZWOPER training.  Valid U.S. driver s license.  Benefits:Market-Competitive CompensationComprehensive Benefits Program, including Medical, Dental, Vision and MoreContinuing Education Assistance and Tuition ReimbursementProfessional Development and Opportunities for AdvancementPaid Holidays and Paid Time OffRewards and RecognitionGEI-Funded Profit Sharing and 401(k)And More…Physical Job RequirementsSedentary  Light  X  Medium  OtherActivity Level Throughout WorkdayPhysical Activity Requirements Occasional (0-35% of day) Frequent (33-66% of day) Continuous (67-100% of day) Not ApplicableSitting  1-2 hrsStanding  6-8 hrsWalking  3-5 hrsClimbing  0-1 hrsLifting (floor to waist level) (in pounds) 0-30 lbsLifting (waist level and above) (in pounds) 0-10 lbsCarrying objects  6-8 hrsPush/pull  0-1 hrsTwisting  1-2 hrsBending  3-5 hrsReaching forward  1-3 hrsReaching overhead  0-1 hrsSquat/kneel/crawl  1-2 hrsWrist position deviation  1-2 hrsPinching/fine motor skills  2-3 hrsKeyboard use/repetitive motion  1-2 hrsTaste or smell (taste=never)  0-1 hrsTalk or hear  6-8 hrs Accurate 20/40 Very Accurate 20/20Not ApplicableNear Vision  XFar Vision  XYesNoNot ApplicableColor Vision (ability to identify and distinguish colors)  XSensory RequirementsMinimalModerateAccurateNot ApplicableDepth perception  XHearing  XEnvironmental RequirementsOccupational Exposure Risk PotentialReasonably AnticipatedNot AnticipatedBlood borne pathogens  XChemical  XAirborne communicable diseases  XExtreme temperatures  XRadiation  XUneven surfaces or elevations  XExtreme noise levels  XDust/particular matter  XOther (exposure risks):Usual workday hours:  X  8  X  10  12  Other work hoursGEI is an EEO/AA/M/F/Vet/Disability employer"}