{"jobID": "2735784477", "jobLocation": "Chicago_IL", "jobTitle": "Senior Business Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.daugherty.com", "Headquarters": "Saint Louis, MO", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Daugherty Business Solutions is on the hunt for an experienced and effective problem solver to join Team Daugherty as a Senior Business Data Analyst. In this role you will have the opportunity to work with our clients to solve complex analytical problems. You will provide reporting, analytics support and data visualization services for client teams in the region. This role will allow you to tackle complex, stimulating challenges every day.  As a Senior Business Data Analyst you will be responsible for the following: Delivering integrated business systems support to users (internal and external to IT), applying an expert understanding of the business issues and the impact of technology.Advocating the initiation of projects, when necessary, to achieve business and IT objectives.Creating visualizations that provide business insights.Building prototypes for demonstration and illustration purposes.Looking for opportunities to improve current processes or finding efficiencies by applying best practices.Successfully identifying, addressing, managing and escalating risks and issues within a project. As a successful candidate, you will have: At least 6-8 years of experience as a business analyst, with 3+ years focused on data and analytics projects and solutions.Broad system level expertise across multiple computing platforms and technologies with the ability to influence direction around information management at the Enterprise level.Strong SQL skills with the ability to write complex SQL statements to analyze data and create prototypes.Experience with Hadoop data structures.Expert knowledge of Tableau best practices.Familiarity with several software delivery methodologies (RUP/Agile/Waterfall). We offer members of Team Daugherty: Excellent health, dental and vision insurance.Revenue sharing and a 401(k) retirement savings plan.Life, disability and long-term care insurance.Little to no travel.Robust career development and training. Do you think you’re a good fit for Team Daugherty? Apply now and find out why working here satisfies the smart, the talented and the curious!"}