{"jobID": "2815339293", "jobLocation": "Irving_TX", "jobTitle": "Business Intelligence Data Analyst III", "companyRating": "3.4", "companyInfo": {"Website": "www.christushealth.org", "Headquarters": "Irving, TX", "Size": "10000+ employees", "Founded": " 1869", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Methodist Healthcare System, Corpus Christi Medical Center, Willis-Knighton Health System"}, "estimatedSalary": "66000", "jobDescription": "DescriptionPOSITION SUMMARYThe Business Intelligence Data Analyst III is responsible conducting full lifecycle analysis to include requirements, design, documentation, testing and validation to support the implementation of Business Intelligence analytics solutions for regional or system partners. Data Analyst will develop analysis and reporting capabilities. This includes an understanding of methodology, design, specifications, programming, delivery, monitoring, and support standards.  Individual should have extensive experience supporting software or analytics development teams in an Analyst capacity. Additionally, strong SQL and database experience in OLTP, OLAP or MPP is required. Ideal candidates will also have experience in data mining using advanced SQL or BI tools.MAJOR RESPONSIBILITIESDesign & Development- Provides technical development leadership and implementation of design as it relates to the existing applications that correspond with the architecture strategies at an enterprise level.Strategy Execution -- Leads in the execution of CHRISTUS' overall information systems strategy as it pertains to their vision of the organization in both strategic and tactical plans. Involved in team adoption, execution and integration of strategy to achieve optimal and efficient deliver.System Engineering -- Involved in the evaluation of proposed system acquisitions or solutions development and provides input to the decision-making process relative to compatibility, cost, resource requirements, operations, and maintenance.System Integration -- Integrates software components, subsystems, facilities and services into the existing technical systems environment; assesses impact on other systems, and works with cross functional teams within information management to ensure positive project impact. Installs, configures, and verifies the operation of software components.System Management -- Participates in development of standards, design and implementation of proactive processes to collect and report data and statistics on assigned systems.System Security -- Participates in the research, design, development, and implementation of application, database, and interface security using technologies such as SSL, Public-Key encryption, and Certificates or other emerging security technologiesRequirementsPOSITION QUALIFICATIONSA. Education/SkillsBachelor's degree in Information Systems, Computer Science, Engineering, Math, or related field preferred.Advanced level of SQL programming for data analysis is required.Advanced level of SQL programming for data consumption is required.Data analysis with large datasets on Big Data Databases (such as Hadoop/Hive/Impala) is required.Experience in integrating and cleansing data from source systems is preferred.Experience using MicroStrategy or comparable BI Tools (i.e. IBM Cognos, Tableau) is preferred.Solid understanding of BI and analytics landscape, preferable in large-scale development environments.Willingness and ability to learn advanced analytics technologies, including SAS, R, Scala, and Python.Must have communication skills and ability to develop and present solutions to all levels of management (including executive levels).Must have demonstrated the ability to solve complex problems with minimal direction.Must be able to interact effectively and patiently with customers especially while under pressure.The ability to work on multiple projects/tasks simultaneously to meet project deadlines for self and others as required.Ability to establish and maintain positive working relationships with other employees.B.ExperienceMinimum of Eight (8) years of experience in SQL programming in platforms with large data assets within an OLTP, OLAP and MPP architecture.Minimum of Eight (8) years of experience with writing and debugging complex SQL queries.A minimum Eight (8) years IT experience in technical analysis or design and implementation.Minimum Eight (8) years of experience in corporate systems environments required. Experience with a variety of Information Management applications, programming languages, and technologies.Four (4) years of experience with large datasets on Big Data Databases (such as Hadoop/Hive/Impala).Four (4) years Healthcare or Healthcare IT experience preferred.C. Licenses, Registrations, or CertificationsCertifications in SQL, MicroStrategy, SAS, Hadoop or Agile Scrum are a plus."}