{"jobID": "2819872446", "jobLocation": "Hudsonville_MI", "jobTitle": "Maintenance Tech", "companyRating": "4.1", "companyInfo": {"Website": "www.gotoroyal.com", "Headquarters": "Hudsonville, MI", "Size": "501 to 1000 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "24", "jobDescription": " Royal is a diverse manufacturer of injection molding, urethane foam and assemblies serving the automotive, furniture, and consumer products industries. We are growing and looking for skilled technicians to join our 2nd and 3rd shift maintenance team! Responsibilities include:Maintenance & repair of industrial machinery such as hydraulic & electric injection molding machines, gantry & articulating robots, auxiliary/support equipment, along with custom designed assembly equipment.Understanding of complex electrical, hydraulic, & mechanical systems such as: Servo electric drives/motorsDigital & analog control systemsClosed loop proportional controlsHydraulic pumps, directional control, & logic (cartridge) valvesBall screws, & precision mechanical controlAbility to read electrical, fluid power, & mechanical prints/schematicsSolid troubleshooting skillsUnderstanding and application of metrology for precision setup & maintenanceUnderstanding of predictive maintenance technologies such as infrared thermography & ultrasonic measurementApplication of education, theory, & mathematics to equipment maintenanceCommitment to the teamExcellent customer service Requirements include a minimum of 3 years experience in the maintenance field. Experience with injection molding, custom automation, & PLC programming skills are preferred. About Royal: Royal is a diverse manufacturer of injection molding, urethane foam and assemblies. We serve the automotive, furniture, and consumer products industries.  People who succeed at Royal are those who share the values of our company: Integrity. Stewardship.  Teamwork. Hard work. Excellence.  We're committed to being the employer of choice. Our goal is to build a culture of commitment where everyone is respected and valued. Where everyone participates. Where everyone matters. We give our employees the responsibility -- and the authority -- to make decisions. We try to provide the best possible work environment. We encourage creativity. We applaud ingenuity. We reward problem solving.  And we recognize that we are only a part of our employees' lives. Our culture embraces the family. We celebrate accomplishments -- both inside the workplace and out. We aim to replicate the family structure on the manufacturing floor by establishing work teams committed to one another -- and to our customers.  Are you ready to make a difference? Apply today! Royal offers a competitive wage and benefit package - including quarterly bonuses based on profitability, outstanding health insurance, ownership in the company through our ESOP (retirement) plan, and much more."}