{"jobID": "2801608524", "jobLocation": "San_Jose_CA", "jobTitle": "Cashier", "companyRating": "3.0", "companyInfo": {"Website": "www.guckenheimer.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": " Food. Cooking. Creativity. Is this your life? Do you believe that commitment unlocks unlimited potential? We are the perfect Company to launch or further your career. We are all about great ingredients, culinary innovation and nourishing inspiration. Oh yeah, we don't work weekends unless we are opening a new location or kicking it at some cool industry event.  Guckenheimer, is a national foodservice management company that pioneered restaurant style, healthful dining in the workplace. We encourage our team members to join in community events such as Chef Ann Foundation to support the #RealSchoolFood campaign, promoting cooking healthy meals with real ingredients at schools., Second Harvest Food Bank, Girls on the Run, and many more community programs.  We offer fantastic health and wellness benefit options that include but not limited to medical, HSA, a rewarding wellness program, dental, vision, FSA, commuter benefits, EAP, free meal each day, free pair of safety shoes at time of hire, and much more. Guckenheimer's own Learning Management System at your fingertips and a yearly tuition reimbursement program will enable you to enhance your career development in your new and exciting position with Guckenheimer!  We encourage you to apply to our CASHIER opportunity and bring your knowledge and passion of high quality food and customer service to our culinary program.Position Summary:Greet guests, making them feel welcome. Operate cash register taking payment from customers. Maintain the front house keeping service areas clean and stocked with product.Qualifications:Passion for customer servicePositive attitudeDependableAbility to communicate effectivelyPosition Responsibilities:Operate Cash Register accurately.Recognize menu items and accurately charge customers for purchases.Smile, greet, and serve customers making them feel welcome.Prepare and stock service areas for hot or cold beverages, such as coffee and teas.Clean or sanitize work areas, utensils or equipment.Provide customers with product details, such as coffee blend and preparation descriptions.Display prepared foods, such as muffins, biscotti and bagels.Stock customer service stations with paper products or beverage preparation items.Wrap, label, or date food items for sale.Set up or restock beverage and product displays.And other duties as assigned.Must follow all safety rules and actively prevent accidents.Commitment to the service values and ethics of the client company.Essential Skills and Experience:Strong customer service skills.Accurately record sales on a cash register and make change for customers within a 1% margin of error.Catering or food preparation skills.Reporting to this position: None Reports to: Chef Manager, Food Service Manager or General Manager FLSA status: NonexemptPhysical Demands and Work Environment:Must be able to lift a minimum of 25 #.Employee must be able to work on their feet 7.5 hour per day excluding breaks.Employee has to work under pressure and time deadlines during peak periods.Must be able to use a cash register or computer key board for up to 2 hours continuously.Must be able to load and push a cart a short distance. Guckenheimer embraces equal opportunity employment  Guckenheimer participates in the E-Verify Program, as required by law"}