{"jobID": "2837517504", "jobLocation": "Southfield_MI", "jobTitle": "Data Science Engineer", "companyRating": null, "companyInfo": {"Website": "www.ncode.com", "Headquarters": "Sheffield, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "If you are interested in becoming a highly sought after expert in data science, artificial intelligence, machine learning, and deep learning, this role will help you sharpen your skills and launch your career. We are looking for a high caliber individual with passion for data science. The role will focus on applying data mining techniques, machine learning methods, and statistical analysis on customer problems. This role will help solve customer problems by discovering details from small or large datasets of customer assets (vehicles, aircrafts, machines etc.), and deliver actionable information and “value added” solutions. If you just graduated or will be graduating from a recognized engineering or statistics or mathematics or technical program and demonstrated high achievements on your performance, please feel free to apply.  Responsibilities: Work collaboratively with customer and other team members identifying customer problemsHelp develop strategy based on data science and physics to solve customer problemsProcess, clean, and verify the integrity of data that will be used for analysisPresent complicated results in a simplified approachDocument results and meeting deliverablesAssess internal suites of engineering data analysis and predictive analysis software to help solve customer problemsLearn and teach data science tools such R and PythonCollaborate with teams to help implement software and hardware architecture for predict analytics and machine learningOther duties as needed Qualifications: US Citizens Only (Requirement)Technical degree from a highly recognized programsHigh academic performance and requires references of your project workExperience in data science, artificial intelligence, machine learning, and deep learning or very strong desire to learn them in a short timeDemonstrable understanding or experience of data and how they can be used to solve problems i.e. Data oriented personalityScripting and programming exposure is a mustAbility to learn quickly and apply the knowledge to solve problemsWillingness to travel domestically about 10% of the time"}