{"jobID": "2829383290", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.associatedveterans.com", "Headquarters": "Culpeper, VA", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Associated Veterans is seeking an experienced detail-oriented, Data Analyst to support a high-profile project directly impacting care to Veterans across the nation's largest integrated health system. The Data Analyst will need to be highly organize and detail oriented, responsible with deadlines and strong time management capabilities, with the ability to self-manage and prioritize competing tasks. The Data Analyst will leverage excellent communication skills with colleagues, leadership and external stakeholders. The candidate will demonstrate superb ability to analyze software systems and highly complex Supply chain data and processes in order to develop logical enterprise solutions and data standardization/consolidation recommendations. Summary: 1. Effectively evaluate a clients need and business processes. Translate, communicate, and document the requirements to the Agreement Express solution  2. Skilled at mapping data files and processes  3. Skilled at documenting requirements and communicate workflow through diagrams (e.g. create process flow diagrams, integration diagrams, finite state diagrams, customer experience maps etc.)  4. Ability to succinctly communicate solution and requirements to customer and internal team  5. Excellent facilitation skill to collaborate with the clients through decision making process and gain consensus to reach sign-off Duties:6 years of experience required.Provide advice on information systems strategy, and solution deliveryConduct tasks in a team matrix environmentAnalyze software systems and highly complex data and procedures and develop logical solutions to problems;Conducts business and technical assessment of systemsAssist in the design, development, and integration and implementation of creative information systems business solutionsInterface with suppliers and vendors to evaluate software and hardware as requiredAssist in the coordination and linkage of computer systems within an organization to increase compatibility and information sharingMaximize the efficiency, effectiveness and overall quality of information systemsConduct independent third-party reviews and surveys to assess information systemsRequired Skills:Degree in Computer Science, Information Technology, Business Administration or other relevant university discipline AND;6 or more years of experience.Experience leading meetings, facilitating workshops, and performing interviews with end users and other stakeholders to perform systems and data analysis related functionsExperience using BI tool (like Tableau) to perform data analysisExperience with developing information models and data flow diagramsExperienced in analyzing and documenting business processes Demonstrated ability to bring clarity to business processes that may not be well understood by customers themselvesAbility to translate business requirements to technical specification for implementation or developmentUnderstanding concepts of data modeling and system configuration. Be able to read and understand xml standardsStrong communications skills.Excellent verbal and written English skills are critical for success in this roleThrives in a fast paced environment. Demonstrated ability to work calmly in a demanding work environment subject to a variety of pressures and constraintsEffective communicator, both oral and writtenExcellent analytical skills and strong attention to detailAbility to collaborate effectively and work as part of a teamAbility to analyze current (As-is) state of a system operation from a data standpoint to understand its component parts and their relationship to each other in an Enterprise systemAbility to develop and represent business related data functions in order to provide standardization and consolidation recommendation across the Enterprise.Experienced in analyzing and documenting business processes Demonstrated ability to bring clarity to business processes that may not be well understood by customers themselvesAbility to translate business requirements to technical specification for implementation or developmentUnderstanding concepts of data modelling and system configuration.Strong communications skills. Excellent verbal and written English skills are critical for success in this roleThrives in a fast paced environment. Demonstrated ability to work calmly in a demanding work environment subject to a variety of pressures and constraintsPreferred Skills:Business or Data Analysis certification (CBAP/PMI-PBA)Demonstrated experience in analyzing enterprise systems and relevant dataHigh-level experience in methodologies and processes for analyzing large scale systems for a Government organizationExperience with various software solutions (SaaS, COTS, GOTS, Legacy)"}