{"jobID": "2827102720", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.alere.com", "Headquarters": "Waltham, MA", "Size": "5001 to 10000 employees", "Founded": " 2001", "Type": " Company - Public (ALR) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " Data Scientist  Alereis now part of Abbott's Diagnostics family of businesses, bringing togetherexceptional teams of experts and industry leading technologies. As we embark onthis exciting journey, the Abbott Rapid Diagnostic Division (ARDx) issearching for a new member to join our Research &Development; team. The Data Scientist will be an integral contributor to the team's success in launchingnew diagnostic technologies. Current and future projects are classified as highprofile to the business and in later development phases, with several earlystage projects about to take off. This is an ideal time to join!  Thisis a great opportunity to leverage your strong technical expertise whilegrowing your career with a premier industry leader. If you seek a dynamic rolewhere your contributions will pave the way in developing exciting new productsthen come and work with us!  Core JobResponsibilities Support R&D; to capture, interpret, understand, and operationalize advanced analyticsProvide data modeling, mining, pattern analysis, data visualization and machine learning solutionsApply design of experiment methodology to understand technology variation and improve product performanceApply advanced statistical procedures, models and graphics on a wide array of data setsProvide root cause analysis including troubleshooting of pre- and post-market productsDefine experimental plans, pilot exploratory and analytical phases on experimental dataCreate and maintain documentation for data analyses used to develop specifications for various platformsProvide continuous improvement of data analysis tools and methods used to evaluate data sets and set specificationsWork on all stages of projects from understanding data to implementing solutions into products, including determining testing stages, applying appropriate statistical tools, defining sampling size, and setting specificationsPrepare reports summarizing the results of data analysisCollaborate with project teams in the design and development of protocols, statistical analysis plans, data management plans, compliance of data analyses and the reporting of resultsThe individual may travel occasionally per needs of the assigned project Position Accountability / Scope The individual is responsible for the development and/or implementation of statistical methods and tools, data modeling and data analytics designed to evaluate and analyze data sets generated across various platforms within R&D;The individual will work as part of a cross-functional team ecompassing R&D;, Product Development, Operations, Quality, Regulatory and Project Management to deliver statistical and analytics solutionsPrevious experience in the area of molecular diagnostics is a plusQualifications An advanced degree (minimum Masterof Science) in computer science, statistics, or mathematics, or in biochemistryor biology with a strong background in computer science, statistics ormathematics with at least 3 years of experience at a startup or mid- tolarge-sized corporation is required. The candidate must have experience in statisticalanalysis, data modeling and/or advanced analytics in healthcare or anotherregulated industry.  The candidate must have expertknowledge in at least 2 of the following: Data analyticsData modelingInferential statisticsPredictive analyticsDesign of experiment The candidate must have workingknowledge in JMP, Prism, Minitab, or SAS.  Prior experience with any of thefollowing is a plus: R, Python, Streaming analytics, Machine LearningSDL2017"}