{"jobID": "2831638723", "jobLocation": "Aliso_Viejo_CA", "jobTitle": "Lead Claims Adjuster", "companyRating": "3.1", "companyInfo": {"Website": "www.ajg.com", "Headquarters": "Rolling Meadows, IL", "Size": "10000+ employees", "Founded": " 1927", "Type": " Company - Public (AJG) ", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Aon, Marsh & McLennan Companies, Willis Towers Watson"}, "estimatedSalary": "54000", "jobDescription": " At Gallagher Bassett Services, Inc.  (GB) we are a team of skilled professionals who are up for a challenge and take  exceptional performance to heart. Our professionals maintain our reputation as  one of the most progressive property/casualty third party claims service  organizations in our industry and throughout the world. Gallagher Bassett  provides award winning services to Fortune 1000 companies throughout 100  offices worldwide.  Would  you like to:Work from your home to gain work/life balance?Accelerate your career development with a diverse range  of experiences across multiple coverages, jurisdictions, industries and  risks?Join an elite team of highly expert and engaged  professionals? We promote from within our team and  provide the flexibility of working from home. You will do meaningful work in  partnership with our client Sompo. You can take responsibility to make better  decisions, earlier in the life of every claim. You can identify and deliver the  right resources, at the right time and in the right place. And you'll be backed  by our premier analytical and reporting tools. Your ability to think  critically, solve problems, plan and organize activities, serve clients,  negotiate, effectively communicate verbally and in writing and embrace new  challenges will drive your success. Key  Responsibilities:Exercise proper discernment and decision-making to  analyze the claims exposure, to plan the proper course of action and to  appropriately settle the claim.Interact extensively with various parties involved in  the claim process.Manage claims consistent with clients' and corporate  policies, procedures and standard methodologies and also in accordance  with any statutory, regulatory and ethics requirements.Document and communicate all claim activity timely and  effectively and in a manner which supports the outcome of the claim file.Investigate, evaluate, and resolve a wide variety of  claims within a collaborative team environment.Required  Qualifications :High School Diploma or GEDMinimum of 7 years related claims experience requiredAppropriately licensed and/or certified in all states  in which claims are being handled.Knowledge of accepted industry standards and practices.Computer experience with related claims and business  software.Analytical skill necessary to make decisions and  resolve complex issues inherent in handling losses.Ability to successfully negotiate the settlement and  disposition of serious claims including the ability to interpret related  documentation.Desired:Bachelor's DegreeJuris DoctorateU.S.  Eligibility Requirements:Submit an application and resume/CV online18 years of age or olderWilling to submit to a background investigation; any  offer of employment depends upon the successful completion of a background  investigationUnrestricted work authorization to work in the United  States. For U.S. employment opportunities, Gallagher hires U.S. citizens,  permanent residents, asylees, refugees, and temporary residents. Temporary  residence does not include those with non-immigrant work authorization (F,  J, H or L visas), such as students in practical training status.  Exceptions to these requirements will be determined based on shortage of  qualified candidates with a particular skill. Gallagher will require proof  of work authorizationWilling to execute Gallagher's Employee Agreement or  Confidentiality and Non-Disclosure Agreement which requires, among other  things, post-employment obligations relating to non-solicitation,  confidentiality and non-disclosure Gallagher offers competitive  salaries and benefits, including: medical/dental/vision plans, life and  accident insurance, 401(K), employee stock purchase plan, educational expense  reimbursement, employee assistance program, flexible work hours, training  programs, matching gift program, and more.  Gallagher believes that all persons  are entitled to equal employment opportunity and does not discriminate against  nor favor any applicant because of race, sex, color, disability, national  origin, religion, creed, age, marital status, citizenship, veteran status,  gender, gender identity / expression, actual or perceived sexual orientation,  or any other protected characteristic. Equal employment opportunity will be  extended in all aspects of the employer-employee relationship, including, but  not limited to, recruitment, hiring, training, promotion, transfer, demotion,  compensation, benefits, layoff, and termination. In addition, Gallagher will  make reasonable accommodations to known physical or mental limitations of an  otherwise qualified persons with a disability, unless the accommodation would  impose an undue hardship on the operation of our business.  #sompo"}