{"jobID": "2645668816", "jobLocation": "Santa_Monica_CA", "jobTitle": "Sr. Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.ring.com", "Headquarters": "Santa Monica, CA", "Size": "1001 to 5000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "167000", "jobDescription": "Ring is looking for an amazing Senior Data Engineer with the passion to drive the design, execution, and ongoing support of mission-critical data services enabling large-scale data collection, near real-time and offline analytics, distributed search, and machine learning for security, engineering, and business intelligence purposes.Responsibilities Work with engineering and business stakeholders to understand data requirementsHelp shape the growth of transformative in-house big data resources and capabilitiesDefine, design, model, implement, and operate large, evolving, structured and unstructured datasetsEvaluate and implement efficient distributed storage and query techniquesInteract and integrate with internal and external teams and systems to extract, transform, and load data from a wide variety of sourcesImplement secure and auditable data infrastructure as requiredTrain users on data capabilities and best practices Knowledge, Skills & Abilities Bachelors degree in a related field5+ years of experience in Software Engineering / Data Engineering / Data Warehousing roles working in high traffic, fault tolerant, and highly available environmentsFamiliarity with stream platforms such as Kinesis or KafkaFamiliarity with Elasticsearch, Logstash, and Kibana or similar technologiesFamiliarity with Hadoop, Hive, Spark, and SQL on Hadoop related technologiesProficient SQL skillsProficiency in one of Python, Java, Scala, or a similar programming languageExcellent verbal and written communication skillsExtreme attention to detailPassion for data Nice to have Experience with AWSExperience integrating NoSQL alongside RDBMS such as Postgres or MySQL in a multi-tiered, globally replicated environmentHaving planned and/or participated in terabyte-scale data migrationsExperience with AirflowAbout RingRing's mission is to reduce crime in neighborhoods and empower consumers by creating a Ring of Security around homes and communities with its suite of smart home security products: Ring Video Doorbell, Ring Video Doorbell Pro, Ring Stick Up Cam and the new Ring Floodlight Cam. With these security devices, Ring has created the neighborhood watch for the digital age and continues to keep homes around the world safe. For more information, visit www.ring.com. With Ring, you're always home.Ring LLC is proud to be an equal opportunity employer, and provides equal employment opportunities (EEO) to all employees and applicants with our regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Ring LLC. complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. Apply Now!"}