{"jobID": "2788950961", "jobLocation": "Redwood_City_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.gofundme.com", "Headquarters": "Menlo Park, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": " Do you believe that people with compassion will support one another to create a better world? Well, we do! GoFundMe is the largest social fundraising community in the world and is just getting started.  GoFundMe is the most popular personal fundraising site in the world. Over $5 Billion has been raised by our users for their personal causes - making GoFundMe a Top 200 Website in the USA based on traffic with monthly audience of over 100M people. Data is at the center of all decisions and strategy at GoFundMe. The mission of the Senior Data Analyst is to provide data insights that enable data driven business decisions and actions that drive business growth to help build a global culture of peer-to-peer giving.  GoFundme is the leader in the personal crowdfunding market. The Senior Data Analyst will be a key part of the growing Data team to help derive data insights from web, marketing, product and user behavior data. This role requires experience in a wide variety of business areas and datasets to gather data from disparate sources, perform analysis, build models and present recommendations. If you are interested in working in a fast paced environment and like being challenged with fun data problems to solve, come join us. The Job...Perform strategic and operational data analysis for all internal teams (marketing, product, engineering, customer service, trust & safety and finance)Monitor all KPIs and present emerging trends and actionable insights to leadership teamDevelop dashboards and perform adhoc analysisEnsure data quality by testing tables, dashboards, models and analysisMeasure and analyze A/B test results for product and marketing optimizationsLaunch surveys and polls to collect and provide customer insightsBuild forecasting and ROI models to project growth for various initiatives to assist with roadmap prioritizationLearn and assist data engineers with data transformations and ETL projectsYou...3+ years experience in data/business analytics using web, marketing, product and user behavior dataThorough knowledge of statistics applied to business analytics (forecasting, segmentation, A/B testing, predictive modeling, etc.)Strong visualization skills and experience with BI tools (Tableau/Looker)Proficient in SQL and PythonStrong presentation skills, being able to author and present insights to the leadership teamKnowledge of data tracking, database architecture, ETL/data preparation tools, APIs, data science and machine learning technologies a plusBachelor's degree in a quantitative field (Mathematics, Physics, Economics, Engineering or related areas)Why youll love it here...Your work has real purpose and will be helping to change lives. Really.We're a fun, close team of people with a work-hard, play-hard mentality.Our Gives Back program allots employees $1,000 per month to donate to the campaign of their choice.We have a fully stocked kitchen and \"MegaFridge\".We're happy to pay for superb talent, offer full benefits and issue bonuses.We're growing fast! We've got some incredible opportunities ahead.More about GoFundMe... GoFundMe is changing the way the world gives. Every day friends, family, and members of the community come together to support one another and the causes they care about most. Our campaigners have raised over $5 billion for medical expenses, education, community projects, sports, emergencies, pets and other personal causes and life events--making us the world's largest crowdfunding platform.  GoFundMe has assembled one of the best teams to go build the next leading consumer Internet company - including leaders from LinkedIn, Intuit, Groupon, YouTube, Facebook, Twitter, GoPro, Uber and several others. We are also funded by some of Silicon Valleys best venture capital firms, including Accel, Greylock, TCV, and others."}