{"jobID": "2697271235", "jobLocation": "Herndon_VA", "jobTitle": "Computer Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.novetta.com", "Headquarters": "Mc Lean, VA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Digital Reasoning, Unisys, Booz Allen Hamilton"}, "estimatedSalary": "111000", "jobDescription": "What we do: Novetta focuses on three core areas: Cyber, Entity, and Multi-Int Analytics. Our products are focused on processing and analyzing vast amounts of data in these core areas. Our services are focused on helping our customers move from complexity to clarity. The Novetta Difference: Our interdisciplinary expertise enables us to solve our customers’ most complex problems through a combination of: Smart people, fresh approaches, and focused inspiration; Domain and subject-matter expertise; Agile and flexible solutions; Software that operates at scale and speed; A culture of challenge and continuous learning. At Novetta, we bridge the gap between what our customers think they can do and what they aspire to achieve.  Our culture is shaped by a commitment to our Core Values:  Integrity | Customer Mission Success | Employee Focus | Innovation Position Description: Novetta has an exciting opportunity for a self-motivated and accomplished Computer Scientist to join our entity analytics team. You will work on complex projects involving data analysis, software engineering, and deploying software in a cloud computing environment. We are looking for a flexible problem solver with significant technical experience to join a team providing unique solutions for our customers and stakeholders. In this role you will:Analyze large amounts of dataDeploy applications on a large-scale data processing cluster using AWS technologiesDevelop algorithms and visualization tools to help stakeholders understand their data and prioritize new data sourcesDevelop and maintain tools to support operations and maintenance of production and development computing clustersBasic Qualifications:A Bachelor’s degree in computer science or related field and a minimum of 5 years of experience; or a Master’s degree in computer science or related field and a minimum of 3 years of experienceExperience in software development/engineering including requirements analysis, software development, installation, integration, evaluation, enhancement, maintenance, testing and problem diagnosis/resolutionSoftware development experience on Windows and/or Linux-based systems in Python or shell scripting or JavaScriptDesired Skills:Software development experience with Java, Python, or other modern programming languagesHands-on experience with other Hadoop ecosystem products, including but not limited to: Flume, Oozie, Hive, Hbase, and Hadoop StreamingBackground in statistical analysis, machine learning, or data scienceExperience with entity resolution products or a background in data matching theory and technologiesExperience developing applications in AWSSecurity clearance:Active TS/SCI with Polygraph is required to start Get a referral bonus for the great people you know! With our amazing referral program, you could be eligible to win outstanding rewards for referring qualified new hires to Novetta. Novetta is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law."}