{"jobID": "2831762071", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "OVERVIEW OF THE COMPANY Fox Networks Group  Fox Networks Group (FNG) is a primary operating unit of 21st Century Fox (NASDAQ:FOXA). FNG consists of FOX Television Group, which includes FOX Broadcasting Company and 20th Century Fox Television; FOX Cable Networks, which includes FX Networks; FOX Sports Media Group, and National Geographic Partners. Together these units create, program and distribute on a worldwide basis much of America's most popular entertainment, sports and nonfiction programming. JOB DESCRIPTION The newly formed Fox Data Analytics Group is seeking a Senior Data Scientist to join our team and be the department's lead expert on Machine Learning. The Sr. Data Scientist will implement applications of Machine Learning and AI for multiple initiatives and across the Fox Networks Group (FNG) businesses. This position will design, implement, and productize Machine Learning and AI models based on business or product team requirements. Further, this individual will advocate for the use of Machine Learning across the organization and keep our community informed of the latest trends in the AI and ML.  The ideal candidate will possess expertise in Machine Learning and AI , as well as the application of Deep Learning Neural Network Architectures to the fields of Natural Language Processing, Image Processing or Speech to Text. He or she will possess an MS in Computer Science, Machine Learning or related fields and 4+ years of industry experience within the Machine Learning/AI space, or a PhD with 1+ year of experience, and have a proven track record of successfully implementing Machine Learning models to deliver business value. ResponsibilitiesCollaborate with other members of the Data Science team to identify and scope opportunities for advanced data analytics, Machine Learning and AI to drive business value across multiple FNG divisions. Define plans to achieve and measure the results of those initiatives with statistical rigor.Lead the design and implementation of Machine Learning models to satisfy business requirements. Collaborate with Data Engineering team to operationalize machine learning and data analytics pipelines.Educate the technology and business community on advances in machine learning and AI.Promote the use of Machine Learning by proposing alternative and advanced approaches to traditional data analytics problems.Help identify and evaluate Machine Learning and AI tools and vendors that can provide an improvement to our models or to the productivity of the team.Drive innovation by exploring new experimentation methods, state-of-the-art tools, and AI/ML techniques that could sharpen or speed up our product decision-making processes.QualificationsMS in Computer Science, Machine Learning or related fields and 4+ years of industry experience within the Machine Learning/AI space, or a PhD with 1+ year of experience, with a proven track record of successfully implementing Machine Learning models to deliver business value.Experience with Machine Learning and AI techniques, including:Building Machine Learning models for classification and regression problems and evaluating its performance.Knowledge about advanced AI techniques in the field of Natural Language Processing, Computer Vision or Text to Speech.Familiarity with common Deep Learning architectures such as RNN, CNN, Autoencoders, Inception, etc.Traditional Machine Learning Techniques such as Logistic Regression, Random Forest and other Bagging and Boosting methods.Familiarity with techniques for dimensionality reduction, clustering and pattern recognition. Experience with relevant technologies, including Scripting and analytical languages such as Python, Scala, and Java.SQL and non-SQL related technologies (Redshift, Hive, DynamoDB, Hbase) for both structured and non-structured data analysis.Creating data wrangling and transformation pipelines using Spark.Scalable machine learning libraries such as MLlib, H2O, Mahout, etc.Deep Learning frameworks such as Tensorflow, Keras, Theano, etc.Data Analytics packages such as Pandas, Scikit-learn, Numpy or R.Cloud Technology Stacks from providers such as AWS and Google Cloud.Solid analytical skills and the ability to communicate verbally and in written form with all relevant groups (business management, technical teams, vendors, etc.) to articulate insight from data analytics efforts.Self-motivated and able to work well both independently and in a team environment. Must be organized and able to manage multiple and complex tasks simultaneously.Experience in the media industry or advertising industry a plus. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law.SDL2017"}