{"jobID": "2752053357", "jobLocation": "San_Francisco_CA", "jobTitle": "Resident Engineer", "companyRating": null, "companyInfo": {"Website": "www.bell.one", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Accenture, Capgemini Consulting, Infosys"}, "estimatedSalary": null, "jobDescription": " Reporting to the Manager of Advanced Services, this is a highly technical role, providing post-sales support of Junipers Network Products. The Resident Engineer will share both on-site and remote access to customer's network. Candidate is expected to have expertise on Juniper products deployed or to be deployed by providing technical and operational support on network issues, on-going certification, and testing efforts. While the listing of posting is San Francisco based, candidate may be remote but must be a US Citizen.Key Responsibilities: This is a full-time position and may require long work hours or occasional on call weekend support. Technical support to the customer may require the Resident Engineer to: Strong interpersonal skills.Demonstrated ability to break-down work activity to achieve project goalsDemonstrated ability to communicate project status and identify riskThe ability to work independently and to function in a team environment.Strong customer interface and presentation skillsUnderstand the customer’s organizational structure and become familiar with the customer’s network implementation and support processes and procedures to help in designing a network that is available and sustainable.To hold network information gathering workshops with the Customer to understand the Customer’s existing network design and technical requirements of new network designs.Carry out testing of new tools, features, and functionality as required by the customer in a laboratory environment and to help develop plans to implement and verify that they are operating correctly in the live networkTest patches and fixes to operating software and to ensure that they are implemented and functioning correctly in the pre-production test network and then live network as implementation plans dictate.Hold technology workshops with the customer to discuss equipment and network problems, and to provide case status updates, including the reasons for any problems encountered and the workarounds and/or solutions that are being triedSupport design and planning of Juniper SRX, NetScreen series, Space, and associated solutions within the customer backbone networkSupport design and planning of Juniper MX, and EX series, while not required, brings a stronger candidate to the customerSupport ongoing efforts in defining best practice policies for Juniper product applications used by customer.To peer with other employees performing similar Resident Engineering roles where lessons learned may help minimize risk associated with major network upgrades or changes in the network.The RE will be expected to develop secondary skills in other products in the Juniper product portfolio.Skills and Experience: Preferred candidates for this position should have a Bachelor’s Degree in Engineering or Computer Science with JNCIE certification.  Candidates for this role MUST have a minimum 7 years experience providing implementation and technical support of networking products in LAN, WAN, or Internet services environments with either a technology vendor or a service provider environment. Note: If they do not possess these, they will not be considered as meeting the basic requirements of position>Preferred Qualifications:An understanding of the protocols surrounding IP service provider networks. These skills include but are not limited to:IP/Routing experience (OSPF, ISIS, BGP, MPLS-TE, RSVP, LDP, IPv6, Routing Policy)Understanding of Multicast strongly preferredRouting protocol operation, migration, and scaling mechanismsRouting policies at BGP peering pointsVPNs and the associated tunneling technologies (MPLS, L3VPN, VPLS, MVPN.)Ethernet switching and 802.1Q, QOSSoftware Define Networking (SDN)Other Information:Relocation is/is not available for this positionLimited travel requirements.1-2 trips per quarter"}