{"jobID": "2776255539", "jobLocation": "Mount_Laurel_NJ", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.marlinfinance.com", "Headquarters": "Mount Laurel, NJ", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Public (MRLN) ", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": " OverviewMarlin Business Services Corp. ® is a publicly traded bank holding company (NASDAQ: MRLN) that provides nationwide commercial financing and depository products and is the parent company of Marlin Leasing Corporation. Marlin specializes in providing innovative financial solutions for small and mid-size businesses.  Since 1997, Marlin has extended over $5 billion in financing by providing tailored financing programs and competitive lease structures. Marlin's value proposition is centered around providing excellent service and delivering on commitments made to equipment dealers, manufacturers, resellers, distributors and their customers.  Marlin is a direct lender providing financing to businesses so they can acquire new equipment and technology while preserving capital.  The Data Scientist is skilled in statistical design and analytic methods, creates measurements and analytic models, and is responsible for scorecard design, development and implementation. This role is responsible for developing analytics and documenting model development process and associated methodologies employed. The candidate will perform a variety of complex tasks requiring discretion and expert judgment. They will recommend improvements and seek opportunities for innovation. He/she will be responsible for quality and accuracy metrics and analytics. The ideal candidate demonstrates initiative and contributes to problem solving while working as an individual contributor as well as in a team environment. Furthermore, this role plays a key role in product offering strategies by leading analysis to understand the drivers of overall performance and profitability by channel.Responsibilities Predictive model development, implementation and management. This includes writing the code, training/fitting of the model parametersDevelop models to forecast credit loss, new credit growth, balance attrition and profitability by channel including the creation of lifetime value modeling and portfolio valuationsIndependent model testing including evaluation of mathematical soundness, developmental evidence, historical performance, statistical testing, back testing, model benchmarking and appropriate sensitivity analysesFull documentation of the model development process, any associated testing performed, any and all modelling assumptions (particularly management assumptions), and relevant control and governance processes surrounding modelPresent quantitative results clearly and concisely and display a capability to discuss statistical and quantitative concepts coherentlyIdentify areas to enhance auto decisions and scoring strategies to maximize process efficienciesWork with cross-functional areas to develop predictive models such as response models, behavior models, dealer onboarding models, etc.Strong communication and interpersonal skills and ability to explain complex modeling techniques to the management teamMaintain knowledge of changes in the regulatory environment including ensuring compliance with SR 11-07.Lead analytic efforts in support of the continuous improvement of profitability, acquisition channel optimization and retention strategiesPortfolio monitoring and managementLoss forecasting & portfolio stress testingEnsures individual objectives are aligned to achieve the overall corporate goalsReviews and signs off on all validation reports and continuous monitoring outputsSupports and ensures collaboration across business verticals and cross-functional departments to improve the identification, measurement, management, reporting and controls in governance and risk management environmentsPromotes innovation in the risk domain to enhance efficiency and resultsQualificationsAn advanced degree in Quantitative fields ( Economics, Statistics, Mathematics, Industrial Engineering)Minimum 1 to 5 years of experience preferably in data science within the financial lending sectorStrong SAS, R or Python experience required in addition to advanced skills in MS Office, ExcelStrong interpersonal and communication skills requiredPossess in-depth knowledge and subject matter expertise of statistical techniques and their application.Knowledge of techniques and tools that promote analysis and the ability to effectively interpret results and determine the correct course of actionTechnical aptitude with strong logical, problem solving and decision-making skillsProficient with the use of advanced statistical analysis software and applications (SAS, R, Python, SQL programming, etc.)Strong understanding of statistical tools and their application to business, as well as principles of cost/benefit analysis, risk management, marketing, collections and operationsAbility to prioritize according to the strategic direction of the organization, ability to meet deadlines and follow through on the completion of high-profile projects and initiativesHighly organized and detail oriented with the proven ability to multi-taskStrong written and verbal communication skills and ability to work with various levels of an organization"}