{"jobID": "2829635046", "jobLocation": "Chicago_IL", "jobTitle": "TWSS 7364 - Data/BI Business Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.thoughtwavesoft.com", "Headquarters": "Aurora, IL", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "Data/BI Business Analyst Chicago, Illinois - United StatesTax TermsN/AOverviewBI Business AnalystChicago, IL The role is expected to aid in one or more BI projects in gathering requirements with multiple elicitation activities, document and model business processes and requirements following our standards and templates. Other activities would include in preparing test scenarios, helping in functional testing, training end users. In detail the Experience and Skills Requirements are: * Strong Business Analysis experience in end-to-end Business Intelligence projects with excellent communication and organization skills.  * Proficient in elicitation of requirements through workshops, interviews, etc.  * Experience in modeling and analyzing business processes and requirements.  * Experience in prototyping user interfaces.  * Understanding of metrics, dashboard design and drivers of business analysis  * Properly documenting the business and functional requirements and getting sign-off and working in Agile environment where appropriate.  * Experience in preparing high level data dictionaries, data mapping documents  * Experience in mock-ups and wireframes for reports, dashboards, scorecards etc. based on the requirements  * Understanding/experience of business benefits definition, tracking, and measurement.  * Working with BI Architect in developing detailed functional specifications and reviewing requirements  * Assisting in the functional testing process  * Ability to perform analysis on data via ad-hoc reports or freehand queries to support the requirements process  * Understanding of Business Intelligence, Data Warehousing, Data Integration fundamentals to gather complete requirements  * Experience/knowledge of BI Products such as OBIEE 11g,Tableau to design solutions appropriate for business users and within best practices.  * Experience/knowledge of financial reporting, cost accounting and financial allocation.(Nice to have)  * Ability take ownership of BA activities in project when needed and/or take direction from Project Management/Lead BA  * Support BI tool experts and developers in development and ensure that the solution is built according to specifications KEY QUALIFICATIONS: Education: Bachelors degree in Business, Computer Science or related field Years of Experience: A minimum of 6 years of in-depth business experience with the bulk of that experience serving a business/IT liaison role Required Skills  * Experience in business analysis and providing business solutions  * Basic knowledge of systems development cycles, methodologies, and work flow diagramming  * Knowledge of company’s business and technical environments  * Excellent analytical, problem solving, organizational, communication and interpersonal skills  * Experience with OBIEE and its best practices  * Experience in reporting and analysis best practices in general Preferred Skills * Experience in leading projects and excellent communication capability with business stakeholders  * Experience in financial reporting, cost accounting and financial allocation.Looking for a BA with experience in Data Warehousing and reporting (ideally OBIEE)Data Warehouse Exp and Reporting experience - ideally with OBIEEData Warehouse Exp and Reporting experience - ideally with OBIEE"}