{"jobID": "2829254355", "jobLocation": "Washington_DC", "jobTitle": "Data/Business Analyst (Financial Accounting)", "companyRating": "3.0", "companyInfo": {"Website": "www.theoakleafgroup.com", "Headquarters": "Chevy Chase, MD", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " GoldenSource Corporation, Actualize Consulting, Navigant"}, "estimatedSalary": "93000", "jobDescription": " For a large financial services client, we are seeking a Data/Business Analyst (Financial Accounting), to work on a 9-month or longer project to formulate requirements and analyze data for loan accounting and debt/derivative accounting products impacted by new mortgage portfolio interest rate hedge accounting requirements. Initially the role will focus on Business Analysis for development of requirements and data mapping, then shifting to Data Analysis for intensive data querying as the initiative ramps up. Create, design, and format technical specifications including descriptive text, process flows, and other information needed to produce specificationsConduct data analysis and identify and document data requirements, definitions, data dependencies and relevant business rules.Develop data requirements through various methods including individual and group (stakeholder) discussions, independent data analysis and by extracting from a suite of mathematical functions and code.Candidate will also develop data models, data dictionaries, event models, CRUD matrix, or other artifacts.Engage with enterprise data governance to adhere to corporate data standards.Bachelor’s degree in Computer Science or related field.5+ years of relevant experience5+ years working with Oracle, SQL stored procedures and advanced querying. Very strong SQL capability required for data analysis.Experience with data mapping and research.Ability to document highly complex data processing and demonstrated experience making clear connections between the business principles and the numbers/data.Strong communication skills, able to persist effectively cross-functionallyPreferred Skills:NetezzaFamiliar with concepts of treasury accounting, derivatives and mortgage loan amortization. Finance or economics knowledge or experience.Prior related data experience at a GSE organization and familiarity with mortgage loans, amortization, treasury accounting, and derivatives.Experience in Agile environment.Company Overview The Oakleaf Group is a mid-size consulting firm with offices in Chevy Chase, MD, Bethesda, MD and New York, NY. Our people are our greatest assets and our company culture is grounded on that belief. Our goal is to thrill our clients and challenge and reward our employees. As a member of the Oakleaf team, you will have an exciting opportunity to work with emerging technology, modernize financial applications, and grow in a friendly workplace where you can work independently and collaboratively. In this position the ideal candidate will work to solve complex “hot topic” issues currently faced by the financial services industry. We bring depth of experience to a wide range of highly satisfied clients, delivering trusted advice along with quantitative, technology, regulatory, and operations strategies. Do you possess the talent and dedication to be part of our growing team? Third party candidates will not be considered for this position.As a condition of employment with The Oakleaf Group, any successful job applicant will be required to successfully complete a background investigation, which may also include a pre-employment drug screen and/or a credit check for positions in some areas of our business. The Oakleaf Group is an equal opportunity employer. Applicants are considered for positions without regard to race, religion, gender, native origin, age, disability, or any other category protected by applicable federal, state, or local laws. The Oakleaf Group participates in the E-Verify program."}