{"jobID": "2817592078", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Scientist, Analytics - Video Ecosystems", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "155000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Facebook is the second largest online video platform in the world. Video at its heart is a social experience, as people talk about and talk through video. Users upload their own videos. They go Live and broadcast to their friends. Pages upload tens of millions of hours a day. The video team at Facebook is responsible for the entire video experience at FB, from the uploading, to the watching to the interactions around the video. This role is focused on better understanding the ecosystem of videos on Facebook. That includes better understanding the types of videos we have (classification by different content types and publisher types); better understanding the types of user interactions we have (substantive discourse versus platitudes versus shares); better understanding the impact of video watching on our users. Responsibilities:"}