{"jobID": "2837716074", "jobLocation": "San_Antonio_TX", "jobTitle": "Master Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.salientcrgt.com", "Headquarters": "Fairfax, VA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " We are seeking a Master Data Analyst to join our project team in building and implementing enterprise grade software systems. This role will coordinate multiple simultaneous software development project efforts and define best practices and standards. The ideal candidate will bring a diverse background of software engineering process and development experience.  As a leading provider of Information Technology, Training and Engineering services worldwide, our people play a critical role in helping our customers make better decisions while protecting our nation. We bring forward-looking business insights to strengthen communities and change lives. At Salient CRGT you will join talented people who are as passionate about their work as you are - analysts, programmers, systems/network administrators, engineers, trainers, communications specialists, project managers, and more. For the experienced professionals and veterans, we value your expertise and offer opportunities to share the most compelling projects. For students transitioning from college to work, explore the opportunities for college students and graduates.  Mandatory Qualifications (Education, Certifications, Experience, Skills) Responsibilities/Duties:Works closely with senior-level government clients to define business requirements and develop functional solutions to complex problemsRefines high-level requirements into detailed, development-ready user storiesConducts gap analysis between delivered functionality and client requirements and recommend solutionWorks closely with Development Team to ensure requested capabilities can be achievedProvides analytical and troubleshooting abilities to address multiple technical areas of systems.Provides full life cycle support in software and system development at varying degrees of responsibility and technical contributionIntense research into complex data/information manipulation. Recognizes and acts on inconsistencies in data or results and escalates unusual problemsWorks independently on assignments where considerable judgment and initiative are required in resolving problems and making choices, recommendation or decisionsWorks as an integrated member of the project team in an Agile Scrum environmentCreates and updates project documentation - workflow, design, and sustainmentTesting of the ongoing development to ensure acceptance criteria has been met and to drive further user story developmentPresentation of analysis, plans, and complex information to high-level Government representativesRequired Skills:Twelve (12) of hands-on experience with Information Technology to include three of thefollowing areas: Systems Requirements, project management and strategic planning, HIPAA requirements, Medical Systems, Operational Requirements, Enterprise Strategic Planning and operations, Unix/Linux system software, Test & Evaluation, and Training. Recognized expert who has demonstrated industry and public service leadership in one or more of: medical systems; advanced system architecture; information assurance; hardware technologies; digital/analog communications technologies; applied physics; human factors engineering; computer simulation; electronic sensor technologies; and ERP. Demonstrated experience in at least two of the following areas: Ability to plan and organize work and interact with technical and non-technical personnel translating user requirements into responsive applications.Demonstrated detailed knowledge of IA concepts 2. and requirements.Demonstrated comprehensive knowledge of DOD military specifications and standards.System design integration planning for multiple large-scale installations.Hardware and software EvaluationSystem Test and Evaluation, planning execution and management.System requirements planning and oversight.Technical development product milestone scheduling.Understanding of FISMA and HIPAA IA requirements.Information Security Management and Information Systems Audit.Excellent understanding of the software development life cycleHands-on experience with Agile projectsMust have excellent written and oral communication skillsAbility to manage multiple assignments in a fast-paced work environmentActive Security ClearanceInformation technology experience with experience working closely with subject matter experts to develop requirements and/or user stories.Experience working closely with subject matter experts to develop requirements and/or user stories.Ability to work in a multiple discipline teamExcellent writing communication skills to assist in the creation of project-related documentation such as Requirement Traceability Matrix, Project Plans, Configuration Management (CM) Compliance Plan, Software Implementation Plan, Development Integration Test Environment Plan, Solutions Design Documents (SDDs), Contingency Operations Plan, and other project documentsProvides deep subject matter expertise in Oracle applications modules and works with the client to develop functional solutions to complex problems. Interprets generally defined practices and methods and applies them to the COTS environment.Recognizes and acts on inconsistencies in data or results and escalates unusual problems.Defines configuration requirements in the context of functional requirements.Works on assignments where considerable judgment and initiative are required in resolving problems and making choices, recommendations, or decisions.Excellent oral and presentation communication skillsStrong working and writing skills in the use of Microsoft Office Products: Word, PowerPoint, VisioExperience with FISMA and HIPAA IA requirementsDefines configuration requirements in the context of functional requirements.Works on assignments where considerable judgment and initiative are required in resolving problems and making choices, recommendations, or decisions.Excellent oral and presentation communication skillsStrong working and writing skills in the use of Microsoft Office Products: Word, PowerPoint, VisioExperience with FISMA and HIPAA IA requirementsEducation/Certification Requirements:BS / BA Technical Training in Information Assurance, Information Technology, Medical Systems, Network  Design, Strategic Planning, and/or HIPAA law Location: San Antonio, TX  Mandatory Qualifications Salient CRGT will not sponsor applicants for work visas for this openingThe ability to obtain/maintain a Public Trust Clearance is required including residency in the United States a minimum of three (3) of the past five (5) years Desired Qualifications (Education, Certifications, Experience, Skills) Desired Skills:Involvement on IT projects supporting systemsAgile training or certificationsExperience implementing DevOps and Continuous IntegrationExperience in programming languages Salient CRGT is a leading provider of health, data analytics, cloud, agile software development, mobility, cyber security, and infrastructure solutions. We support these core capabilities with full lifecycle IT services and training--to help our customers meet critical goals for pivotal missions. We are purpose-built for IT transformation supporting federal civilian, defense, homeland, and intelligence agencies, as well as Fortune 1000 companies.  If you feel you are qualified for this position, express interest by clicking the Apply button below (if you are viewing this position on the Salient CRGT website). If you are viewing this job posting outside of the Salient CRGT website, please visit: www.salientcrgt.com/careers to express interest in this position through the Salient CRGT Careers page.  Salient CRGT is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, age, sex, sexual orientation, gender identity or expression, veteran status, disability, genetic information, or any other factor prohibited by applicable anti-discrimination laws. provided by Dice Agile, Analysis, Analyst, Architecture, Business Requirements, Configuration Management, Development, ERP, Genetic, Hardware, Lifecycle, Linux, Management, Oracle, Physics, PowerPoint, Programming, Project, Project Management, Research, Scheduling, Scrum, Security, Simulation, System Architecture, Testing, Unix"}