{"jobID": "2821579506", "jobLocation": "Des_Plaines_IL", "jobTitle": "Scientist", "companyRating": null, "companyInfo": {"Website": "www.spectraforce.com", "Headquarters": "Raleigh, NC", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Scientist  Location: Des Plains, IL 60018  Duration: 12 monthsDescription A qualified and motivated scientist to join a team developing oncology and infectious disease molecular diagnostics assays. The individual will conceive, design, conduct and lead independent or multi-disciplinary research driven by strategic business needs. He or she could act as the technical lead or Project Manager and interface with other departments (i.e., Marketing, Business Development, Technical Service and/or Operations), as well as with external collaborators to coordinate product development and improvement. The successful candidate must have strong analytical, written and communication skills, solid track record of applied research, as well as leadership abilities. Major responsibilities: Responsible for implementing and maintaining the effectiveness of the quality system. Ensures quality through sound experimental design, execution and evaluation. Conceives, plans, and executes projects related to the strategic needs of the division. Generates new product ideas consistent with division strategy. Interacts with functional groups outside R&D; to establish scope for new projects. Applies advance scientific knowledge to projects. Critically analyzes complex data, applying advanced computer skills. Presents complex technical data to large and diverse groups. Identifies/communicates to other areas in the division implications of relevant scientific observations. Maintains high level of professional expertise through familiarity with current scientific and industry literature, knowledge of competing technologies and/or products, and attendance of scientific seminars and meetings. Identifies new directions for research from literature review. Contributes to scientific presentations and publications. Participates in technology teams. Maintains and develop broad external and internal contacts as required to accomplish job objectives. Skills/ExperienceKnowledge of regulations and standards affecting IVD’s and Biologics, including FDA requirements, ISO 9001 and GMP guidelinesExtensive research, product developmentDemonstrated competence in data analysis, research design and evaluation of new techniques and procedures for manufacturing reagents, systems, products or technologiesExcellent organizational skills, including the ability to efficiently evaluate, prioritize and handle multiple and changing projects and prioritiesStrong analytical and quantitative skillsExcellent verbal and written communication skills and the ability to interpret and summarize scientific results in a clear, concise, accurate mannerAbility to initiate and maintain scientific collaborations with academic and industrial research groups, as well as interact effectively with personnel outside R&D; (e.g., Clinical, Regulatory Affairs, Business Development)Desire to work within a team and demonstrated ability to adapt to changing needs consistent with demands of the workgroupPreferred Qualifications:Experience development of molecular assays, including IVD assaysResearch experience in molecular biology, specifically in developing, validating and implementing DNA detection methods.Experience with Fluorescent In Situ Hybridization techniques and real-time PCR assay development would further strengthen this candidate’s opportunityKnowledge and experience utilizing genomics tools/databases, especially those utilized in the field of cancer research analyzing large data sets, DNA analysis software applications; familiarity with statistical analysis tools and approaches is a plus.Management/supervisory experienceEducation RequirementsPh.D. in molecular biology, biochemistry, genetics, cell biology or related field with 2+ years of advanced research or industrial experience (or equivalent) or MS with 6+ years of experience."}