{"jobID": "2818864702", "jobLocation": "San_Jose_CA", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.incubelabs.com", "Headquarters": "San Jose, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The ideal candidate is expected to play a pivotal role in our R & D team. The candidate must have a background in biochemical analysis such as spectrophotometric, fluorescence immuno assays, HPLC, CE, LC-MS. Experience with microplate assays is a must and experience with Luminex MapX technology is an advantage. Experience in liquid handling robotic platforms for bioanalytical assay workflows is highly preferred. Excellent interpersonal and communicative skills are a must as the candidate will work with scientists at all levels, pay attention to detail, and effectively communicate progress and results. Minimum Qualifications: M.S. or Ph.D in biochemistry, chemistry, engineering or related discipline.  Hands-on experience (at least 2 years) in bioassays and liquid handling in a pharmaceutical or biotechnology research lab.  Proficiency in both writing and optimizing scripts on automated liquid handling platforms (e.g., Beckman, Hamilton, Tecan etc.,).  Analytical, creative thinker, ability to solve problems.  Effective organizational and time management skills.  Highly energetic and self-motivated. Able to work independently as well as part of a team.  Excellent written and communication skills. Responsibilities: Participate in projects that are complex and scientifically demanding.  Provide expert in vitro and ex vivo experimental support from concept/design, initiation, execution and data analysis through communication of results to project teams and relevant groups.  Perform bioanalytical assays for the quantification of the analytes in preclinical and clinical samples.  Participate in the development of in vitro/in vivo models performing a variety of microplate assays independently with minimal supervision.  Design and manage the data from complex experiments including preliminary statistical analysis.  Configure, program and troubleshoot laboratory automated platforms. Optimize existing automated processes to improve efficiency, throughput, robustness and quality.  Provide support for existing equipment and coordinate vendor support as required.  Document test plans and create Standard Operating Procedures (SOPs) for automated workflows.  Coordinate with different cross functional team members and execute projects in a timely manner.  Perform other lab duties as assigned."}