{"jobID": "2811455772", "jobLocation": "San_Francisco_CA", "jobTitle": "Contingent: Data Analyst – Deposit Management", "companyRating": "3.7", "companyInfo": {"Website": "www.firstrepublic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (FRC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Silicon Valley Bank, City National Bank (Texas)"}, "estimatedSalary": "77000", "jobDescription": " OverviewFirst Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business. We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.ResponsibilitiesThe Data Analyst will work as a key technical resource for the portfolio of large corporate projects at First Republic Bank. The Data Analyst will have deep knowledge in analyzing data with expertise in interpreting data quality for banking solutions, and will be working across organizational boundaries and analyzing and advising on data reporting to enable our deposit business strategy. The primary duty of the Data Analyst will be to conduct full lifecycle analysis with Business to understand business requirements and then partner with key data resources, technology resources and vendors to formulate critical data requirements and design reporting capabilities. The ideal candidate will be able to evaluate a business requirement, perform end to end data assessment, identify and document the data requirements and recommend appropriate data management solutions. The candidate is expected to be a self-starter, requiring minimal oversight, is results-oriented, with a strong sense of teamwork. The role requires exceptional communication skills and an ability to build and maintain working relationships with team members, vendors, and other departments involved.  In addition to these more general cross functional responsibilities, the Data Analyst will also be responsible for the following: Interpret data, analyze results using known techniques and provide ongoing reportsIdentify, analyze, and interpret trends or patterns in complex data setsPartner with Business to understand business processes and requirementsPartner with key data and technical resources (example, Data Architects, Data Champions, Enterprise Architects, Infrastructure leaders) and vendors to document data requirements and solution.Perform end to end impact assessment for any technical change and how it may impact upstream and downstream systems and processes.Partner with the Testing Lead to provide guidance in overall test strategy and test execution.Support the Business for User Acceptance Test.Locate and define new process improvement opportunitiesDefine Data quality with data analytics and other strategies that optimize efficiency.Identify any needed reporting, instrumentation and analytics in support of automation. QualificationsEducation / work experience: Bachelor's Degree or higher in technology-related field or relevant experience in implementing software for a financial institution.3+ years of banking experience required4-6 years of proven working experience as a data analyst or business data analystTechnical expertise regarding data models, database design development, data mining and segmentation techniquesStrong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsHighly adept user of MS Visio, MS Excel, MS Access, and common data analytics tools requiredRelevant experience acceptable as a member of a financial institution or consulting firm.Requires knowledge and proven experience in Agile/SCRUM.Must possess excellent verbal and written communication skills and an ability to build relationships at all levels of the enterprise including external vendors.Demonstrated ability to exercise independent judgment and strategic thinking under a minimum of supervision.Must possess strong interpersonal and organizational skills. Professional skill / competency: Expert at managing by influence to achieve goals through departments and staff not directly in a reporting relationship.Strong business orientation with broad experience with banking processes, technology and change initiatives.Understands business processes, appropriate application of technology in supporting those processes, and the common technical complexity / considerations when evaluating new products or process options.Skilled at identifying and evaluating existing operations and new developments and gauging appropriate opportunities for the business.Focus on development of organizational capabilities and resources to support continuous evolution of a more competitive and profitable Bank Leadership skill / competency: Demonstrated leadership, planning, and managerial skills with ability to contribute broadly at any level.Pragmatic with an ability to generate trust and build alliances across business and functional lines.Consistently demonstrates and follows high standards of integrity in business decision-making. Personal skill / competency Strategic perspective and business acumen. Looks toward the broadest possible view of an issue/ challenge; can easily pose future scenarios; can think globally about all aspects of the Bank; can discuss multiple considerations of an issue and forecast them into the future.Communication skills. Demonstrates excellent communication and interpersonal skills; able to communicate clearly and concisely in a variety of settings and styles; is effective in a variety of formal presentation and meeting settings; commands attention and can manage group process during presentation/ discussion.Change management. Gains support for change by providing context and responding with sensitivity to concerns; takes initiative to recommend/ develop innovative approaches to getting things done.Negotiation skills. Negotiates skillfully in tough situations with internal and external groups; can be both direct and diplomatic.Peer relationships. Can quickly find common ground and solve problems for the good of all; is a team player and encourages collaboration. Mental/Physical Requirements: The ability to learn and comprehend basic instructions; understand the meanings of words and respond effectively; and perform basic arithmetic accurately and quickly.Vision must be sufficient to read data reports, manuals and computer screens.Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person.Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.Position involves sitting most of the time, but may involve walking or standing for brief periods of time.Must be able to travel in a limited capacity."}