{"jobID": "2837613207", "jobLocation": "McLean_VA", "jobTitle": "Data Analyst Specialist", "companyRating": null, "companyInfo": {"Website": "www.iconma.com", "Headquarters": "Troy, MI", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Modis International, Experis"}, "estimatedSalary": null, "jobDescription": " Location: McLean, VA  Duration: 12 months Description: - The Business Engineering (BE) group, within the Investments and Capital Markets Business Technology Office (I&CM; BTO), is responsible for delivering and managing technology solutions that support the entire I&CM; division. BE works closely with our customers across the organization to develop/maintain solutions and infrastructure that enhance and streamline business processes. We also support critical data-centric infrastructure and processes vital to I&CM.; - The candidate will work closely with BE team members, business partners, and IT teams to support a range of small- to medium-sized projects within I&CM.;- We are seeking a self-motivated leader who can provide system analysis and project management support.Scope of work/tasks: - Create business requirement documents - Create UAT test cases and any related artifacts - Document test results and training materials  - Coordinate deployments by creating pre- and post-deployment tasks  - Work with developers to ensure defect fixes and issue resolution  - Track project status and report to senior management - Develop and troubleshoot SQL queries; support creation of DDL scripts- Develop solutions using tools like Dataflux, Python, and shell scripts.Preferred Skills:- Strong data and financial analytical skills- Knowledge of fixed income products, especially mortgages- Experience with databases (Sybase, DB2, SQL Server, Oracle) - Previous experience supporting multiple concurrent efforts/projects in various capacities  - Application development and support experience - Experience with tools like Dataflux, Python, and Schell scripting. - Excellent interpersonal, team, verbal, written and listening skills Education Level: - Bachelor Degree Years’ Experience: 5+"}