{"jobID": "2607483836", "jobLocation": "Corpus_Christi_TX", "jobTitle": "Engineer/Scientist-in-Training II/III", "companyRating": null, "companyInfo": {"Website": "www.apaienv.com", "Headquarters": "Fort Worth, TX", "Size": "51 to 200 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DetailsLevel EntryJob Location Corpus Christi Office - Corpus Christi, TXPosition Type Full TimeEducation Level 4 Year DegreeSalary Range UndisclosedTravel Percentage Up to 25%Job Shift DayJob Category Entry LevelDescriptionWe are accepting resumes for an Engineer-in-Training II/III to support growing operations located in our Corpus Christi office. The ideal candidate will be motivated and hard-working, have excellent oral and written communication skills, will be able to work in both field and office environments, and be capable of multi-tasking on several projects. The EIT will report to and work with a Senior Project Manager in the Corpus Christi office to support existing and future work in the water and wastewater market. The EIT will support water and wastewater conveyance projects managed from the Corpus Christi office; but will also support a wide range of other water and wastewater related projects in Corpus Christi and other APAI offices. This position works with the Project Manager and staff in other Texas branch offices to support the project team to prepare engineering memoranda and reports; design drawings and details; technical specifications; and cost estimates. The person must have exceptional time management skills, as well as a solid understanding of the engineering fundamentals related to conveyance of water, stormwater, and wastewater in pipe networks, pump design, hydraulics and construction administration. A solid understanding of wastewater treatment principles would be useful in this position, as well.This position will be responsible for performing assessments, design, design calculations, hydraulic analysis/modeling, and technical office and field work for conveyance-related and storm water projects. The opportunity will be available to assist with water and wastewater treatment projects and with a variety of other water and wastewater planning, quality, and regulatory support projects.Essential Functions:1. Serve as an Engineer-in-Training on multiple water and wastewater conveyance assessment and design projects and a variety of other water and wastewater planning, quality, and regulatory support projects. 2. Perform hydraulic analysis for pipeline projects 3. Develop preliminary cost estimates based on standard industry information and project specific information 4. Develop drawings and/or sketches for incorporation into study figures or design drawings 5. Edit technical specifications 6. Draft document sections and/or a complete technical memoranda or lengthy reports 7. Evaluate project permitting requirements and coordinating with governing agencies on permit applications and submittals 8. Research equipment and product manufacturers and vendors for information, pricing, and project-specific design considerations 9. Assist with communications pertaining to specific assignments or meetings 10. Assist with coordination of work of designers, interns and/or administrative staff 11. Assist with periodic construction observation site visits and prepare field site visit reports 12. Attend project meetings with Project Manager, shadowing in client relationship management 13. Participate in professional associations representing the firm in networking opportunities 14. Participate in company-provided training 15. Oral and written communication, and collaboration skills in a professional setting 16. Problem solving, investigation, and analysis skills 17. Computer proficiency in engineering software products (standard office software, project scheduling, AutoCAD familiarity is helpful, GIS familiarity (not proficiency) a plus.Work Environment:This job includes a mix of approximately 75% office time and 25% outside field requirements depending on project scopes. Candidates are expected to serve in a traditional professional office environment. Additionally, candidates are expected perform outside data collection from agency files or through field activities; including site visits to construction sites, obtaining field notes, operating basic survey equipment, etc. in various climates and topography within Texas.Physical/Mental Demands:Physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, communications with other engineers, clients, vendors, and contractors will be necessary. Traveling to and from project sites and meetings is required. Utilizing basic survey equipment, obtaining field notes, climbing stairs or ladders, etc in various climates within Texas may be required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Mental demands typically include time management, conflict resolution, excellent communication and organizational skills. Must be able to manage fast paced project environment with multiple competing deadlines.Position Type/Expected Work Hours:This is a full-time position, 40 hrs/wk. Typical days and hours of work are Monday through Friday, 8:00 a.m. to 5 p.m. Occasional longer hours may be required as job duties demand, including evenings and/or weekend work.Travel:10% Travel is expected for this position's essential job duties.Other Duties:Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.RequirementsCompetencies- Microsoft Office high proficiency, including Excel, required - Working knowledge of AutoCAD or Microstation preferred - Working knowledge of GIS, Google Earth or other Geographic mapping systems preferred. - Problem solving, investigation, and analysis skills - Team collaboration skillsPersonal Qualities: Independent, self-directed worker; knows when to stop and ask questions; organized and able to prioritize multiple tasks; insatiable desire to continue learning; loves researching and solving complex problems. Must be efficiency minded seeking methods to improve and streamline processes. Takes initiative to plan, schedule, conduct and coordinate project-specific work assignments while balancing deadlines. Self-starter who takes ownership of work product. Fits in company culture of integrity, kindness, service and excellence.Supervisory ResponsibilityThis position has no direct supervisory responsibilities.Required Education and Experience1. Bachelor’s degree in Civil, Environmental, or Mechanical Engineering with a strong interest in hydraulics and/or water/wastewater engineering from an ABET accredited engineering program. 2. Engineer in Training (EIT) certified in the state of Texas preferred; or ability to obtain EIT certificate within 6 months of being hired mandatory. 3. Able to perform engineering calculations. 4. Utilize Microsoft Word and Excel to perform calculations, tables of information, written communication to share with other team members 5. Outstanding communication skills and past experience working in a team environment.Desirable Additional Education and Experience1. Experience in Consulting Engineering industry specializing in hydraulic design (open channel and closed pipe systems), water/wastewater engineering. 2. Have worked under a Professional Engineer for 3 months - 3 years.Additional Eligibility QualificationsRead, write, and speak English at a professional level.Valid Texas Driver's LicenseWork Authorization/Security ClearanceMust be able to legally work in the U.S. on a permanent basis without sponsorship.EEOC StatementIt is the policy of the Company to provide an equal employment opportunity for all applicants and employees. The Company does not unlawfully discriminate on the basis of race, religion, color, gender, gender identity, sexual orientation, national origin, ancestry, age, medical condition, disability, workers’ compensation status, or veteran status."}