{"jobID": "2836580494", "jobLocation": "Tomball_TX", "jobTitle": "Certifying Scientist / LC-MS Chemist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Elite Medical Laboratory was founded by a physician, for physicians, who saw the need to provide a different lab testing model to address the growing concern of medication abuse and over prescription. We seek outstanding individuals who are talented and dedicated and provide them with a supportive work environment and opportunities for advancement within our rapidly growing organization.  We have an opening for a Certifying Scientist/LC-MS Chemist in our Northwest Houston, TX laboratory. Must be experienced reviewing/certifying data in a clinical toxicology lab and performing duties related to LC-MS/MS production with strict adherence to laboratory procedures. SPECIFIC DUTIES:Perform complex scientific analyses, including operation, maintenance, and troubleshooting of multiple LC-MS/MS instrumentationAnalyze chromatography data from the LC-MS/MSIdentify samples requiring re-injection and/or re-extractionVerify quality control and calibration data is within rangeReview and interpret patient report dataCertify patient test results for accurate reporting to clientsPerform regular duties of a bench chemist as needed, including sample preparationMaintain and protect the confidentiality of all lab and client informationOther duties as assignedRequirementsAPPLICANTS MUST MEET THESE MINIMUM REQUIREMENTS TO BE CONSIDERED:Education: Bachelor’s degree in a chemical, physical, biological, or clinical laboratory science. Master's degree preferred. Experience:Must have at least 3 year full time data review/certifying experience in a clinical/pain managment toxicology labGeneral clinical lab experience should be greater than 2 yearsExperience with AB Sciex and MultiQuantSkills & Abilities:Knowledge of toxicology/pharmacology of legally prescribed medications and illicit drugsMastery of fundamental LC-MS/MS conceptsMethod development and method improvement a plusStrong organizational skills; detail orientedCritical thinking and problem solving a mustAbility to work under time constraintsGood laboratory techniquePhysical Requirements: Must have adequate mobility to move throughout the laboratory areas. Lifting up to 25 lbs. Other: Overtime as necessary; exposure to biohazardous material, caustics, flammables, solvents, and reactive compounds. Benefits We offer competitive pay; health, dental, vision, life insurance benefits; paid time off; paid holidays.  We are an Equal Opportunity Employer."}