{"jobID": "2756011096", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.spins.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " SPINS, a Chicago-based SaaS company, is seeking a Data Engineer to join the Retail Data Science Solutions team.  By leveraging SPINS industry-leading proprietary data and analytics, our technology enables deeper, more engaged relationships between Retailers, Brands and Consumers through our platform, web, and mobile products. WHO ARE WE?We eat collaboration and curiosity for breakfastWe communicate quickly and succinctlyWe believe in roles instead of jobsWe take initiative independently and hurdle challenges togetherWe discuss, debate, decide and do with the same rapidity as we iterate our platformWe are a talent ecosystem whose health is predicated on each individuals ability to support every other individuals successWHO ARE YOU?Someone energetic, empathic and earnestSomeone who wakes each morning thinking of which opportunity they will grab todaySomeone that refuses to give up when the path isnt pavedSomeone that consistently delivers quality work on scheduleSomeone who would rather build the right tool to do the job than wait until theyre handed oneA creative thinker as adept at looking at the Big Picture as they are at the detailsAn obsessive perfectionist that knows when to put down the paintbrush and shipThe kind of person that can expertly use an Onion headline as an analogy in a serious strategy meetingWHAT DO WE NEED? You will report to the Director of Data Science Solutions and create robust, scalable data engineering pipelines that scale across the SPINS business. You will be working in a hands on role, using python to efficiently uncover meaning and insight that leverage SPINS proprietary data. You will develop and drive the analytics efficiency of the organization by contributing to a reusable codebase that can be leveraged in other projects across the organization.  Ideally, you thrive on continuous innovation when value is determined by client results. You must have a passion for digging into data using the latest tools and methodologies. WE'LL BE COUNTING ON YOU FOR...Developing and maintaining tools that bridge disparate data sources across the organization to serve data models, dashboards, decision aids, and business case analysis with up-to-date and accurate informationCreating hourly, daily, weekly, or monthly automated processes built on proven and completed work.Creating innovative and efficient techniques that better solve the problems we are working onAssessing risks to proposed analytics solution based on quality of existing data sources and actively develop QA procedures to mitigate those risksImplementing retail partner business rules in a robust and scalable wayFacilitating knowledge transfer across the business between Product Delivery and Solutions teams.Recommending and implementing enhancements that standardize and streamline processes, assure data quality and reliability, and reduce processing time to meet client expectations.YOU ALREADY...Have a professional quantitative background with an education that stresses analytical thinking and quantitative methods (STEM)Have a strong knowledge of python in a data context (iterators, pandas, scikit-learn, etc.)Are passionate about innovating new ways to answer novel problemsAre comfortable with being given the self-autonomy to work independently and experiment with new ideas and new ways to design and implement data science solutions to advance business goalsHave confidence in being the expert on SPINS data capabilities and best practices based on independent synthesis of a broad range of dataFamiliarity with Docker is a plus."}