{"jobID": "2738347222", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "95000", "jobDescription": " About the role  The Data Engineering team supports business decisions at Avanade and for Avanade clients through comprehensive data analysis. It collects, aggregates and analyzes data from multiple internal and external sources and reports patterns, insights and trends to Avanade decision-makers. Its goal is to support data-driven insights into business performance, opportunities for improvement and identification of root cause problem analysis.  As a Data Engineering Consultant, you will collect, aggregate, store and reconcile data in support of Avanade business decisions. You will help design and build reporting tools, information dashboards, data generators and other end-user information portals and insight tools. You will be a critical part of the data supply chain, ensuring that stakeholders can access and manipulate data for routine and ad hoc analysis.  Day-to-day, you will: Plan and deliver data warehouse and storage architecturesSupport the planning and implementation of data design services, providing sizing and configuration assistance and performing needs assessmentsDevelop and maintain data warehouse schematics, layouts, architectures and relational databases for data storage and data miningDeliver data to end users using Microsoft SQL Server Reporting Services (SSRS), Microsoft Excel, PowerPivot and Microsoft SharePoint Performance PointCustomize data storage and extraction, data mining, database architecture, metadata and repository creationImplement effective metrics and monitoring processesTravel as needed. About you  You have a good analytical mind on top of excellent technical skills. You are familiar with current database technology and data reporting tools, and more importantly, you understand the point of it allto produce solid insights to drive business decisions.  Your skillset likely includes: Knowledge of database storage, collection and aggregation models, techniques and technologies and the ability to apply such methods to solve business problemsKnowledge of structured problem-solving assignmentsStrong project management and people management skillsKnowledge of Microsoft SharePoint, PowerPivot, SSRS, Excel (with embedded Pivot Tables and macros)Some SQL skills. You will likely be a recent college graduate or have some relevant professional experience or coursework.  About Avanade  Avanade leads in providing innovative digital services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem. Our professionals combine technology, business and industry expertise to build and deploy solutions to realize results for clients and their customers. Avanade has 27,000 digitally connected people across 23 countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. We welcome all, and seek talented individuals who can bring their whole self to work, build inclusive teams and encourage diversity inside and outside the organization. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation. Learn more at www.avanade.com.  Qualifications"}