{"jobID": "2764035338", "jobLocation": "East_Hanover_NJ", "jobTitle": "+ Scientist I", "companyRating": "4.7", "companyInfo": {"Website": "www.infoquestgroup.com", "Headquarters": "Edison, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": "Duration & Type: 6+ months Contract with our client – a global leader in the pharmaceutical industry No. of Positions: 1 Location: East Hanover, New Jersey Responsibilities:In conformance with all Working Instructions (WI), and safety and quality regulations, may perform (with minimal or no supervision) activities such as: clinical laboratory analyses (hematology, hemostasis, clinical biochemistry, urinalysis and immunoanalyses (i.e. microsphere-based immunofluoresence assays, enzyme-linked immunosorbent assays (ELISAs), Multiplex assays, QC activities, etc.)), producing toxicity information and data reporting; instrument and assay qualification and method validation.Provide quality testing and result verification while displaying good scientific judgment.Communicate results and interpretations in an accurate and timely manner.May function on teams and/or lead associates assigned to major activities.Display high level of competence in use of laboratory equipment.Work independently to resolve issues.Required:Bachelor’s degree with 4+ years experience or equivalent, or Masters degree with 2+ years of experience of equivalent.ASCP certified Medical Technologist.Immunology or immunotoxicology skills.Documented ability to be self motivated while making strong team-oriented contributions.Competent to internally support major analytical instrumentation.Strong personal and team-oriented time management skills.Computer skills in Microsoft office software.Demonstrated experience in the required area, and competency in all technical procedures. For consideration, please send resume to career@infoquestgroup.com"}