{"jobID": "2685228743", "jobLocation": "Los_Angeles_CA", "jobTitle": "Research Scientist (Senior Economist)", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": " The Center for Economic and Social Research (CESR) at the University of Southern California has openings for Research Scientists in the field of Applied Economics at a rank equivalent to Advanced Assistant Professor / Associate Professor / Full Professor level. CESR provides an excellent opportunity for scholars to pursue their own new and exciting areas of research within a vibrant multi-disciplinary community of social scientists.  Successful candidates for these positions will have demonstrated research excellence, as evidenced through their publication and grant record. The positions require a Ph.D. in economics or closely related field, in addition to several years of experience. The positions require excellent analytical skills, strong written and oral communication skills, significant knowledge of a specialized area of research, experience working on externally funded grants, a willingness to attract external funding, the ability to lead projects and proposals and work as a member of multi-disciplinary teams, and a commitment to effecting change through empirical research.  CESR is a new interdisciplinary institute in the USC Dornsife College of Letters, Arts and Sciences (cesr.usc.edu/). Research areas at CESR include work on aging, children & families, development economics, education economics, behavioral economics, financial decision-making, genoeconomics, health and health disparities, inequality, mobile health, self-report science, subjective well-being, and work disability. We welcome applicants who will either help us build depth in one of these areas, or who are working in a new, complementary area of research. CESR is a research-funded center, therefore positions are not part of the tenure system and Research Scientists are eventually expected to fund their research agenda. Qualifications: • PhD in Economics or related field.  • Demonstrated research skills, preferably in the form of peer reviewed publications.  • Demonstrated success initiating and leading research projects and grant proposals.  Keywords: Economics, Applied Microeconomics, Experimental Economics, Health Economics, Education Economics, Labor Economics Application Instructions: Interested candidates should submit a cover letter, a CV, a sample of recent papers and the names of three individuals who will be contacted by USC for a letter of reference. Reference letters will be requested after preliminary review.  USC strongly values diversity and is committed to equal opportunity in employment. Women and men, and members of all racial and ethnic groups are encouraged to apply.  CESR has offices in Los Angeles, CA (on the USC campus) and Washington, D.C."}