{"jobID": "2824645336", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.arcadis.com", "Headquarters": "Amsterdam, Netherlands", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Job Description Arcadis is seeking an Industrial Hygiene (IH) Senior Consultant. The primary mission of the industrial hygiene senior consultant is to ensure operation excellence in the region and build the service practice for industrial hygiene and OSHA compliance safety services.  The successful candidate will coordinate services in the Southern California, US Southwest and Western regions. Coordinate services centered out of our offices located in Irvine or Los Angeles, although an alternate reporting location may be considered. The Arcadis activity-based working program incorporates flexibility of work locations.  The ideal candidate will have a minimum of ten years of successful consulting experience with increasing responsibilities for a wide range of clients and have established relationships with potential client contacts primarily within California. Responsibilities include:Support our existing IH and Health and Safety consulting services programsProvide leadership on individual regional projects with training, mentoring and technical guidance to field technicians to ensure quality of service to all clients throughout the project cycle.Participate in local area marketing and networking endeavors, such as AIHA and ASSSE, to include participation and technical presentation.Expand IH/CIH Services with current clients.Interact with Arcadis Principals in Charge of client accounts and client representatives to ensure industry leading service quality.Develop scope of work and cost estimates for new projects and be highly motivated to engage new clients and establish new business relationships.Collaborate on forward-looking marketing plans to expand Arcadis IH and CIH services with existing and new clients.Apprise clients and associates of emerging EHS issues and regulationsAttain security clearance for client work sites as required We are looking for someone who is passionate about a career in occupational health and enjoy understanding client needs and problem solving. This is an exciting and rewarding opportunity. The IH senior consultant will work in fast-paced environment with interesting projects for prestigious companies and organizations.  Required Qualifications PEBA/BS in EHS or Science related fieldCSP CertificationOSHA Silica Standard ExperienceDOSH Asbestos (CAC)CDPH LST, LI/RA (Lead Based Paint)ErgonomicsProcess Safety ManagementMachine GuardingElectrical/ arc flash safety Preferred Qualifications Experience with digital solution and technologies, data analytics and BIM Employment Type  Regular"}