{"jobID": "2725247028", "jobLocation": "San_Francisco_CA", "jobTitle": "Machine Learning Engineer", "companyRating": "5.0", "companyInfo": {"Website": "www.buildingconnected.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": "About Us:Our mission is to connect every business in the $10 trillion construction industry and to strengthen the lives, jobs, and relationships of millions of hardworking construction professionals worldwide.Were creating beautiful, user-friendly communication software and transforming an industry thats traditionally been underserved by tech. Over $100 billion in new construction is managed on our platform every month. From the new Warriors stadium to local schools and hospitals, our tools are helping cities grow and communities come together. Were solving real problems for real people.Founded in 2012, weve raised $53 million from top tier investors like Lightspeed Venture Partners, Brookfield, Crosslink Capital, and Brick & Mortar. Were a fun, fast-growing team thats passionate about building products people love.Engineering at BuildingConnected:As software engineers at BuildingConnected, our job is simple: we create efficiency. Whether its indexing millions of American businesses for lightning-quick search, optimizing the transfer of terabytes of architectural drawings, or building clean new UIs to manage thousands of business opportunities, we pride ourselves in creating efficiency through code. If you like effecting change on a global scale and want to work with an awesome team that is building truly useful products for people in a hard-working industry, we should chat. This is a great opportunity to join a growing startup with a massive upside! Learn more here.The Role:As a Machine Learning Engineer youll work on building and deploying models that make BuildingConnected the network where pre-construction is done. Were incorporating machine learning into all aspects of our application from helping general contractors find subcontractors through recommendations and search, to classifying features in forwarded emails that eliminate manual data entry and makes our application the source of truth for subcontractors. Youll propose techniques to solve hard problems over large datasets and bring them from hypothesis all the way to production.About You: You have experience using machine learning libraries or platforms such as sckit-learn, TensorFlow, or ML Lib.You are product minded and can propose different approaches and algorithms based on the problem and product requirements.You have a track record of taking work from the research phase all the way to production. You can architect APIs, add logging, and take pride in seeing your work function well at scale.You can communicate algorithms and techniques to both those with an ML background, as well as non technical folk.You want a supportive culture where engineers share knowledge and give feedback to better ourselves and the technology that underpins the product.Requirements:Really, really great communicatorTeam playerOur ML Tech Stack:Python / Scikit-earnLambda / ComprehendStanford NLPOur Production App Stack:React / ReduxNodePythonMongoDB / ElasticSearch / Redis / RedshiftDocker / Heroku / AWS / LambdaPerks:Supportive, smart, motivated co-workers and a fun office environmentFull medical / dental / vision, etc401K planEndless snacks and beerDog-friendly officeUnlimited PTO & sick leave- work hard, take a break when you needBuildingConnected is an equal opportunity employer. We will extend equal opportunity to all individuals regardless of race, religion, color, sex (including pregnancy, sexual orientation and gender identity), national origin, disability, age, genetic information, or any other status protected under applicable federal, state, or local laws."}