{"jobID": "2786255559", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.enova.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "What you'll be doing: You will be expected to design, develop, implement and maintain the full lifecycle of data functionality and analytic applications across multiple business units. Your stakeholders are the Analytics Team, Enova Decisions, and Business Owners, who will depend on your impactful data analysis, preparation, and compilation for a wide array of critical business purposes raw data assembled into structured marts and tables, enabling key business metrics, and aggregating data sources/business information using Enterprise BI tools. You will capture and translate requirements, through a variety of techniques, to create coherent data structures leading to successful solutions. Chances are you are innovative and willing to collaborate with your team to evolve our new data warehouse and data mart initiatives in support of Enova Decisions. You will operate as an owner by completing the full life cycle of a project from understanding the business process that the application supports through implementation and support. And last but not least, you have the ability to become an expert in the technologies used on the team. What you should have:At least 5 years of related experienceBachelor's degree in Engineering/CS, IT, or related studyStrong technical knowledge of SQL and data analysisProven requirements gathering and long- term solution development experienceConducted validation of existing reporting and new solutionsKnowledge of data warehousing conceptsProven expertise in ETL and ELT tooling such as Pentaho, Integration Services, Informatica, Data Pipeline, GlueWorking knowledge of Data Technologies in the Cloud such as AWS RDS/Redshift or SnowflakeDemonstrated verbal and written communication skills, and ability to interface with Business, Analytics and IT organizationsAbility to work effectively in short-cycle, team oriented environment, managing multiple priorities and tasksAbility to identify non-obvious solutions to complex problemsStrong knowledge of relational database modeling principles and techniquesExperience in the financial sector a plus Our Business Intelligence and Data Services teams:  Enova's Business Intelligence and Data Services team is part of our Analytics team which consists of over 60 quantitative and data reporting professionals. Our team members are problem solvers and action-oriented thinkers. The Data Services team effectively and sustainably provides data solutions and tools across the organization. We integrate, transform, and improve volumes of data at the project or enterprise level for streamlined processes, greater efficiencies, and smarter, more informed decision-making. This team is high-energy, dynamic and in a business-critical domain space. We speak these languages: Python, R, RedShift, AWS, MicroStrategy, PostgreSQL, Pentaho, SQL, MySQL, Excel and UNIX. About Enova: Enova is a leading provider of online financial services that leverages its advanced technology and analytics to provide access to credit for non-prime consumers and small businesses. Our roots are in Chicago, but we have served nearly 5 million customers through our six businesses in the U.S. and abroad. We pride ourselves on hiring smart and driven people who bring new and innovative ideas to the table. Our philosophy is, \"Life's short. Work someplace awesome.\"  Many of us consider our people to be Enova's best perk. But to sweeten the deal, we also have a pretty awesome list of conventional (and less conventional) perks and benefits including competitive salaries, health care benefits, a 401K matching plan, a revamped parental leave program (and brand new nursing rooms for our returning mothers!) summer hours, tuition reimbursement and a sabbatical program. And of course we also have the things you'd expect at a leading tech company in Chicago, such as the snacks, game room, onsite massages/barbers/nail technicians, monthly social events, and sporting sponsorships.  Our goal at Enova is to recruit, hire, develop and maintain a diverse workforce. It is our policy to provide equal employment opportunity for all persons and not discriminate in employment decisions by placing the most qualified person in each job, without regard to any other classification protected by federal, state, or local law.SDL2017"}