{"jobID": "2837155784", "jobLocation": "Chicago_IL", "jobTitle": "Business Intelligence Analyst (Ad Tech)", "companyRating": "3.2", "companyInfo": {"Website": "www.publicisgroupe.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1926", "Type": " Company - Public (PUB) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Interpublic Group, Omnicom, WPP"}, "estimatedSalary": "78000", "jobDescription": " Company DescriptionPublicis Media Exchange (PMX) delivers sustainable, transparent, competitive advantage to Publicis Media clients and agencies. This is done through the consolidated strength of our agencies, deep understanding of our client drivers, leveraging scaled investment, marketplace innovation, strength in partnerships and intelligence. PM Precision is PMXs data-informed, tech-enabled trading division that helps brands reach audiences on highly viewable, fraud free media. Precision spans product strategists, marketers, solutions consultants, activation specialists, ad-ops and data scientists. Precision encompasses agency-embedded teams that provide greater strategic alignment with clients and buying teams. Agency teams are supported by a centralized team for shared resources, best practices, tech audits and partnership management.Job DescriptionThe Business Intelligence Analyst (Ad Tech) will be responsible for consulting Publicis Media agencies and clients on programmatic advertising and marketing technology with a focus on data driven insights & advanced analytics. The Analyst solves strategic marketing challenges through the exposure and application of advanced data sets to ensure clients programmatic and digital investments are as efficient as possible, eliminating any and all forms of waste due to fraud, bidding strategies, audience segmentation, and inventory usage.  This roles primary focus is to support the Associate Director, Analytics Consulting in serving as the analytics arm of Solutions Consulting, working collaboratively with agency and Publicis colleagues to isolate and generate insights that elevate our client services and solve our clients most pressing marketing challenges. This can include analytics research, developing reporting visualizations, case study development, fraud investigations, and consulting with product teams to develop scalable data solutions with Groupe-wide application.  The Analyst is an energetic individual who possesses a combination of strong analytic, problem solving, and client-facing communication skills, working as an integral part of the Publicis Media Exchange (PMX) Precision practice. The PMX Precision practice is the central hub for marketing data, analysis and insights across our client base including major retailers, telecommunications companies, financial services organizations, and consumer manufacturing companies. The role requires the ability to proactively identify opportunities to leverage data and technology to solve business problems. The Analyst is able to take complex and/or technical analytical work products and present them to audiences with varying levels of analytical and technical expertise.  Responsibilities:  Data Visualization Design Take complex data sets and simplify them into automated reports for audiences of varying levels of technical expertise;Be an expert in advertising technologies such as ad servers, mobile ad servers, video ad servers, RTB platforms, ad exchanges, cross-device tracking technologies, site optimization platforms, website analytics systems, dynamic creative optimizers, data modelers, browsers, etc. and the utilization of resulting data sets.Understand the standard workflows and metrics involved in digital marketing programs, including how to traffic a media and data campaign, calculate costs (CPM, CPC, CPA), and measure performance (ROI, ROAS, CTR, CPA, AOV, RPV, Conversion Rate, etc.);Assist the product management team with roll-in/roll-out functional enhancements and application development, providing customer impressions and feedback;Provide Global Solutions Product team guidance on the development of data solutions, including new product and feature roadmap input based on customer and market needs;Assist users with report and dashboard customization as necessary;Own idea generation, design and proposal of new and enhanced data insights.  Marketplace Thought LeadershipKeep abreast of industry trends; Uncover and understand the needs and challenges of our Fortune 500 clients; address these through business analysis, recommendations, and ongoing consultation based on our unique information services and ability to assess markets, customers, competitors and prospects;Identify the feature set required by clients of next generation data products to optimally support all the major data technologies and contribute direction to Publicis Media and agency contacts;Practice Development & Eminence: Support/contribute to the preparation of market-valued intellectual capital and the development of practical data solutions and methodologies, \"thoughtware\" and \"point-of-view\" documents;Provide technical expertise and guidance to agency and account teams to assist in developing sales pitches and closing sales.  Custom AnalyticsWork collaboratively with Solutions Consulting, Publicis agencies, and internal teams to uncover client needs, priorities, and collaboratively develop data driven insights and solutions: o Participate in requirements sessions with business stakeholders to understand their needs;  o Perform gap analyses on clients current architectures, identifying challenges and opportunities;  o Specify the scope, tasks, milestones, and deliverables needed in order to successfully present and demonstrate such use-cases; Work with Publicis agencies to understand and clarify marketing strategies, ensure satisfaction and foster trust; deliver a continuous flow of data driven strategies, while securing relationships and positive performance feedback;Provide ad hoc analytics support to agencies and clients, as requested, to solve broad strategic marketing problems;Monitor Publicis Media programmatic delivery trends and identify issues/opportunities for improvement collaborate with Solutions Consulting, Product, and other internal resources to resolve.Qualifications• BS required mathematics, statistics, engineering, finance, or other quantitative field of study preferredRelevant experience in digital marketing, programmatic, or analytics preferred; internships countPrior experience buying media programmatically a plusExcellent verbal and written communication skillsExperience delivering presentations to senior level or executive audiences1+ years of experience in data visualization is ideal; Tableau experience a plusSQL expertise is required (writing as opposed to repurposing); R, Javascript, or Python experience is a plusAbility to be a thought leaderAdditional InformationAll your information will be kept confidential according to EEO guidelines."}