{"jobID": "2830254762", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst - temporary", "companyRating": "3.0", "companyInfo": {"Website": "www.redcross.org", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1881", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "Job Description: The American Red Cross will provide recovery services for survivors of Hurricane Harvey in affected states, primarily in Texas. This position is expected to last 6-12 months from date of hire, with a possible extension.  The Data Analyst supports the Planning Unit's work in the areas of reporting, data management, and the Coordinated Assistance Network (CAN) system support. Responsibilities:Retrieves and analyzes data and presents reports to management for use in supporting operational and business objectives.Collects financial and other data from numerous sources in various formats and translates it into a standard format.Assists the Planning Manager is oversight of the CAN database in the areas of reporting and data management.Supports CAN users (internal and external) with CAN data requests.Provides recommendations for improvement and written documentation that relates to the analysis of the data. Responsible for researching data anomalies and issues. The above statements are intended to describe the general nature and level of work being performed. They are not intended to be an exhaustive list of all responsibilities and duties required of staff so classified.  Scope  Interacts with all levels of staff and management. May participate in cross-functional teams or projects. Qualifications Bachelor's degree plus minimum three years of relevant experience or equivalent combination of related education and experience in data or business analysis required. Knows and applies the fundamental concepts, practices and procedures of particular field of specialization.  Skills and Abilities  Excellent interpersonal, verbal and written communication skills. Ability to work independently, handle and prioritize multiple tasks. Identifies and resolves problems and/or develops alternative solutions.  Other  Advanced level proficiency with MS Office software, including Word, Excel, and PowerPoint. Must be comfortable handling large data sets using pivot tables and have experience crafting complex formulas. LI-Post Apply now! Joining our team will provide you with the opportunity to make a difference every day.  The American Red Cross is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.  The American Red Cross is a diverse nonprofit organization offering its employee's professional development and growth opportunities, a competitive salary, comprehensive benefits, and a collaborative team spirit environment."}