{"jobID": "2617963275", "jobLocation": "Sunnyvale_CA", "jobTitle": "Senior Principal Scientist", "companyRating": null, "companyInfo": {"Website": "www.pharmacyclics.com", "Headquarters": "Sunnyvale, CA", "Size": "501 to 1000 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Acerta Pharma, Kite Pharma, Genentech"}, "estimatedSalary": null, "jobDescription": "General Position Summary/Purpose:  The ideal candidate should have extensive experience supporting DMPK in drug discovery with a track-record of accomplishments in identifying clinical candidates for drug development programs, ideally in oncology indications. Responsible to provide pharmacokinetic and ADME expertise and strategy to support oncology discovery and early development projects. Influence cross functional teams to support preclinical development of drug candidate and regulatory submission. DMPK and PKPD lead in discovery project towards the selection of IND candidate(s). Key Accountabilities/Core Job Responsibilities:Represent DMPK in cross functional discovery and early development project teams to effectively identify and characterize high quality drug candidates towards the selection of IND candidate(s), determine drug liability, and plan for IND enabling studies.Responsible for the design, real time data analysis, and interpretation of pharmacokinetic (PK), toxicokinetic (TK), and pharmacodynamic (PD) aspects of preclinical and clinical studies.Review nonclinical data and use established guidelines to determine the starting dose for first in human studies. Provides a rationale for dose escalation and dose range in phase 1 studies.Perform non-compartmental and compartmental, and pharmacokinetic-pharmacodynamic modeling of clinical and non-clinical data.Write scientific reports and prepare appropriate documentation to support applications for regulatory agency filing. Provide DMPK and PKPD expertise and input into related documents such as Investigator Brochures, SOPs, study reports, manuscripts, summaries for regulatory authorities, INDs, NDAs and sNDAs.Participate and present the results in group and project team meetings.Champion on problem solving and addressing critical need and advancing project.Must have clear and effective communication skills and building effective technical collaborations in a team model environment.Qualifications and Requirements:Ph.D. degree in pharmacokinetics, biopharmaceutics, pharmaceutical sciences, metabolism or related discipline. At least 12 years (PhD) relevant industrial experience in drug discovery setting with demonstrated impact on oncology drug discovery and/or development.Appropriate modeling and computer software experience and proficient in computer programs or PK software, i.e., WinNonlin, NONMEM or similar programs.Must have experience in delivering multiple small molecule compounds into IND and in early stage clinical development programs.Ability to prioritize and manage multiple projects and activities while meeting tight deadlinesProactive in problem-solving and be able to independently manage Proactive in problem-solving and be able to independently manage timelines and priorities.Excellent interpersonal skills, strong written and oral communication skills.Ability to work independently to drive project forward as well as collabroratively in a multidisciplinary team environment.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}