{"jobID": "2739752626", "jobLocation": "Chicago_IL", "jobTitle": "Principal Pathologist/Principal Research Scientist, Immunology Dermatology", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "153000", "jobDescription": " AbbVie (NYSE:ABBV) is a global, research-based biopharmaceutical company. AbbVie combines the focus and passion of a leading-edge biotech with the expertise and capabilities of a long established pharmaceutical leader to develop and market advanced therapies that address peoples critical needs.  Job Description:  A discovery Pathologist/Principal Research Scientist will join the Immunology Dermatology Discovery group which focuses on identification of both small and large molecules for the treatment of inflammatory and autoimmune diseases with a primary focus on skin pathologies. The successful candidate will be part of a research group providing anatomic pathology support including interpretation and scientific guidance for basic research, applying routine and molecular pathology to the evaluation of pharmacology studies. In addition, the candidate will utilize digital imaging and image analysis to provide additional objective endpoints for in vivo studies and human tissue experiments. The candidate will collaborate with immunology and molecular biology colleagues to identify other relevant study endpoints using cultured cell lines or primary human cells and will incorporate the above data into comprehensive study reports and regulatory documents as well as summarize study results for and provide recommendations for project teams. A primary responsibility will be to demonstrate expression and distribution of new targets in human disease and animal tissues using histology, in situ hybridization, and immunohistochemistry techniques to generate high-quality, stage-gate appropriate data packages supporting compound transitions towards the clinic. In addition, he/she will develop new techniques and technologies to increase confidence on the translatability of the targets to human disease.  It is expected that the candidate will utilize his/her expertise to generate external collaborations with key opinion leaders to identify opportunities for novel technologies. Level and compensation will be commensurate with experience.QualificationsPathologist (DVM, DACVP), PhD; MS or BS in Science or related field ideally immunology, pharmacology and/or toxicology with emphasis on dermatology) with 3+ (DVM &Ph.D;); 8+ years (PhD); 14+ years (MS); or 16+ years (BS) required. Pharmaceutical industry experience required. Significant research experience in histology and immunohistochemistry techniques as demonstrated by track record of publications and scientific accomplishments.Strong scientific expertise in Immunohistochemistry/In situ Hybridization assay development and other histologic techniques including image analysis is required.Detailed knowledge of state-of-the-art tools and approaches to imaging target expression is required.Experience in histopathologic and transcriptomic evaluation and interpretation of animal models of autoimmune disease including psoriasis and atopic dermatitis.Excellent oral & written communication skills.Excellent interpersonal, leadership & organizational skills.Demonstrated ability to work collaboratively with scientists from various disciplines as a member of a team.Experience supervising, training and developing junior staffExperience and enthusiasm for hands-on work in the laboratoryKey AbbVie Competencies:Builds strong relationships with peers and cross functionally with partners outside of the team to enable higher performance.Learns fast, grasps the essence and can change the course quickly where indicated.Raises the bar and is never satisfied with the status quo.Creates a learning environment, open to suggestions and experimentation for improvement.Embraces the ideas of others, nurtures innovation and manages innovation to reality.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}