{"jobID": "2835297501", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Assistant Research Scientist – Geospatial Programmer", "companyRating": "4.3", "companyInfo": {"Website": "www.mtu.edu", "Headquarters": "Houghton, MI", "Size": "1001 to 5000 employees", "Founded": " 1885", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": " Position Information Position Title Assistant Research Scientist – Geospatial ProgrammerDepartment Michigan Tech Research Institute (MTRI)Location Michigan Tech Research Institute (Ann Arbor, MI)Position Type StaffFull-time/ Part-time Full-timeFull-Time Equivalent (1.0=100%) 1.0Appointment Term 12 MonthPay Type Salary BasisSalary or Hourly Rate Negotiable Based on Experience – not less than $40,000/yearShiftPosition Duration Dependent on External Funding? YesTitle of Position Supervisor Senior Research Scientist I Position Summary InformationTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Job Description SummaryThe Assistant Research Scientist – Geospatial Programmer position provides support for MTRI programs focused on the application of scientific programming, geospatial analysis, and image processing to solve governmental and societal needs through sponsored research. The ability to improve the processing, analysis, and visualization of remote sensing data through custom coding will be important. Examples of current research areas include Great Lakes aquatic sensing, invasive species mapping, transportation infrastructure assessment and traffic monitoring, wetlands assessment, carbon budget and emission impacts from wildfires, improved geotemporal visualization of complex data and patterns, extending UAV-enabling sensing, and Arctic landscape change. The position is based at MTRI in Ann Arbor, MI (www.mtri.org).Essential Duties & Responsibilities (other duties may be assigned)1. Participate as an important team member in research projects applying scientific programming, geospatial analysis, image processing, web development, and environmental knowledge to solve project tasks for ongoing and new MTRI research projects, with the expectation of planning and coordinating research and development tasks under supervision of a principal investigator. Participate as an integral team member on multi-disciplinary research relating to applying technological skills to solving governmental and societal needs for a diverse set of current research areas, including improved geotemporal analysis and visualization of complex data for ecological, transportation, and signal processing projects.Apply web development capabilities and custom APIs to developing and improving MTRI’s capabilities in front-end web mapping and back-end server development to make research results more easily available to end users through user-friendly decision support tools and portals, using open source and proprietary tools as appropriate.Under direction, apply geospatial image processing capabilities to advanced research tasks, and be able to deal with issues encountered in data processing and analysis to ensure scientifically-valid data collection.Interpret the results of multispectral, hyperspectral, satellite, and other data collected and/or downloaded for research projects. Describe and share any concerns about the results or methodology, and recommend or implement countermeasures.Participate in occasionally intensive field deployments, including the potential for boat-based water quality sampling, UAV data collections, and backcountry data collections.Contribute technical expertise to specific aspects of conference presentations, journal articles, and technical reports, and be able to take the lead on preparing technical reports. Help represent MTRI in public and professional outreach opportunities. The employee will be expected to exercise independent judgment using their expertise to help define how tasks will be completed, in coordination with project leaders, while being responsible for their own work.Contribute to competitive proposals.Assess effectiveness of safety measures and training and implement necessary changes. Anticipate and recognize problems and potential problems at the individual and system levels. Recognize and respond appropriately to potential and actual unsafe situations.Apply safety-related knowledge, skills, and practices to everyday work.Commit to learning about continuous improvement strategies and applying them to everyday work. Actively engage in University continuous improvement initiatives.Required Education (minimum requirements)Bachelor’s degree in computer science, remote sensing, GIS, geospatial technology, geography, computer engineering, physics, mathematics, ecology or closely related field and at least 2 years of experience."}