{"jobID": "2560392607", "jobLocation": "Liberty_Corner_NJ", "jobTitle": "Actuarial Predictive Modeler/Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.everestre.com", "Headquarters": "Liberty Corner, NJ", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (RE) ", "Industry": " Insurance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Chubb, Munich Re, Swiss Re"}, "estimatedSalary": "96000", "jobDescription": " Everest Insurance, a member of the Everest Re Group, Ltd. is currently recruiting for Actuarial Predictive Modeler/Data Scientist in our growing Insurance Operation. This is an exciting opportunity to play a key role in providing predictive modeling and analytical support for several programs/business segments in the property and casualty lines. In addition to having strong technical capabilities, the ideal candidate will be high-energy, dynamic, and attracted to the opportunity to develop new tools and capabilities within a rapidly expanding business. This position location is flexible as it can either be based out of our corporate headquarters in Liberty Corner, NJ (exit 33 off I-78) or our Midtown Manhattan office. Responsibilities will include:Transform data and generate predictive variables from both internal and external data sourcesApply statistical and machine learning techniques to solve business problemsDevelop predictive models, mainly focused in pricing and underwriting; also work with models in other functional areas such as claims, marketing, operational efficiency and customer experienceWork with IT to implement predictive models, design specs and provide support in testingDocument and keep track of technical details of model development and implementationMonitor performance of implemented models and provide analytical supportEvaluate predictive models and other technology/modeling/data solutions from 3rd party vendorsQualifications:Must have BS or MS degree within a quantitative discipline3+ years of hands-on experience in predictive analytics in the property-casualty insurance industryStrong track record in large data manipulation in insurance environment. Excellent SQL skill is a mustExcellent programming skills in one or more of the following is also a plus: R, Python and VBAStrong ability to effectively interpret data and modeling results and draw actionable insightsIdeally anywhere from 3 actuarial exams passed to recent FCAS’sExcellent interpersonal and communication skillsOrganized, self-motivated, results-orientated, and resourceful Everest is committed to recruiting and retaining the most talented individuals in the industry. We offer a dynamic work environment and a competitive compensation and benefit package which includes a 401k plan, retirement/savings option, tuition reimbursement, medical, dental, vision, life and group legal plans.  Everest is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or creed, sex (including pregnancy), sexual orientation, gender identity or expression, national origin or ancestry, citizenship, genetics, physical or mental disability, age, marital status, civil union status, family or parental status, veteran status, or any other characteristic protected by law. Job Location Liberty Corner, NJ Area of Interest Actuarial"}