{"jobID": "2729646915", "jobLocation": "Troy_MI", "jobTitle": "Business Innovation Group 5.0", "companyRating": null, "companyInfo": {"Website": "www.unitedshore.com", "Headquarters": "Troy, MI", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " You have big goals. Big ambition. And you’re ready to take on a big adventure…  United Shore’s BIG program may be just what you’re looking for.  BIG stands for Business Innovation Group, a 12-month rotational program that allows you the opportunity to work with nearly every team in the mortgage loan process; such as Sales, Risk Management, Underwriting, Client Service, Team Member Services, and many more. You will gain a 360 view of the essential roles each of these teams play in the company’s success. You will have an opportunity to provide feedback and share your ideas during each rotation helping us on our continued journey as the #1 Wholesale lender in the country.  Along the way not only will you learn our entire business, but we expect you will learn a lot about yourself during this journey. Each rotation will bring out which roles and projects inspire you most. You may start out the year convinced that Sales is your future career path and along the way you may find yourself falling in love with IT, or your rotation in Underwriting highlights some of your core competencies that you never had the chance to explore.  We want you to find the place where you can Be You.WHAT YOU WILL BE DOINGAs a B.I.G. participant, you’ll spend from 1-5 weeks immersed on each team through both observation and hands-on participation, including shadowing within each team. In these rotations, you will learn the entire mortgage process from start to finish. You will be in the production roles and be a producing team member in many of your different team rotations. Rotations can also include a specific project the BIG participants are given to improve a process or procedure within that Business Unit. This will give you a lasting footprint in many of the rotations you complete. You will also be assigned a Capstone project within your group that will be presented to our Executive Leadership Team towards the end of the program. Other perks of the BIG program:A one-on-one mentor from United Shore’s leadership teamMentors from prior BIG groupsVariety of professional development workshopsMonthly one-on-one with the BIG program leadersConstructive feedback from rotation leadersWHAT WE NEED FROM YOU2+ years in the professional working environmentThe ability to take initiative, ask questions, and dive into new projectsThe ability to adapt quickly to new schedules and teamsCreative problem-solving skillsA positive attitude and great energyThis position requires on-site attendancePreferred:A bachelor's degreeLeadership, entrepreneurial or project management experience THE PLACE & THE PERKSUnited Shore is a diverse group of over 2,300 mortgage experts, sales superstars, tech gurus, marketing whizzes, and more – all working toward the same goals. We’re a $30 billion and growing, family-owned-and-operated company that still feels like family. We have an award-winning workplace that just happens to be home to the #1 wholesale mortgage lender in the country, United Wholesale Mortgage. We’re committed to a 40-hour workweek. And we believe in setting our team members up for success by creating a unique, energetic culture where you can be yourself and still reach your goals. Here are just a few of the reasons you’ll love working here:Be well here - Salta Direct is our in-house doctor’s office, available to all team members!Work-life balance. Give us 40-hours and the rest is yours.Generous benefits package including health and wellness, community involvement, personal and professional development, and rewards and recognitionFree fruit, soft drinks, and coffeeGourmet cafeteria featuring homemade breakfast, lunch, sushi Mondays, and Mediterranean food.State-of-the-art fitness center open 5 a.m.–11 p.m. daily24/7 convenience storeOur very own StarbucksCool company events that always include a surprise or twoLawn vouchers to concerts at DTE Energy Music Theater DISCLAIMERAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job related instructions as requested by their supervisor, subject to reasonable accommodations. This document does not create an employment contract, implied or otherwise, other than an “at will” employment relationship. United Shore Financial Services is an Equal Opportunity/Affirmative Action Employer."}