{"jobID": "2758759849", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.hp.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (HPQ) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " HP is growing its investment big data services and solutions to create the next generation of data driven product insights and business intelligence. We are looking for a Data Analyst to help examine large volumes of data and employ subject matter knowledge to uncover actionable insights, trends, problem statements, and business value. We want someone that has a strong technical background, is comfortable working in teams, and is able to contribute as part of a larger leadership team across a set of big data programs. As a Data Analyst, you are responsible for creating and applying statistical models to create and evolve insights. You would also be responsible for connecting with key partners in business and technology teams to make insights actionable. You should be able to create meaningful visualizations and stories to describe data in forms usable by the business. Responsibilities: Participates as a member of team with data engineers carrying out the investigation, design, development, execution, and implementation of data science projects to generate new insights, products, technologies, and intellectual property. In accordance with plan, performs/executes data collection and analysis procedures and data insight visualizations for assigned projects. Collaborates with internal and external partners to perform experiments and validations in accordance with overall plan. Collects, records, and analyzes data using established protocols and processes; communicates findings to other team members for review and feedback. Prepare and present program and project status to key stakeholders at regular intervals. Create and nurture a fun, collaborative work environment which fosters autonomy, transparency, mastery, innovation, and learning. Promote value-driven delivery, innovation, and continuous improvement. Interact comfortably in one-to-one with individual technical contributors, engineering leaders, and key stakeholders or customers. Education, Experience, and Skills: Bachelor's or Master's degree in Computer Science, Mathematics, Economics, Physics, Computer Science, or equivalent. Typically 2-4 years experience including graduate or postgraduate research. Using scientific design and data collection methodologies, tools and analysis packages to collect, validate, and analyze research data. Ability to use statistical methods to analyze data and generate reports. Understanding of design, scientific procedures and processes, and data analysis. Experience with Looker, Tableau, or other Data Visualization/Exploration tools. Experience with SQL and Amazon Redshift or other Data Warehouse. Experience working with NoSQL databases Machine Learning experience Strong written and verbal communication skills; mastery in English and local language. Ability to apply analytical and problem-solving skills. Ability to effectively communicate research plans, proposals, and results, and negotiate options. Attention to detail."}