{"jobID": "2685764078", "jobLocation": "Austin_TX", "jobTitle": "Principal Data Scientist", "companyRating": "5.0", "companyInfo": {"Website": "www.blacklocus.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": "About Us: Were an Innovation Lab, operating within The Home Depot, finding competitive edges with predictive analytics. We get to have a massive impact on a 100 Billion dollar company, given that we are impacting product pricing, assortment, margins and share. We are the tiger team, focused on the CEOs agenda, and we work on the high impact projects across the company, not in one functional area. We're a polyglot team combining science with engineering, and we are lean and experimental. We're engineers, analysts and scientists. We look for high leverage problems and attack them with the freedom to take risks. Our team is small, with little hierarchy so everyone has an opportunity to make an impact.Position Purpose: A Principal Data Scientist is capable of performing new innovative research to solve difficult business problems. Principal Data Scientists are responsible for thought leadership of analytics and software design in taking the solution from concept to final prototype. Responsible for resources from the data science team and defines tasks within the business problem to parallelize and deliver a solution in the shortest amount of time. Principal Data Scientists are expected to not only contribute to projects as hands on expert level resource, but also provide thought leadership to data scientists and the company as a whole.Job Responsibilities: Work with merchants and other business experts to define an distill requirements for analytic solutions Define best in class analytic methodology and facilitate adoption of that methodology by the data science team Design analytic solutions leveraging advanced statistical modeling and optimization that are best suited to solve the business problems Lead internal data scientists to deliver advanced analytics solutions. Provide thought leadership and establish a technical strategy and roadmap for advanced analytics Communicate timely and effectively both verbal and written to the peers, team, managers, and Home Depot Stay current with advancements in optimization, statistical modeling, programming techniques and advocates them where appropriateMajor Tasks, Responsibilities, and Key Accountabilities: 35%-Designs and develops solutions that leverage statistical analytics and optimization to derive business insights. 35%-Partner with internal cross-functional teams and lead data scientists to develop advanced solutions. 20%-Seeks further knowledge on key developments within data science, technical skill sets, and additional data sources within Home Depot. 10%-Define clear communication mechanisms to the head of data science to ensure projects are on time and on budgetNature and Scope: Reports to the Head of Data Science at Black Locus.Travel: Typically requires overnight travel less than 10% of the time.Education Required: The knowledge, skills and abilities typically acquired through the completion of a PhD degree with 5+ yrs of experience or Masters with 8+ years of experience in the domain of data science. Years of Relevant Work Experience: 5 - 8 years Additional Qualifications:"}