{"jobID": "2823490986", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.lazparking.com", "Headquarters": "Hartford, CT", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": "Want to hear something crazy? Cars only spend 5% of their time driving. Where do they spend the other 95%? PARKED!  LAZ Parking is one of the largest and fastest growing parking companies in the country. LAZ operates hundreds of thousands of parking spaces across the country. When it comes to parking, we’re the experts!  We are also a PEOPLE FIRST company. We often say “parking is our industry but people are our passion.” Our mission is to “create opportunities for our employees and value for our clients”. If you’re looking to join a growing company led by passionate people committed to being the best – contact us today! The Spirit of the Position: The Data Analyst oversees the data processing and reporting from the day-to-day operation. This role is responsible for different reports that are provided to department managers and client regarding the performance of the operation. The role is also responsible for quality control ensuring all data is being collected and entered accurately.  Principal Job Duties: Provide analytical and research support for reports required by the City of Chicago and our client (e.g. Daily Meter Report, Red Alarm Report etc.).Serve as project supervisor for operational data management initiatives, which may include: Design and development of dashboards to better inform management teamEnforcement / Compliance Data Entry,Exempt Persons Audit List (“EPAL”), and/orCWO2 MigrationPrepare and issue reports on operational activity, as well as additional client research and analytical reports on a regular and as-needed basis (e.g. CWO/Zen Desk Reports, Reserve Meter Report, etc.).Serve as a liaison between department leadership and operational teamsPerform other such duties and projects as may be required.Act as the final quality control check on closure paperwork and sign off for processing.Assist with “Work Order” process as requested.Other related duties as assigned. Requirements:  Education: BA/BS Degree Experience: 2+ years Supervisor experience.Strong Knowledge of Excel, Word, Power Point and General Microsoft Office Applications. Skills: Ability to communicate professionally and effectively.Ability to speak, read, and comprehend the English language.Must be open to feedback, differing opinions and other points of view.Demonstrates a sense of urgency and timeliness.Demonstrate the ability to seek improvement.Excellent teambuilding and interpersonal skills. Physical Demands: Ability to lift, push and pull at least 10 pounds.Willingness to work in the elements – heat, wind, snow, rain, etc.Ability to stand, walk and run for extended periods of time.Ability bend, stoop, squat and lift frequently throughout a shift. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with qualified disabilities to perform the essential duties/functions.  FLSA Status: Non-Exempt  To be hired, all candidates must pass a background check and pre-employment drug screen.  LAZ Parking is an equal opportunity employer. In all our employment practices, including hiring, we are firmly committed to provide equal employment opportunity (EEO) to all persons, regardless of race, color, religion, sex, national origin, disability, age, genetics, Vietnam era, special disabled, recently separated and other protected veterans, or any other characteristic protected by federal, state or local law. No question in our application process is used for the process of limiting or excluding any applicant's consideration for employment on such grounds.  This Employer participates in E-Verify."}