{"jobID": "2826628587", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.enquero.com", "Headquarters": "Milpitas, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": "The Job Experience the satisfaction of seeing clients succeed through predictive modeling and statistical analysis. Enquero, a leader in management consulting, is looking for a Data Scientist who can apply machine learning and applied statistics techniques to deliver actionable insights across sales and financial operations. You will be working with a team of business architects, business intelligence experts, data engineers and data scientists to drive business outcomes by applying these techniques on behavior segmentation, churn prediction, propensity modeling, recommendation systems, revenue prediction and many other use cases. Experience The ideal candidate has minimum 3 years of hands-on experience in developing predictive models on large scale enterprise datasets to achieve business goals through statistical modeling, machine learning and data mining techniques. You have a track record of identifying and exploring use cases for which machine learning and applied statistics yield insights towards how multibillion-dollar businesses in the high-tech industry can drive towards their sales and financial goals. With your industry experience, you communicate how business goals can be achieved with statistical and machine learning models on customers and partners. Skills This position requires the ability to develop and optimize statistical predictive models. You have had at least 3 years of hands-on experience in extracting data with SQL, munging data with R/python and crafting features on your own to research on sales and finance use cases. You have used machine learning, data mining and Bayesian techniques to acquire insights and develop predictive models that result in business solutions. You are well versed in machine learning algorithms and the do’s/don’ts in the ML workflow. You have had solid experience in developing multilevel models with Bayesian techniques. Proficiency in SQL, Python and R as well as prior experience working with Tensorflow is required.  The ability to leverage MLLIB, Scala, and Spark to develop models on large scale data sets, familiarity with the Google Cloud AI libraries, prior hands-on project in deep learning, as well as management consulting experience are nice-to-haves but not required.  You are an entrepreneurial, self-directed individual, with a can-do attitude and a willingness to tackle problems head on. You enjoy collaborating with colleagues to delight clients with innovative solutions. BenefitsHealth Insurance (Vision, Dental Included)401KFull time position with Holidays, Vacation, Sick PayReimbursement allowances for mobile phone, home internet and health club/gymLife insuranceTraining allowancesprovided by Dice sql, R, Python, ML, Tensorflow, MLLIB, Scala, Spark"}