{"jobID": "2823762970", "jobLocation": "Boise_ID", "jobTitle": "Data Scientist - Technology Development", "companyRating": "3.6", "companyInfo": {"Website": "www.micron.com", "Headquarters": "Boise, ID", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (MU) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Samsung Electronics, Hynix, Toshiba"}, "estimatedSalary": "98000", "jobDescription": " Req Id: 108281 Data Scientist – Technology Development    Are you experienced in applying machine learning to Big Data, never-before-solved problems for industrial manufacturing at scale?     We are seeking a Data Scientist capable of using machine learning and statistical techniques to create state-of-the-art data products (decision support and decision automation data systems) using extensive and diverse Big Data sets from our manufacturing teams.     As a Data Science at Micron, you will employ techniques and theories drawn from areas of mathematics, statistics, and information technology to uncover patterns in data from which predictive models, actionable insights, and solutions can be developed.     You will interact with experienced Data Scientists, Data Engineers, Business Areas Engineers, and UX teams to identify questions and issues for data analysis projects and improvement of existing tools. In this position, you will help develop software programs, algorithms and/or automated processes to cleanse, integrate, and evaluate large datasets from multiple disparate sources.    Qualifications:Strong desire to grow career as Data Scientist in highly automated industrial manufacturing doing analysis and machine learning on terabytes and petabytes of diverse datasets. Experience in the areas: statistical modeling, feature extraction and analysis, supervised/unsupervised/semi-supervised learning.Ability to extract data from different databases via SQL and other query languages and applying data cleansing, outlier identification, and missing data techniques.Strong software development skills.Strong verbal and written communication skills.Experience with or desire to learn: Required: Machine learning and other advanced analytical methodsRequired: Fluency in Python and/or RRequired: pySpark and/or SparkR and/or SparklyRRequired: Hadoop (Hive, Spark, HBase)Required: Teradata and/or another SQL databasesOptional: Tensorflow, and/or other statistical software including scripting capability for automating analysesOptional: SSIS, ETLOptional: javascript, AngularJS 2.0, TableauOptional: Experience working with time series data, images, semi-supervised learning, and data with frequently changing distributions is a plusOptional: Experience working with Manufacturing Execution Systems (MES) is a plusOptional: Existing papers from CVPR, NIPS, ICML, KDD, and other key conferences are plus, but this is not a research position   Education: B.S. in Mathematics, Computer Science, Data Science, Physics     #LI-AD1   We recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices. Each manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters. To request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748). Keywords: Boise || Idaho (US-ID) || United States (US) || Technology Development || Experienced || Regular || Engineering || #LI-CC2 || "}