{"jobID": "2796313376", "jobLocation": "Rochester_Hills_MI", "jobTitle": "Consulting Scientist", "companyRating": null, "companyInfo": {"Website": "www.quarkonics.com", "Headquarters": "Detroit, MI", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary Quarkonics Applied Research Corporation invites applications from scientists interested in providing ongoing consulting to various industries in the fields of artificial intelligence, data analytics, physics analysis of systems, machine learning, sensor technology and other similar fields.  Quarkonics Applied Research Corporation is a scientific consulting company that serves oil and gas and manufacturing industries. We are the pioneers of technologies such as the world’s first robotic oil well drilling, real time machine condition monitoring and predictive maintenance technology, the world’s first downhole flow sensor, virtual rig simulator and downhole data compression technology  We are looking for senior scientists with strong track record of solving complex scientific problems and leading research teams. Scientists looking for part-time / flex-time consulting opportunities are encouraged to apply. Responsibilities and Duties The consulting scientist will lead groups of research scientists to help industrial experts in design and development of technology solutions to their industrial problems. They are responsible for guiding the team and providing strategic insight in solving the problem.  Additionally, the consulting scientist shall provide support and insights relative to their area of specialization to the client team as they develop innovative new technologies.  Some travel may be required on an as-needed basis to client sites.  Work hours are flexible and we will work with you to set up the optimal schedule that aligns with the project requirements. Qualifications and SkillsPhD in one of the following fields: physics, material science, math, computer science, engineering.Experience in Matlab and PythonParticipated in or led multiple projects involving machine learning or big data analyticsExcellent communication, leadership, and presentation skills. Job Types: Full-time, Part-time, Contract"}