{"jobID": "2822282288", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.rallyhealth.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "Do you love using data to monitor and improve product performance and communicate impact? You might be the RISC (Rewards, Incentives, Survey, and Campaigns) teams next Operations Data Analyst!Rally Healths RISC team administers reward programs, health assessment surveys, and runs campaigns all aimed at empowering people to take charge of their health and achieve their personal goals.  With an incentives and rewards platform processing hundreds of millions of dollars a year we seek a sharp analyst who can work with our data to ensure accuracy, answer product questions, communicate value to clients, and measure and improve our performance to make sure that we are effectively delivering incentives and driving health improvements. This is a fast-paced, high profile role that is crucial to the well-being of our users and the satisfaction of our clients.  In addition to principal responsibilities for data support of the Rewards/Incentives products, the RISC analyst will also occasionally work on investigations and analyses with Survey and Campaigns data.  As the RISC Data Analyst, you will be the go-to team member for data and investigations essential to the functioning of these product areas, using a mixture of BI tools, direct querying, and data analysis to support operational needs. Roles & ResponsibilitiesConduct ad-hoc data analyses and queries to support product capabilitiesMonitor operational dashboards and use data analysis to investigate issuesInvestigate and answer questions with dataHelp define and monitor key business and operational metricsSkills & ExperienceRequired Skills1-3 years experience as a data analyst or equivalentStrong proficiency with SQL, including the ability to work with complex data structuresIntermediate level Python or RThorough understanding of data schemas and structuresStrong proficiency using Excel to analyze dataAn inquisitive mind and keen business acumenStrong attention to detailExcellent communications skills with and about dataProven ability to manage competing priorities simultaneouslyAdaptable, proactive, energetic and willing to learn and deliver on a variety of tasks and responsibilitiesProven ability to work in a fast-paced environment focused on continuous product innovationNice to HaveExperience with Hadoop/Hive/Spark and big data environmentsExperience scripting in Bash or similarExperience querying MongoDBExperience building dashboards and visualizations in Tableau, or ability to quickly get up to speed Rally Health is committed to ensuring that its workforce reflects Americas diverse population. Rally Health knows that such diversity will enrich us with the talent, energy, perspective and inspiration it needs to achieve its mission. Rally Health believes in a policy of equal employment and opportunity for all people based on merit and commitment to the principles of diversity. It is our policy to recruit, hire, train, and promote individuals in all job titles, and administer all programs, without regard to race, color, religion, national origin or ancestry, citizenship, sex, age, marital status, pregnancy, child birth or related medical conditions, personal appearance, sexual orientation, gender identity or expression, family responsibilities, genetic information, disability, matriculation, political affiliation, veteran status, union affiliation, or any other category protected by applicable federal, state or local laws.  Individuals with disabilities and veterans are encouraged to apply. Applicants who require an accommodation related to the application and/or review process should notify Talent Acquisition (recruiting@rallyhealth.com).  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}