{"jobID": "2802563038", "jobLocation": "Ne_Jersey", "jobTitle": "Data Modeler", "companyRating": null, "companyInfo": {"Website": "www.capgemini.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1967", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Accenture, CGI, Sopra Steria"}, "estimatedSalary": null, "jobDescription": " Short Description About CapgeminiA global leader in consulting, technology services and digital transformation, Capgemini is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital and platforms. Building on its strong 50-year heritage and deep industry-specific expertise, Capgemini enables organizations to realize their business ambitions through an array of services from strategy to operations. Capgemini is driven by the conviction that the business value of technology comes from and through people. It is a multicultural company of 200,000 team members in over 40 countries. The Group reported 2017 global revenues of EUR 12.8 billion.Visit us atwww.capgemini.com. People matter, results count.Job Title:Data modelerPosition Type: Permanent/Fulltime •6+ years of experience with majority of exposure in Banking industry working as Data Modeler in the Banking domains  •Master (experienced) in using Erwin  •Logical Design Demonstrated experience with large scale, multiple business solutions across divisions or enterprise  •Ability to communicate strategies and processes around data modeling and architecture to cross functional groups and senior levels  •Extensive experience implementing relational database designs, data warehousing, data architecture, & data modeling, including strong knowledge of various data modeling approaches and practices (experience with 3NF, star schemas, and multi-dimensional designs)  •Experience with ERwin Enterprise Data Modeler Suite or equivalent modeling software  •Experience with data quality management and metadata management  •Hands-on experience with large, transactional databases (Oracle) including strong SQL & PL/SQL skills, Greenplum / postgres (good to have)  •Must have worked in the Requirement Gathering process with Business  •Banking Industry experience within the last 3 years  •Data Integration within the last 3 years  •Data Warehousing within the last 3 years  •Well versed with project life cycle & SDLC life cycle  •Well versed with Data Warehouse concepts and knowledge of Data Modeling  •Well versed with key data elements for different portfolios of banking domain  •Excellent communication skill and direct customer/business interaction experience  •Ability to establish and maintain good working relationships with business users, management, vendors, and peers.  •Strong organizational, multi-tasking, and time-management skills. Ability to complete assignments on time Disclaimer: Capgemini America Inc and its U.S. affiliates are EEO/AA employers. Capgemini conducts all employment-related activities without regard to race, religion, color, national origin, age, sex, marital status, sexual orientation, gender identity/expression, disability, citizenship status, genetics, or status as a Vietnam-era, special disabled and other covered veteran status. Click the following link for more information on your rights as an Applicant:http://www.capgemini.com/resources/equal-"}