{"jobID": "2831603240", "jobLocation": "San_Francisco_CA", "jobTitle": "Improvement Data Analyst - Strategic Improvement Core Operations (BUS INTEL SPEC 3", "companyRating": "3.9", "companyInfo": {"Website": "www.ucsfhealth.org", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1907", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Stanford Health Care, Dignity Health, Sutter Health"}, "estimatedSalary": "139000", "jobDescription": "At UCSF Health, our mission of innovative patient care, advanced technology and pioneering research is redefining what’s possible for the patients we serve – a promise we share with the professionals who make up our team.  Ranked by U.S. News & World Report as the number one hospital in California – and among the top five in the country – UCSF Health is committed to providing the most rewarding work experience while delivering the best care available anywhere. In an environment that allows for continuous learning and opportunities for professional growth, UCSF Health offers the ideal atmosphere in which to best use your skills and talents.Department DescriptionThe Strategic Improvement Office is accountable for driving strategic and value programs within UCSF Health to support a culture of continuous process improvement (CPI), innovation, high value care and a learning health system.Job SummaryThe Improvement Analyst position in UCSF Health’s Strategic Improvement Office is responsible for assisting the transformation of clinical and operational processes by accessing relevant health system data sources (including APeX EMR data) and providing analytic insight of areas of improvement. The Improvement Analyst brings analytic skills to bear on largely unexplored or misunderstood financial, quality and operational data to develop insights on where and how to focus organizational or departmental improvement efforts, and to evaluate if/how improvement efforts are affecting performance indicators and outcomes.  They use knowledge of financial, clinical systems and industry practices to turn generalized opportunities into specific tactics, and advises operational leaders and their teams on how to connect key metrics to the work performed. In collaboration with improvement teams, the Improvement Analyst will be part of a systematic approach to enhancing the quality of patient care, using evidence-based practices and critical thought to improve systems, processes, and patient outcomes.  The Improvement Analyst has strong technical skills with a variety of data sources and architectures, has been involved with complex projects, and has experience to understand and communicate with non-technical users. Projects involve relationships with a variety of teams, including physicians, nurses and frontline staff, Business Intelligence and IT, Quality, Population Health Analytics and Decision Support Services: interest and excitement in partnership across the continuum is critical.  Healthcare reform and systems management paradigms have driven a substantial increase in the variety and volume of data; this is a growth-oriented opportunity to implement healthcare analytics at UCSF Health and transform the way we deliver care.Required QualificationsThree to five years experience in business intelligence reporting, data mining, data analysis, and/or statistical analysisBachelor's degree in quantitative social science, management information systems, or related area, and / or equivalent combination of experience / trainingThorough knowledge of business intelligence functions, analytics, industry standards and best practicesHighly proficient in all MS Office Suite (Word, Excel, PowerPoint, Access), database applications, and analytical software (such as Tableau, R, or others)Strong critical thinking and problem-solving skills to manage complex information, assess problems, and develop and effective solutionsStrong written and verbal communication skills with the ability to convey complex information in a clear, concise manner; ability to produce high-quality reports and documentationStrong interpersonal skills for effective collaboration with a broad range of professional and technical staffProven ability to serve as a technical resource providing advice and counsel on business intelligence issuesStrong initiative and ability to work independently as well as in a team environmentDetail oriented, with ability to manage time and organize competing prioritiesDiscretion, confidentiality, tact, and ability to deal with sensitive data involving patient health informationAbility to demonstrate excellent judgment, attention to process and detailThe flexibility to orient and work at all UCSF Medical Center locationsPreferred QualificationsMaster’s degree in statistics, epidemiology, public health, operations research, computers/systems engineering or other relevant field OR equivalent work experienceCertified in at least one Epic Clarity module (preferred: Ambulatory or Inpatient)Thorough knowledge of relevant internal databases, BI applications and tools, such as APeX/EpicProficient in SQL programmingFamiliarity with health care environmentLicensure/CertificationN/ALiving Pride StandardsService Excellence Demonstrates service excellence by following the Everyday PRIDE Guide with the UCSF Medical Center standards and expectations for communication and behavior. These standards and expectations convey specific behavior associated with the Medical Center’s values: Professionalism, Respect, Integrity, Diversity and Excellence, and provide guidance on how we communicate with patients, visitors, faculty, staff, and students, virtually everyone, every day and with every encounter. These standards include, but are not limited to: personal appearance, acknowledging and greeting all patients and families, introductions using AIDET, managing up, service recovery, managing delays and expectations, phone standards, electronic communication, team work, cultural sensitivity and competency.Uses effective communication skills with patients and staff; demonstrates proper telephone techniques and etiquette; acts as an escort to any patient or family member needing directions; shows sensitivity to differences of culture; demonstrates a positive and supportive manner in which patients / families/ colleagues perceive interactions as positive and supportive. Exhibits team work skills to positively acknowledge and recognize other colleagues, and uses personal experiences to model and teach Living PRIDE standards.Exhibits tact and professionalism in difficult situations according to PRIDE Values and PracticesDemonstrates an understanding of and adheres to privacy, confidentiality, and security policies and procedures related to Protected Health Information (PHI) or other sensitive and personal information.Demonstrates an understanding of and adheres to safety and infection control policies and procedures.Assumes accountability for improving quality metrics associated with department/unit and meeting organizational/departmental targets. Work Environment Keeps working areas neat, orderly and clutter-free, including the hallways. Adheres to cleaning processes and puts things back where they belong. Removes and reports broken equipment and furniture.Picks up and disposes of any litter found throughout entire facility.Posts flyers and posters in designated areas only; does not post on walls, doors or windows.Knows where the Environment of Care Manual is kept in department; corrects or reports unsafe conditions to the appropriate departments.Protects the physical environment and equipment from damage and theft. The flexibility to orient and work at all UCSF Medical Center locations is required.Equal Employment OpportunityThe University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. Further information about the University of California, San Francisco, is available at diversity.ucsf.edu. UCSF seeks candidates whose skills, and personal and professional experience, have prepared them to contribute to our commitment to diversity and excellence, and the communities we serve."}