{"jobID": "2678792569", "jobLocation": "Chicago_IL", "jobTitle": "Lead Quantitative Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.theocc.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CME Group, Intercontinental Exchange, DTCC"}, "estimatedSalary": "163000", "jobDescription": " Job Details:Duties: Lead the CCRA Quantitative Analysis team to capture, analyze, communicate and validate business and quantitative requirements for risk management systems and models for equity derivatives clearing organization. Collaborate with senior leadership to identify, recommend and implement short- and long-range business objectives. Design and execute strategy for continuous improvement of quantitative analysis functions. Establish quantitative procedures and methodologies, quality standards and practices within the team and continually refine them to ensure they are efficient and address the changing needs of OCC. Translate quantitative methodologies including Monte Carlo simulations into functional and technical documentation. Design and develop test cases to validate, test and optimize quantitative risk models using R and Python prior to production release. Lead Agile development teams in quantitative analysis and implementation of financial models. Review analysis of quantitative requirements including analytical and technical documentation developed by team to identify weaknesses and/or missing components and recommend improvements. Education Required: Bachelor’s degree in computer science, math, engineering or related field Experience Required: Five (5) years of experience in quantitative analysis.  Must have some work experience with each of the following: 1) Translating quantitative methodologies including Monte Carlo simulations into functional and technical documentation; 2) Designing and developing test cases for data validation using R and Python prior to production release; and 3) Leading Agile development teams in quantitative analysis and implementation of financial models.Step 1 When you find a position you're interested in, click the 'Apply' button. Please complete the application and attach your resume. Step 2  You will receive an email notification to confirm that we've received your application.Step 3  If you are called in for an interview, a representative from OCC will contact you to set up a date, time, and location. For more information about OCC, please clickhereOCC is an Equal Opportunity Employer"}