{"jobID": "2733330070", "jobLocation": "Grayling_MI", "jobTitle": "Certified Personal Financial Counselor", "companyRating": null, "companyInfo": {"Website": "www.zeiders.com", "Headquarters": "Woodbridge, VA", "Size": "501 to 1000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0164 Post Date 4/13/2018 Title Certified Personal Financial Counselor Work Hours Standard Office Hours City Grayling State MI Description*This position qualifies for a special Sign-on Bonus*  Zeiders is an industry leader in military and family support. Our company's reputation is based on providing top quality service with exceptional, dedicated employees. This approach has earned client confidence and repeat business from satisfied customers.  Headquartered in Woodbridge, VA, Zeiders’ employees support clients worldwide in behavioral health, military family resiliency, work-life education programs, and related services. We seek individuals with strong passion for what we do and our commitment to  quality service. Job Summary: The Personal Financial Counselor (PFC) program is seeking qualified individuals to work full-time with Service Members and their families on personal financial issues such as budget planning, credit management and debt reduction, as well as retirement and  estate planning. These full-time positions are located on military installations throughout the continental Unites States and selected overseas locations. Principal Responsibilities: The majority of Service Members and their families will require financial counseling and education to assist with establishing a basic level of financial literacy, good financial behavior and habits, long term financial planning to include retirement planning.  The PFCs will be responsible for: Identifying immediate and long range measures to increase income, reduce household expenditures, and avoid additional financial burdens.Personal budget/financial planning to reduce, eliminate, and avoid debt and to achieve solvency and stability.Teaching Service members (and their families) money management techniques to encourage them to live within their means.Understanding credit, finance charges, interest rates and the implications of only paying the minimum amount each month.Educating military families on the importance of maintaining excellent credit histories and ratings.Establishing, monitoring, and protecting their credit.Teaching Service Members to make informed decisions and to be aware of associated costs such as insurance, maintenance, fuel costs, etc.Educating and counseling Service Members - about their retirement systems and providing financial models to assist them in establishing a comprehensive retirement plan.Assisting with tax planning.Teaching Service Members and their families how to save for emergencies, unanticipated contingencies, and both short and long-term goals.Other duties as assigned. PFCs will traditionally provide support in one of three ways. Any combination of the three may be requested by the installation coordinator. Face-to-Face financial counseling: PFCs support and educate individuals and families to help address specific needs, including provision of appropriate resource referrals.Financial briefings: Facilitate briefings designed to promote awareness and educate Service Members and their families on various personal finance topics. PFCs facilitate requested briefings using a library of approved presentations and handouts on a variety  of financial topics.Resource table: PFCs perform outreach and engage event attendees in conversations about setting financial goals, guidance to appropriate resources, as well as discussions on all areas of personal finance.REQUIRED QUALIFICATIONS:A minimum of a Bachelor’s degree coupled with 2+ years of experience in financial counseling or education.A national certification as an Accredited Financial Counselor (AFC) OR Certified Financial Planner (CFP) OR Chartered Financial Consultant (ChFC).Counselors shall maintain a valid, unrestricted motor vehicle license.Demonstrated experience in utilizing MS Office products (Excel, Word, PowerPoint).A criminal history background check that includes a credit check, as well as an FBI fingerprint check are required to work in this program.DESIRED QUALIFICATIONS:Previous military experience (including military spouses and/or as a service provider)Ability to travel up to 10% including some weekends with advanced notice.Ability to facilitate financial workshops and trainings to large groups and ability to tailor presentations to audiences as needed.Knowledge, skills, and abilities such as: Working knowledge of military, state, federal, and local resources.Understanding, sensitivity, and empathy for Service members and their family members.Ability to develop trusting helping relationships.Ability to work effectively with individuals and families from diverse racial, ethnic, and socioeconomic backgrounds.Ability to use sound professional judgment, ethical practice, and common sense. Ability to develop, implement, and evaluate financial needs of individuals and families.Other Skills and Abilities: All positions that require access to U.S. Government facilities and systems require U.S. Citizenship, and reliable transportation to travel to assigned locations and nearby facilities. Physical Demands: Sits, stands, bends, lifts, and moves intermittently during working hours. The employee must occasionally lift and/or move up to 40 pounds. The physical demands described here are representative of those that must be met  by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Work Environment: The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with  disabilities to perform the essential functions. The noise level in the work environment is usually quiet. Zeiders Enterprises, Inc. is an Equal Opportunity Employer.Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities.Please view Equal Employment Opportunity Posters provided by OFCCP  here.The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access  to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure  is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41  CFR 60-1.35(c)"}