{"jobID": "2639482469", "jobLocation": "San_Francisco_CA", "jobTitle": "Insurance Sales Agent", "companyRating": null, "companyInfo": {"Website": "www.healthmarkets.com", "Headquarters": "North Richland Hills, TX", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Humana"}, "estimatedSalary": null, "jobDescription": "Insurance Sales Agent - Leads Provided!Have you ever thought about the freedom and financial rewards of being your own boss while leveraging Corporate support every step of the way? We think about it every day! HealthMarkets has a winning formula to help Insurance Sales Reps build a successful business! All you need is the desire to jump into an industry that changes peoples lives. Whether you are new to insurance, or experienced in insurance sales, you can join a proven leader. Bring the ingredients and we will help you build a winning recipe. Your Ingredients with Our Recipe =Competitive Compensation: after hitting your training benchmarks, you will transition to a solid commission structure in the industryLead Programs Exclusive & Shared LeadsPre-Set AppointmentsMarketing InvestmentCorporate AdvertisingTechnology ToolsContinuous Training ProgramPortfolio of Products from Leading CarriersInvestment Stock Options PlanIngredient Requirements:You are coachable, entrepreneurial and competitive spiritYou have compassion & passion for helping people & making a difference in their livesYou have prime listening skills with clear communicationYou thrive on prospecting, cold calling, canvassing and leveraging your territory to gather leads and new customers.You have a competitive spirit and are driven by your own successYou are self-disciplined, self-motivated, high energy and persistentYou are a sharp, go-getter individualExtra Seasoning not required but a plus:Any Cold calling experienceProficient in Microsoft Office applications including OutlookAny CRM experienceAbility to successfully complete a pre-employment background check and drug screenDid you say Why Healthmarkets?Let me share our commitment. Millions of people are now purchasing their own health insurance, and millions more will soon be required to make complex Health Insurance and Medicare choices on their own. We are passionate to help these people with true guidance and recommendations!Know someone who is? Please share this job posting! "}