{"jobID": "2563003905", "jobLocation": "Elk_Grove_Village_IL", "jobTitle": "Senior Business Intelligence Analyst (Senior Operations Analyst)", "companyRating": "3.0", "companyInfo": {"Website": "www.pearson.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1844", "Type": " Company - Public (PSO) ", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": " At Pearson, we’re committed to a world that’s always learning and to our talented team who makes it all possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always re-examining the way people learn best, whether it’s one child in our own backyard or an education community across the globe.  We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology — and each other to surpass these boundaries — we create seeds of learning that become the catalyst for the world’s innovations, personal and global, large and small.General Responsibilities ·  Work with  stakeholders to elicit, analyze, specify, document, communicate and validate  business analytics requirements including operational performance metrics and  KPIs.  ·  Work with IT to identify,  provision, and structure data from internal, transactional systems and  external, third-party appended data sources to support business analytic  discovery, visualization, modeling, and reporting/presentation.  ·  Help  improve and streamline processes regarding data flow and data quality to  improve business analytics accuracy, viability and value.  ·  Collaborate  in the development of analytical insights and capabilities and ensure alignment  of these capabilities to business intelligence strategies and roadmaps.  ·  Identify, analyze, and interpret  trends using statistical techniques  ·  Lead  design and support development of internal operational and external business  partner KPI dashboards and analytical reports using visualization and reporting  tools.  ·  Provide  support for on-going analytical performance reports that drive operational  decision-making and provide ad-hoc or special reports  as dictated by business needs  ·  Aid in  the development of best practices used in business metrics analysis.  ·  Act as a  liaison on business analytics initiatives between cross-functional  stakeholders; draft communications and provide initiative updates  ·  Support  process improvement discussions with stakeholders informed by analytical  insights  ·  Participate in business partner-facing  presentations and meetings as neededGeneral Qualifications ·  4-year  degree from an accredited institution in Mathematics, Statistics, Economics,  Business, Computer Science, Information Management or related field OR  combination of education and significant experience required (advanced degree  preferred)  ·  Minimum  of 5 years’ experience in a role focused on data & analytics with  demonstrated capability in data visualization, discovery, and analysis  ·  Advanced  knowledge of data sources, tools, statistical principles and methodologies.  ·  Strong  analytical and problem solving skills including collecting, organizing,  analyzing, and disseminating significant amounts of information with attention  to detail and accuracy  ·  Advanced  MS Excel skills as well as working experience with other BI/Analytics  technologies such as Tableau, Qlikview, MS Power BI, and Tibco Spotfire  ·  Ability  to work within a cross-functional team setting  and shifting priorities  ·  Good  communication and interpersonal skills. Ability to interact with diverse  technical and non-technical groups, spanning organizational levels.  ·  Experience  participating in fast-paced and dynamic projects. Solid organizational and  project management skills.  ·  Ability  to perform up to 15  non-local travel  Candidates  should be able to demonstrate proficiency in:  o Programming experience: intermediate SQL and scripting language such as Python  o  Intermediate Excel: pivot tables,  HLOOKUP/VLOOKUP, ODBC, macros  o  Integrating data from multiple  sources and formats.  o  Internal and external dashboard  design  o  Reporting packages: Tableau  desktop experience preferred. Experience with SSRS/SSIS.  o  Creating and delivering  presentations to internal and external stakeholders  Additional  skills desired:  o  Applied analytics experience in  higher education student marketing, recruitment, and retention  o  Exposure to: R, Python, Hadoop,  machine learning  o  Statistical packages: SAS, SPSS  o  Curiosity to investigate anomalies  in data and understand root causes  o Predictive modeling: linear/stepwise/logistic regression  o  Data mining and segmentation  techniques  #LI-TH  #OPM  #POLS  #CHI"}