{"jobID": "2796516104", "jobLocation": "Farmington_Hills_MI", "jobTitle": "Catalog Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.akebonobrakes.com", "Headquarters": "Farmington Hills, MI", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Support the Catalog & Data Services Manager by assisting with responsibilities to the Product Development, Sales & Marketing Teams as well as all direct & in-direct customers, sales agencies and channel partners for the efficient, effective and successful sale of Akebono parts within the Independent Aftermarket (IAM). Essential Duties/ResponsibilitiesMaintain all aspects of Akebono’s IAM Catalog Database; including but not limited to vehicle applications, interchanges, product attributes and images; using standard industry formats; ACES, PIES, PADB as well as proprietary customer specific formats.Utilize OEM and Industry specific application information to identify new applications and carry-up coverage.Assist in areas relating to, but not limited to, paper cataloging, digital content, customer specific data requirements and strategic departmental initiatives.Provide timely data updates as required, to customers, channel partners and data providers enabling long term profitability and growth by maximizing sales opportunities and customer satisfaction for the IAM in North American.Support Product Development Team with OEM application and competitive interchange information, coverage and gap analysis along with current and future sales potential.Support the IAM Sales Team with part related information including, but not limited to: paper & digital PDF’s of vehicle applications, OE & Competitor interchangeability, pricing, popularity, sales forecasts, recommended stocking guides and vehicle registrations; in-total and by local geography, allowing optimized customer inventory and sales potential.Attend industry related conferences and events as well as customer seminars for the purpose of increasing knowledge, improve data deliverables and staying current with industry standards, trends and specific customer requirements.Produce, edit, distribute and maintain product images in required sizes and formats, utilizing customer specific requirements and industry established “best practices”.Produce and Distribute Bulletins; New Part Announcements as well as Informative or Educational memos.Meet customer expectations and all contractual obligations.Investigate new part opportunities and make recommendations based on individual research.Other duties and responsibilities assigned as required.Education and/or Experience (minimum required for the position) Bachelor’s Degree, preferably in Business or Engineering, and a minimum of 3 years related experience and/or training; or equivalent combination of education and experience.  A basic knowledge of the automobile and mechanical aspects of the braking system of a passenger car or light truck as well as the basic understanding of the automotive aftermarket a plus. Knowledge and a genuine interest in the Automotive Industry and passenger vehicles a plus. Essential Knowledge, Skills, Abilities To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Ability to read, analyze and interpret industry and customer guidelines and requirements, part applications, part fitment and qualifiers. Ability to write reports, business correspondence, product procedures and customer communication bulletins. Ability to effectively present information and respond to questions from executives, directors, managers, direct & indirect customers, and end-consumers/vehicle owners.Ability to calculate figures and amounts such as sales, percent of sales, market share, vehicles in operation (VIO) part and vehicle life-cycle and scrappage trends, product line coverage and gap analysis.Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram or schedule form.Strong organizational & reporting skills as well as project & time management.Ability to exercise independent judgment to perform essential duties.Ability to develop instructions and guidelines to perform functions of the job when necessary.Demonstrated proficiency in Photoshop is preferred.Demonstrated proficiency in MS Office (Access, Excel, PowerPoint, Word, Outlook).Supervisory Responsibilities This position does not have direct supervisory responsibility. Physical Demands/Environment This position requires the following physical abilities: to sit; to use hands (to finger, handle, or feel), to reach with hands and arms, to stand, to talk and hear and occasionally lift and/or move up to 25 pounds. In addition, the specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus. Other Requirements There is up to 10% travel required to visit suppliers, other Akebono facilities, customers and industry events, therefore ability to drive a motor vehicle and/or fly is required."}