{"jobID": "2818452429", "jobLocation": "Irvine_CA", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.usstoragecenters.com", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Job Title: Data Analyst  Reports To: Troy Bergen Direct Reports: None Department: Operations Location: Irvine, CA FLSA Status: Exempt Position Status: Permanent Work Schedule:Monday-Friday -subject to change based on project assignments/deadlines Base Salary Range: $55k to $60k per year “Commensurate with Experience” Travel: Up to 5% of the time About US Storage Centers Westport Properties manages US Storage Centers (“USSC”) which is a top 10 Self Storage Management company in the country with over 130 properties and operating in multi-states under management with over 30 million rentable square feet. Founded in 1985, we have built a premier management platform in the industry. Since its inception, USSC has helped thousands of its customers organize their lives by delivering convenient and affordable self-storage solutions. Summary Role: Data Analyst The role of the data analyst is one with a background in data querying and proficient knowledge in SQL Server. The qualified person for this position will have a proven successful track record in inspecting, cleansing, transforming, querying and modeling data. The day-to-day functions and responsibilities of the data analyst will be to provide reports sourced from a wide variety of databases while maintaining good communication and reporting relationships with multiple departments, field management, and Company Personnel at all levels. Key Functions & Areas of Responsibilities:Automate Revenue Management PlatformDevelop Reporting using data stored in our Business Intelligence Software (DOMO)Link databases from different corporate platforms including Operations, IT, Accounting, HR, and Property ServicesOther Duties As AssignedPeriodic special projects and duties may be assigned based on Company need and requirementsQualifications Required:1 year of experience in a data analyst role preferredProficient knowledge of SQL Server (T-SQL and MySQL)Proficient in Microsoft Office Suite - Word, Excel, and Outlook with advanced skills in Excel highly preferredAbility to understand and convey Company Policies and relevant industry standardsAbility to analyze and configure data for reporting purposesAbility to effectively communicate while exercising diplomacy, sound judgment and tactAbility to deal effectively with co-workers, department managers and outside vendorsAbility to work flexible hours depending on various departmental project deadlines and/or Company events and sponsored programs (including a few late evenings and weekend events per year)Core Competencies:General office and telephone skills are requiredExcellent Computer Skills are requiredGood written and verbal communication skillsGood organizational skillsCollaborative Team WorkProactive, self-starter, goal oriented and ability to work independentlyMaintain a positive attitude and composure in a supportive roleAbility and willingness to work remotely as necessaryUphold Company’s Vision, Mission Statement and Core ValuesEducationBachelor’s degree in Computer Science with a concentration in Database Administration or equivalent from an accredited college or university is preferredMicrosoft SQL Server MCSA certification or MySQL certification is preferredPhysical DemandsStationary Position: frequently remains stationary up to 90% of the time and sitting up to 8 hours in a dayMove/Traverse: infrequently bend, stand, stoop and/or walkCarry Weight: infrequently carry weight and/or lift objects (light to heavy) weighing up to 10 poundsHearing and Speech: frequently communicates with the ability to hear and talk on a regular basis with employees, coworkers, and all personnel matters; must be able to exchange accurate information in these situationsSight: frequent use of sight to detect images on computer, office documents, and office objects near and farWork EnvironmentRegular professional, office business settingNoise moderately lowBenefits for Full-Time EmployeesPaid Vacation TimePaid Sick TimePaid Holidays401(k) EligibilityHealth Benefits: Medical, Dental, VisionLife Insurance BenefitsSupplemental (Flexible Spending Accounts, Disability, Cancer/Critical Care, Hospitalization, Accident)Recognition of Hard Work and Exemplary PerformanceClean, Air Conditioned, Friendly Working EnvironmentDiscretionary Bonus Based on Several FactorsAbout UsAll Employees must pass a post-offer, pre-hire background screening which includes a multi-state criminal check and DMV Records in accordance with federal protected FCRA/FACTA Requirements for Investigative Consumer Reports, CA ICRA and other state mandated requirements for employment purposes.Furthermore, this job description is subject to change at any time. Nothing in this job description is meant to guarantee employment status and/or position. This job description neither restricts nor prevents management’s right to assign and/or reassign duties and responsibilities to this job at any time of the essential functions. It does not proscribe or restrict the tasks that may be subsequently assigned. Essential Job Function for Reasonable Work Accommodation According to the American’s with Disabilities Act (ADA), Equal Employment Opportunity Commission (EEOC) and the California Fair Employment and Housing Act (FEHA), employees must be able to perform the essential job functions with or without a reasonable accommodation. The Company will provide reasonable work accommodations to allow the employee to perform their essential job functions and duties as detailed above. Disclaimer Westport Properties, Inc. is a parent company of US Storage Centers (USSC) which provides at-will, equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, marital status, disability or genetics. Furthermore, Westport Properties, Inc. expressly prohibits any form of workplace harassment and discrimination based on age, disability, color, genetics, marital status, national origin, race, religion, sex, sexual orientation, or veteran status in compliance with federal, state and applicable local laws governing employment and labor law in every location in which the company conducts business. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}