{"jobID": "2810670571", "jobLocation": "Dearborn_MI", "jobTitle": "Ford GDIA Data Ops Supervisor Data Consulting", "companyRating": "3.9", "companyInfo": {"Website": "www.ford.com", "Headquarters": "Dearborn, MI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (F) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tesla, General Motors, Uber"}, "estimatedSalary": "75000", "jobDescription": " Job Description&Qualifications; Job Description/Overview: The Data Operations Supervisor will manage a team of data consultants to support the data needs of our business partners in the development of a single, complete, and actionable view of our Ford customers. Responsibilities: You will be responsible to for providing the data consultations and tasking for enterprise data integration tasks, including selection, standardization, and enrichment that will feed downstream applications to drive business value through evidence based decisioning. In addition, you will: Strong focus on supporting the needs of our Sales Forecasting, Dealership and Ford Credit Analytic TeamsCreate information strategies to deliver on GDIA promisesEngage with GDIA business customers to understand their goals and how best to support these objectives through data and analyticsWork with GDIA IT business partners to deliver solutionsDrive the Data Strategy and align it with continuously changing business landscapeContinuously increase Data Coverage by working closely with the analytics teams, understanding and evaluating their data requirements and delivering the data they needProvide visibility to Data Quality issues and work with the business owners to fix the issuesPromote the Enterprise Data Governance model and actively demonstrate the concept of data sharing, data reuse, data quality and data standardsServe as data subject matter expert and demonstrate an understanding of key data management principles and data useDrive Data profiling and data exploration for basic understanding and profiling of the data Job Requirements Basic Qualifications:Bachelor's degree required7 years of experience in data science consultingPreferred Qualifications:Knowledge of data management standards, data governance practices and data qualityAbility to quickly comprehend the functions and capabilities of new technologiesHighly motivating team leader, with the ability to develop direct reports in their own careersStrong analytical and problem solving skills, with the ability to communicate in a clear and succinct manner and effectively evaluates information / data to make decisionsStrong interpersonal, and leadership skills, with proven abilities to communicate complex topics to leaders and peers in a simple, clear, plan oriented manner The distance between imagination and creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities you'd expect from a diverse global leader. You'll become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always ready to go further.  Candidates for positions with Ford Motor Company must be legally authorized to work in the United States on a permanent basis. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position. TN Visa holders may be considered.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status."}