{"jobID": "2827208098", "jobLocation": "Fremont_CA", "jobTitle": "Retail Sales Associate", "companyRating": null, "companyInfo": {"Website": "www.petfoodexpresscareers.com", "Headquarters": "Oakland, CA", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Petco, PetSmart"}, "estimatedSalary": null, "jobDescription": " What makes being a Sales Associate at Pet Food Express so rewarding? Knowing every pets name that walks into the store and being the trusted advisor for your customers by helping them find the best solution for their pet problems like dietary needs or behavior issues. Even better your excellent sales and customer service skills are rewarded with excellent pay and benefits and bonuses too! Apply today to join a team that not only cares about making a difference in the pet community, but cares about your own passion and growth. What youll do:Provide the signature PFE experience our customers rave aboutBuild relationships with your customers, understand their pets needs, and share your product knowledge in order to provide solutionsRing up customers, answer questions, stock shelveswhatever needs to happen to create an exceptional in-store experienceParticipate in training and educational programs to enhance your product knowledge and communication skillsWhat youll need:We value potential over experience. The bottom line is that we hire great people, pay them well, and train them on what they need to know. If youre unsure about whether you meet our qualifications, just applyA passion for pets and peopleA warm and welcoming personalitySales and/or pet experience is a plusAbility to work evenings and weekends regularlyAbility to regularly lift and carry up to 50 lbs. (bags of kibble and litter)What youll love:Pay starting at $14.50 and opportunities for growthFun team and managers who care about your developmentBest employee discount in the industry, and extends to you and family members!Competitive vacation, holiday, and sick payHealth insurance, 401k match, profit sharing, and other great benefitseven pet insurance!Community volunteer opportunitiesAbout the Company One of Business Insider Magazines 25 companies that are revolutionizing retail, we at Pet Food Express pride ourselves on offering high quality, innovative, and unique pet foods and products. Since 1986, our commitment to purpose over profits has driven our decades long history of continuously strong growth. But dont take our word for it: in addition to our national industry awards, youll find us and our founders on lists like the National Retail Federations People Changing Retails Future (15) and Top Bay Area Workplaces (7 years running). You love pets, so do we. Join us.Pet Food Express is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}