{"jobID": "2778541969", "jobLocation": "Germantown_MD", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.aecom.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1990", "Type": " Company - Public (ACM) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Bechtel, ABB, Louis Berger"}, "estimatedSalary": "83000", "jobDescription": "*Business Line** Water*Position Title** Data Analyst United States of America - Maryland  Germantown *Job Summary** AECOM is actively seeking a highly talented and motivated Data Analyst for immediate employment in the Germantown, MD office.  The responsibilities of this position include, but are not limited to:  + Develops solutions to collect, analyze and report project-specific data using a wide range of technologies including but not limited to SQL Server, MS Access, open source database platforms and MS Office automation.  + Works and collaborates with internal and external customers to develop data management strategies for AECOM business units including Water, Environment and Transportation  + Responsible for working with large and varied data sets, from multiple data sources, in order to conduct analysis, generate concise reporting, and present recommendations to clients for future project deliverables.  + Maintains project data solutions and implement regular updates to ensure data quality  + Assist swith coordination and troubleshooting of database and software systems  + Researches and recommends new technologies that could benefit the team *Minimum Requirements** + High School Diploma  + 2+ years of experience  + Demonstrated experience with relational databases including SQL Server, MS Access, Oracle and open source tool sets and unstructured data  + Experience developing solutions using MS Office automation including Excel macros and pivot tables  + Proven ability to work in a team environment. Collaborate with other data managers, developers, testers, managers and clients (internal and external).  + Excellent verbal and written skills  + Position requires attention to detail and the ability to quality check all data deliverables for internal and external clients. Successful candidate must be a team player, committed to meeting team and client schedules, and able to work productively on several high profile projects at once.  + Due to the nature of this work, U.S. citizenship is required *Preferred Qualifications** + Bachelors degree in related field or equivalent experience  + Experience with JavaScript and HTML  + Knowledge of Python and R for statistical computing  + Ability to work with scientists and engineers to help develop project-specific algorithms and methodologies  + Knowledge of open source data analysis tools  + Familiarity with big data and business intelligence technologies *What We Offer** AECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow.  AECOM is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply. For further information, please click here to view the EEO Is The Law poster.  At AECOM, employees safety and security are our top Safeguarding core value. All employees are expected to set the highest level of safety expectation in their work, display the highest level of safe behavior, and actively participate in AECOMs Safety For Life Program. SH&E; is a part of our company culture and participation is required for all employees.  Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM. *Job Category** Information Technology*Business Group** Design and Consulting Services Group (DCS)*Country** United States of America*Position Status** Full-Time*Requisition/Vacancy No.** 186700BR Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status."}