{"jobID": "2673370997", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher", "companyRating": "4.0", "companyInfo": {"Website": "www.allstontrading.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "180000", "jobDescription": "Who is Allston Trading? Founded in 2002 by former CME floor traders, Allston Trading is one of the world's leading electronic trading and market-making firms, providing liquidity in global energy, commodity and financial futures markets. Allston is owned by its current and former employees, a retired founder, and long-term institutional backers Sequoia Capital and Francisco Partners. We are proud of our track record through multiple macro-economic cycles and an ever-evolving landscape of technology, regulation and market structure. We have attracted and retained many of the industry's best and brightest trading, analytical and technology professionals.  Headquartered in Chicago, we also have offices in New York, Houston, and London. What does this role entail? The Quantitative Researcher will analyze and develop profitable trading models by applying large scale statistical analysis and other relevant techniques to market data and other relevant data sources. What does it take?Masters or PhD in, e.g., Statistics, Computer Science, Mathematics, PhysicsProven success with profitable trading strategiesHands on experience in the full life-cycle of strategy development research, including: idea creation; data collection/cleansing; analysis; testing; and deploymentProven success working with large data sets and developing predictive statistical modelsStrong programming skills in C++ in a Linux environmentExperience with numerical computing in PythonStrong knowledge of probability, statistics, machine learning, time-series analysis, large scale inferencePrior experience working in a data driven research environmentStrong communication and collaboration skills with the ability to work within a multi-disciplinary teamWhat are the benefits?Quarterly bonus programCatered breakfast and lunch dailyWeekly shoulder massagesFlexible vacation policyPaid maternity leaveTuition assistanceMedical/Dental/Vision coverage401(K) matching planCasual dress codeCompany eventsEmployee discount program and much more!"}