{"jobID": "2829250384", "jobLocation": "Downers_Grove_IL", "jobTitle": "Senior Food Scientist II - Optimization", "companyRating": "3.4", "companyInfo": {"Website": "www.tysonfoods.com", "Headquarters": "Springdale, AR", "Size": "10000+ employees", "Founded": " 1935", "Type": " Company - Public (TSN) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": "*58208BR***Req ID:**58208BR*Job Description:** This position is a key development leadership position that is responsible for identifying, developing and commercializing new and improved products and/or processes. This person would work independently and autonomously to create work plans that will have significant positive impact on the company. This person is responsible for using consumer insights driven concepts to develop innovative products that will meet the customer?s needs as well as accomplish Tyson?s objective of profitable, efficient production. The Scientist in this position will have a strong knowledge of the Research & Development process and is expected to leverage and expand their knowledge related to ingredients, product formulation and food processing. Position will be responsible for assessing emerging ingredient and process technologies as well as partnering with key vendors to bring innovation to new product development, process improvement and cost optimization. The person in this position will be responsible for working across multiple product lines and processes, conducting research with a focus on food safety, shelf life, sensory technologies, yield improvements and optimization efforts to meet our business objectives. Product development and research activities will expand across a broad range of food products and processes. This position will be responsible for analyzing, interpreting and presenting data for effective communication of product development and/or research findings to Marketing, Operations and our Senior Leadership Teams. This position will have a broad understanding of culinary techniques and the interaction with the science. This person will lead teams within R&D; and across the organization in normal project work or special project assignments. This position requires a strong foundation in project management, problem solving techniques, presentation skills and relationship building to effectively work with Culinary, Process Engineering, Regulatory, Food Safety Quality Assurance, Operations, Sales & Marketing, as well as major external customers. REQUIREMENTS:EDUCATION: BS, MS or PhD in Food Science, Meat Science, Food Engineering or related field. No degree with minimum of 15 years- relevant experience. EXPERIENCE: Related degree with minimum of 8 years relevant R&D; work experience. No degree with minimum of 15 years? relevant experience. COMPUTER SKILLS: Requires excellent computer skills with ability to fully utilize MS Office products and Tyson systems (or like systems). COMMUNICATION SKILLS: Excellent verbal and written communication skills required. Strong presentation skills required. Must have the ability to effectively communicate with all functional and business unit management levels. SPECIAL SKILLS: Strong critical thinking and problem solving skills. Strong project management skills. SUPERVISORY: May supervise a team of hourly technicians that support a team of scientists. May also manage one or two salaried scientists.  TRAVEL: 25% - 12+ domestic trips per year. Travel will be required to accomplish our internal and external customer needs. Travel will include customer meetings, plant production facilities for testing and commercialization of new products, process trouble shooting and any other regular business needs. \\#LI-KG1*Facility Name (Location):** Downers Grove Office *Pay Type:** Exempt *Title:** Senior Food Scientist II - Optimization *City:** Downers Grove *State:**IL*Shift:**1*Job Function:** Research and Development *Full Time / Part Time:** Full Time *Relocation Covered:**YES*Company Culture, Inclusion and Diversity Statement:** Tyson Foods proudly embraces diversity and is committed to maintaining an inclusive work environment. Our Culture is rooted in our Core Values and brought to life each day through our 5C Team behaviors (Caring, Candor, Creativity, Collaboration and Commitment). Team Members are the heart of our company and its success and culture is the connecting thread which drives our Talent Strategy to Attract, Grow, Reward and Retain the best talent.  Tyson is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will be considered without regard to race, national origin, color, religion, age, genetics, sex, sexual orientation, gender identity, disability or veteran status."}