{"jobID": "2817655977", "jobLocation": "Washington_DC", "jobTitle": "Manager, Data Scientist (AI/NLP)", "companyRating": "3.8", "companyInfo": {"Website": "us-jobs.kpmg.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1987", "Type": " Subsidiary or Business Segment", "Industry": " Accounting & Legal", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " PwC, Deloitte, EY"}, "estimatedSalary": "105000", "jobDescription": "Business Title: Manager, Data Scientist (AI/NLP) Requisition Number: 33987 - 19 Function: Business Support ServicesArea of Interest: Data AnalyticsState: DCCity: WashingtonDescription:Innovate. Collaborate. Shine. Lighthouse - KPMG's Center of Excellence for Advanced Analytics - has both applied data science, AI, and big data architecture capabilities. Here, you'll work with a diverse team of sophisticated data and analytics professionals to explore the solutions for clients in a platform-diverse environment. This means your ability to find answers is limited only by your creativity in leveraging a vast array of techniques and tools. Be a part of a high-energy, diverse, fast-paced, and innovative culture that delivers with the agility of a tech startup and the backing of a leading global consulting firm. For you, that translates into the chance to work on a wide range of projects - covering technologies and solutions from AI to optimization - and the power to have a real impact in the business world. So, bring your creativity and pioneering spirit to KPMG Lighthouse.KPMG is currently seeking a Manager to join our KPMG Lighthouse - Center of Excellence for Advanced Analytics in our Emerging Markets Practice.Responsibilities:Retrieve, process and prepare a rich data variety of data sources such as social media, news, internal/external documents, emails, financial data, and operational data Analyze and model structured data and implement algorithms to support analysis using advanced statistical and mathematical methods from statistics, machine learning, data mining, econometrics, and operations research Perform Statistical Natural Language Processing to mine unstructured data, using methods such as document clustering, topic analysis, named entity recognition, document classification, and sentiment analysis Utilize a diverse array of technologies and tools as needed, to deliver insights, such as R, SAS, Python, Spark, Hadoop, Qlikview, and Tableau Help drive client engagements focused on Big Data and advanced business analytics, in diverse domains such as risk management, product development, marketing research, supply chain, public policy; communicate results and educate others through reports and presentationsQualifications:A minimum of seven years of professional experience working as a Data ScientistMaster's, or PhD in Computer Science, Statistics, Mathematics, Engineering, Econometrics, or related fields from an accredited college or universityStrong mathematical background with strong knowledge in at least one of the following fields: AI, statistics, data mining, machine learning, statistics, operations research, econometrics, natural language processing, and/or information retrieval Experience with command-line scripting, data structures, and algorithms; ability to work in a Linux environment Proficiency in analysis (e.g. R, SAS, Matlab) packages as well as proficiency in programming languages (e.g. Python, Ruby, Java, Scala) Ability to travel up to eighty percent of the time. Must be able to work in the United States without sponsorship of a VISA.KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, creed, religion, age, sex/gender, national origin, ancestry, citizenship status, marital status, sexual orientation, gender identity or expression, disability, physical or mental handicap unrelated to ability, pregnancy, veteran status, unfavorable discharge from military service, genetic information, personal appearance, family responsibility, matriculation or political affiliation, or other legally protected status. KPMG maintains a drug-free workplace. KPMG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable local, state or federal law (including San Francisco Ordinance number 131192). No phone calls or agencies please.GL: 4GF: 15304"}