{"jobID": "2771751407", "jobLocation": "Lakewood_NJ", "jobTitle": "R&D; Scientist I - Method Validation", "companyRating": null, "companyInfo": {"Website": "www.renpharm.com", "Headquarters": "Lakewood, NJ", "Size": "Unknown", "Founded": " 2010", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This position supports validation activities of analytical methods and method transfer from R&D; to QC labs for new pharmaceutical projects. Applying a working knowledge of Method Validation theories, practices and concepts, the incumbent works under the direct supervision of more senior R&D; scientists to execute validation activities. Insure Standard Operating Procedures and protocols are maintained and applied.  Technical Under the supervision of The R&D; Manager or a Senior Scientist, support validation activities of analytical methods and method transfer from R&D; to QC labs as per the current SOPs, ICH and FDA guidelines.Conduct routine and non-routine laboratory analyses such as finished product testing, stability testing, and manufacturing in-process testing of R&D; /engineering batches which require critical levels of accuracy.Use analytical techniques like HPLC/UHPLC, and GC using empower software, Karl Fisher, UV spectrophotometer etc., that is used in analytical development activitiesWrite standard methods of analysis.Write and review analytical test methods, reports and protocols.Operate all laboratory analytical instrumentation and perform troubleshooting and calibration of laboratory equipment as needed.Perform assigned various tasks which are needed to maintain the laboratory. Such tasks may include ordering lab supplies, calibrating instruments, cleaning glasswares and Hazmat duties.Manage time effectively to complete assignments in an expected time frame.Document all experimental work neatly and correctly in a lab notebook in accordance with Standard Operating Procedures.Review lab testing results and notebooks to ensure accurate documentation.Ensure proper training before performing any tests and maintain an up to date training record related to all job functions and GXP requirements.Maintain current knowledge of relevant Quality System Regulations and other regulatory requirements related to research and development (product development, design and safety) to ensure compliance in all research, data collection and reporting activities.Maintain quality checks on safety of the Lab, including biohazards and insure maintenance of the facilities according to Good Laboratory Practices.  CommunicationsCompile data and interpret any out of trend/specifications against predetermined validation criteriaEffectively interact with other scientists, project managers and colleagues from numerous functions.  Bachelor’s degree in Pharmaceutical Sciences, Chemistry, or similar degree and relevant experience in the pharmaceutical industry is preferred."}