{"jobID": "2828376078", "jobLocation": "West_Bloomfield_MI", "jobTitle": "Dishwasher", "companyRating": "4.3", "companyInfo": {"Website": "www.beztak.com", "Headquarters": "Farmington Hills, MI", "Size": "501 to 1000 employees", "Founded": " 1940", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Paragon Properties, Broder & Sachse Real Estate, Brookdale Senior Living"}, "estimatedSalary": "12", "jobDescription": " The Dishwasher performs all necessary duties to uphold the communitys standards of quality and excellence in food, service, hospitality, and friendliness. The position is responsible for ensuring that all dishes, utensils, glassware and equipment are kept in a clean and orderly manner. The positions assists wait staff and servers as needed. ESSENTIAL FUNCTIONS:Cleans all dishes according to the process identified within the department.Collects dishes and brings them to the cleaning area.Cleans all areas assigned according to the departmental standards.Assists servers and cooks as required.Ensures an adequate supply of clean dishes for the efficient delivery of meals.Knows and uses Universal Precautions and Personal Protective Equipment provided according to requirements established by OSHA.PERSONAL QUALITIES:Flexible, innovative and demonstrates the make sound decisions.High integrity, positive attitude, mission drive and self-directed.Passion, dedication and commitment for providing seniors an engaging, enlivening and captivating living environment.Ability to identify issues before they occur.Able to handle problems as they arise in relation to the operation of the community and collect data, establish facts, draw valid conclusion and make changes to prevent the problem from occurring again.QUALIFICATIONS AND EDUCATION:Working knowledge of the industry.Excellent verbal and listening skills.PHYSICAL DEMANDS AND WORK ENVIRONMENT:The position is required to regularly stand for long periods of time, walk, and communicate with residents, staff, family members and the public."}