{"jobID": "2645668541", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.retentionscience.com", "Headquarters": "Santa Monica, CA", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " AgilOne, IBM"}, "estimatedSalary": null, "jobDescription": "About us:ReScis mission is to Transform how brands communicate with their customers using Artificial Intelligence.ReSci builds advanced AI software that transforms information about customers into powerful data science predictions. With our award-winning AI platform-Cortex, we take the guesswork out of marketing by uncovering customer trends undetectable by the human mind to deliver thriving and successful campaigns. Our goal is to revolutionize how marketers think, feel, and do marketing.We are a B2B software as a service model and our core product Cortex is a paradigm shift in doing email marketing and segmentation.Description:The Data Science team at ReSci in a new phase of its evolution. Earlier having scaled 40 different predictive models to 250M users (across 100 businesses) we are looking at identifying and building the next wave of innovations to scale our platform. You will work closely our Data scientists and Data Engineers to get the best Machine learning models on production and evaluate its efficacy. Our goal is to democratize AI to every marketer.We are looking for Team Player who loves to build data products and has passion for Machine learning. If youre a self-starter with passion and great attention to detail then this is for you. Your day-to-day work will directly impact more than 100s clients and 100s of millions of users!Responsibilities: Apply unsupervised and supervised machine learning for predictions that power our products: Cortex and Pocket DataMaintain and improve generalized but tunable product recommendation models, churn predictors and LTV modelsCommunicate methodology and results to technical and non-technical audiencesBuild and maintain apps on Scala including ML monitoring, AB testing, Data connectorsMaintaining data pipelines and feature engineering layers for ML to flourishReporting and analytics for clients on key campaign resultsQualifications:Minimum 5 years in shipping Machine learning or data products at scaleStrong breadth of Machine learning techniques like classification, regression and clusteringMS/PhD strongly preferred in Computer Science, EECS or relevant fieldStrong communication skills and able to speak to a non-technical audience about data science and AIStrong Python, Spark AND Scala are desired but not mandatoryPerforming AB testing at scale"}