{"jobID": "2802136570", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Analyst SQL with Rx Technology", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with San Antonio Interviews but with Rx Technology  San Antonio Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description We are looking to add a Data Analyst to our growing team!  The skill set we are looking for:  Ability to use SQL queries to pull data for reporting processes  Build and maintain queries for repeated use for a “cookie-cutter” approach to report generation  Utilization of Advanced Techniques in Excel  Collecting, analyzing and reporting on various internal and external metrics and processes.  Perform data mining operations within SQL  Build report data into PowerPoint presentation for easy dissemination  Able to meet with Key Stake Holders to help determine reporting. Requirements: Focused and attentive to details, ability to think independently and detect problem issues.  Ability to multitask, prioritize and follow through with projects from start to finish.  Ability to quickly understand and adapt to new technologies and procedures.  Ability to work well under pressure to meet project deadlines  Ability to effectively present information to customers, clients and other employees of the Company.  Excellent written and oral communication skills; ability to respond to incoming emails with proficiency and professionalism.  Company DescriptionFounded and headquartered in San Antonio, Texas in 1995, Rx Technology supports the data, security, fire and IT needs of clients with efficient, solution-based services. Rx Technology has experienced and maintained tremendous growth over the last 22 years, but continues to be family owned and operated, always striving to maintain the principles on which it was founded: integrity, reliability and a focus on client relationships  Apply"}