{"jobID": "2832423332", "jobLocation": "Piscataway_NJ", "jobTitle": "Scientist II or III Bioassay, AR&D;", "companyRating": null, "companyInfo": {"Website": "www.planet-pharma.com", "Headquarters": "Western Springs, IL", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Contract", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job ID: BH51703  Category: Scientist, Scientific  Industry: BiotechnologySUMMARY:  The Scientist III Bioassay will be responsible for phase specific analytical method development and sample testing required for functional characterization of biologics through various phases of biosimilar development. Additional responsibilities include support of method transfer to QC laboratories and liaising with CRO laboratories. Techniques employed include but are not limited to cell based assays, ELISA and SPR binding assays. Experience with flow-cytometry and BLI binding assays is a plus. The candidate must have experience authoring SOPs and technical reports. The successful candidate will be a highly motivated, well-organized, and detail-oriented scientist who can work effectively in a fast-paced and multi-disciplinary environment. ESSENTIAL DUTIES AND RESPONSIBILITIESDevelopment of bioassays for characterization and product release: binding, potency, effector function assays, downstream signaling, reverse-signaling, etc.Support sample testing as necessary for various stages of biosimilar developmentElucidation of structure/function relationships for biologic therapeuticsTransfer of analytical methodologies to other laboratoriesMaintain a detailed and well-organized record of all laboratory activitiesAuthor SOPs and technical reportsParticipate and/or lead cross-functional project teamsRepresent the company in discussions with external parties as neededParticipate in lab maintenance activities as needed Requirements:PREREQUISITES:Education:PhD. with 2 – 8 years, OR, M.S. with 8-10 years, OR B.S. with 12-15 years of experience in Life Sciences fields such as Cell Biology, Biochemistry, Pharmaceutical Sciences, or a related fieldExperience:Strong experience in analytical method development and validationFirm understanding of cellular pathways and mechanisms of drug actionFamiliar with ICH guidelines and USP/EP pharmacopeia requirementsA strong theoretical understanding and experience in protein chemistrySPECIALIZED KNOWLEDGE AND SKILLS:Experience with MS office tool is requiredExperience with DOE software and statistical data analysis is a plusStrong communication and technical writing skillsWORK ENVIRONMENT AND PHYSICAL DEMANDS:General Work Environment:70% laboratory and 30% office settingExtended hours or weekend hours may be occasionally necessaryNoise:No extraordinary noise levelsStanding/Lifting:No extraordinary requirementsVisual:No extraordinary requirementsStress:High paced demanding environmentTravel:Less than 30% Type:  Direct  Location:  Piscataway, NJ Apply Now"}