{"jobID": "2667336892", "jobLocation": "Pasadena_CA", "jobTitle": "Machine Learning Scientist With Audio DSP Background", "companyRating": null, "companyInfo": {"Website": "www.oben.me", "Headquarters": "Pasadena, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "MACHINE LEARNINGMACHINE LEARNING SCIENTIST WITH AUDIO DSP BACKGROUNDObEN’s mission is to enable everyone in the world to create their own Personal AI (PAI), intelligent 3D avatars that look, sound, and behave like the individual user. Secured and authenticated on the Project PAI blockchain, ObEN’s technology creates more productive, more personalized digital interactions. ObEN is a K11, Tencent, Softbank Ventures Korea and HTC Vive X portfolio company, and we work with our strategic investors to expand PAI technology across multiple verticals including hospitality, retail, healthcare, and entertainment.  Working at ObEN means taking on extraordinary transformations every day, in an environment that celebrates and encourages innovation. You’ll be working in small, agile teams (including world class researchers in areas of machine learning, NLP, computer vision, speech, and blockchain). We are blazing new trails in AI and blockchain technology, and we encourage and support publications to top conferences and journals. Learn more about working at ObEN in our blog post.JOB DESCRIPTION Collaborate with senior machine learning researchers, engineers and speech processing researchers. Provide technical expertise to address supervised and unsupervised learning problems in an applied research and development environment. Develop & deploys modern machine learning and statistical methods (CART and Random Forests, clustering and classification algorithms, Bayesian models, neural nets, SVM etc.) for finding patterns/models from audio signals. Familiarity with large data sets, cloud based development and deployment, open source practices and frameworks and experience in putting an application into production is desirable. You will:Provide technical expertise and execution know-how to the design of machine learning algorithms/solutions to solve ultra-challenging problemsDetermine methodologies needed; apply such methodologies (e.g. neural nets, CART, Bayesian methods, etc.) on speech processing and related research domains.Define data needs, evaluate data quality, perform and critique appropriate statistical analyses using software such as R, Python, SAS, MATLAB, and/or Splus. Explore, determine & develop technical approaches to be used and apply them on major challengesInterface closely with Oben Business counterparts to understand/define requirements, domain knowledge/models, and data needs.Effectively communicate technical analyses and results.Work with offshore and in-house technical and business teamsYou must have:Doctorate (Preferred) or Masters degree in Computer Science, Mathematics, Applied Physics, Applied Statistics or in Engineering.Foundation in theories underlying machine learning techniquesAdvanced knowledge in audio digital signal processing and speech processingAbility to apply theoretical or experiential knowledge on machine learning to solve problemsExperience in developing machine learning packages with programming languages such as Java, Python, C++Experience with PhP/MySqlExperience in coding for Operating Systems such as Android, iOS, Mac, Linux and WindowsMust be willing to work out of an office located in Pasadena, CA.Great to have:Experience with designing and prototyping algorithms on different kinds of data.Experience in applying machine learning to different kinds of problemsKnowledgeable with relational databases & SQL concepts and Compute platforms like Matlab.Interest/Experience in large data sets, cloud based architectures and deployment frameworks for machine learning algorithms. Open source efforts in machine learning.Strong analytical skills, with demonstrated reputation including publications / development / deployment experience.Excellent teamwork and customer focus.Excellent written and verbal communication skills.Ability to take initiative and deliver tangible results under deadline.Ability to work independently with minimal direction.Flexibility of working across all functions/levels as part of a team.Interest in working for a young companyApplication Requirements: Please send the following to careers@oben.com Detailed resume and/or LinkedIn profile  Links to any research / papers you have been an instrumental part of and are proud of  Name of instructor / adviser, if any along with link to their profile  Cover Letter identifying your five favorite apps on your phone  Introduction to ObEN: https://goo.gl/gxpxwT"}