{"jobID": "2775847897", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Partner with marketing, product and engineering team to understand our customers and ultimately create a better shopping experienceDesign dashboards and reports to communicate business trends and opportunitiesWork closely with data engineering to validate data and ensure we have data points needed for analysisEnable self service analytics through BI enhancementsTHE QUALIFICATIONS3+ years of related work experience in analyticsStrong SQL skillsExperience with at least one analytics & visualization tool such as Looker, Tableau, ModeHighly analytical and quantitative, with strong attention to detailAbility to communicate complex ideas effectivelyBachelor's degree in Mathematics, Statistics, Economics, Business or quantitative focused studyProficiency with website analytics tools like Heap, Mixpanel or Google Analytics a plusTHE PERKSComprehensive health benefitsEquity401k planSubsidized lunches and fully stocked kitchenWellness benefits including in-office massage visitsQuarterly product allotment -- a package of the world's best bras every 3 months! ThirdLove® is empowering women to feel comfortable and confident in their everyday lives. We make bras that fit perfectly, feel incredible, and look stellar.  We're a rapidly growing team (over 200 today and doubling in size this year) based in San Francisco with offices in Chico, CA and Argentina. We're funded by Tier 1 investors and are disrupting a $100 billion global market. We're one of the fastest growing consumer brands in the country, and known as 'the brand to catch Victoria's Secret'.  Our culture is collaborative, fast-paced, and data-driven with a strong focus on designing beautiful products and creating a seamless user experience. Instead of using standard industry molds, we developed proprietary half-cup sizes based on real women's measurements and created a Fit Finder® Quiz that removes the hassle in finding the best size. To date, over 9 million women have taken our easy-to-use Fit Finder® Quiz.  Five core values drive all of the work we do: Put customers first. Do things that make our customers happy.Adaptive. Defy standard conventions. Be nimble and embrace change.Curious. Strive to always learn and grow.Engaged. Be Present. Lift others up. Be your best self.Responsible. Gain others' trust by being respectful, reliable, and accountable. If you want to impact millions of people each and every day, and you share these values, we'd love to connect.  ThirdLove is an equal opportunity employer and values diversity at the company. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, genetics, marital status, veteran status, or disability status.SDL2017"}