{"jobID": "2387638801", "jobLocation": "Oak_Brook_IL", "jobTitle": "Sr Quantitative Analyst, Energy Economics", "companyRating": "3.6", "companyInfo": {"Website": "www.exeloncorp.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (EXC) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ameren, PPL, Southern Company"}, "estimatedSalary": "107000", "jobDescription": "DescriptionPRIMARY PURPOSE OF POSITIONThe Senior Quantitative Analyst for the Utility of the Future will focus on developing the economic model and associated analyses to study long-term revenue impacts from changes to energy/environmental policy, adoption of renewable and energy efficiency technologies, and the dynamics of a multi-sided energy platform. As a member of the Advanced Analytics team, the successful candidate will collaborate directly with economists, financial engineers, risk analysts, and policy experts. He or she will apply quantitative techniques to measure and analyze the inter-relationships of key drivers and form opinions on the strengths and limitations of the model. A solid understanding of economic modeling and policy analysis techniques along with a foundation in programing, statistical methods, and data analysis is essential. PRIMARY DUTIES AND ACCOUNTABILITIESItemAccountability%1Leverage in-depth technical knowledge of economics, statistics, modelling techniques and simulation approaches to develop the core economic model252Conduct research and produce proof-of-concept demonstration systems to test new economic modeling approaches and solutions to complex problems253Translate qualitative business concepts into mathematical relationships.254Provide leadership, training, and mentorship to less experienced analysts on the team and in the organization156Partner with stakeholder analytics teams across ComEd and the enterprise to expand the use and gather feedback on the models and systems10QualificationsPOSITION SPECIFICATIONS Minimum:Preferred:Bachelor’s degree in Economics, Engineering or other quantitative field Masters or PhD in quantitative field5 to 8 years of relevant experienceEnergy industry experienceThorough understanding of applied quantitative economic concepts and techniques (including advanced statistical techniques)Prior experience in an quantitative economic roleAbility to use a broad range of development languages (e.g. C/C++, Python, Perl, Matlab, etc.), and databases query languagesIn-depth experience in one or more programing languageAbility to quickly master industry fundamental concepts including energy commodity markets, utility business models, and system dynamicsBackground in applied system dynamics theoryShould be self-driven and able to work in (and lead) team sizes ranging from individual contribution to several members.POSITION SCOPE · Reports to the Director of Advanced Analytics· Works under minimal supervision, relying on knowledge, skills and judgment acquired through education and relevant experience to plan and accomplish assigned tasks and goals"}