{"jobID": "2837746163", "jobLocation": "Rahway_NJ", "jobTitle": "Outcomes Research Scientist, Associate Director, Outcomes Research", "companyRating": "3.7", "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Under the guidance of an Executive Director, CORE (Center for Observational & Real - world Evidence), the Associate Director will have the primary responsibility for planning and managing real world evidence activities for in - line and developmental Merck drugs on a worldwide basis. This includes all phases of outcomes research and real world evidence needs including design and implementation of retrospective database studies, assessment of patient reported outcomes (PROs), epidemiological studies and economic modeling. The incumbent will work closely with Customer Business Line teams, Regional Product Directors, MSD affiliates, Public Affairs, Medical Education and Merck Research Laboratories (MRL) colleagues to ensure programs are consistent with marketing strategies in key countries. He / she will cHi ontribute to product development and marketing strategies to ensure that product value is defined and developed.  This position will focus on Hospital & Specialty Care / Primary Care. Specific roles include but are not limited to:  Participate in Value and Evidence Sub - teams (VEST) and provide leadership in developing the OR strategies and plans for developmental compounds and obtains cross - divisional senior management approval  Work closely with the VEST team members to develop OR plans for Merck in-line and developmental products based on the regulatory, marketing and reimbursement / HTA environments on a worldwide basis; including US specific market needs. Work with MRL colleagues, MSD affiliates and consultants to write, coordinate, and validate as required, study design, protocols, measurement questionnaires, case report forms, data analysis plans, and final reports/publications  Critically assesses drivers and barriers to reimbursement and market access, identify value evidence needs to provide input into clinical and market development programs  Implement programs to document disease burden and unmet need, PRO components, and health economic aspects of disease and the value of drug therapy as outlined in the OR planning process / map and generates data on a worldwide basis to support pricing and reimbursement  Develop value evidence deliverables (e.g., health economic evaluations) and their adaptation to generate country - specific data supporting pricing and reimbursement  Work with the Merck Investigator Study Program Committee to evaluate outcomes research study protocols for studies in local markets  Support MSD affiliates to understand local needs, adapt health economic evaluations, customize Outcomes Research documents such as protocols and reimbursement dossiers, which includes the development of the worldwide template document including global value dossier and input forms, design of data collection forms for customization to countries, and in collaboration with MSD affiliates, adaptation of the document according to local requirements  Work closely with other departments (i.e. GHH and Public Affairs) to effectively develop / communicate OR data and consistent messages throughout Merck and to external customers  Responsible for maintaining awareness of scientific developments within his / her areas of expertise, both in terms of new methodology and new activities to establish communications with key outcomes research opinion leaders  Build relationships with health economic and outcomes research experts worldwide  Present outcomes research data at international / national congresses and publishes articles in scientific journals  Qualifications  Education:  Doctoral Degree from a recognized school of medicine, public health, management, pharmacy, or economics - OR - Master’s Degree required from a recognized school of medicine, public health, management, pharmacy, or economics  Required:  Minimum of 5 years of experience in the areas of health economics, outcomes research, market access, HTA or related field  Preferred:  Demonstrated expertise in the field of outcomes research, epidemiology and / or health economics  Excellent leadership and strategic thinking skills  A track record of scientific presentations and publications"}