{"jobID": "2543166875", "jobLocation": "Palo_Alto_CA", "jobTitle": "Deep Learning & Computer Vision Scientist", "companyRating": null, "companyInfo": {"Website": "www.oneconcern.com", "Headquarters": "Palo Alto, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "One Concern is a startup which specializes in Artificial Intelligence for Natural Disasters. With our team of global disaster scientists and engineers, we have developed a platform that helps emergency responders prepare for and make the most critical decisions during the first moments of a crisis, with the main goal of saving lives.We are looking for creative data scientists that have built deep learning pipelines from inception to maintenance. You should have experience with collecting and cleaning data, feature engineering, building scalable deep learning algorithms and constantly improving them over time.We work in a highly collaborative, challenging and exciting environment. Our data science challenges are unique, so you should be comfortable stepping in uncharted territory and excited to create systems that can scale to all disasters and geographies. If you are problem solver, think out-of-the-box, love challenging yourself, and want to work for a cause, we would love to have you at One Concern.We are committed to a workplace that reflects the community we serve. We especially encourage women, people of color, and others who are underrepresented in the tech industry to apply.Must-haves: A strong drive to solve challenging problems in uncharted territory, think out of box, meet deadlines, and build whatever is necessary along the wayPh.D in Computer Science, Statistics with specialization in Machine Learning or highly relevant experienceAt least 2+ years of industry or academic research experience building, training, and validating deep learning models (recurrent neural networks, convolutional neural networks)Strong experience using at lease one of TensorFlow, Caffe, Theano or other open source frameworks. Deep understanding of underlying concepts of TensorFlow, as an example, to understand/enhance the inner workings of an artificial intelligence framework of choiceExperience with Computer VisionSolid software engineering skills across multiple languages including Python, C++Good-to-haves:Experience with OpenCV preferredExperience with deployment on cloud infrastructure preferredWhat you will do:Build and improve existing deep learning modelsWork with domain experts and machine learning scientists in different hazard productsDemonstrates up-to-date machine learning skills and applies this to the development, execution, and improvement of action plansIdentify key problems in prediction models and propose innovative solutionsFormulate your own problems as the problem might not always be defined for youWork with cross-functional partners across the business Perks and Benefits Market-competitive salary plus equityComprehensive medical, dental, and vision insuranceDaily lunches, and a fully-stocked kitchenBeautiful location at the heart of Palo AltoGenerous PTO policyTeam off-sitesFlexible working hours"}