{"jobID": "2836731243", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Warehouse Programmer Analyst - Decision Support Services (DATA SYS ANL 4", "companyRating": "3.9", "companyInfo": {"Website": "www.ucsfhealth.org", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1907", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Stanford Health Care, Dignity Health, Sutter Health"}, "estimatedSalary": "108000", "jobDescription": "At UCSF Health, our mission of innovative patient care, advanced technology and pioneering research is redefining what’s possible for the patients we serve – a promise we share with the professionals who make up our team.  Ranked by U.S. News & World Report as the number one hospital in California – and among the top five in the country – UCSF Health is committed to providing the most rewarding work experience while delivering the best care available anywhere. In an environment that allows for continuous learning and opportunities for professional growth, UCSF Health offers the ideal atmosphere in which to best use your skills and talents.Department DescriptionShared Services supports UCSF Health Finance and other organizations within UCSF Health. Data Warehouse and Application (DWA) is a group within this department that provides information for integrated reporting/analysis and supports the AllScripts EPSi system.  Omniview is an integrated data warehouse supplied by sources external and internal to UCSF Health. Its data and associated business rules are integrated into a hybrid Inmon/Kimball architecture housed in MS SQL Server using SQL Server Integrated Services (SSIS) as the ETL tool and SQL Agent as scheduler. Current internal sources include APeX (via CLARITY – Hospital Billing, Professional Billing, ADT, Inpatient, etc.), costing/budget from EPSi, IR Solution’s Incident Reporting System, PeopleSoft GL, HBS Time & Attendance, UCSF Payroll, patient care data from Nursing Performance Improvement surveys via Salesforce and McKesson’s PFM.  External sources include Clinical Indicator data from Vizient, payroll (ADP, TriNet, Right Sourcing, WFX, ZeroChaos, etc.) and OSHPD (inpatient, ambulatory and ED data for all California hospitals).  EPSi provides UCSF Health with financial (cost, budget, etc.) and patient information. Among some of DWA’s EPSi responsibilities are security, maintenance and the processes that feed it information from various systems.Job SummaryThis position supports Finance’s data warehouse (Omniview) by working with stakeholders and data consumers/providers to determine the requirements, processes and architecture of the data. Primary activities include the design, implementation, testing, documentation and support of data models within Omniview (and its associated data marts) along with the ETL processes that produce useful business intelligence capabilities for UCSF Health.  The data warehouse staff performs various functions that require multiple skill sets - SQL, data modelling/profiling, DBA skills, SSIS package programming, MS Team Foundation and effective communication with SMEs (Subject Matter Experts). The needs of the organization for integrated analysis/reporting in the clinical/financial domains are acquired through frequent SME interaction and a fundamental understanding of the data and its business rules.  A working knowledge of the source’s backend data structure and the ability to access the data from the frontend presentation layer, as well as its backend, is paramount. This knowledge allows the staff to modify the architecture of Omniview so that the data can be integrated and an automated ETL process can be created.  This involves data profiling, determining any commonalities with Omniview, incorporating the data into Omniview, updating its data model and metadata, ensuring referential integrity via foreign key constraints throughout the data model and building an automated ETL process. Coordination with the support groups of the source systems is crucial to ensure that access can be achieved and guaranteed on an ongoing basis.  These groups are both internal (IT, ISU, Patient Safety, etc.) and external (University Health Systems Consortium, Legacy Data Systems, ZeroChaos, etc.).Required QualificationsFive years of experience in a Data Warehouse/Business Intelligence environmentDemonstrated experience designing, developing and supporting database applicationsThorough working knowledge of testing practices and application debugging and troubleshooting proceduresAbility to identify, assess impact and develop recovery strategies for application or system failuresDemonstrated ability to identify and implement critical maintenance fixes and to isolate and correct malfunction, including interface problemsDemonstrated ability to research, evaluate and implement new technologies and softwareAbility to use creative problem-solving skills and apply effective technical solutionsWorking knowledge of Relational Database design and data modeling skillsWorking knowledge of the Kimball Data Warehouse Dimensional ModelWorking knowledge of the Inmon Data Warehouse ModelAdvanced working knowledge of SQL Server’s T-SQL languageAdvanced working knowledge of SQL Server’s Integration ServicesWorking knowledge of SQL Server SecurityAbility to work in an Agile environmentDemonstrated ability to work with technical and non-technical staff to identify user requirements and translate them into technology-based solutionsExcellent verbal and written communication skills, including the ability to prepare and deliver formal and informal documentation, presentations, and training to a variety of end usersExcellent organizational and time management skills with the ability to set own priorities to coordinate multiple assignments with fluctuating and time-sensitive deadlinesAbility to foster and maintain positive and professional working relationshipsAbility to effectively handle interpersonal interactions at all levels and respond appropriately to conflicts and problemsThe flexibility to orient and work at all UCSF Medical Center locationsPreferred QualificationsEPIC certified in one or more CLARITY Data ModulesDegree in computer science or related fieldFamiliarity with: Health Insurance Portability and Accountability Act (HIPPA)General ledger systemsAllscripts EPSiQlikViewWorking knowledge of: Windows authentication and other security protocolsMS Windows ServerOracle DBMSEPIC HyperspaceEPIC data modelMS Team FoundationPrevious experience in healthcareFamiliarity with BI tools such tableau or SSRSLicensure/CertificationN/ALiving Pride StandardsService Excellence Demonstrates service excellence by following the Everyday PRIDE Guide with the UCSF Medical Center standards and expectations for communication and behavior. These standards and expectations convey specific behavior associated with the Medical Center’s values: Professionalism, Respect, Integrity, Diversity and Excellence, and provide guidance on how we communicate with patients, visitors, faculty, staff, and students, virtually everyone, every day and with every encounter. These standards include, but are not limited to: personal appearance, acknowledging and greeting all patients and families, introductions using AIDET, managing up, service recovery, managing delays and expectations, phone standards, electronic communication, team work, cultural sensitivity and competency.Uses effective communication skills with patients and staff; demonstrates proper telephone techniques and etiquette; acts as an escort to any patient or family member needing directions; shows sensitivity to differences of culture; demonstrates a positive and supportive manner in which patients / families/ colleagues perceive interactions as positive and supportive. Exhibits team work skills to positively acknowledge and recognize other colleagues, and uses personal experiences to model and teach Living PRIDE standards.Exhibits tact and professionalism in difficult situations according to PRIDE Values and PracticesDemonstrates an understanding of and adheres to privacy, confidentiality, and security policies and procedures related to Protected Health Information (PHI) or other sensitive and personal information.Demonstrates an understanding of and adheres to safety and infection control policies and procedures.Assumes accountability for improving quality metrics associated with department/unit and meeting organizational/departmental targets. Work Environment Keeps working areas neat, orderly and clutter-free, including the hallways. Adheres to cleaning processes and puts things back where they belong. Removes and reports broken equipment and furniture.Picks up and disposes of any litter found throughout entire facility.Posts flyers and posters in designated areas only; does not post on walls, doors or windows.Knows where the Environment of Care Manual is kept in department; corrects or reports unsafe conditions to the appropriate departments.Protects the physical environment and equipment from damage and theft. The flexibility to orient and work at all UCSF Medical Center locations is required.Equal Employment OpportunityThe University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. Further information about the University of California, San Francisco, is available at diversity.ucsf.edu. UCSF seeks candidates whose skills, and personal and professional experience, have prepared them to contribute to our commitment to diversity and excellence, and the communities we serve."}