{"jobID": "2696202218", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Data Scientist (AI Infrastructure)", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "192000", "jobDescription": "WearenowlookingforaSeniorDataScientist(AIInfrastructure): NVIDIA is hiring data scientist to scale up its AI infrastructure. You will need to have strong programming skills and a deep understanding of data science tools, methodologies, and how to apply them to real world problems. In addition, you will need excellent communication and planning skills. You and other specialists in this team will help advance NVIDIA's capacity to build and deploy leading solutions for a broad range of AI-based applications such as cyber security, web analytics, and healthcare. Whatyou'llbedoing:Working with new and existing technologies and integrating them to find actionable insights into enterprise data.Building predictive models, recommendation engines, anomaly detection systems, statistical models, and/or other machine learning systems for constant analysis of data.Collaborate with multiple distributed systems teams scale machine learning models into production.Provide input and feedback to systems engineers regarding ETL, data pipelines, and container needs.Benchmarking new methods against industry standard baselines.Whatweneedtosee:You have a BS, MS, or PhD in Computer Science, Computer Engineering, Mathematics, Physics, Economics, or related field with 6+ years of work or research experience in data science.A proven track record with 4+ years of experience and expert level ability in model development and deployment within one of these verticals: Telecommunications, Cyber Security, Retail, AdTech, Financial Services, or Health Care.Strong knowledge of traditional big data technologies for ML, Scikit-Learn, H2O, SAS, R, or other ML frameworks and when to use them.Demonstrated ability to implement new methodologies and algorithms from leading research papers, and understand their functionality, scalability, and overall viability.Strong programming ability in multiple languages (Scala, Java, R, Julia), with high proficiency in Python and/or C++.Experience writing white papers, journals articles, or technical blogs on methods and outcomes.Highly motivated with strong communication skills, you have the ability to work successfully with multi-functional teams and coordinate effectively across organizational boundaries and geographies. With highly competitive salaries and a comprehensive benefits package, NVIDIA is widely considered to be one of the technology industry's most desirable employers. We have some of the most brilliant and talented people in the world working with us and our engineering teams are growing fast in some of the hottest state of the art fields: Deep Learning, Artificial Intelligence, and Autonomous Vehicles. If you're a creative and autonomous data scientist with a real passion for machine learning, distributed systems & parallel computing, we want to hear from you.  ​​​NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.#deeplearning"}