{"jobID": "2661150864", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Data Engineer-Infosec", "companyRating": "3.6", "companyInfo": {"Website": "www.paypal.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (PYPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Square, Amazon, Apple"}, "estimatedSalary": "169000", "jobDescription": " Job Description Summary:Our mission is to protect high value data across the diverse and complex data environments at PayPal. You should be someone who is excited by the explosion of advancements occurring in both the security and data space and the potential of products, software and processes to create possibilities in that space. As a key member of the team, creative thinking, a solid work ethic, and a passion for developing and delivering great solutions are a must.Job Description:  This position enables the discovery, protection, and measurement of security of high value data, develops and delivers capabilities as needed, maintains and operates current commercial and customized tools in the data security space. Support the data security program strategy in Discovery, Auditing, and other key Data Security priorities.Development/Implementation of new capabilities including identifying requirements and objectives for new capabilities, POC to implementation delivery required.Work with delivery teams to articulate needs and requirements to close operational gaps and requirementsEnsure high priority issues are addressed commensurate with issuesOperability of tools and capabilities – availability, performance, security Primary Job Responsibilities Design and delivery execution of stand-alone and distributed applications across the entire stack that enable data security.Design and integration of tools that enable identification of data that is insecurely stored and enable developers to identify data security pitfalls.Partner with other stakeholders to help improve data security tools and processes.Design and develop dashboards that enable bird’s eye view of data security posture.Aggregate information from various data security streams and provide state-of-the-art metrics that are transparent, reliable and reflect ground-reality of the various data security controls.Effectively analyze standards of data security programs and participate in data security policy reviews and apply changes to and maintain data security tools. Ability to Communicate: Outcomes and goals to leadership as well as project/program statusGoal and outcomes of product to Product Delivery TeamsWritten and relevant User Stories that drive PD teams to develop and deliver key features of the system needed to fulfill the outcomes of Data Security ScanningAssurance that Enterprise Data Scanner delivers and meets the need of data security scanning across PayPal data enterprise to Discover, track and triage data security violationsExecute on vision of Enterprise Data ScannerProvide data security architecture guidance on various use cases to product engineering teamsPerform security design reviews and provide subject matter expertise to assess security implications for introduction of new or different technologies within the environment and proper data protection strategies.Identify security gaps, evaluate and propose appropriate remediation strategyActively engage with Compliance, Privacy and Data Governance on data security aspects Primary Job Skills Good understanding of REST-oriented APIs, understanding of distributed systems, data streaming, NoSQL solutions for creating and managing data integration pipelines for Batch and Real Time Data needs.Ability to understand requirements, articulate current state and deliver on priority requirements. Experience and good understanding of Data Lifecycle and also the tools and capabilities necessary for Data Protection is a plus.Strong real-world experience with one or more of the following technologies at scale is required:Stream Processing ecosystem (e.g. Kafka, Storm, Samza)Hadoop-ecosystem technologies (e.g. Presto, Spark, Flink, Druid, Beam)NoSQL (e.g. Cassandra, Aerospike, CockroachDB)Experience in designing and developing Java, Node.js or python/Django applications on top of RESTful APIs.Proficient in one or more of Java, Scala, Python is required Solid data mining and machine learning expertise is a plus, DB/data warehouse expertise desired. Information Retrieval (search/recommendation/classification), incident investigation and management.Possess sound judgment, flexibility and nimbleness in changing courses and solving problems swiftly.Having a passion for quality in designing and executing clean, solid, readable systems that scales and performs well.Ability to multitask effortlessly and manage competing priorities under demanding deadlinesBackground required:5+ years experience with Data Platforms as DBA and/or Data Architect in large and complex environmentsProven experience in ability to design Software solutions, drive development teams and implementation with success metrics5+ years in Security roles, designing, developing and implementing solutions across large and complex environmentsProven experience and knowledge in application development and deploymentProven experience and knowledge in complex and diverse technology infrastructure Subsidiary:PayPalTravel Percent:0Primary Location:San Jose, California, United States of AmericaAdditional Locations: We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities."}