{"jobID": "2837708331", "jobLocation": "Rahway_NJ", "jobTitle": "Scientist, Statistical Programming", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world - class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  This position supports statistical programming activities for late stage drug / vaccine clinical development projects. Accountability predominantly includes the development and execution of statistical analysis and reporting datasets, tables, listings, figures and submission deliverables under the guidance of a senior level programmer. The statistical programmer will perform validation tasks according to departmental SOPs and collaborate effectively with outsource partner on medical monitoring reports development, validation, and deployment. The position is a key collaborator with statistics and other project stakeholders to gather and document user requirements for statistical programming deliverables.  Primary Activities:  Programmatically develop, validate and maintain efficacy and safety datasets, tables, listings, and figures at a protocol level  Assure deliverable quality and compliance with departmental SOPs and good programming practices  Collaborate effectively with project team members including outsource provider staff  Qualifications  Education Minimum Requirement:  B.A / B.S in Computer Science, Statistics, Applied Mathematics, Life Sciences, Engineering or related field plus 2 - 4 years SAS programming experience in a clinical trial environment  M.S in Computer Science, Statistics, Applied Mathematics, Life Sciences, Engineering or related field  Required Experience and Skills:  Department Required Skills and Experience:  Good interpersonal skills and ability to negotiate and collaborate effectively  Good written, oral, and presentation skills  Knowledge and experience in developing analysis and reporting deliverables for R&D; projects (data, analyses, tables, graphics, listings)  Takes direction effectively and completes tasks at a project level; ability to collaborate with key stakeholders  Position Specific Required Skills and Experience:  SAS programming experience including data steps, procedures, SAS / MACRO, SAS / GRAPH  Ability to quickly and effectively learn new program techniques and data structures  Takes direction effectively and completes programming tasks under the guidance of a senior programmer at a project level  Knowledge in CDISC SDTM and ADaM standards  An interest to advance career by investing in development activities and taking on tasks with increasing levels of challenge and responsibility  Preferred Experience and Skills:  Knowledge of pharmaceutical development processes and clinical endpoint data (efficacy and safety)  Unix operating system experience; systems and database experience  Good working knowledge of reporting processes (SOPs) and software development life - cycle (SDLC)  Ability and interest to work across cultures and geographies"}