{"jobID": "2656984517", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software Engineer (Node.js)", "companyRating": null, "companyInfo": {"Website": "www.theleague.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Bumble, Coffee Meets Bagel, Match"}, "estimatedSalary": null, "jobDescription": "The League is a pre-series A mobile social dating app startup backed by IDG Ventures, xSeed Capital, Cowboy Ventures, Structure Capital, Sherpa Ventures, and many notable angels. The Founder, Amanda Bradford, is a Stanford MBA (ex-Google, ex-Salesforce) with a strong product sense (engineering degree from Carnegie Mellon) and a fierce determination to change the dating space for the better. The League is live in 30 cities, brings in healthy, growing revenue each month, and has a 500,000+ wait list of people in other metros waiting for their city launch! As a Software Engineer at the League you will find yourself part of a fast paced engineering culture. You will continuously leverage your existing skills and grow new ones. You will quickly develop a passion for backend or frontend work and specialize your time to develop strengths in both. Your interpersonal and teamwork skills will be enhanced while your ability to communicate effectively will be honed. All of engineering at The League follows two primary principles: Impact and Delivery!Principle One: Impact! Do the work! Be an integral part of the solution. Empower yourself through active communication to ensure that your are performing efficiently. Learn to step up and solve problems and avoid spinning wheels and yak shaves. Learn to allocate your time between the fundamental development tasks. Work closely with other engineers to ensure projects combine smoothly and that everyone grows. Become your own engineering strike team!Principle Two: Deliver! On time delivery means ensuring communication flows in the right direction, especially in the thick of a release. It means the ability to empower the business in making the right choices to grow and to make the necessary sacrifices to ensure every release is a success. Unquestionable quality means thorough and deterministic execution on every commit and every release. When issues arise, take responsibility and don’t hesitate to ask for help to ensure that the issues are handled immediately with implacable attention and follow through.MINIMUM QUALIFICATIONSBachelor’s degree or above in Computer Science, Computer Engineering, or related field.2+ years experience in building software solutions with broad consumer reachProficiency in Node.jsAbility to learn complicated systems and make positive impactful changeWillingness to participate in continuous education and community meetupsUnderstanding of distributed systemsWillingness to think at a high level and make detailed plansStrong communication and interpersonal skillsRESPONSIBILITIESLead the backend team by taking ownership of our backend systems (Node.js)Take the lead in implementing key systems needed for scale & growthCommunicate effectively with your team and your managersParticipate in and grow the engineering cultureDrive your work towards company OKRs and ensure time is spent effectivelyLearn and develop your skillsEmpower cross-functional teams by escalating concerns to your leads and managersParticipate in company strategy with effective listening and thinking beyond immediate needsGrow to understand the long term implications of decisionsPREFERRED QUALIFICATIONSThe ability to define your weaknesses and develop a plan to improve themThe ability to state your strengths without blusterTenacity to listen, learn, then teachA keen sense of what is technically and visually right and wrongBackend System Experience: Managing development and production infrastructure (AWS versus GCP vs ?), understanding of developer flows through git, continuous Integration, monitoring and logging, horizontal and vertical scaling, cost reduction and optimizationProficiency in additional languages other than Node.js: Swift, Objective-C, Java, C, GO, etc. It's a great time to join The League - we have found product market fit, a successful business model, and have built out the necessary tools to scale. We’re looking for hungry, smart individuals to take on huge areas of responsibility in the company and the potential to grow with us as we aim this rocketship for the moon! We offer lots of perks to our founding family - everything from first date drinks on us(!) to unlimited vacation, flexible work hours, competitive pay, and generous equity! Come help us change dating for the better and build a quality brand that stands for equality in all things, especially relationships."}