{"jobID": "2823636444", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Science Manager, Uber Eats (SF)", "companyRating": null, "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Uber We’re changing the way people think about transportation and logistics. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the RoleAre you interested in working at the intersection of applied quantitative research, engineering development, and data science? Do you have interest in leading and growing a top-notch science team at Uber to develop and apply quantitative solutions related to Uber's uniquely challenging problems? If so, this is the job for you.What You’ll Do We are specifically looking for a data science lead/manager in SF office to spearhead the challenging modeling and algorithmic development work in the pricing space for Uber Eats. You are in charge of managing and developing a group of data scientists to tackle impactful problems such as delivery fee optimization, real-time busy area fee, menu price recommendation, targeted user promotion, loyalty mechanism design, etc. Your efforts will critically impact the growth, efficiency, and reliability of Uber Eats’ marketplace.  We are looking for someone with advanced quantitative degrees (PhD preferred) who is comfortable enough with research methodologies that they can address abstract business and product problems with utmost precision, and who also has the passion and experience in leading and empowering a group of geniuses to accomplish extremely ambitious goals. What You’ll NeedMinimum 4 years industry experience in data analytics and quantitative modeling, with significant work experience as a technical contributor.Prior management / team-lead experience. You'll be leading several direct reports initially and will have the opportunity to create, scale and nourish a team of experienced professionals.Excellent educational background in a quantitative field, such as Operations Research, Economics/Econometrics, or Machine Learning; graduate degree required and PhD degree preferred.Self-starter and collaborative leader. Everywhere you go, you can't help but mobilize people, build things, resolve problems, get into the details, go above and beyond, and draw out the best in people. You are a doer and motivator of others.Excellent execution and organization. This team will be working with engineers and product leads at the forefront of the development cycle. To excel in this role, you should be comfortable executing with little oversight and be able to adapt to problems quickly.Strategic mindset - you're comfortable thinking a few steps ahead of where the team is at now.Experience with common analysis tools - SQL, Python, R, etc. Demonstrable familiarity with code and programming concepts.About the TeamUber Eats Data Scientists help solve the most challenging problems related to Uber's ambitious on-demand food delivery business. These fascinating and difficult problems include personalized search and recommendation for restaurants and dishes, travel and food preparation time prediction, text mining and natural language processing, demand and supply forecasting, growth and spend optimization, dynamic pricing, dispatch and routing optimization, and many more. To solve these problems, data scientists leverage unique data sources diverse in both geographical and temporal dimensions and in both structured (data from app sessions, trips, etc.) and unstructured (menu descriptions, food photos, support contacts, etc.) forms."}