{"jobID": "2764485767", "jobLocation": "Detroit_MI", "jobTitle": "Maintenance Renewal Representative", "companyRating": null, "companyInfo": {"Website": "www.dynatrace.com", "Headquarters": "Waltham, MA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "A Maintenance Renewal Representative generates revenue through maintenance and subscription renewals. This is accomplished by direct contact with both our internal and external customers. Responsibilities Manage and track the entire maintenance renewal process, coordinating and communicating customer renewal intentions with Sales, Finance and other members of the Customer Success organizationEngage customers in a value discussion surrounding their maintenance renewal, as well as introducing them to the added value provided by the new pricing models.Provide information to internal and external customers regarding maintenance quotes and reinstatements.Work in a team environment to ensure the completion of assigned tasks within specified deadlines for an assigned region and in support of NORAM Geography.Provide information for internal management reportingMeet all contractual and reporting deadlinesPerform additional duties as required.QualificationsProven ability to assess, manage and operate effectively given multiple priorities in a mission-critical environment.Self-starter, highly motivated, and committed to getting results.Excellent mathematical skills with emphasis in accounting or financial math.Strong organizational skills, including detailed record-keeping, excellent and independent follow-through, and a high degree of accuracy.Excellent verbal and written communication skills.Proven track record of flexibility in a team setting.Excellent word processing and spreadsheet experience in MS Word and Excel.Knowledge of Salesforce.comDesired SkillsKnowledge of Dynatrace software products.Knowledge of licensing and product pricing.Dynatrace has redefined how you monitor todays digital ecosystems. AI-powered, full stack and completely automated, its the only solution that provides answers, not just data, based on deep insight into every user, every transaction, across every application. The worlds leading brands, including, 72 of the Fortune 100, trust Dynatrace to optimize customer experiences, innovate faster and modernize IT operations with absolute confidence.We offer competitive compensation, company-sponsored premium benefits, medical, dental, vacation/holidays, company matching 401(k) Plan, etc. Dynatrace is an equal opportunity employer and VEVRAA Federal Contractor. We consider all qualified applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law. If your disability makes it difficult for you to use this site, please contact recruiting@dynatrace.com. Dynatrace participates in E-Verify, participant information in English and Spanish. Right to work information in English and Spanish. EEO is the Law/EEO is the Law Supplement.Note to Recruiters and Placement Agencies: Dynatrace LLC (Dynatrace) does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Dynatrace employee. Dynatrace will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Dynatrace."}