{"jobID": "2802101523", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist with Coyote Logistics", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Chicago Interviews but with Coyote Logistics  ChicagoInterviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Coyote Logistics was founded in 2006, built with passion and dedication to create a phenomenal company culture. We are a company that has heart and soul, and a drive for success. As a third-party logistics (3PL) provider, Coyote is dedicated to helping its customers move their products and manage their supply chains efficiently, and we take care of our carriers to keep them moving so they can grow their businesses too. We are fanatical in our goal to provide unparalleled service excellence to each and every customer and carrier we work with. In addition to its recognition as one of the Leading 3PLs in the industry, Coyote continues to change the industry expectation by executing with unprecedented service and unmatched innovation.  Data Scientist  The Data Science team is looking for an individual that has a passion for deriving value from data and an insatiable curiosity for learning and trying new things. The Data Scientist will be responsible for conducting statistical analysis, developing methodologies and contributing to a variety of research activities. Primary responsibilities will also include suggesting new research approaches and exploring relevant evolving technologies. Other Responsibilities include creating solutions that allow for fast and streamlined integration between Data Science products and the rest of the Coyote ecosystem.  Daily Tasks Responsibilities Create solutions to efficiently manage and consume various models and predictive toolsCreate, test and tune predictive and prescriptive models leveraging any combination of relevant disciplinesCome in every day with an eagerness to learn, teach and collaborate Essential Skills, Characteristics, Experience 2+ years of experience in machine learning and predictive modeling at a professional levelExpert in Python and/or RStrong quantitative analysis, statistics, programming, and modeling skillsExperience manipulating, processing, and analyzing large data setsProficiency in MS SQL or similarA healthy appetite of curiosity coupled with creative problem solving Valued Skills Experience MS Azure or AWSAzure Machine LearningMS SQL Server 2016Spark, SciKit Learn, TensorFlowNonlinear optimization, graph theory Why Coyote? Onsite training ongoing career developmentCompetitive base salaryComprehensive benefits packageGreat perks like onsite haircuts, massages, and intramural sportsSignificant advancement opportunities for outstanding performersCasual dress and company lunch Coyote is an at-will employer.  Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities.  Please view Equal Employment Opportunity Posters provided by OFCCP here.  The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-1.35(c)Company DescriptionThe transportation and logistics industry is responsible for coordinating and moving the goods we buy and consume every day. In this industry, Chicago-based Coyote Logistics, founded in 2006, is a UPS company and leading transportation and logistics service provider that is constantly innovating—a great place to embark on your career. Powered by proprietary technology, smart people, and unrivaled commitment, Coyote is successful because of the company’s “No Excuses” mentality to provide shippers and carriers with the best service in the industry.  Coyote’s culture fuels this mission every day. Our people make our business what it is, which is why Coyote primes its employees for career success with training programs, accessible leadership, and talent development. Make a difference every day. Transform a centuries-old industry. Be a part of something that never quits. Apply to join the Coyote pack  Apply"}