{"jobID": "2632334668", "jobLocation": "Chicago_IL", "jobTitle": "Arity - Senior Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.allstate.jobs", "Headquarters": "Northbrook, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (ALL) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Progressive Insurance, State Farm, Farmers Insurance Group"}, "estimatedSalary": "112000", "jobDescription": "Where good people build rewarding careers. Think that working in the insurance field can’t be exciting, rewarding and challenging? Think again. You’ll help us reinvent protection and retirement to improve customers’ lives. We’ll help you make an impact with our training and mentoring offerings. Here, you’ll have the opportunity to expand and apply your skills in ways you never thought possible. And you’ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.Job DescriptionArity Arity is a new technology company that uses advanced predictive analytics to help partners evaluate risk and make sense of everyday experiences. Our proprietary algorithms analyze billions of data points, distilling the flood of information into simple, actionable insights. Chief among these is the Arity Driving Score, which models billions of miles of driving and claims data to assess risk, gauging each driver’s likelihood of an event.  Founded by The Allstate Corporation, an organization synonymous with protection and preparation, Arity is born from a long-standing commitment to deep customer understanding and future-focused innovation. Fueled by the curiosity of a startup, our expertise begins with connected car, providing applied insights that meet insurer and transportation/mobility company needs and enhance driver safety, connectivity and value.  Don’t miss this opportunity to join a team where your innovative thinking and technology skills can improve the safety of those on the road and further enhance the car-ownership experience. The TeamData Science incorporates techniques across many disciplines – including mathematics/statistics, computer programming, data engineering and ETL, software development, and high performance computing – with traditional business expertise with the goal of extracting meaning from data to optimize future business decisions. Individuals in this field should be an expert/fluent in several of these disciplines and sufficiently proficient in others to effectively design, build, and deliver end to end predictive analytics products to optimize future decisions. Individual demonstrates sufficient analytic agility to quickly develop new skills across these disciplines as those disciplines evolve. Arity Data Science and Analytics is responsible for aligning with and contributing to corporate objectives by identifying and developing growth and profitability opportunities that will enable Arity to generate profitable market share growth. The Data Scientist family is accountable for using data to make decisions, which includes building predictive models and developing new machine learning techniques that enable Arity to make better decisions to achieve its goals. The Data Scientist Family requires Analytic Agility, the ability to quickly learn new modeling/machine learning techniques, programming languages, and see how these ideas can integrate to optimize the business. The Role This role is responsible for leading the use of data to make decisions. This includes the development and management of new machine learning predictive modeling algorithms; the coding\\development of tools that use machine learning/predictive modeling to make business decisions; searching for and integrating new data (both internal and external) that improves our modeling and machine learning results (and ultimately our decisions); and discovery of solutions to business problems that can be solved through the use of machine learning/predictive modeling. As an ideal candidate, you appreciate the difference between fitting and implementing statistical models, the importance of good metrics, and the significance of large-volume high-quality data. You can perceive common structure between superficially unrelated problems, and can use this to build tools, algorithms, and products of high value. This role will also begin to manage projects of medium complexity. Key ResponsibilitiesUses best practices to develop statistical, machine learning techniques to build models that address business needsManages data and data requests to improve the accuracy of our data and decisions made from data analysisUses and learns a wide variety of tools and languages to achieve results (e.g., R, SAS, Python, Hadoop)Identifies languages and tools that can bring efficiencies or needed techniques to the teamWorks on data and business problems to drive improved business results through designing, building, and partnering to implement modelsCollaborates the with team in order to improve the effectiveness of business decisions through the use of data and machine learning/predictive modelingUnderstands the business’ problems to identify the optimal modeling approachCommunicates to team members, leadership and stakeholders on findings to ensure models are well understood and incorporated into business processesUtilizes effective project planning techniques to break down moderately complex projects into tasks and ensure deadlines are keptWorks with leaders to ensure the project will meet their needsThe development and execution of a communication strategy, with appropriate coaching, that keeps all relevant stakeholders informed and provides an opportunity to influence the direction of the workReviews and evaluates on appropriateness of techniques, given current modeling practices, to senior leadershipLeads and participates in peer reviews, code reviews and other department activitiesKnowledge/Skills/Abilities/ExperienceRequired:Degree in a quantitative field such as statistics, mathematics, computer science, finance or related disciplineExperience in using statistical modeling and/or machine learning techniques to build models that have driven company decision makingExperience in managing and manipulating large, complex datasetsExperience in working with statistical software such as SAS, SPSS, MatLab, R, CART, etc.Ability to code and develop prototypes in languages such as Python, Perl, Java, CKnowledge of advanced modeling techniqueAbility to analyze and interpret moderate to complex conceptsAbility to provide written and oral interpretation of highly specialized terms and data, and ability to present this data to others with different levels of expertiseDemonstrated analytic agilityGood to have:Master’s or PhD preferred in a quantitative field such as statistics, mathematics, computer science, finance, or economicsUnderstanding of the Insurance market place; economics and regulation preferredExperience working with mobile sensor dataExperience working with Spark, HDFS, MapReduceExperience working through end to end life cycle from data acquisition, model building through to deploying, monitoring and revising models in a production settingGood Work. Good Life. Good Hands®. As a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.  Learn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video. Allstate generally does not sponsor individuals for employment-based visas for thisposition. Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.  For jobs in San Francisco, please see the notice regarding the San Francisco Fair Chance Ordinance.  For jobs in Los Angeles, please seethe notice regarding the Los Angeles Ordinance.  It is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era. ABC"}