{"jobID": "2667239289", "jobLocation": "Chicago_IL", "jobTitle": "End Point Security Data Collection Analyst", "companyRating": null, "companyInfo": {"Website": "www.eclaroit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Eclaro International is currently recruiting for End Point Security Data Collection Analyst for one of our financial services clients.  Job Description: Position is within the Global Information Security Technology Team. As a member of this team you will be responsible for delivering security capabilities to the enterprise. The candidate must be able to interface with a wide number of stakeholders to coordinate the delivery of technical capabilities in accordance with a system development life cycle. Required Skills & Experience: • Strong analytical skills/problem solving/critical thinking • Must be comfortable in delivering messages across a wide spectrum of individuals having varying degrees of technical understanding • Ability to work independently on initiatives with little oversight. • Motivated and willing to learn. • Effective communication skills • Strong fundamental understanding of information security principles • Strong understanding of endpoint security controls, including intrinsic OS controls and third party controls • Understanding of cyber security operations functions • CISSP or similar certification • Tools search list should include Carbon Black, Bit 9, Tanium, McAfee, Symantec, Qualys, Crowdstrike, Cylance • Experience with enterprise endpoint systems management tools, such as McAfee EPO, Tivoli Endpoint Manager, Casper Suite, Tanium, etc. Desired Skills & Experience: • Bachelor's degree in Information Technology or related field • Must be exceptional at Network and Network security as many projects will require deep understanding of network security in order to properly deliver assignments. • Experience in Distributed Denial of Service and Network Based Layer 7 (Web Application Firewall) protection highly desirable. • Detailed, bank specific access administration knowledge in Windows, Midrange and Mainframe Platforms with emphasis on security and access controls. • Strong analytical skills/problem solving/conceptual thinking • Ability to work with Technical and Non Technical business owners • Assist with internal efficiencies projects and development Enterprise Role Overview: Key individual contributor, with accountability for researching, designing, engineering, implementing, and supporting information security & directory technology systems (software & hardware). Utilizes in-depth technical knowledge and business requirements to design & implement secure solutions to meet customer / client needs while protecting the Bank's assets. Develops and implements security standards, procedures, and guidelines for multiple platforms and diverse environment (e.g. client server, distributed, mainframe, etc.). Exercises judgment within broadly defined practices and policies in selecting methods, techniques, and evaluation criterion for obtaining results. Work leadership may be provided by assigning work and resolving problems. Typically 5-7 years of IT experience.Equal Opportunity Employer: Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status."}