{"jobID": "2788348614", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Data Scientist - Predictive Prescriptive Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.verizonwireless.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": "What you’ll be doing... You’ll be helping us bring the best possible experiences to our customers by helping us to identify what they like by using your expertise in data analysis including modeling, data mining, and visualization. You will work as an analytics person in an operations analytics team that is responsible for achieving revenue, margin, cost and service level targets with minimum possible cost and working capital. You will design and develop complex and advanced analytical models such as: Use advanced statistical and machine learning algorithms to predict trouble tickets for FiOS business domain to enable pro-active resolutions to reduce cost while increasing customer retention and satisfaction.Build and implement predictive models to forecast supply/demand volumes and price at a granular level for the reverse supply chain and then utilize those in an optimization problem to maximize revenue and margin with supply to demand allocation model.Build predictive and prescriptive models in sourcing and spend analytics domain such as minimizing price variance between contracts and actuals, optimize price/volume by vendor, reduce call center spend while maintaining retention and performance metrics, and minimize cost by implementing and zero-based budgeting.Develop, implement and maintain predictive analytics model, which determines the list of devices and accessories to be selected as Forward Stocking Location (FSL) not only based on sales volumes and forecast, but also based on predictive modeling by using Market Basket Analysis and what if tools to determine DC volume splits and FSL area fill rates by using R, SQL, and Tableau. Additional responsibilities: Translate a supply chain challenge into an analytical problem, relaying results in common business language with managerial implications. Partner with Supply Chain operational teams (e.g., supply & replenishment planning, distribution & logistics) and other Verizon organizations (e.g., sourcing, wireline, network, device marketing) to identify supply chain inefficiencies and potential root causes.Design and implement creative approaches to predictive and prescriptive modeling problems.Perform model assessments, validation, and enhancement activities.Track and report success metrics for projects and their impact on key supply chain KPIs.Partner with IT to effectively migrate analytical models from prototype to production.Drive adoption and application of analytical model results with business partners, ensuring benefits realized.Present and communicate analytical modeling results to business partners and other internal and external stakeholders in a simplified structure with clear business heuristics which can be implemented in our supply chain.Maintain a working knowledge of modeling, data mining, and visualization best practices.Stay current with day-to-day operational business needs and join daily discussion and meetings.What we’re looking for... You are good with numbers and you love to dig into data to find the story. You are detail-oriented and know how to focus on what really matters. You understand the importance of accuracy in data analytics and reporting. You are a self-starter and a multitasker who can work independently under tight timelines. You want to make an impact by providing the data that will help improve the experience for our customers.  You’ll need to have: Bachelor's degree or four or more years of work experience.Four or more years of relevant work experience.Experience with SQL.Knowledge and experience in statistical software packages (e.g., R, SAS or SPSS). Even better if you have: Master's degree in Supply Chain, Operations Research, Industrial Engineering, Statistics, Economics or a related STEM field.One or more years of experience in developing and implementing analytical models in business.Proficiency in engaging and influencing large teams and functional leaders.Coding skills in a general-purpose programming language (e.g., C/C++, Java or Python).Two or more years of experience in developing and implementing analytical models in business.Familiarity and hands-on experience in simulation software packages (e.g. ExtendSim).Knowledge and hands-on experience with optimization models such as Linear & Integer Programming, Network &Routing; Optimization, and tools such as OPL and CPLEX to solve such problems.Familiarity and experience with creating analytical data sets.Familiarity and experience with data visualization software like QlikView, Tableau or Excel.Experience and competency in supply chain management.When you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}