{"jobID": "2809338346", "jobLocation": "Frisco_TX", "jobTitle": "Business Intelligence Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.saxonglobal.com", "Headquarters": "Irving, TX", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " Business Intelligence Analyst (Qlikview) IV Frisco, Texas - United  States  Job Start Date - 05/21/18, Posted Date - 05/15/18 Primary SkillsN/ATax TermsN/AOverviewOverview: The person will be responsible for the creation, enhancement and  maintenance of US BioServices QlikView Manufacturer Dashboards as well  as supporting ad-hoc manufacturer and operations requests. It will  require the ability to communicate with internal and external  customers to gather and understand business requirements and  understand how source-systems are used and to translate those  requirements into a technical solution. This person in this role must  take ownership for their solutions and own them from requirements  through release. Essential Position Responsibilities: Works on complex, major or highly visible tasks and projects as a  project owner.  Works on projects that may span a range of technologies.  Expertise in multiple technical environments and possesses business  knowledge that spans one or more business areas.  Participates in project planning processes.  Identifies project tasks and leads or assists with project timeline  estimations.  Work closely with business users and manufacturers to understand the  business requirements that drive the analysis and design of reporting  and BI solutions.  Leverages knowledge of business processes and data domain.  Brings deep expertise in Qlikview in translating business analytics  needs into data visualization and semantic data access requirements.  Provide end-user training on reports and dashboards that are  developed and ensure users understand the relationship between  operational practices and report outputs.  Create test plans and system documentation, ensuring all necessary  sign-offs occur before moving to production.  Develops reports and presentations for senior management, as needed.  Evaluates new visualization tools and performs research on best  practices as needed.  Participates in POC projects and provides business analytics  solutions recommendations.  Conceptualize, design and develop data visualization solutions that  synthesize data concepts into clear communications for key business  stakeholders.  Demonstrate an ability to know and understand the audience and the  information the audience needs.  Demonstrate a drive to learn new tools and new ways of  visualizing/displaying data and insights.  Show strong team building and creative thinking skills, and a desire  to make a difference. Qualifications: Must have 3+ years of primary work experience with dashboard  development in QlikView (from data modeling through UI design).  5-10 years overall experience in developing business analytics  solutions, focusing on requirements gathering and effective report and  dashboard development (i.e. Tableau, QlikView, Power BI, Business  Objects, SSRS).  Must have QlikView experience with Section Access, Set Analysis,  Map, Data Loading techniques (Incremental loading,preceding  loading, partial loading, binary loading, resident loading, inline  load, Buffer load), Data modeling : Star Schema and Snow Flake schema.  Significant experience working with business customers to gather  requirements, research questions, and resolve issues.  Experience in managing projects from requirements through testing  and deployment.  Bachelors degree in Programming/Systems or Computer Science or other  related field. Or equivalent work experience.  Pharmacy or healthcare experience a plus.  Experience with Microsoft Power BI a plus. *** ADDITIONAL NOTES ****Must have 2+ years of QlikView experience. Needs to be recent (2+ years in the last 3 or 4 years). Job CodeSG - 13735Pay Rate/SalaryN/AExperienceN/AWork AuthorizationN/ASales ManagerN/A"}