{"jobID": "2786674503", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.crescentsolutions.net", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job description  Our technology team is leading the way for new opportunities in the digital realm focusing on health and fitness. They provide consumer-facing eCommerce experiences and high traffic CRM for our network users, which are supported by enterprise applications for our order processing and fulfillment engine.  Duties/Responsibilities: Analyze our products and business initiatives and translate results from data into actionable insights that help drive business goals and improve company performance.Develop and automate analytical reports for various business units and stakeholders throughout the organization utilizing AWS, Hadoop, and Tableau to enable educated decision making.Regularly present and share findings with stakeholders to drive new business initiatives and evangelize Business Intelligence and Analytics tools and strategies.Monitor and analyze key metrics and execute recurring analyses and reporting.Manage the clickstream tracking of data using tools such as Omniture and Tealium to ensure we are capturing the necessary data to evaluate the business.Regularly analyze websites to ensure site traffic and conversion funnels are performant and provide recommendations to test and optimize new features and products.Work with partners and vendors to acquire, store, and report on third party data ensuring functional, performance, and quality requirements are met.Develop and maintain strong relationships with internal teams and provide analytical support as necessary.Prioritize development related to data initiatives including new data acquisition, database performance optimization, new metric calculations, machine learning models, etc.Communicate with internal stakeholders regarding new releases, production issue status, etc. We'd love to chat if you have; BA / BS degree in related field2-6 years of experience in Business Intelligence or Analytics space. Data Science experience nice to have.Advanced SQL / query language skills with large-scale, complex data sets.Ability to analyze large data sets, manipulate data, and make data driven recommendationsHighly familiar with database, data warehouse and ETL concepts, with the ability to translate between business users and engineersExperience managing various tagging and tracking platforms such as Adobe Marketing Cloud (Omniture), Tealium, Google Analytics, etc.Experience with the following technologies is desired: Hadoop, AWS, Tableau or other OLAP cube/data visualization, Oracle database, Adobe Marketing Cloud (Omniture), Google Analytics, Clicktale, ExactTarget/Salesforce (or similar ESP)Experience coordinating and communicating with internal and external stakeholdersStrong understanding of eCommerce and online sales attribution methodologiesExcellent organizational, technical writing, oral and interpersonal communication skills, and keen attention to detailStrong Ability to prioritize and handle multiple initiatives / tasks in parallel as well as changing priorities"}