{"jobID": "2830517144", "jobLocation": "Pasadena_CA", "jobTitle": "Data Management & Integration Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.eastwestbank.com", "Headquarters": "Pasadena, CA", "Size": "1001 to 5000 employees", "Founded": " 1973", "Type": " Company - Public (EWBC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Chase, Bank of America, Wells Fargo"}, "estimatedSalary": "57000", "jobDescription": " For more than 40 years, East West Bank has served as a pathway to success. With over 130 locations across the U.S. and Greater China, we are the premier financial bridge between the East and West. Our teams of experienced, multi-cultural professionals help guide businesses and community members on both sides of the Pacific looking to explore new markets and create new opportunities. And our sustained growth and expertise in industries like real estate, entertainment and media, private equity and venture capital, high-tech and aviation help build sustainable businesses and expand our employees’ potential for career advancement.  Headquartered in California, East West Bank (Nasdaq: EWBC) is a top performing commercial bank with an exclusive focus on the U.S. and Greater China markets. With assets of $37.7 billion, we’re ranked among the 30 largest banks in the United States and currently top 5 in “America’s 100 Best Banks” by Forbes, a list where we've consistently been in the top 15 since 2010. With a strong foundation, an enterprising spirit and a commitment to absolute integrity, East West Bank gives people the confidence to reach further.  East West Bank is seeking a Data Management & Integration Analyst. The Data Management & Integration Analyst is responsible for designing, building, and maintaining solutions for managing and integrating data between operational systems, data repositories, and reporting and analytical applications. This position provides strong analytical and technical supports, and interacts with project teams, IT teams, and business stakeholders to drive business intelligence and data strategy across a wide range of projects. Work with business and technology teams to accurately gather and interpret requirements, specifications, data models, etc., for developing data integration, and reporting solutions.Act as liaison between IT and Business Units to provide solutions and business requirements for internal application development.Provide business requirements (logics) for report automation.Maintain functional and technical artifacts including design documents, data mappings, data architecture, data models and data dictionaries.Work with the database development and business intelligence teams to design, implement, and support end-to-end data solutions.Assess and document source data and quality, and coordinate with the business and technology teams to identify and resolve issues.Bachelor’s degree required, preferably in Information Systems and Computer ScienceExperience with an object oriented Language, such as C#, Java, or Python.Experience both consuming and contributing to a MS SQL Server hosted data warehouse.Strong proficiency with ExcelAnalytical and problem solving skills including troubleshootingAble to work under pressure while managing competing demands and tight deadlinesWell organized with meticulous attention to detailCan-do attitude, self-motivated and strong work ethicSelf-driven to identify areas of improvementMust be team-oriented with experience working on interdepartmental team projectsProduct knowledge inLoansDepositsBanking operations"}