{"jobID": "2791017475", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.zoosk.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "Are you looking to join a team that strives to bring a positive, real-life impact to the lives of millions of people? At Zoosk, we have the tremendous and rewarding challenge of facilitating meaningful connections between over 40 million users worldwide and growing. Our users span 80 countries worldwide and exchange millions of messages in 25 different languages every single day.Zoosk is seeking Senior Data Analyst to join our team. This person will study Zoosks massive database of rich behavior and preferences to identify interesting trends and signals.Data Analysts at Zoosk are a core part of the strategic decision making processes throughout the company. As a member of the Data team, your primary responsibility will be to work with department leaders to derive insights that improve business performance. This includes exploratory analysis of large data sets, metrics identification, report creation, and development/maintenance of analytics systems. This role will broadly influence the companys products, operational effectiveness, and elevate the role of data as an asset to the business. The ideal candidate will be able to quickly derive insights from large data sets and translate findings into plain English.What you'll do: Conduct original research into what behavior leads to subscriptionsBuild statistical models that help us understand the significance of experimentation resultsWork with the BI team to create and tune machine learning modelsBuild reports, dashboards, and metrics to monitor the performance of our company and changes in user behaviorPresent findings to the senior leadership teamPartner with other departments to solve problems and identify trends/opportunitiesProvide advice and education in the usage and interpretation of data to business usersBuild sustainable, impactful reporting assetsDevelop new insights and analyses that inform decisions and help us continue grow the business while delighting our usersData mining, statistical analysis, and visualization of data to help understand how users are interacting with our productWhat were looking for in you:5+ years experience using data to drive product/business decisions, preferably on engagement-based consumer product teamsBachelor's degree in Math, Statistics, or similar (Master's degree is desirable)Expert SQL skills (you'd rate yourself 10/10), familiarity with R or Python is a plusSolid understanding of statistics including A/B experimentation and regression modelingPrior experience generating data-driven research findingsExcellent verbal and written communication skillsSelf-motivated, detail-oriented, and highly organizedIt's great if you:Enjoy digging into the data but you dont dwell on the details; you sift through them to tease out key insights for business partners in a timely mannerApproach problems creatively and can build structure out of ambiguous research requests; you not only generate hypotheses but follow through and use rigorous methods to evaluate whether the data supports themAre passionate about working multi-functionally in a dynamic environment and are willing to adapt to changing timelinesHave a knack for succinctly explaining complex ideas to technical and non-technical audiencesAre self-sufficient, learn autonomously, and are self-motivatedHave excellent follow-through, responsiveness, and are not easily overwhelmedZoosk Core Values: Dont stop caring. Be a doer. Were better together. Speak up. We say no to the status quo. If theres fun to be had, then have it.While there is a lot to do, we also have a very open and collaborative culture and know how to have a lot of fun; frequent team and company outings, Hackathons, happy hour every Friday, daily catered lunches, health and wellness benefits, 401K matching, generous maternity/paternity leave policies, and flexible time off are just some of the ways we support our teams.Zoosk is proud to be an equal opportunity workplace committed to building a team culture that celebrates diversity and inclusion."}