{"jobID": "2740683385", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "POSITION: Data EngineerLOCATION:, Santa Monica, CACONTACT: Victoria Wang, Recruitment Partner, e. vw@startuptap.com, m. 817.733.9158THE COMPANY: GOODRX (www.goodrx.com)We are a 100+ person team funded by top-tier firms, based in Santa Monica, CA with satellite offices in San Francisco. We are a low-key but tight-knit group of hard-working people working to fix America's broken healthcare system. Americans spend over $400 billion per year on prescriptions and too many people simply can't afford the medications they desperately need. Join GoodRx and help us solve meaningful problems that help us make peoples lives better every day.THE OPPORTUNITY: Data EngineerGoodRx is looking for extremely smart and curious data engineers, who are deft at working with a wide variety of languages, such as Python and SQL, a variety of raw data formats, such as JSON and CSV, in a fast-paced and friendly environment. Previous work with Python-based ETL solutions, such as Luigi or Airflow, is a huge plus.MORE SPECIFICALLY... Manage data warehouse plans for product and marketing teamsWork closely with product managers to understand the data needs of product and marketingAct as an internal expert in each of the data sources so that you can own overall data qualityDesign, build and deploy new data models and ETL pipelines into productionExperience contributing to full life cycle deployments with a focus on testing and qualityDefine and manage overall schedule and availability of all data setsWork closely with other engineers to enhance infrastructure, improve reliability and efficiencyMake smart engineering and product decisions based on data analysis and collaborationAct as in-house data expert and make recommendations regarding standards for code quality and timelinessREQUIRED EXPERIENCE/QUALIFICATIONS:EDUCATION: Bachelors degree in CS, computer engineering or related fieldEXPERIENCE: a minimum of 3 years working as a Data Engineer2+ years professional experience in the data warehouse spaceExpert Proficiency with Python and AWS Services (e.g. Redshift, S3)2+ years experience in custom ETL design, implementation, and maintenanceIn-depth knowledge of how to write and optimize SQL statements.Deep familiarity with distributed processing (Map Reduce, MPP, etc.)2+ years experience with schema design (logical and physical)Ability to quickly learn complex domainsInnately curious and organized with the drive to analyze data to identify deliverables, anomalies, and gaps and propose solutions to address these findingsAbility to manage and communicate data warehouse plansThrives in a fast-paced startup environmentWHY JOIN GOODRX?Every day, GoodRx brings millions of Americans the lowest possible prices for prescription drugs. Our proprietary market-intelligence technology gathers current prices at more than 75,000 pharmacies to bring customers savings of up to 80% on their prescriptions. Since 2011, Americans have saved more than $3 billion using GoodRx. We are the #1 medical app on the iOS and Android app stores, and our products can help all Americans, insured or not.We also offer:· A competitive compensation plan· A beautiful office located overlooking the ocean in Santa Monica· A casual, fun, relaxed, and entertaining work environment· Professional development opportunities· Great Health, Dental, Vision, and Life insurance· 401K· Flexible schedule"}