{"jobID": "2831884429", "jobLocation": "Chicago_IL", "jobTitle": "Technology Consultant / Data Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.slalom.com", "Headquarters": "Seattle, WA", "Size": "5001 to 10000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Accenture, Deloitte, Avanade"}, "estimatedSalary": "138000", "jobDescription": " Employer Name: Slalom, LLC  Position: Technology Consultant / Data Engineer  Job Site: 180 North Stetson Avenue, Ste. 5300, Chicago, Illinois, 60601  Job Duties: Responsible for the identification/development of innovative technology/business analytics solutions. Define client needs and develop a plan and proposal for delivery of the project. Assess business issues and subject matter, analyze associated business data, and implement solutions across different technology groups, including Hadoop, ETL, DW/BI, Data Visualization, and Advanced Analytics, in order to provide a solution and results to clients. Work with clients and internal teams to define industry-leading analytics for a wide variety of business topics and industries while applying best practices with data and analytics. Gather and prepare data to support analytics from a variety of data source types including databases, flat files and external sources. Produce analytics using various technologies, including Tableau, QlikView, Excel, Spotfire, and Microstrategy. Use agile engineering to deliver custom-built digital products and solutions. Work as part of a team to develop Cloud Data and Analytics solutions. Participate in development of cloud data warehouses and business intelligence solutions. Data wrangling of heterogeneous data and explore and discover new insights, utilizing graduate-level research/analytical skills. Utilize new data platforms and programming languages (e.g. Python, Hive, Spark).  Must be available to work on projects at various, unanticipated sites throughout the United States.  Minimum Requirements: Masters degree in Information Systems, Computer Science or related field and 2 years of experience in the job offered or in a computer software-related occupation. Special Requirements: Position requires at least 1 year of experience in each of the following skills:  1) Analyzing business data and developing solutions using ETL tools like Informatica, Composite, IBM Datastage;  2) Implementing solutions using Shell/Bash scripting language to provide platform operational insights to the client;  3) Training team members on standard processes to follow for server backups and maintenance.  Position also requires graduate-level coursework or some experience in each of the following skills:  4) Developing complex and robust solutions using Object Oriented Programming languages like C#, Java;  5) Preparing business requirement document by identifying business issues and accessing analytical data;  6) Developing business analytics solutions using tools like Tableau, Qlikview, Qliksense and Excel in a team environment;  7) Developing Business Intelligence solutions using ETL tools for Data warehousing(DW) such as SSIS, Talend;  8) Extracting data from flat files and external sources into databases such as MySQL and PostgreSQL;  9) Database designing and Data modeling, in SQL Server;  10) Defining client needs and developing a plan for delivery;  11) Object Oriented Design using language C#.  Must be available to work on projects at various, unanticipated sites throughout the United States.  To apply: Please e-mail resume to and indicate job code KB057."}