{"jobID": "2501655128", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.mantech.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 1968", "Type": " Company - Public (MANT) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Req ID 92547BR Business Title Data Scientist Group MCIS Location USA VIRGINIA Reston Clearance Level Needed TS/SCI Category Scientific / Analytical Job Duties and Responsibilities  Currently, ManTech is seeking a motivated, career and customer oriented Data Scientist to join our team in the Northern VA area to provide unparalleled support to our internal organization and to begin an exciting and rewarding career within ManTech. Description: The Data Scientist shall utilize data science and development skills to automate manual analytic processes, generate analytic models, and enable analysts to exploit DHS and IC data holdings. The contractor shall establish advanced analysis and data visualization methodologies, models, and tools to derive intelligence outcomes and impacts. Technical developer skills required include, but are not limited to: Python, R, Java, JavaScript, PHP, Oracle, AngularJS, .NET, and Hadoop-related technologies. As technology and mission requirements change over the course of this contract, the need for some of these technologies may be lessened and the need for new or different skills may be required. The Contractor shall assist in the establishment of data visualization concepts to better represent insights. The Contractor shall assist in establishing capability to examine voluminous data sources. The Contractor shall assist the Government in applying innovative and big data-driven problem solving skills to analytic and operational elements of the IE. The Contractor shall provide services related to data visualization and communication of complex quantitative concepts to non-technical audiences. The Contractor will assist in mission data projects within DHS and with other US Government partners, as appropriate. The Contractor will apply specialized experience in statistics and machine learning algorithms (how to gather, clean, and appropriately use data in models that address DHS mission needs) as well as coding and data visualization skills. The contractor shall provide tailored communications to innovation stakeholders in meetings, demos, and other customer engagements. The contractor shall support analytic innovation, development, and data analytics activities to DHS customers, as well as forward-deployed full-time support to DHS Intelligence Enterprise Components throughout the National Capital Region. The Contractor shall assist in identifying threats to transportation through big data fusion using Department of Defense systems designed for data integration. Requirements:Must possess a Bachelor's Degree and 8 years of experience, years of experience can replace degree requirements.Handles raw data (e.g. structured, unstructured, and mixed datasets), and analyzes data through the application of various statistical techniques or tools.Familiar with programming languages such as, but not limited to: R, SAS, Python, MatLab, SQL, Hive, Pig, and Spark.Experienced in working with and exploiting big data; distributed computing; predictive modeling; mathematics; statistics; machine learning; story-telling; and visualization.Demonstrates ability to extract meaning from and interpret data using a variety of tools and methods from statistics and machine learning.Ability to collect, clean, and mung data in a timely manner as part of a cross-functional team in an intelligence, or related, environment.Possesses strong working knowledge of the Microsoft Office suite, including Access, Excel, PowerPoint, Project, Visio, and Word.Clearance:Must possess an active TS/SCI Qualifications BS in Computer Science, Statistics, Applied Math or equivalent. 7-9 years of relevant work experience. Proficiency in using R, Matlab, Python Scikit-learn or other statistical modeling packages, with a focus on machine learning; experience with NLP a plus. Proficiency in developing production systems for processing large volumes of structured and unstructured data in Java, Python or similar technology stack. Previous experience with Hadoop technology stack (Map reduce, HIVE/PIG, etc). Excellent verbal and written communication skills. Strong team player, capable of working collaboratively in customer teams. Degrees See Qualifications Years of Experience See Qualifications Position Type Full-Time Shift Day Overview ManTech International Corporation is comprised of approximately 7,300 talented employees who use advanced technology to help government and industry meet some of their greatest challenges around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Nearly half our employees have a military background, and approximately 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, health, space, and intelligence communities; we hold nearly 1,100 active contracts with more than 50 different government agencies."}