{"jobID": "2830089330", "jobLocation": "Pasadena_CA", "jobTitle": "Automotive Sales Service Manager", "companyRating": "3.4", "companyInfo": {"Website": "www.aamco.com", "Headquarters": "Horsham, PA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Our Service Managers are high energy professionals who not only lead by example, but are also a team player who supports the employees that work for them. A Service Manager performs many different roles as they manage the day-to-day operations of one of our centers, including: generating sales, communicating with customers, building client relationships, managing the technical team, and ensuring that all employees are adhering to company policies and procedures. Position Responsibilities:Meeting and greeting customersManaging technician workflowRecommending services to customersOrdering parts and inventoryKeeping customers updated on the status of their vehicles' repairsManaging and tracking lead counts as well as customer satisfaction ratingsGenerating and closing salesDeliver a high level of customer service and quality control over all aspect of the center's business, operations, and work productWhat We Offer:Competitive Compensations packageOngoing training and field supportDaytime work hoursPaid time offGrowth opportunityJOB REQUIREMENTSMinimum of 5 years of automotive service sales experience OR equivalent sales experience with a track record of success. Transmission sales is a big plus.Excellent one time closing skillsStrong commitment to customer service and relationship buildingAbility to communicate and use interpersonal skills at a sustained high levelCapable of multi-tasking and executing in a fast paced environmentHonest, goal-oriented and energetic team playerMust have valid driver's license If you are interested in this position, please feel free to apply through this site or contact Megan Cabot at 267-464-7252 ,"}