{"jobID": "2837401938", "jobLocation": "Ann_Arbor_MI", "jobTitle": "RESEARCH ASST PROFESSOR / ASSISTANT RESEARCH SCIENTIST", "companyRating": null, "companyInfo": {"Website": "www.umich.edu", "Headquarters": "Ann Arbor, MI", "Size": "10000+ employees", "Founded": " 1817", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Apply Now  Clicking \"Apply Now\" opens the link in a new window.  How to ApplyTo submit your application, please go to sph.umich.edu/epid/faculty-search/ to upload yourapplication. To do so, you will need a University of Michigan account or “Friend” account. Youcan set up a UofM Friend account at friend.weblogin.umich.edu/friend/. Once this step iscompleted, you can upload your application.  A complete application should include:1. Statement of current and future research plans2. Curriculum Vitae3. Names of three (3) references (please include complete contact information for eachreference)  Please upload these documents in a single PDF file. Anyone with questions about submittingtheir application online should contact Stacy Babcock (babcockk@umich.edu).  Review of applications will begin August 15, 2018, and continue until suitable candidates areidentified.Responsibilities*The Department of Epidemiology at the University of Michigan, School of Public Health invitesapplications for an Assistant Research Scientist / Research Assistant Professor faculty position inGenetic Epidemiology. Successful applicants should have a Ph.D. level training and researchbackground in genetics, epigenetics, statistical genetics, genetic epidemiology methodologiesand/or applications and excellent writing skills. The successful applicant will work with a largeteam of genetic epidemiologists and statistical geneticists on a variety of studies and initiativesthat may include the Genetic Epidemiology Network or Arteriopathy (GENOA), the Health andRetirement Study (HRS), the Multi-Ethnic Study of Atherosclerosis (MESA), the Trans-Omics forPrecision Medicine Initiative (NHLBI), and the Study of Women's Health Across the Nation(SWAN), a large national study of midlife and aging in women.  Our Department of Epidemiology is home to more than 40 highly interdisciplinary, internationallyrecognized faculty members whose research encompasses a broad range of epidemiologicdisciplines. The Department has large and highly successful training programs at both the mastersand doctoral level.  Genetic/epigenetic epidemiologists from chronic disease, cardiovascular disease, cognition anddementia, environmental epigenetics, or related fields are encouraged to apply. Inquiries regardingthis position can be directed to Dr. Sharon Kardia (skardia@umich.edu) and/or Dr. Jen Smith(smjenn@umich.edu).Underfill StatementThis position is posted as Research Assistant Professor / Assistant Research Scientist. The rank of the selected candidate will depend upon candidate's qualifications.Additional InformationThe University of Michigan is an Equal Opportunity/Affirmative Action Employer. Minorities and women are particularly encouraged to apply. This search will be conducted in amanner consistent with the University of Michigan’s newly released campus-wide Diversity, Equity & Inclusion Planning Initiative. For more information, see diversity.umich.edu/...urcommitment/. The University is responsive to the needs of dual career couples.Background ScreeningThe University of Michigan conducts background checks on all job candidates upon acceptance of a contingent offer and may use a third party administrator to conduct background checks. Background checks will be performed in compliance with the Fair Credit Reporting Act.U-M EEO/AA StatementThe University of Michigan is an equal opportunity/affirmative action employer."}