{"jobID": "2672141070", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Applied Scientist, Machine Learning", "companyRating": null, "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": null, "jobDescription": " Machine Learning is a critical part of Adobe’s Cloud offering. Adobe Clouds enable customers to create and manage digital content, such as assets, composites, 3D, documents etc., and digital experience and transformations.  Creative Cloud is focused on visual imagination and creation, and includes such well-known products as Photoshop CC, Illustrator CC, Lightroom CC, and Adobe Stock. Document Cloud is centered around the creation and management of textual documents, including Acrobat DC and Adobe Sign. Experience Cloud is the set of offerings for the large-scale enterprise, covering marketing, advertising, and analytics.  We are building new machine learning platform, called Adobe Sensei, that powers machine learning and AI across all of these Adobe Cloud product lines. This platform will enable thousands of applied researchers, millions of users, and billions of content pieces. The objective is to make machine learning offerings a world-class, leading-edge, differentiating product in Adobe Cloud ecosystem. We match the pace, innovation and excitement of a startup, backed by the resources and infrastructure of Adobe!  How can you participate? We’re looking for technical leaders to guide development of the Sensei platform, transfer the newest technology from Adobe Research to realization in products, innovate in discovering new ML use cases and product features, and encourage best practices in machine learning application across Adobe. In this role, you will help build technologies for content understanding, computer vision, deep learning, user understanding, language understanding, information retrieval, campaign and channel optimization, advertising bid optimization, and more.  RESPONSIBILITIES  You will:  - Lead the team through “what” and “how” of the Adobe Machine Learning platform and Sensei algorithms.  - Apply data mining and machine learning to improve content understanding, computer vision, deep learning, language understanding and content ranking & recommendations in Adobe products  - Work closely with product, engineering, and research to take early ML prototypes all the way to demos and products that surprise and delight users and make them more creative and productive.  - Create a winning culture built on collaboration and shared accomplishments- have fun along the way!  WHAT YOU NEED TO SUCCEED  MS in Computer Science, PhD nice to have  10+ years of applicable experience in industry  EXPERIENCE IN MACHINE LEARNING TECHNOLOGIES, ESPECIALLY IN CONTENT UNDERSTANDING  Some combination of the following:  Strong grounding in machine learning theory and recent advances in deep learning  Pragmatic orientation to building ML solutions that work in the field  Experience in design, training, validation and evaluation of machine learned models  Understanding of issues around ground truth and training sets for ML, including human judgment and A/B testing  Experience with machine learning frameworks – TensorFlow, Scikit, MLPack, , SparkMLib, Caffe, …  Experience with Spark, big data processing, Hadoop.  Hands on experience with Java, Python, and/or C++.  Knowledge of Matlab, R and other tools.  At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}