{"jobID": "2805448663", "jobLocation": "Houston_TX", "jobTitle": "Staff Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.bhge.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (BHGE) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us:Baker Hughes, a GE company (NYSE:BHGE) is the worlds first and only fullstream provider of integrated oilfield products, services and digital solutions. Drawing on a storied heritage of invention, BHGE harnesses the passion and experience of its people to enhance productivity across the oil and gas value chain.BHGE helps its customers acquire, transport and refine hydrocarbons more efficiently, productively and safely, with a smaller environmental footprint and at lower cost per barrel. Backed by the digital industrial strength of GE, the company deploys minds, machines and the cloud to break down silos and reduce waste and risk, applying breakthroughs from other industries to advance its own.With operations in over 120 countries, the companys global scale, local know-how and commitment to service infuse over a century of experience with the spirit of a startup inventing smarter ways to bring energy to the world.Follow Baker Hughes, a GE company on Twitter @BHGECo, or visit us at BHGE.com.  GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Role Summary: The person will be part of the core Data Sciences team at BHGE Engineering and will develop analytics to meet objectives of the business. In this role, you will contribute to the development and deployment of modern machine learning and statistical methods for finding process insights to problems in Oil Field Services. Essential Responsibilities: As a Staff Data Scientist, you will be part of a cross-disciplinary modeling & data science team on commercially-facing development projects, typically involving large, complex data sets. These teams typically include domain experts, statisticians, computer scientists, software developers, engineers, product managers, and end users, working in concert with partners in BHGE business units. Potential application areas include remote monitoring and diagnostics across Oil & Gas infrastructure and industrial sectors, and operations optimization.In the role of Staff Data Scientist, you will: Be responsible for data exploration and model building targeting given CTQs (field issue investigations, developing tracking filters, inspections, root cause analysis, etc.) Work alongside software developers and software engineers to translate algorithms into commercially viable products and services Work in technical teams in development, deployment, and application of applied analytics, predictive analytics, and prescriptive analytics Perform exploratory and targeted data analyses using descriptive statistics and other methods Work on data quality assessment and data cleansing Execute design, analysis and development of assigned projects adhering to business standards, practices, procedures and product / program requirements Communicate results, findings and observations in clear and concise documents (presentations, reports, technical articles) to peers and program leader in formal/ informal reviews Document technical data generated by the assigned project consistent with engineering policies and procedures Qualifications/Requirements:Basic Qualifications:"}