{"jobID": "2816455704", "jobLocation": "N_o_n_e", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.hcl.com", "Headquarters": "Noida, India", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " SR Number HCL/HCL/2018/****** Designation  Data Analyst  Location  Texas  Job Family  Delivery Domain  Job Description (Posting).  Responsible for indirect purchasing activities, Open POs expediting  and Material Return to vendor etc (1.) The individual should be able  to work effectively in a team whilst enthusing others to do the same  for achievement of common goals of the team (2.) 1. Requisition  validation and new suppliers addtion to the system. 2. Negotiating  with Suppliers on Price, time of Delivery 3. Placing Purchase Order  with Suppliers and confirming on delivery time. (3.) To consistently  meet or exceed all agreed procurement chain parameters (4.) Bringing  new ideas and Process Improvement which will add value to client (5.)  Improving skill level through Self development / nominating training  programs Skill reverification Tests  Experience  1-3 Years  Qualification  Bachelor of Business Studies(BBS)  No. of Positions 1 Skill (Primary)  Domain Competencies (BSERV )-Supply Chain Management-Manufacturing  Country USA Removal Date  12-Jul-2018  Be an Employee Employee Growth and BenefitsBeware of Fraudulent offersRecruitment Process OverviewOur Culture IdeaprenuershipRelationship Beyond The Contract HCL and any of its subsidiaries or any authorized third-party  recruitment partners never ask for recruitment , processing or  security deposit or any other kind of money in exchange of offer  letters or interview calls at any time during hiring. Please note that  offer letters and other recruiting correspondence from HCL and its  subsidiaries are sent from an official e-mail ID and/or are printed on  HCL letterheads with authentic signatures of appropriate HCL  authorities."}