{"jobID": "2817063811", "jobLocation": "Hastings_MI", "jobTitle": "Customer Service Representative", "companyRating": "4.0", "companyInfo": {"Website": "www.hastingsmutual.com", "Headquarters": "Hastings, MI", "Size": "201 to 500 employees", "Founded": " 1885", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "15", "jobDescription": " Hastings Mutual has an opening for a Customer Service Representative. The individual in this role will provide service to agents, customers and HMIC Marketing and Underwriting personnel by handling billing inquiries, credit card payment transactions and resolving billing account issues.  This role will be based at our Hastings, Michigan corporate headquarters and will report to the Accounts Receivable and Customer Service Manager. ResponsibilitiesAnswer telephone inquiries accurately and in a courteous, respectful and helpful manner.Accurately processes customer credit card payment transactions.Answers direct bills and agency account inquiries from agents, customers, mortgage holders and HMIC employees.Reviews account information and provides factual and accurate feedback to callers.Evaluates payment plan options available to customers based on line of business, credit tier and state rules.Adheres to company confidentiality guidelines.Prepares account history documentation for customers and agents. Maintains accurate and detailed documentation.Investigates and resolves misapplied or misdirected payments, prepares route payment history information for customer.Candidate RequirementsHigh school diploma or equivalent required.One year Billing Department experience or call center experience. Insurance background preferred.Strong PC skills including knowledge of MS Office (Word, Excel, Outlook)Demonstrated excellent oral and written communication skills.Demonstrated ability to resolve problems and service-related issues.Minimum ability to type 30 words per minuteÂ (test provided as part of interview process)Ability to maintain confidential information pertaining to accounts, accounting, or HIPAA.About Us Hastings Mutual Insurance Company is an award-winning, regional property/casualty insurance company with a six-state, Midwest marketing territory, with our corporate office located in Hastings, Michigan. For over 125 years, Hastings Mutual has built an outstanding reputation based on excellent customer service and top quality insurance products, backed by sound fiscal responsibility.  Are you looking to embark on a fulfilling career in the Insurance industry? Do you currently have experience but are looking to become more than just a\"number\"?  Join us!  We treat our employees as valued team members and we are continuously finding new ways to enrich our employee's lives and careers. From fully paid certification training, to our full-service D.W. Windstorm Cafe offering breakfast, lunch, complimentary coffee and tea, onsite massage services and fitness classes, to our community outreach programs, we strive to take care of our employees and our community. And with our employee recognition programs and appreciation days, you'll definitely feel like part of a family.  Hastings Mutual is a regional employer of choice, carries an\"A\" rating by A.M. Best Company and has been named to the 101 Best and Brightest Companies to work for in West Michigan each year since 2011."}