{"jobID": "2571566067", "jobLocation": "Bridgewater_NJ", "jobTitle": "Clinical Research Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.insmed.com", "Headquarters": "Bridgewater, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public (INSM) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " Company DescriptionInsmed understands that its most valuable resource is its employees. We place great value on the unique skills, talents and qualities that each of our employees brings to our company. We are building a world-class team with a focus on innovation, teamwork and the desire and ability to change the way our patients live.  Insmed is a fast-paced, high-energy organization that seeks talented individuals who are leaders in their respective functional areas of expertise, who are creative problem solvers and who have the desire to make a difference.Job DescriptionSUMMARY: The Clinical Research Scientist (CRS) will support and work predominately with the Medical Monitor for assigned protocols and/or projects, partnering with vendors and cross functional teams. The CRS will provide scientific support to clinical development and operations, regulatory and quality assurance teams, as well as overall program support ensuring the adherence to all standard operating procedures (SOPs). RESPONSIBILITIES: Participate in cross functional teams to develop and implement Clinical Study protocols within clinical program(s). Responsibilities include but are not limited to: Collaborate with internal teams, CROs and external vendors to prepare, review and finalize clinical protocol documentsContribute to scientific and operational aspects and stages of the protocol development and execution from study design planning through final reporting of result.Provide scientific input and review of protocol data, support in assessing medical monitoring reports, study integrity/conduct and protocol oversightSupport preparation of abstracts, manuscripts, presentations, and materials for meetings as it related to the protocol(s) and programProvide protocol level scientific review of information to support the development and updates for regulatory documents (i.e. IND submissions, IND Annual Updates, DSUR, Investigator Brochures, and briefing books) and aid in the development of responses to regulatory authorities when questions arise for the protocolSupport enrollment projections and assist with the development and implementation of subject recruitment and retention strategies Provide scientific support to the study teams, including: Collaborate with team members in the review and development of Data Management activities including development of eCRFs, edit checks, report development and database lock processesParticipate in activities related to review of data review, database lock, medical monitoring and query resolution for the protocolWork with medical monitors and drug safety vendor(s) to provide support and scientific review of adverse eventsProvide scientific review of statistical analysis plansSupport corporate objectives:Development, review and revision of departmental and corporate SOPs and processesProvide clinical development and technical expertise in support of due diligence activitiesSupport regulatory activities at the protocol level to develop, prepare and respond to regulatory authoritiesQualificationsRequires a Bachelor's degree combined with a minimum of 5 years of relevant experience; a Pharm.D. or Ph.D is strongly preferred with a minimum 3 years of drug development experience requiredKnowledge of pharmacokinetic applications related to drug dispositionStrong medical writing and presentation skillsUnderstanding of biostatistics and data managementAbility to read, analyze and interpret common scientific and technical journals, financial reports and legal documentsExcellent written and oral communication skillsAbility to work in high paced working environmentDemonstrated team-building skills and the ability to work successfully in a matrix team environment.Analytical, negotiation, meeting management, cross-functional team and leadership skillsExperience with EDC systems, experience with RAVE and J-Review preferredSkills in conflict management, time management and organizationalTravel requirement approximately 5-10% based on protocol development stage and program needsAdditional InformationInsmed is an Equal Opportunity Employer and will judge all applicants based on their qualifications for the job, without regard to race, color, sex, religion, national origin, age, disability or any other characteristics protected by applicable federal, state or local law.  Unsolicited resumes from agencies should not be forwarded to Insmed. Insmed will not be responsible for any fees arising from the use of resumes through this source. Insmed will only pay a fee to agencies if a formal agreement between Insmed and the agency has been established. The Human Resources department is responsible for all recruitment activities; please contact us directly to be considered for a formal agreement.  Please note that we review every submission and we will keep all submissions on file for six months. Insmed is an Equal Opportunity Employer.Job LocationI'm interested"}