{"jobID": "2827531155", "jobLocation": "Traverse_City_MI", "jobTitle": "Physical Therapist - Physical Therapy- Full Time", "companyRating": "3.1", "companyInfo": {"Website": "www.atipt.com", "Headquarters": "Bolingbrook, IL", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AthletiCo, Novacare Rehabilitation, U.S. Physical Therapy"}, "estimatedSalary": "29", "jobDescription": "Physical Therapist  ATI Physical Therapy is currently seeking qualified physical therapy candidates to join our dynamic team and be remarkable with us. As an ATI physical therapist you will work in a friendly and encouraging environment offering state of the art equipment to help you provide the highest quality of care. You will be responsible for patient-centered outpatient treatment including the development of an individualized plan of care and treat patients through all phases of physical therapy. We emphasize compassionate and high-quality care through a comprehensive, thorough, and customized physical therapy regimen resulting in remarkable outcomes.  Join the industry leader today and enjoy highly competitive benefits including best-in-class continuing education, performance based incentives, residency/fellowship sponsorship, robust in-house research opportunities, career advancement potential and complete insurance coverage including medical, vision, dental and life.  Job Description:  1. Ensure every patient receives a thorough, comprehensive and customized physical therapy regimen, while receiving a unique experience.  2. Provide a written and hands-on evaluation and immediate treatment of incoming patient conditions to determine appropriate physical treatment programs. Consult with clinic director or referring physicians regarding diagnosis.  3. Ensure fluid treatment progression via ongoing scheduling of patients.  4. Develop and implement physical therapy treatment programs based on each patient's particular needs.  5. Assist patients with all phases of physical therapy treatment and techniques.  6. Discuss treatment with patients and record patient conditions and responses to treatments in patient’s medical record after each visit.  7. Complete daily patient care notes, progress notes, discharge notes and other required forms as requested by treating physicians, rehab nurses or insurance companies.  8. Consult with clinic director or referring physicians regarding patient diagnosis and communicate changes via progress notes.  9. Provide continuous communication with referring physicians, physical therapy assistants and athletic trainers regarding patient therapy and equipment.  10. Operate and apply knowledge of standard physical therapy equipment.  11. Maintain friendly, cordial relations with all clients and employees.  12. Comply with ATI standards of operations and adhere to ATI core values.  Physical Therapists report directly to the Clinic Director.  Required Skills  Masters/Doctorate degree in Physical Therapy from an accredited program. Current PT Licensure or eligibility to test for PT license required.  Required Experience  No experience required; new graduates are welcome to apply"}