{"jobID": "2805415318", "jobLocation": "Sacramento_CA", "jobTitle": "Senior Development Scientist", "companyRating": null, "companyInfo": {"Website": "www.leicabiosystems.com", "Headquarters": "Buffalo Grove, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Senior Development Scientist develops new product designs, processes, new product scale-up, design/product optimization, technology transfer and process/product validation activities. Develops and reviews production and quality control procedures and process/product specifications. Includes laboratory roles.  This position will be responsible for developing complex microbial and molecular diagnostic assays consisting of reagents, consumables, and instrumentation through collaboration with cross-functional product teams. The ideal candidate will ensure product designs meet performance criteria and compatibility with customers requirements, will provide recommendations based on scientific experience and/or knowledge of customer/patient needs, and will execute experimental designs to collect, organize and analyze data to support project milestones. The position is in the Research and Development group which is responsible for reagent and assay development for Beckman Coulters’ Microbiology diagnostic platforms.  Essential Job Responsibilities:  Development and optimization of assays, reagents, sample preparation methods and protocols for in vitro diagnostic tests  Characterization of infectious organism’s antibiograms, drug resistance mechanisms and biological nature of variance in resistance under various environmental conditions  Maintenance of detailed experimental records and laboratory documentation  Authorship of technical reports, SOPs and supporting quality documentation  Design of training and troubleshooting materials to assist assay transfer to manufacturing  Surveillance of technology and competitive trends in Medical Microbiological Diagnostics  Application of strategies and analytical problems solving skills to reagent and system integration issues to identify critical performance factors of microbiology and chemistry assays  Presentation of data at technical meetings  Efficient allocation and prioritization of time and resources to meet individual, team, and corporate goals  Qualifications  The ideal candidate must have a background primarily in microbiology and molecular biochemistry. Success in this position will require:  Demonstrated ability to write, present and communicate verbally in a clear manner.  Able to work independently and in a multidisciplinary team-based environment of scientists and engineers.  Ability to perform knowledge discovery and analysis of technical research publications as it applies to product development  Take initiative and lead when necessary to work through complex, cross-functional project issues with aggressive timelines  Understanding of good laboratory technique and documentation practices  Attention to detail and methodical problem solving skills  Expertise in molecular biology techniques and instrumentation used for chemical and protein analysis  Knowledge of microscopy techniques and image analysis methods preferred  Experience in development of reagent preparation methods and analytical test protocols  Expertise in working with medically important strains of bacteria and yeasts preferred  Knowledge of application of Lean, 6-sigma, Kaizen and 5S principles to problem solving and continuous improvement  Experience with statistical methods and programs (JMP, SAS, R) necessary for successful data analysis and interpretation including DOE, and process and test method validation  Working with ISO 13485 and GMP quality systems with demonstrated experience working in BSL-2 laboratory environment preferred  Educational Requirements:  Master’s degree in field with 3+ years of experience OR Doctoral degree in field with 0-2+ years of experience"}