{"jobID": "2837020773", "jobLocation": "Raritan_NJ", "jobTitle": "Data Analyst - Local and W2 Only", "companyRating": null, "companyInfo": {"Website": "www.beaconhillstaffing.com", "Headquarters": "Boston, MA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Aerotek, WinterWyman, Hollister Staffing"}, "estimatedSalary": null, "jobDescription": "Job Summary The Data Analyst position will be responsible for the design, testing and implementation of Data Warehouse projects for Policy, Claims, Quotes, Billing, Agency, ECP and Data Mart insurance applications. Primary duties will include requirements review, estimating, analysis, development of technical specification documents, development team support, significant quality assurance, implementation tracking, downstream application support and monitoring of data in production databases. Knowledge, Skills and Education RequiredBachelor's degree in Computer Science (or equivalent experience), with 1-3 years of software development experience (ideally SQL)2-5 years of Data Analyst ExperienceExperience in relational databasesExperience in data mapping and transformationExperience using a software development life cycle (SDLC) methodology, including project planning and estimating.Experience with SQL - DB2 and SQL Server preferredEffective oral & written communication skillsAnalytical SkillsSignificant testing skillsetAbility to multi-taskAttention to detail and qualityMust be a team player Duties and Responsibilities  Specific responsibilities include:  Analysis and clarification of Business RequirementsDevelop system specifications, including data transformations, using Software Development Life Cycle (SDLC) methodologies and templates.Unit testing and involvement in integration, user and performance testing as well as support of downstream IT and business applications utilizing the Data Warehouse data.. Other highly valued skills would include: Knowledge of the Property and Casualty Insurance industry is a plusFind Us on Facebook!  Follow Us on Twitter!  Beacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply. Company Profile: Beacon Hill Technologies, a premier National Information Technology Staffing Group, provides world class technology talent across all industries on a contract, direct (permanent), contract-to-direct and project basis. Beacon Hill Technologies' dedicated team of recruiting and staffing experts consistently delivers quality IT professionals to solve our customers' technical and business needs.  Beacon Hill Technologies covers a broad spectrum of IT positions, including Project Management and Business Analysis, Programming/Development, Database, Infrastructure, Quality Assurance, Production/Support and ERP roles.  Learn more about Beacon Hill Staffing Group and our specialty divisions, Beacon Hill Associates, Beacon Hill Financial, Beacon Hill HR, Beacon Hill Legal, Beacon Hill Pharma and Beacon Hill Technologies by visiting www.beaconhillstaffing.com.  We look forward to working with you.  Beacon Hill. Employing the Future"}