{"jobID": "2604175550", "jobLocation": "Beltsville_MD", "jobTitle": "HVAC Service Technician", "companyRating": "3.9", "companyInfo": {"Website": "www.croppmetcalfe.com", "Headquarters": "Fairfax, VA", "Size": "201 to 500 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Michael and Son Services, F.H. Furr, ARS-Rescue Rooter"}, "estimatedSalary": "22", "jobDescription": "Are you an experienced Residential HVAC Service Technician who loves challenges, helping customers live more comfortable lives, and working in an exciting company culture? If so, then CroppMetcalfe wants you to join our team!Here at CroppMetcalfe, we are one of the largest local companies with a family-owned culture. From the few trucks we started with in 1979 to the 200+ trucks in our fleet today, CroppMetcalfe is dedicated to serving our customers, our co-workers, and our company. At CroppMetcalfe, we believe in:Year-Round WorkCareer DevelopmentExcellent BenefitsPaid, Ongoing TrainingFun, Dynamic CultureDESCRIPTION Responsibilities included but are not limited;Independently service compressors, heat exchangers, coils, accumulators, outdoor units, humidifiers, condensate pumps and electronic air cleanersTroubleshoot and repair major HVACR parts such as refrigeration leaks, motors, contactors, transformers, thermostatsAble to troubleshoot Refrigerant and electrical problems in Heat pump, Gas furnaces, Steam/ Water Boilers and Geothermal Unit.Must have the ability to perform heating and cooling maintenance inspections without assistance.Provide exceptional service to our customers POSITION REQUIREMENTSAt least two years of experience working in the fieldCFC/EPA certification of Type II or UniversalClean driving record as required by company insurance carrierClean criminal record as required by state laws for home service companiesA good grasp of mathematical concepts to understand HVAC designsMust be able to carry out instructions with little to no supervisionAbility to operate power and hand tools safelyDemonstrated mechanical aptitude and follow written and verbal instructionsExcellent interpersonal skills with the ability to interact with all types of customersWillingness to learn and possess an excitement about a career, not just a job.CroppMetcalfe was founded in 1979 with a Vision TO SERVE. We strive to follow this vision every day to better serve our customers, co-workers, and company. We want the Washington DC Area's very best HVAC, Plumbing, Electrical, and Pest Control professionals on our team.CroppMetcalfe offers a complete benefits package including:Medical insurance401k Plan with company matchTool allowanceGuaranteed 40 ProgramFully stocked truck with mobile restock programPaid holidaysPaid time off (PTO)Paid trainingCompany discounts on products and servicesWe look forward to hearing from you!CroppMetcalfe is an equal opportunity employer and a drug free workplace.This position above is equivalent to the following military codes: 3E1X1,1161,4228,4291"}