{"jobID": "2722539127", "jobLocation": "Benicia_CA", "jobTitle": "Physical Therapist", "companyRating": "3.5", "companyInfo": {"Website": "www.ahhsac.com", "Headquarters": "Sacramento, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47", "jobDescription": "\">Level ExperiencedJob Location Advanced Home Health Northbay - Benecia, CAEducation Level Physical Therapist LicenseJob Category Health CareDescriptionAdvanced Home Health North Bay is looking for a Physical Therapist to be part of our wonderful team to support our continued growth. Advanced Home Health North Bay is a locally owned and operated agency. We are seeking talented and compassionate therapist that want to make a significant difference in the lives of their patients.  The Physical Therapist, contracted or employed through the Organization is responsible for providing physical therapy services and for adherence to all conditions outlined in the Personnel Services Agreement. ESSENTIAL JOB FUNCTIONS/RESPONSIBILITIES Provides physical therapy services to patients according to a written physician's plan of care. This may include, but will not be limited to: Assessing and evaluating therapeutic/rehabilitative/functional status, and participation in the development of the total plan of care. Evaluates home environment.Assesses for muscle strength, mobility, gait, ROM-potential for rehab.Directing the physical therapy treatment, instructing patients and families/caregivers in the use and care of therapeutic appliances.Determining priority needs for physical therapy.Reports to physician the patient's reaction to treatment or changes in condition.Initiates physical therapy program and instructs other personnel and/or family/caregiver members in certain phases of physical therapy with which they may work with a patient, as well as instruction them as to the goals of the physical therapy program for the patient by participation in case conferences.May train the patient in the use of prosthetic device.Identifies patient and family/caregiver needs for other home health services and refers as necessary.Prepares and submits clinical and progress summaries based on the attainment of goals.Participates in discharge planning for the patient.Prepares and submits a clinical progress summary based on the attainment of goals as directed by Organization policy.Provides physical therapy consultation to home families/caregivers when indicated.Provides in-service education programs for nursing organization personnel as needed.Participates in peer consultation process.Supervises Physical Therapy Assistants according to organization policy and state regulations.When therapy is the only skilled service, instructs, supervises and evaluates home health aide care every two (2) weeks. The above statements are intended to be a representative summary of the major duties and responsibilities performed by incumbents of this job. The incumbents may be requested to perform job related tasks other than those stated in this description.QualificationsPossesses a degree from a baccalaureate or masters program in physical therapy approved by an accredited organization.Licensed to practice as physical therapist within the state of California.Two years of appropriate experience as a physical therapist. Community/home health experience is preferred.Demonstrates good verbal and written communication and organization skills.Possesses and maintains current Heart Association approved CPR certification.Must be a licensed driver with an automobile that is insured in accordance with state/organization requirements and is in good working order.​Medical RequirementsCurrent Tuberculosis (TB) Test or Chest X-ray (Within the last six months)Titers for: Varicella (Chickenpox), MMR (Measles, Mumps, Rubella), and Hepatitis B. A titer is a blood test that checks your immune status to vaccinations (immunizations) you may have received in the past.Proof of Vaccination for Tdap (Tetanus, Diphtheria, Pertussis)Proof of Vaccination for Flu (Influenza)Proof of Physical exam (Within the last six months)"}