{"jobID": "2809408041", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.teradata.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (TDC) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " EMC, IBM, Oracle"}, "estimatedSalary": "101000", "jobDescription": " Teradata empowers companies to achieve high-impact business outcomes through analytics. With a powerful combination of Industry expertise and leading hybrid cloud technologies for data warehousing and big data analytics, Teradata unleashes the potential of great companies. Partnering with top companies around the world, Teradata helps improve customer experience, mitigate risk, drive product innovation, achieve operational excellence, transform finance, and optimize assets. Teradata is recognized by media and industry analysts as a future-focused company for its technological excellence, sustainability, ethics, and business value.  Fast-paced, flexible, fun describes our work environment. Teradata is a place to brainstorm with the best data minds, engage customers, and surprise yourself with what's possible every day.  Teradata Labs is looking for candidates interested in solving next generation big data problems leveraging modern and open source tools and frameworks in combination with tried and true best-in-class technologies. Candidates will be a part of an organization tasked with building the next generation Analytical Ecosystem technology. You will analyze large volumes of sensor data to discover new patterns and perform predictive analytics. Data Scientist, Analytical EcosystemMajor Responsibilities: Teradatas Analytic Ecosystem is seeking an experienced Data Scientist to join our team. As a member of our team, the candidate will work in collaboration with other members of the team to research, design, prototype, test and document novel algorithms and predictive analytics for automated, near real time decision making on telemetry data. On a daily basis, you will work with massive data sets, which includes data integration, data cleansing, exploratory analysis, predictive modeling, and rapid prototyping. You will present findings to teammates and guide the transition of new algorithms into operational code. Qualifications:Masters or PhD degree in a related discipline (Mathematics, Statistics, Data Science, Operations Research, Computer Science or Engineering)5+ years working in an analytics research and development role (e.g., Data Scientist, Algorithm/Machine Learning Engineer)Prior work and/or research demonstrates experience in the following areas Statistics: exploratory analysis, model development and theoryData mining: discovery of patterns & signals in data or anomaly detectionImplementation: machine learning algorithms, clustering algorithms, mathematical optimization, time-series or probabilistic reasoning algorithmsDrawing conclusions from data and generating actionable informationExtensive knowledge of at least one scientific or statistical programming language such as Matlab, Octave, R, or Python (must include SciPy, NumPy, SciKit-Learn, Pandas)Experience with at least one general purpose, high level programming language such as Fortran, C/C++, Java or PythonExcellent verbal and written communication skillsAbility to collaborate on an interdisciplinary team members to solve research problemsSelf-starter with a positive attitude, intellectual curiosity and a passion for analyticsPreferences:Experience with either Teradata or Aster database technologyExperience with at least one of the following: SQL, Tableau, SAS, SparkDeveloping novel statistical algorithms to automatically process telemetry data (video game, aerospace, financial, biomedical, etc.)Demonstrable skills in creative-problem-solving of complex and advanced technical subject matterWork Environment This position will be located in San Diego, CA. Please continue to check our website to evaluate all open opportunities.  Teradata is an Equal Opportunity/Affirmative Action Employer and commits to hiring returning veterans."}