{"jobID": "2705217256", "jobLocation": "Mountain_View_CA", "jobTitle": "Chief Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.groundtruth.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Chief Data Scientist Mountain View, CA  GroundTruth, is a global location technology company that drives results with real data. We believe in the power of place. Build your brand, increase sales and more by building off what real people are doing in the real world, mapped using our proprietary Blueprints technology. GroundTruth delivers superior consumer insights by seeing more people and places than anyone else, with an unrivaled first-party database of 150 million active monthly users, across 100 million places and points of interest. GroundTruth currently serves 21 countries globally. Learn more: www.GroundTruth.com We are looking for a dynamic and proven chief data scientist to head our data science team. The person will lead and grow a team of smart researchers and engineers to address challenging data problems in the exciting location domain. Additionally, the chief data scientist is a machine learning expert who is knowledgeable in advertising industry and is interested in leading research on the new area of location based performance delivering. You will:Be responsible for the development strategy, technical path, and key technology direction.Represent the company as the scientific expert for patent applications, litigations, and industrial standard committees.Be a hands-on leader who is willing to roll up your sleeves and discussing technical details with your team members, and even doing some coding if necessary.Be an expert in machine learning and data mining algorithms and systems. Additionally, you will mentor team members and provide technical guidance.Recruit, manage, and grow a team of 10+ data scientists and engineers.Work with product team to drive production innovations and deliver science algorithms into productions.You are:Expertise: Expert in machine learning and Data Science.Well organized: Ability to prioritize and deliver results timely.Excellent communicator: Strong written and verbal communication skills, comfortable in engaging conversation with all levels.Extremely flexible: Dynamic, hard-working, and able to pivot direction quickly to keep up with business demands.Problem solver: Take initiatives and drive them to conclusions.Technical Aptitude: Eager to learn and implement new technologies.You have:Ph. D in engineering, data mining, statistics, operations research, math, physics, economics or equivalent required.10+ years of software engineering and scientific experience.5+ years of experience in people management.Experienced in hands-on coding using Java and Python and Big Data. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}