{"jobID": "2807721158", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "106000", "jobDescription": "Requisition ID: 178834Work Area: Information TechnologyExpected Travel: 0 - 10%Career Status: ProfessionalEmployment Type: Regular Full Time COMPANY DESCRIPTIONAs market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably.SAP’s vision is to help the world run better and improve people’s lives. As the cloud company powered by SAP HANA®, SAP is a market leader in enterprise application software, helping companies of all sizes and industries run better. SAP empowers people and organizations to work together more efficiently and use business insight more effectively. SAP applications and services enable our customers to operate profitably, adapt continuously, and grow sustainably. At SAP, we believe in the power of collaboration and empower our employees to perform at their best in an environment that encourages free and open expression of ideas. You’ll work alongside creative thinkers who share your interests while turning big ideas into reality for our customers. With innovative job training, mentors to help you grow, and the flexibility to balance your work and personal life, you’ll be able to get more out of your career. It’s no wonder that some of the sharpest minds from around the world are working for a company that is consistently recognized as a global top employer. Now it’s your turn to take the next step and help make the world Run Simple. Who we are The Innovation Center Network creates the SAP beyond tomorrow. We generate new technologies and business models for SAP in a highly creative environment by incubating new ideas, demonstrating feasibility of new technologies, supporting board level initiatives, and exploring research topics from different universities. We also work with our field organizations to identify high value business scenarios and enable innovation for strategic customers.The Innovation Center Southern California as our new outpost will be a beacon, an iconic destination of innovation and creativity in Orange County ... a lighthouse that shines out new possibilities and draws in people who have a spirit of creativity and a fire for finding tomorrow’s solutions, today. This is a new space and we are building up an interdisciplinary team with skills and experiences ranging from architecture, data science, engineering, visual & interaction design, research, to business strategy, and product management.Purpose & ObjectivesWe are looking for a passionate data scientist to contribute to the identification and exploration of whole new focus areas and to engineer machine learning solutions based on the most recent research results. This position is meant for you if you are looking for an exciting opportunity to explore new areas, to apply machine learning to complex business challenges.What’s exciting for you:· Work out of our open workspace where the focus is on cooperation and collaboration· Connect with world leading software engineers, become part of the worldwide SAP network of experts, partners, and customers, have an extraordinary executive visibility· Being part of a cross-functional team discovering and working on trending technologies and building next-generation applications Responsibilities & Expectations · Strong enthusiasm and interest for new technologies and business models of the next generation· Dedication to prototype technology concepts with short turnaround times with various stakeholders· Being able to tackle complex technical challenges independently and as a member of small teamsQualifications· Major in Software/Computer Engineering/Data Science or related fields· Software development experience with Java/Scala, Python, C++· Experience with machine learning & artificial intelligence (computer vision, NLP, data science, etc.), ML/DL frameworks (TensorFlow or Theano or Torch)· Enjoying ambiguous challenges, fast iterations, and independent thinking· Having worked with various technologies during your studies but also independent of it (e.g. as an intern, as a trainee, at a start-up or together with friends or just for fun), to demonstrate that you’re driven to create beautiful & valuable technology solutions· Cloud-based experience with PaaS and IaaS, as well as Cloud-based, agile, development environments· Strong enthusiasm and interest for new technologies and business models of the next generation· Ability to visualize data and present core insights in a clear and compelling way· Excellent written and communication skills in the English language Location & Travel· Newport Beach, ~0-10% travel SAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company. SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis.EOE AA M/F/Vet/Disability:Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.Additional Locations: "}