{"jobID": "2688791712", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Self Driving", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About the RoleYou will have access to Uber's planet-scale data store while gaining subject matter expertise in various parts of the autonomy stack. What Youll DoLearn from world-renowned practitioners of robotics, mapping, perception, logistics, machine learning, motion planning, mobile communications, and other fields;See your work deployed fast and often into the real world and stretch yourself as you switch from one tough problem to another;Work with an outstanding engineering team and the support of an established data infrastructure;Benefit from working at a dynamic startup inside an established, well-capitalized company;Get in at the beginning as we grow the data science team!Build dashboards and visualizations of complex data sets and calculations What Youll NeedWe have positions available for experienced data scientists, as well as those at bachelors, master, and PhD levelsSkills as a full-stack data scientist equally proficient in software development, statistics, machine learning, big data, and visualization Dont worry if you havent covered each onewe learn skills from each otherExcellent software development skills (preferably in Python or C++)Driven and focused self-starters, great communicators, amazing follow-through - you love the responsibility of being individually empowered About the Team At the Advanced Technologies Group (ATG), we are building technologies that will transform the way the world moves. Our teams in Pittsburgh, San Francisco, Phoenix, and Toronto are dedicated to mapping, software and hardware development, vehicle safety, and operations for self-driving technology. Our teams are passionate about developing a self-driving system that will one day move people and things around more safely, efficiently, and cost effectively."}