{"jobID": "2824400267", "jobLocation": "Arlington_TX", "jobTitle": "Data Scientist Lead", "companyRating": "4.0", "companyInfo": {"Website": "www.texashealth.org", "Headquarters": "Arlington, TX", "Size": "10000+ employees", "Founded": " 1997", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Baylor Scott & White Health, UT Southwestern Medical Center, Methodist Health System"}, "estimatedSalary": "106000", "jobDescription": " Texas Health Resources is seeking a Data Scientist Lead for their Date Integration Office. Position Summary: The Data Scientist Lead role will be a self-motivate individual, who can inspire others by telling stories with data. The individual will lead and manage other analyst on projects. They will help educate the business on data analysis and drive business decisions through their team’s analytic work. Regularly exercising independent judgment and decision making in projects across the entire enterprise of Texas Health Resources. Required Minimum Education:Master's Degree in Statistics, Engineering, Epidemiology, Health Service Research, Operation Research, Economic, Statistics or equivalent areaPh.D in Statistics, Engineering, Epidemiology, Health Service Research, Operation Research, Economic, Statistics or equivalent area preferredRequired Minimum Experience:With a Master's degree: seven (7) years’ experience working with inferential statistics and/or machine learning required. Experience working in healthcare or related field preferred.With a PhD: five (5) years’ experience working with inferential statistics and/or machine learning required. Experience working in healthcare or related field preferred.Skills and Abilities:Excellent skills using SPSS, R, SAS or pythonExcellent skills using Tableau, Power BI, Cognos, or equivalent visualization softwareExcellent skills using SQL to query, join tables, and create tablesExcellent skills doing data discovery in an EDW or data lake environmentAble to take on multiple projects concurrently and manage changes in scope along the wayProven track record of building intuitive statistical model that provide actionable insight to business usersAbility to manage train others, set timelines, and hold accountabilityEssential Functions:Leads multiple projects in an analytic role, and overcome roadblock in data to get things done. Works with minimal guidance and can manipulating and join data from multiple sources into population set for comparative analysis. To be accomplished using a SQL, or No-SQL tool approach.Partners with senior leadership across the organization to assess need and define business questions. Leads analytic meetings to translate business questions/problems into analytical questions and deliver analytic insights back to the business. Ability to communicate complex methodologies of analytics to a non-technical user.Works with multi-disciplinary or cross functional teams to plan and build efficient scalable models that can be automated for large scale data analyses, development, validation, implementation and ability to communicate this plan.Deliver actionable insights with data to propose operational or process changes. Identify key driver of desired outcomes both known and unknown at the start of the analysis. Explaining the analysis to key stakeholders. Program or project analysis using statistical techniques to prove or disprove efficacy of the projects, tying in sources from the EMR, Supply Chain, Finance, Patient Experience, and third-party sources.Presentations to upper leadership on findings through graphical displays, and ability to tell the story through data and examples. Write statistical methodology and results for technical reports and publication. Submit for publication insights discovered at THR.Effectively manage diverse assignment with shifting priorities and tight timeframes. Mentor analytic team members to grow their skills and ability. This might include creating training classes on analytic concepts, or leading a monthly journal article review."}