{"jobID": "2811684320", "jobLocation": "Grand_Prairie_TX", "jobTitle": "E9393:Data Scientist Analyst Sr", "companyRating": "3.6", "companyInfo": {"Website": "www.lockheedmartin.com", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LMT) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Boeing, Northrop Grumman, Raytheon"}, "estimatedSalary": "119000", "jobDescription": " E9393:Data Scientist Analyst Sr  05-Jun-2018 Req ID436704BRLMCareers Business UnitESS0385 MISSILES AND FIRE CONTROLWork Schedule FLEX9x80A-Friday off in 2nd week w/flex hrs/day Security Clearance None Shift First Direct/Indirect Indirect Business Area Missiles and Fire Control DepartmentDEE0M1:OPS ENG - ADV MFG TECRelocation/Housing Stipend Available Possible Job Code/Title E9393:Data Scientist Analyst Sr Job Class Manufacturing Job Category Experienced Professional Industry Job Title Sr Data Scientist / Big Data / Analytics / Grand Prairie, TX Req Type Full-Time Job Description Missiles and Fire Control (MFC) is a recognized designer, developer and manufacturer of precision engagement aerospace and defense systems for the U.S. and allied militaries. This is Lockheed Martin’s lead business unit for research development and production of manned and unmanned ground-vehicle systems, electro-optical and smart munitions systems and is a pioneer in the field of versatile, high-performance missile and rocket technology.  This position is for a Data Scientist to join the advanced computational engineering production analytics team. The Data Scientist identifies meaningful insights from complex datasets, and develops machine learning based models for improving manufacturing processes. Maintains awareness of emerging analytics and big-data technologies. Experience designing efficient algorithms with programming languages and tools for data manipulation and statistical analysis. Experience designing efficient data mining and text mining frameworks with related tools. Position requires self-motivated individuals combined with hands-on entrepreneurial spirit and exceptional drive, with the ability to work in a fast-paced multi-disciplinary environment.  Relocation: Relocation assistance is possible for this exciting position.  The Locale: Grand Prairie is part of the “Mid-Cities” region in the Dallas-Fort Worth Metroplex which is in the North Central region of Texas. Grand Prairie is a suburb of both Dallas and Fort Worth. The region offers a great cost of living combined with a robust economy and a pleasant climate. This North Central region of Texas is a great place to live and to raise a family. The region is home to numerous colleges and universities to include University of Texas at Dallas, University of Texas at Arlington, University of North Texas, Southern Methodist University, and Texas Woman's University. The Mid-Cities is the suburban region filling the thirty-mile span between Dallas and Fort Worth. These communities include the cities of Arlington, Irving, Grand Prairie, Grapevine, Southlake, Colleyville, HEB (Hurst, Euless and Bedford), NRH (North Richland Hills and Richland Hills), Haltom City, Watauga, and Keller, along with multiple other smaller towns such as Trophy Club and Roanoke and together represent more people than either Dallas or Fort Worth. Basic QualificationsAbility to build predictive models, such as generalized linear, decision tree, neural network models, and ensemblesAbility to perform model selection and evaluationProficiency with SQL and RExperience designing efficient algorithms with Statistical programming environmentsExperience with integration and cleansing of disparate or incomplete data sets to deliver insightAn understanding of traditional business intelligence and data warehousing concepts (ETL, data modeling, and reporting)Bachelor's degree in an associated disciplineDesired skillsMasters or PhD in quantitative analytics, or related fieldExperience in applied machine learning, optimization, and simulationStrong problem-solving capabilities; ability to devise solutions for complex business problemsExperience with two or more of the following: R, SQL, SAS JMP, Tableau, SAP HANA, SQL Server, Python, Hadoop, KNIME, StatisticaDomain knowledge of Aerospace & Defense industry, particularly in the manufacturing domainKnowledge of SAP ERP Systems, Applications and Processes and data constructs, as it applies to Production OperationsState Texas Virtual no City Grand Prairie Zip75051EEOLockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.* As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.  Join us at Lockheed Martin, where we’re engineering a better tomorrow. "}