{"jobID": "2832686912", "jobLocation": "West_Hills_CA", "jobTitle": "Scientist Clinical Lab I", "companyRating": "3.4", "companyInfo": {"Website": "www.questdiagnostics.com", "Headquarters": "Secaucus, NJ", "Size": "10000+ employees", "Founded": " 1967", "Type": " Company - Public (DGX) ", "Industry": " Health Care", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " LabCorp, Bio-Reference Labs, Thermo Fisher Scientific"}, "estimatedSalary": "38", "jobDescription": " Scientist Clinical Lab I - West Hills, CA  Schedule: Tuesday - Saturday, 6pm-2:30 am  This position will be supporting the Microbiology department in West Hills, CA.  Job Summary  Reports to Operations Supervisor, Laboratory Supervisor or Laboratory Manager. Under limited supervision incumbent(s) will use their training in medical technology to perform clinical lab testing and/or other scientific examinations. Required to work independent of immediate supervision and assume the initiative for prompt and accurate performance of tests with appropriate documentation and proper notification of abnormal results. This is considered an entry level position and is the first of a two level job family.  Job Accountabilities  Clinical Laboratory Scientist I will perform all or part of the following duties: Independently performs consistently moderate and somewhat complex clinical tests. Exhibits skills and proficiency in applying technical principles and techniques of medical technology.Prepares and tests new reagents or controls and evaluates their usefulness based on standard criteria.Performs test calibrations and runs Quality Control material at appropriate intervals.Determines the acceptability of specimens for testing according to established criteria in testing procedures.Determines calculated results utilizing testing data by means of manual or computerized procedures.Accurately enters results of testing. Checks the computer review reports to monitor accurate reporting of laboratory results.Evaluates the acceptability of routine analysis prior to releasing patient reports. Takes appropriate action in response to critical values or unusual or unexpected results, and documents action taken.Responsible for performing preventative maintenance and/or calibration of laboratory equipment and properly documenting actions taken based on approved schedule.Evaluates the results of instrument performance checks. Performs linearity, accuracy and precision checks as required.Performs Q/C and calibrations with the appropriate frequency and evaluates results, to decide whether tests should be reported. Reports any shifts or trends to a Clinical Laboratory Scientist II or Supervisor.Accurately performs and records proficiency testing.Recognizes problems, and initiates troubleshooting steps to evaluate testing failures and other problems, if necessary. Notifies the supervisor, and contacts manufacturer for additional assistance or field service support, if required.Monitors and maintains a consistent supply of reagents and consumables.Promptly and courteously answers the phone and assists clients and other departments.Maintains a safe and neat work area.Maintains a cooperative working relationship with co-workers.Provides on-going technical guidance to laboratory assistants, laboratory associates, and other Clinical Laboratory Scientists. Instructs and/or trains new employees in the proper performance of routine procedures.Maintains professional growth and development through continuing education activities.Follows established company and department policies and procedures. Follows the guidelines for safety, environmental, and infection control.Demonstrates a high level of integrity and honesty in maintaining confidentiality.May be required to perform Clinical Laboratory Scientist II level duties for a limited period of time, in order to establish competency prior to promotion as well as fill in for departmental absences.Provides direct and constant supervision to unlicensed staff as necessary. Job Requirements Clinical Laboratory Scientist I must have:A Bachelors of Science degree in medical technology or biological sciences from an accredited college or university.A current California state Clinical Laboratory Scientist license to perform laboratory testing.Zero to three year's direct experience in a laboratory setting.Demonstrated proficiency in computer skills such as word processing, statistical analysis, and laboratory information system. [All requirements are subject to possible modifications to reasonably accommodate individuals with disabilities. All duties and requirements are essential job functions.]  All requirements are subject to possible modifications to reasonably accommodate individuals with disabilities. Quest Diagnostics is an Equal Opportunity Employer: Women / Minorities / Veterans / Disabled / Sexual Orientation / Gender Identity.SDL2017"}