{"jobID": "2817705717", "jobLocation": "Washington_DC", "jobTitle": "Information Extraction/Retrieval Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.aquilent.com", "Headquarters": "Laurel, MD", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "127000", "jobDescription": "Employee Type: Full-Time Location: Washington, DC Job Type: Science Experience: Not Specified Date Posted:5/28/2018 About Us  At Booz Allen, we harness our collective ingenuity to solve our clients' toughest management and technology problems. We work with governments, Fortune 500 corporations, and not-for-profits around the globe, in industries ranging from defense to health, energy to international development. We believe there is no product, code, or strategy that can create progress-only people can. That's why for more than 100 years we've empowered our team: over 24,000 dreamers, drivers, and doers who work together to change the world. Job Description Job Number: R*******  Booz Allen Hamilton has been at the forefront of strategy and technology for more than 100 years. Today, the firm provides management and technology consulting and engineering services to leading Fortune 500 corporations, governments, and not-for-profits across the globe. Booz Allen partners with public and private sector clients to solve their most difficult challenges through a combination of consulting, analytics, mission operations, technology, systems delivery, cybersecurity, engineering and innovation expertise.  Information Extraction/Retrieval Data Scientist Key Role: Provide Scientific, Engineering, and Technical Assistance (SETA) support to the Government Program Manager (PM). Provide technical support for and apply expertise in information extraction, information retrieval, and human - in - the - loop interaction. Assimilate and integrate technical inputs from performers and analyze performers' technical deliverables and reports. Develop technical documents, briefing materials, and other program documents using Microsoft Office applications. Conduct independent reviews and summaries of related technical literature and emerging technologies and participate in conferences and workshops related to program technical areas. Develop and document testing methodologies and protocols, ensuring they align with program technology components and assess performer results against program metrics. Coordinate, align, and schedule technology development tasks across multiple performers, monitor and analyze performer technical progress in comparison to planned cost and schedule, and perform technical and programmatic risk analysis or review and tracking. This position is located in the Washington metropolitan area (WMA). Basic Qualifications:2+ years of experience with three of the following six fields: machine learning, deep learning, human language technology and HL T evaluation, natural language processing, collection and annotation of large - scale corpora, or program management support for a large research programAbility to manage multiple, concurrent tasks proactivelyAbility to obtain a security clearanceMA or MS degree in CS, Engineering, Mathematics, Statistics, Computational Social Science, or a related technical fieldAdditional Qualifications:2 years of experience in the intelligence community (IC), including requirements, CONOPS, and transitionExperience with managing a multi - agency, multi - disciplinary test and evaluation teamTS/SCI clearance with a polygraph preferred.MA or MS degree in CS, Engineering, Mathematics, Statistics, Computational Social Science, or a related technical field preferred; PhD in CS, Engineering, Mathematics, Statistics, Computational Social Science, or a related technical field a plusClearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.  Integrating a full range of consulting capabilities, Booz Allen is the one firm that helps clients solve their toughest problems by their side to help them achieve their missions. Booz Allen is committed to delivering results that endure.  We are proud of our diverse environment, EOE, M/F/Disability/Vet."}