{"jobID": "2771202139", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ucs-inc.com", "Headquarters": "Fairfax, VA", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Title Data Analyst EOE Statement We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law. About the Organization Universal Consulting Services, Inc. (UCS) is a rapidly growing Government contractor known for our expertise in health and IT solutions. Our driven, passionate professionals are catalysts for improving performance across all levels of Government. We have been recognized as one of Washington Technology's FAST 50 for our tremendous success as a woman-owned business, in addition to inclusion on Inc. Magazine's 5000 list of the fastest-growing companies in America for 2008. Our clients include, but are not limited to, the Department of Defense, Department of Justice, and Department of Treasury. DescriptionUniversal Consulting Services, Inc. is currently seeking a Data Analyst for a government client in San Antonio, TX. This successful candidate will be responsible for the following: Able to extract data from procurement systems, such as FPDS-NG and SPS/PD2, and develop reports to help customer track key performance indicators. These projects assist leadership in making informed decisions and become more efficient and effective in the use of their resources.Proficient with Microsoft Office productsAble to turn large data sets into useful information with minimal guidance.Design and prepare executive level reports with minimal guidance.Collaborate with customer to identify data sourcesAssist senior staff in conducting activity and data modeling, development of modern business methods, identification of best practices, and creating and assessing performance measurements. Position RequirementsQualifications required: Bachelor’s degree required; Master’s degree preferred3+ years of related experienceAbility to pass a background investigation and receive a Secret level clearanceMust be a US citizenQualifications preferred:Experience with federal and DoD acquisition processes, systems, and procurement data standardsExperience with healthcare processes and systemsMilitary experience Location San Antonio, TX Full-Time/Part-Time Full-Time Exempt/Non-Exempt ExemptThis position is currently accepting applications.Apply Now"}