{"jobID": "2803512571", "jobLocation": "Royal_Oak_MI", "jobTitle": "Guest Relations Assistant", "companyRating": "3.2", "companyInfo": {"Website": "www.detroitzoo.org", "Headquarters": "Royal Oak, MI", "Size": "201 to 500 employees", "Founded": " 1928", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "9", "jobDescription": " The Guest Relations Assistant is responsible for providing quality customer service to all guests of the Detroit Zoo. Service and service recovery must be provided in a professional, efficient, proactive, and safe manner. All employees must be committed to ensuring our guests have engaging, meaningful, and memorable experiences. Principal Duties and ResponsibilitiesWorks in various positions such as Customer Care, Wildlife Interpretive Gallery, Parking Lot, rentals, Tauber Family Railroad, Wild Adventure Ride and Theater, Giraffe Encounter, ticket taker and moreCarries out all assignments with the goal of providing guests engaging, meaningful, and memorable experiencesGreet visitors in a friendly, professional, welcoming manner and resolves guest complaints as able, and involving the supervisor if neededProvides information about facilitiesCollects admission parking, railroad, theater simulator, and event fees in the off seasonChecks cash register receiptsDirects visitors to various facilities and exhibitsDirects visitors to parking spacesAssists patrons boarding the Tauber Family RailroadAssists in locating lost childrenResponds to emergencies by notifying proper authorities and following instructionsMaintains premises in a clean and orderly condition, reporting malfunctioning equipment, wear and tear, damage, and theftDrives tractor trainHelps set up for special eventsResponds to customer needsAssists with crowd controlComplies with all federal, state, local, and organizational policies/proceduresWorking Conditions: Work locations are determined by season, event, and volume of visitors. Work is largely performed outdoors with exposure to all seasonal weather conditions and elements and on occasion, indoors in an office environment with some exposure to computer monitors. Physical Requirements: Able to perform the essential functions of various duties; walking and standing for long periods of time; stooping; kneeling; and bending; lifting up to 25 pounds. Work is light to medium. Knowledge, Skills, and Abilities (Minimum)Completion of High School Diploma or GEDMust have a positive, friendly, and social dispositionBe able to interact with the general public in a professional and efficient mannerMust be comfortable using a computer and a cash registerBasic math skills are requiredPreferred1-2 years of collegeOne year of experience in customer service or other activities involving positive contacts with the public0"}