{"jobID": "2834711769", "jobLocation": "Washington_DC", "jobTitle": "Director, Hub & Patient Services", "companyRating": "3.6", "companyInfo": {"Website": "www.horizonpharma.com", "Headquarters": "Lake Forest, IL", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (HZNP) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Abbott Labs, Pfizer, POZEN"}, "estimatedSalary": "134000", "jobDescription": "Working at Horizon Pharma is more than a job – it’s personal. We define success by a different set of numbers: the number of lives touched, the number of lives changed, the number of lives saved. We’re a team of agile, out-of-the-box thinkers who are inspired to do more because we know we’re a part of something bigger. We strive to build meaningful careers at a company whose values we share because when we live up to our potential, we help patients live up to theirs. The Director, Hub and Patient Services is responsible for all access and reimbursement services for patients enrolled at the Hub supporting Rheumatology. Working remotely from anywhere in the US, ideally from within the central region, this individual will lead and manage both the Hub and the Commercial Co-Pay assistance support programs, including all budgeting and contracting requirements. Additionally, the role entails the development and implementation of key service model initiatives and day to day operational management in order to maximize treatment access for patients and sustain growth objectives. Exceptional analytical and presentation skills are required.Responsibilities:Develop strategy and lead implementation to optimize access and reimbursement for patients considering or treated with KRYSTEXXADesign KPIs and levers for accountability that meet the needs of internal and external stakeholdersPartner with the managed care team to signal and address transactional and systemic payer challenges. Partner with patient access managers, sales and external hub partners to secure the best possible coverage outcome for patients and expedite treatment accessDevelop and implement patient support programs, including co-pay assistance, bridge and patient assistance programs; manage all associated Hub and Copay assistance budgets and contractingOversee quarterly business reviews with external hub. Recommend and oversee improvements and process changes to hub services contracts as necessary, within the scope of company compliance guidelines, to support patient and provider needsCreate presentations in support of business reviews for monthly meetings, executive committee presentations and board of director updates. Drive reimbursement track for sales meetingsMonitor and assess Hub and Copay vendor performance measures, staffing needs, and adjust when necessaryManage Hub hiring, training, coaching and development for dedicated staffBuild analytic capabilities that fulfill data insight requirementsMonitor daily case progress as well as weekly and monthly trends; ensure quality goals are achieved through regular performance auditsLead weekly Hub management call and provide regular business updates to access and sales leadershipQualifications and Skills Required:BA/BS in related field8+ years of experience in pharma/biotech experience working with complex access/service models5+ years of experienced in patient services/reimbursement; Hub design and/or management is preferredExperience working with multiple projects and managing multiple external vendorsDetail-oriented with demonstrated success improving processes from a quality and turnaround standpointUnderstanding of medical and pharmacy benefit designs, specialty pharmacy processes, buy and bill, prior authorizations and insurance appealsReimbursement experience is critical with numerous examples of problem solving and successful resolution of treatment challengesPossesses a firm understanding of Health Care laws and regulations such as HIPAAWillingness to travel (as much as 50%)Proficient in Microsoft OfficeProfessional demeanorSelf-starter attitudeStrong interpersonal and leadership skillsExcellent written and verbal communication skillsEssential Core Competencies:Action OrientedProblem SolvingOrganizationFunctional/Technical SkillsPriority SettingDrive for ResultsStrategic AgilityIntellectual HorsepowerDealing with AmbiguityCore Behaviors:Integrity and TrustComposureStanding AloneHorizon Pharma plc does not discriminate on the basis of race, color, religion, gender, sexual orientation, national origin, age, disability, veteran status, or any other characteristic protected by law. It is our intention that all qualified applications are given equal opportunity and that selection decisions be based on job-related factors. Any individual, who, because of a disability, needs accommodation or assistance in completing this application or at any time during the application process, should contact the Human Resources Department."}