{"jobID": "2745758801", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist, Enterprise SaaS Data Systems", "companyRating": "2.7", "companyInfo": {"Website": "www.inseego.com", "Headquarters": "San Diego, CA", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Public (INSG) ", "Industry": " Telecommunications", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " FleetMatics, CalAmp, NETGEAR"}, "estimatedSalary": "105000", "jobDescription": " We are seeking a seasoned data science expert to help drive innovation and make an impact within the world of health. As a Data Scientist youll be responsible for individual data science work. Youll be working to solve complex problems using large datasets and an array of advanced data science technology. Every day, youll be working alongside energizing product teams that are eager for your insights that solve our customers most pressing problems. Responsibilities:Design, analyze, develop, test, and deploy complex analytical models into enterprise data systems. Perform each task as needed for data science projects as an independent contributor.Demonstrate in-depth knowledge of data science and statistics. Perform as the data science liaison and subject matter expert.Apply creative and unconventional thinking with standard industry best practices to solve challenging and unique business problems.Transform business goals into hypotheses and tangible data mining goals. Plan and execute experiments.Collaborate with other business stakeholders to define business problems and to design solutions using advanced analytics.Leverage software development principles and break down tasks into measurable time specific milestones.Enhance architecture and systems to improve processes, refresh technical capabilities, and ensure that deliverables are state-of-the-art. Implement new tools and new approaches to achieve better outcomes.Complete documentation, business reports, white papers, and technical/statistical assessments.Qualifications:Masters degree in Data Science, Predictive Analytics, Engineering, Mathematics, Statistics, Computer Science, or related field with graduate level coursework in machine learning.Minimum of eight years of experience building and applying predictive models and programming using statistical software. R language preferred.Proven knowledge of statistical techniques and data science is required.Minimum of eight years of experience manipulating large datasets and using database tools and programming languages (SQL, Hive, Impala, Spark). A solid understanding of relational database concepts is required.Ability to quickly understand new concepts and implement novel designs to advanced data science problems.Ability to conduct research on new algorithms and implement in ways that create customer value.Strong business acumen.Strong interpersonal and communication skills (both written and oral) including the ability to communicate complex technical/statistical concepts to a non-technical audience.Strong candidates are creative, innovative, and have intellectual curiosity.Inseego is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion (including religious dress and grooming), sex/gender (including pregnancy, childbirth, related medical conditions or breastfeeding), gender identity, gender expression, national origin, ancestry, age, physical or mental disability or legally protected medical condition, family care status, military or veteran status, marital status, sexual orientation, genetic information, or any other protected classification under federal, state and local law."}