{"jobID": "2827375263", "jobLocation": "Alexandria_VA", "jobTitle": "TS/SCI Cleared Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.xts-inc.com", "Headquarters": "Haymarket, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data Scientist Location: Springfield, VA Security Clearance Requirement: TS/SCI  Xcellent  Technology Solutions (XTS) is seeking a TS/SCI cleared Data Scientist to  support our intelligence client in Springfield, VA. The candidate  will work closely with other  personnel and mission users who support the TCPED process and are investigating  the use of complex data sets to drive solutions and/or tradecraft  developments against KIQs and mission requirements. Skills and Experience:Required ·  TS/SCI Security  Clearance  ·  Spatial  and non-spatial database and data modeling knowledge (e.g., PostgreSQL, PostGIS,  Accumulo, GeoWave, MongoDB, Oracle/Spatial)  ·  Ability  to write scripts in Python, R, C++ and other appropriate languages and tools for modeling  processes, repeatability, efficiency, knowledge capture, hypothesis testing and  process automation for data mining and modeling techniques.  ·  Creation  of Data Stories Document and visualize data both temporally and spatially to assist in  data integrity checks, and display analytical assessments.  ·  Use  statistical, mathematical, machine learning, and other relevant concepts and techniques to  solve complex GEOINT analysis issues and understand concepts associated  with structured data and relational databases  ·  Expert  with Microsoft Applications (Excel, Power Point, SharePoint, SharePoint Designer,  InfoPath, Visio)  ·  Ability  to pull, compare, contrast, merge, extract, research, de-conflict, extrapolate, and portray  data, geospatially, from multiple customer and IC databases  ·  Knowledge  of web services protocols, including but not limited to Open Geospatial Consortium  (OGC) and ESRI REST services  ·  Knowledge  and experience performing big data analysis and streaming data analysis techniques  using open source big data and scripting frameworks including but not limited to  Spark, Jupyter Notebooks, and R Desired: ·  Demonstrated ability to  discover and implement automated process improvements and solutions for the  discovery, preparation, manipulation, and normalization of big data.  ·  Previous experience  supporting DoD and IC entities. Company DescriptionAbout XTS: Xcellent Technology Solutions (XTS) is an 8(a) & Service Disabled Veteran  Owned Small Business operating along 3 primary lines: Geospatial Analysis,  Enterprise Facilitation, and Software Enabled Data Sciences. XTS  holds ISO certifications in GEOINT Tradecraft, Federal Procurements, Corporate  Communications, Data Analytics, Open Source Reporting, and Software  Development. With Corporate Headquarters in Haymarket, VA ; XTS provides  on and off site support in Virginia , Missouri, and Colorado to the federal  government with an emphasis on Intelligence Services. XTS holds a TS/SCI  Facility clearance and is an 8(a) STARS II Prime Contractor. Company Culture and Benefits: XTS offers highly competitive salaries combined with an excellent  individualized benefits package such as gold plated health care packages, 401K  plan, and competitive positioning among other benefits. As a service provider,  we recognize that our employees skills and time is our product which is why we  strive to position each employee in a path that offers mastery, purpose, and  opportunity. We bring mission focused management who place the focus on your  needs so that you can grow professionally and take care of our clients.  · We  cover 100% of the premium for all Health, Dental, Vision and  Life Insurance for you, your spouse and your dependents.  · Gold-plated  health insurance meaning low deductibles and great coverage.  · 20  days (4 weeks) of Paid Time Off in addition to all 10 paid Federal Holidays.  · 401K  plan that allows our employees to choose between a traditional 401K, Roth 401K,  or a combination of 401K plans."}