{"jobID": "2731496972", "jobLocation": "Washington_DC", "jobTitle": "Sr. Manager Technology", "companyRating": null, "companyInfo": {"Website": "www.caqh.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The  Senior Technology Manager is the development interface between internal product  managers and external solution providers, responsible for the creation and the  enhancement of innovative solutions that transform the healthcare system. The Senior Technology Manager reports to  CAQH Solutions’ Director of Technology; the position is full time, exempt. RESPONSIBILITIESApplication Development – Define and confirm technical requirements; guide vendor  application developers and manage the development of complex program  modules from general specifications. Oversee all phases of an agile SDLC with  vendor development teams.Demand Management – Partner with the business to proactively anticipate,  prioritize, and integrate new project requests. Work with the business to  prioritize new or competing IT demands and set delivery standards.Roadmap Support - Engage with business and product teams to collaboratively position  the CAQH product portfolio for the future.IT Operations – Provide IT operations support, execute quality assurance  testing, and develop operations capacity plans. Provide a voice to business  needs; liaise/interface with all technology vendors (e.g. call center, business  operations).Technology Innovation – Maintain uniform and current IT practices, advise on IT  concepts, and foster innovation. Facilitate the  design, installation, modification, and operation of information systems  initiatives.Project Management – Manage technology projects efficiently and effectively by  thoughtfully considering the factors of approach/integration, scope, time,  cost, quality, people, communications, risks, and procurement. Ensure that  projects stay on schedule and budget by managing scope/risks and minimizing  rework.KNOWLEDGE,  SKILLS AND ABILITIESDemonstrated in-depth understanding of relevant and up-to-date  technologies (including .NET framework), applications and platforms; experience  solving business problems using these technologiesAbility to translate functional requirements and design  specifications into technical specifications and effectively communicate  verbally and in written form.Demonstrated analytical mindset with ability to troubleshoot and  creatively solve business and technical problems across multiple companies and  stakeholders.Ability to meet development scope, schedule and budget  commitments.Ability to develop and maintain strong, effective relationships  across the organization and its solution partners.Demonstrated capability to manage remote (potentially off-shore)  development teams.Ability and aptitude to serve as a key technical resourceAbility to work collaboratively and effectively across matrix  organizations in a fast-paced, schedule-driven and entrepreneurial environment.Ability  to communicate clearly and concisely with business and technical stakeholders.EXPERIENCE7+ years designing, developing and delivering IT applications,  preferably in the healthcare industry.4+ years leading development teams with Agile Development and off-shore  team experience.EDUCATIONBachelor’s  degree required; Computer Science, Engineering or related fields.WHO WE ARE Named one of Modern Healthcare’s Best Places to Work in 2016  and 2017, CAQH, a non-profit alliance, is the leader in creating shared  initiatives to streamline the business of healthcare. Through  collaboration and innovation, CAQH accelerates the transformation of business  processes, delivering value to providers, patients and health plans. COB Smart® quickly and  accurately directs coordination of benefits processes.EnrollHub® reduces costly  paper checks with enrollment for electronic payments and electronic remittance  advice.CAQH ProView® eases the  burden of provider data collection, maintenance and distribution.DirectAssure® increases  the accuracy of health plan provider directories.VeriFideTM streamlines  credentialing by consolidating and standardizing primary source verification.SanctionsTrack® delivers  comprehensive, multi-state information on healthcare provider licensure  disciplinary actions.CAQH CORE® maximizes business  efficiency and savings by developing and implementing national operating rules.CAQH Index® benchmarks  progress and helps optimize operations by tracking industry adoption of  electronic administrative transactions.WHAT YOU GET CAQH recognizes  that its most important asset is its growing team of smart, creative,  collaborative, forward-thinking and passionate professionals – and that a  comprehensive employee benefits package is an important factor for them in  choosing where to work. CAQH offers competitive compensation along with an  extensive benefits package for all full-time employees, including medical,  dental and vision coverage, tuition assistance and a 401k. Our location in  downtown Washington, DC is metro-accessible, has an onsite fitness center and  is centrally located to allow our team to take advantage of professional  networking opportunities, cultural offerings and a thriving social scene."}