{"jobID": "2838208159", "jobLocation": "Sunnyvale_CA", "jobTitle": "Supply Chain Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.netapp.com", "Headquarters": "Sunnyvale, CA", "Size": "10000+ employees", "Founded": " 1992", "Type": " Company - Public (NTAP) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " EMC, Nimble Storage, Pure Storage"}, "estimatedSalary": "101000", "jobDescription": " Job Summary  As a Supply Chain Data Analyst (Operations Program Manager 3), you play a lynchpin role in developing and incorporating analytics into NetApp’s operations supply chain planning decisions and processes. Working cross functionally you identify, develop and roll out high leverage analytics for use in decision making impacting hundreds of millions of dollars in operations material spend. You perform data analysis and provide consultation on innovative techniques for mining and leveraging data. Strong understanding of supply chain/operations, along with strong technical and analytical competencies and communication skills are keys to success in this role.  Your work in driving and enriching the use of analytics within NetApp’s planning function will lead to measurable advances in the company’s forecast accuracy and financial performance. This is a key role.  Job Requirements  -  Essential Functions: Identify key opportunities to introduce or enrich the use of analytics in NetApp’s ops planning decisions.Conduct analysis with large sets of data to gain deep business insights and aid in executive decision making.Work cross-functionally to drive adoption, standardize and operationalize these new analyses.Provide consultation on the use of innovative techniques to improve decision making.Develop, create and deliver impactful communications to stakeholders. Requirements: Excellent oral and written communication skills; including presentation skills.Ability to work collaboratively within a team environment to meet goals and measurement criteria.Strong analytical skills.Knowledge of supply chain processes, and operations planning.Experienced user of data analysis SW, as well as Microsoft Office.Creative approach to problem solving. Responsibility: Work with operations planning and adjacent teams to identify places where analytics can add significant value.Develop analytics to address these opportunities.Work within operations planning and across teams to operationalize the use of these analytics.Demonstrate good judgment in solving problems as well as identifying and framing problems in advance and proposing solutions. Interaction: This individual must work effectively with Staff to Vice President level employees within the function, and across functions.Ability to operate, drive results and set priorities somewhat independently.The ideal candidate will be a proactive contributor and subject matter expert. To be successful, this individual must demonstrate favorable results through influencing others.  Education  3 + years of experience is required.  A Bachelor’s degree in an analytic discipline is required; a graduate degree in an analytic discipline is preferred.  Has successfully completed multiple data analytics projects within industry and preferably within supply chain."}