{"jobID": "2816166154", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Managing Editor, Child Care", "companyRating": "4.0", "companyInfo": {"Website": "www.care.com", "Headquarters": "Waltham, MA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Public (CRCM) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " Care.com is the largest and fastest-growing technology platform for online care services, helping families, businesses, and corporate employees find high-quality care for their kids, pets, parents, and homes. We’re seeking innovative, entrepreneurial people to join our collaborative team. A career at Care.com offers countless opportunities to grow professionally and make a significant impact on a growing company. Overview We’re seeking an experienced editor to oversee our parenting and child-care vertical. This person will be in charge of driving engaging content strategy for both parents and child-care providers, our largest audience on Care.com.  This is a leadership role that requires activating and nurturing audiences, managing an editorial calendar, assigning and editing articles, scaling a team of world-class editorial contributors, and overseeing distribution and engagement of content. This is a unique opportunity for an entrepreneurial-minded journalist to take ownership of a digital portfolio in one of the fastest-growing fields in the country.  You’ll join a team of innovative editors and technologists striving to revolutionize the way we find – and provide – help for our families. With over 10 million members, Care.com is the largest online marketplace for finding and managing child care, senior care, pet care and home care, and provides meaningful work for millions of care providers around the world.  You should be an enthusiastic editor who has a keen eye for quality and a penchant for trying new things. Responsibilities:Develop and drive content strategy aligned to child-care business prioritiesManage content operations, from ideation to publicationCultivate and oversee a team of top-talent contributors to produce best-in-class contentServe as a subject matter expert within the childcare space, and represent Care.com as a thought leader in the industryLeverage Care.com’s data to create compelling data-driven articles and content packagesDevelop new content formats and channels to activate and engage usersDrive distribution and engagement of content, including social strategy, syndication and more Required SkillsExperience & Skills:8-10 years of experience writing and editing in a deadline-driven environment; at least 3 years’ experience covering parenting, child care or a related field preferredExperience managing a team of freelance writersExcellent news judgement and editorial sense, and a flair for building and developing an audienceExperience leveraging distribution channels such as social media and newslettersProven multi-tasking capabilities, with the ability to prioritize needs and collaborate with a broad set of stakeholdersExceptional communication skills, whereby you can clearly articulate a vision/strategy and serve as an external spokespersonCare.com Since launching in 2007, Care.com (NYSE:CRCM) has been committed to solving the complex care challenges that impact families, caregivers, employers, and care service companies. Today, Care.com is the world’s largest online destination for finding and managing family care, with 16.2 million families and 12.2 million caregivers* across more than 20 countries, including the U.S., UK, Canada and parts of Western Europe, and approximately 1.3 million employees of corporate clients having access to our services. Spanning child care to senior care, pet care, housekeeping and more, Care.com provides a sweeping array of services for families and caregivers to find, manage and pay for care or find employment. These include: a comprehensive suite of safety tools and resources members may use to help make more informed hiring decisions - such as third-party background check services, monitored messaging, and tips on hiring best practices; easy ways for caregivers to be paid online or via mobile app; and Care.com Benefits, including the household payroll and tax services provided by Care.com HomePay and the Care Benefit Bucks program, a peer-to-peer pooled, portable benefits platform funded by household employer contributions which provides caregivers access to professional benefits. For enterprise clients, Care.com builds customized benefits packages covering child care, back up care and senior care consulting services through its Care@Work business, and serves care businesses with marketing and recruiting support. Headquartered in Waltham, Massachusetts, Care.com has offices in Berlin, Austin and the San Francisco Bay area.  *As of March 2018 Care.com supports diverse families and communities and seeks employees who are just as diverse. As an equal opportunity employer, Care.com recognizes the power of a diverse workforce and encourages applications from individuals with varied experiences, perspectives, and backgrounds.Required Experience  Job Location  San Francisco, US-CA "}