{"jobID": "2730470908", "jobLocation": "San_Francisco_CA", "jobTitle": "Retail Sales Agent", "companyRating": null, "companyInfo": {"Website": "www.acceptanceinsurance.com", "Headquarters": "Nashville, TN", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Public (FACO) ", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " The General, Infinity Property & Casualty, Direct General"}, "estimatedSalary": null, "jobDescription": " OverviewAre you looking for a retail sales position that offers great earnings potential without the late night and Sunday hours? Want to find a team atmosphere where you can grow as an individual as well?  If you enjoy working with the public, are sales oriented, outgoing, professional, detail-oriented and looking for a career opportunity then Acceptance has an opportunity for you. Acceptance Insurance has an immediate opening for a Retail Sales Agent at our San Francisco, CA - El Camino Real location. Overview of a Retail Sales Agent: As a Retail Sales Agent, you will be responsible for the sale of auto, commercial, motorcycle and home insurance products to new and existing customers. Acceptance believes in providing trusted business advisers for our customers and will support you with a full training program and agent mentors as you build your experience. Lastly, you will be an ambassador of the company’s mission, vision and values.  As a Team Member at Acceptance Insurance, you will be part of growing organization that continues to evolve and positively impact the lives of our customers. Benefits of a Retail Sales Agent:Guaranteed Based PayAnnual Achievement Incentative BonusMonthly Add-On Incentive BonusOffice Hours:Monday – Friday 9 am – 6 pmSaturday 10 am – 5 pm As a Team Member at Acceptance Insurance, you will be part of growing organization that continues to evolve and positively impact the lives of our customers.  Acceptance Insurance offers a full line of benefits including: Health Insurance, Dental, Vision, Paid Vacation, Disability Insurance and Employer Matching 401(k) Program. Company Overview: We are principally a retailer, servicer and underwriter of non-standard personal automobile insurance based in Nashville, Tennessee. Our insurance operations actively generate revenues from selling non-standard personal automobile insurance policies and related products in 16 states. We currently conduct our servicing and underwriting operations in 13 states and are licensed as an insurer in 13 additional states.  At March 31, 2017, we leased and operated 355 retail locations and a call center staffed with employee-agents. Our employee agents primarily sell non-standard personal automobile insurance products underwritten by us, as well as certain commissionable ancillary products. In most states, our employee-agents also sell a complementary insurance product providing personal property and liability coverage for renters underwritten by us. In addition, retail locations in some markets offer non-standard personal automobile insurance serviced and underwritten by other third-party insurance carriers for which we receive a commission. Learn more: Visit us at www.acceptanceinsurance.com Acceptance Auto Insurance:Employment ApplicationWE ARE AN EQUAL OPPORTUNITY EMPLOYER. Applicants are considered for position and are evaluated without regard to mental or physical disability, race, religion, sexual orientation, color, gender, national origin, age, marital status, military or veteran status or any other protected local, state or federal status unrelated to the performance of the work involved.ResponsibilitiesResponsibilities of a RetailSales Agent:Assess the customer needs and advise clients on insurance coverage and personal protection options.Provide quotations, pricing, and required information to new prospects. and complete the sales process for each customer.Develop and maintain relationships with business partners around the community (i.e. auto dealerships, standard insurance agents, payday loan businesses, financial companies, etc).Perform outside marketing activities to drive new customer opportunities.Prepare quotations on customer change requests to their current policies.Receive and respond to all customer inquiries and complaints. Request any missing or required information from customers and follow up for that information.Maintain strong knowledge of all company products, pricing, and policy features.Maintain knowledge of industry competitors and provide critical market feedback to leadership regarding local competition and service needs.Follow-up routinely with customers on all open or unresolved issues including calling lapsed policy and policy renewal customers.Answer the telephone in a prompt, professional and courteous manner.Report any and all conditions affecting customer satisfaction.Maintain appropriate records including, but not limited to; all time worked, reporting of sales activities, other reporting as required by Regional Manager or Corporate Office.Maintain the office setting to best represent the Acceptance brand. QualificationsQualifications of a RetailSales Agent:Six months previous professional experience in sales required.Above average communication skills in order to represent the company in a professional manner and communicate effectively with potential customers.Previous experience with Excel, Word and web based systems preferred.Experience with and the ability to use a PC to perform daily duties.Must be detail oriented and accurate and have the ability to work independently following strict procedural guidelines.Work schedule may fluctuate based on business need and will include evening and weekend hours and some Holidays.An insurance license is required in order to work in this position. The successful candidate must possess the ability to obtain and retain a Personal Lines insurance license. Acceptance Insurance pays 100% of the cost to obtain your license upon joining the company."}