{"jobID": "2796306928", "jobLocation": "Torrance_CA", "jobTitle": "Data Reporting Analytics Manager – Financial Services – Torrance, CA/ North Texas", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Reporting Analytics Manager – Financial Services – Torrance, CA/ North Texas  DATE 26 Aug  LOCATION Torrance  COMPENSATION Competitive  KEY SKILLS  DESCRIPTION SALARY RANGE OR SPECIFIED NUMBER + BONUSCompetitive Salary and packageSUMMARYGQR are currently recruiting for an experienced Data Reporting Analytics Manager for a Financial Services client currently based in Torrance, CA. The organization is looking for individuals that acquire strong business acumen along with subject matter expertise within Data Warehousing, ETL, Reporting and Big Data.JOB DESCRIPTIONRole ResponsibilitiesActively drive the management support of Data, Reporting and Analytics Consult and collaborate with the BI Managers to ensure successful program implementations and ongoing support. Ensure successful design, development and implementation in alignment with the organization’s strategy and overall execution approach. Review all designsEssential SkillsA minimum of 15 years working within IT across Data Warehousing, Reporting and Analytics The ability to manage several initiates at once Ample knowledge of data engineering best practice Strong leadership capabilities – the ability to manage onshore and offshore teams is essential Strong background/ knowledge of Data Warehouse applications (Netezza), ETL (Informatica), Reporting (OBI) and Big Data IBM (BigInsights) Bachelor’s DegreeCompensation: Market RateStart Date: ASAPLength: PermanentLocation: Torrance, CA – to relocate to North Dallas in 2017This is a superb opportunity for a Data Reporting Analytics Manager to work at a highly renowned Financial firm. The organization has a fantastic reputation and has very exciting growth plans and so it is an ideal time to join their team. Apply now by sending an up to date CV and cover note to Trish Patel at Trishna.patel@gqrgm.comIf you are interested in learning more about this position please contact Trishna.patel@gqrgm.com or call Trishna Patel on 917 200 0747. CONTACT APPLY | fintech.americas@gqrgm.comVISIT US | While a resume is preferable we also welcome tentative enquiries from well-qualified persons. Utmost confidentiality and discretion is assured.LONDON | 0203.141.8000Westminster Tower, London SE1 7SP| Office Hours: 8.00-20.00 GMTLOS ANGELES | 1.310.807.5030631 Wilshire Boulevard, Santa Monica, CA 90401 | Office Hours: 7.00-20.00 PDTNEW YORK | 1.212.763.8333340 Madison Avenue, New York, NY 10173 | Office Hours: 8.00-20.00 EDTHONG KONG | 852.3678.67382 Exchange Square, 8 Connaught Place, Central | Office Hours: 9.00-21.00 HKTGQR Global MarketsWe are committed to protecting and respecting your privacy. Information on our privacy policy, together with our terms of business are available at www.gqrgm.com.For the latest vacancies, please join our group on LinkedIn: http://www.linkedin.com/groups?gid=1615777&trk;=myg_ugrp_ovr While a resume is preferable we also welcome tentative enquiries from well-qualified persons. To speak with an agent please contact one of our regional offices. Utmost confidentiality and discretion is assured. "}