{"jobID": "2545515217", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.cia.gov", "Headquarters": "Langley, VA", "Size": "Unknown", "Founded": " 1947", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": " Data ScientistData Scientist12938/careers/opportunities/science-technology/data-scientist.htmlAdd to Job CartRemove From Cart12938Work Schedule: Full TimeSalary: $62,338 - $119,794*Location: Washington, DC metropolitan area*Higher starting salary possible depending on experience level Data Scientists organize and interpret Big Data to inform US decision makers, drive successful operations and shape CIA technology and resource investments. Data Scientists work with advanced hardware, software, and techniques to develop computational algorithms and statistical methods that find patterns and relationships in large volumes of data. They clearly communicate their conclusions to a lay audience and become experts through Agency-sponsored continuing education, attendance at academic and technical conferences, and collaboration with the Intelligence Community.  Through CIA's global mission, the Agency has access to unique data sets that can be analyzed in one computational environment. Successful applicants will have keen technical insight, creativity, initiative, and a curious mind. Offices of the CIA - Directorate of Digital Innovation The Directorate of Digital Innovation (DDI) is at the forefront of defining the future of digital expertise within the CIA. DDI focuses on developing the workforce with cutting-edge skills, investing in IT infrastructure, and modernizing the way the Agency does business. DDI officers help accelerate the integration of innovative methods and tools to enhance the CIA's cyber and digital capabilities on a global scale and ultimately help safeguard our nation. Learn more about the Directorate of Digital Innovation Life at CIA: In addition to a comprehensive benefits package, the CIA offers exciting career opportunities and a dynamic environment. We're on the forefront of world-altering events - as they happen. So working here isn't just a job, it's a mindset and a lifestyle. Minimum Qualifications:Bachelor's degree in any area, but with experience in data analytics, computer science, mathematics, statistics, economics, operations research, computational social science, quantitative finance, engineering or other data analysis fieldsGPA of at least 3.0 on a 4.0 scaleExperience with real world data through thesis research, internships, or work experienceDemonstrated creativity, initiative, and leadership abilitiesDesired Qualifications:Master's degree in a data science equivalent field or sub-fieldExperience working with data rich problems through research or programsExperience with computer programmingAbility to successfully complete projects with large or incomplete data sets and provide solutionsThe following items must be attached to your on-line application (PDF format preferred):Your resume.A cover letter in which you specify your qualifications for one or more positions.Unofficial transcripts for all degrees.A writing sample, five (5) pages MAXIMUM, single spaced, technical or analytic paper that focuses on your current area of expertise or interest and is related to your interest in positions at CIA. You can excerpt longer papers.ALL POSITIONS REQUIRE RELOCATION TO THE WASHINGTON DC METROPOLITAN AREA. All applicants must successfully complete a thorough medical and psychological exam, a polygraph interview, and an extensive background investigation. US citizenship is required.  To be considered suitable for Agency employment, applicants must generally not have used illegal drugs within the last twelve months. The issue of illegal drug use prior to twelve months ago is carefully evaluated during the medical and security processing. Important Notice: Friends, family, individuals, or organizations may be interested to learn that you are an applicant for or an employee of the CIA. Their interest, however, may not be benign or in your best interest. You cannot control whom they would tell. We therefore ask you to exercise discretion and good judgment in disclosing your interest in a position with the Agency. You will receive further guidance on this topic as you proceed through your CIA employment processing. To Apply: Save the position(s) that interest you in the job cart. You can add up to four (4) positions. Job cart selections will only be retained during this site visit, so be sure to click “Apply Now” before closing the browser window. After clicking \"Apply Now\" you will be taken to the application account creation page. The positions will appear in the cart once you have created an account. DO NOT submit multiple applications; this will only slow the review of your application and delay processing. Please read the Application Instructions carefully before you begin the online application process.  Application Instructions  An equal opportunity employer and a drug-free work force."}