{"jobID": "2833577951", "jobLocation": "Palo_Alto_CA", "jobTitle": "NLP Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.parc.com", "Headquarters": "Palo Alto, CA", "Size": "201 to 500 employees", "Founded": " 1970", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " SRI International, SAIC"}, "estimatedSalary": "144000", "jobDescription": " Knowledge extraction from unstructured text About the Job PARC's Interaction and Analytics Lab is offering a position for an on-going project that requires the extraction of knowledge from unstructured documents using modeling and techniques from Natural Language Processing, Machine Learning, and Deep Learning. The focus of the effort is on understanding the text of business documents. The project includes general NLP and ML techniques plus analyzing the information content in an initial corpus to identify informational elementsstructuring logical forms to represent information appropriatelyestablishing goals for the system and evaluating how well the system meets those goals Candidates must have experience with knowledge extraction and knowledge representation that incorporates entities and the relations between them.  Responsibilities include: Create knowledge extraction systemDevelop computational models of language that is readable and appropriate for the domainPrepare training and testing dataWork with other researchers to understand and integrate with the overall system Requirements: Masters degree in computer science or related fieldExperience in machine learning, text analysis, and NLPExperience in algorithm design and modelingExperience designing and working with ontologiesProgramming skills in Java, Python, or similar languageBenefits We offer a very competitive salary package and full benefits (medical, dental, vision, life & disability insurance, 401K. PARC also strives for the best possible work-life balance, so employees benefit from maternity, paternity and adoption leave, as well as a variety of flexible working options. PARC employees enjoy the use of onsite health & fitness center and collegial dining at our onsite cafeteria. The PARC campus is in a spacious modern building in close proximity to the resources and opportunities of Silicon Valley and benefits from nearby leading universities such as Stanford and Berkeley. It is also close to many amenities, top schools, and outdoor activities (see http://www.parc.com/about/culture.html). PARC provides a highly diverse environment and is proud to be an equal opportunity employer (see http://www.parc.com/about/careers/). About PARC PARC, a Xerox company, is in the Business of Breakthroughs®. Practicing open innovation, we provide custom R&D; services, technology, expertise, best practices, and intellectual property to Fortune 500 and Global 1000 companies, startups, and government agencies and partners. We create new business options, accelerate time to market, augment internal capabilities, and reduce risk for our clients.  Since its inception, PARC has pioneered many technology platforms from the Ethernet and laser printing to the GUI and ubiquitous computing and has enabled the creation of many industries. Incorporated as an independent, wholly owned subsidiary of Xerox in 2002, PARC today continues the research that enables breakthroughs for our clients' businesses.  PARC is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. People with disabilities who need a reasonable accommodation to apply or compete for employment with PARC should contact PARC Human Resources."}