{"jobID": "2784046116", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Associate Research Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "The responsibilities for the successful candidates: Provides guidance and feedback to drug development teams and regulatory functions in responding to health authorities worldwide  Transfers methods to development and commercial lCompany around the world  Collaborates with formulation and manufacturing colleagues in order to optimize processes and improve productivity.  Conducts testing as per assigned technique and methods.  Documents work in laboratory notebooks and other systems and as per GMPs and department SOPs.  Acquires, reviews and/or approves in GMP compliant manner, data related to methods development and testing of GMP and development materials. Prepares reports for methods, validation, and technology transfer.  Sustains up to date knowledge on applicable department and site standard practices related to GMPs, safety and controlled substances as appropriate to work.  Provides input, and may author standard practices.  Assists in purchase and implementation of new technology  Participates in laboratory investigations/inspections.  Conducts Microbiology Investigations and implement CAPAs as needed  Serves as a member of interdisciplinary development teams, providing scientific and operational input to development plans  Drafts responses and corrective actions to internal compliance questions related to their work.  Writes and revises SOPs, WIs and Methods as needed.  Writes and implement change controls.  The qualified individual will have the following background  Bachelor Degree in Microbiology or related scientific discipline with 3 to 7 years experience in pharmaceutical microbiology.  Good communication skills, both written and verbal, are required.  Experience with bacterial endotoxin test, bioburden and sterility, with in-depth understanding of the method, and possible interferences  Experience with instrument qualifications in a microbiology environment is a plus.  Knowledge of basic compendial microbial test methods is also a plus.  Demonstrated ability to solve non-routine analytical issues and provide guidance to laboratory and external colleagues"}