{"jobID": "2797057650", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.shorepointinc.com", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " 2017", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description ShorePoint is a cybersecurity services firm with a focus on high-profile, high-threat private and public-sector customers who demand experience and proven security models to protect their data. We are seeking an exceptional candidate to serve as a Data Analyst on our team to support multiple federal agencies through the CDM Program. The CDM Program is a high-profile, high-visibility, cybersecurity modernization and risk management program where you can contribute innovative solutions. This is a unique opportunity to shape the growth, development and culture of an exciting and emerging company in the cybersecurity market. Roles and ResponsibilitiesOperate and provide Tier 2 support for an RSA Archer based dashboardEnsure source data feed and source data quality from Splunk to RSA Archer dashboardAccomplish Extract, Transform, and Load operations to retrieve enrichment content from existing hardware, software, system boundary inventories. Direct that content to import facilities of Splunk, McAfee ePO, or ForeScout CounterActHelp to ensure that only summary level data is being sent from the client level CDM Dashboard to the Federal CDM DashboardConduct appropriate analysis and ensure calls that are unable to be resolved are appropriately forwarded to the Tier3 Support Support the following: Provide initial problem resolution where possibleGenerate, monitor, and track incidents through resolutionProvide software supportMaintain frequently asked questions and their resolutionsObtain customer feedback and conduct surveysContribute technical input to CDM Dashboard TrainingDefines, plans, designs, and evaluates information security systemsAssess architecture and current hardware limitations, defines and designs system specifications, input/output processes and working parameters for hardware/software compatibilityPerforms a variety of complex tasks associated with information security ranging from the design of security components to complex architecturesSupervises the work of other engineers performing a variety of information security tasks. Capable of independent program supervision.Required SkillsMinimum 3 years of information technology experienceFamiliarity with the NIST 800 publications governing the FISMA ActExperience with dashboard or Security Information Event Management (SIEM) systems, including ingest of third- party data for rendering within the dashboard or SIEMAbility to manipulate data in order to conduct sound and accurate analysis regarding outputAbility to learn and assist in managing DHS-specific Compliance dashboards and applicationsMust be proficient in developing and presenting, both verbally and in writing, highly technical information and presentations to non-technical audiences at all levels of the organization. Audiences for this information include, but are not limited to, senior executives at DHS and other Components.Familiarity with ITIL Service Desk principals or experience as a Tier 2 or Tier 3 support technicianExperience with basic IPv4 local area networking concepts like subnet masking, switches, routers, gateways Requires 1+ year of experience with at least two of the following technologies:  Splunk Data manipulation technology or scripting language – SQL, PowerShell, Python, Regular Expressions RSA ArcherSecurity Content Automation Protocol (SCAP)Asset Summary Reporting Format (ASR)McAfee ePODesired SkillsCertification: Technical security certifications are recommendedSplunk, Archer, or Solution Development language certificationSecurity Clearance Must be clearable to DHS EOD. Secret clearance preferred"}