{"jobID": "2790098107", "jobLocation": "Midland_TX", "jobTitle": "Analyst, Senior Data - Completions", "companyRating": null, "companyInfo": {"Website": "www.diamondbackenergy.com", "Headquarters": "Midland, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public (FANG) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job SummaryTitle: Senior Data Analyst, CompletionsLocation: Midland, TexasResponsibilities: The Senior Data Analyst will use digital tools and analytics to provide insights that advance Diamondback's Completion operations. The ideal candidate will develop reports and dashboards for the engineering staff and help the team build and grow its analytical capabilities.  Candidates must have a strong foundation in master data management, data platform architecture, analytics, and visualization tools. Candidates must also have the ability to work with the Completions team to identify reporting requirements and fulfill those requirements through the use of available data platform technologies covering data extraction and translation, integration, warehousing, presentation, and visualization. Success in this role requires not only strong data manipulation and analytical skills but also strong communication skills, project management skills, initiative and demonstrated experience with cross functional teams. Knowledge, Skills and Attributes:Accumulate, maintain and effectively organize engineering data sets from multiple sources for engineering analysis.Provide advanced technical and data analytics support to engineering staff.Willing to assume the role of completion data analyst and completion data warehouse analyst.Plays a leadership role in development of data visualization tools for enhanced optimization of completion parameters that tell the analytical story.Plays a leadership role in developing more accurate and reliable data analyses and reporting methodologies.Responsible for loading/entering, verifying, manipulating, analyzing, and reporting data.QC accuracy of well completion data, take appropriate action on any changes, and communicate required corrections to the necessary parties.Provides user support for software systems to other technical support and professional personnel, including installation and maintenance of software and troubleshooting user problems.Works well independently or with a team to perform more complex data analyses.Primarily interfacing with completions operations and resource development teams.Minimum Qualifications:Bachelor's Degree in quantitative field such as computer science, technology, engineering, or statistics.Minimum of 7 years of experience in a data analytics role, 10 or more years preferred.Knowledgeable on Oil and Gas Completion Engineering data types – Stimulation data, WellView, FracFocus, etc.Intermediate to advanced proficiency with data analytics and visualization tools (preferably TIBCO Spotfire).Ability to write and troubleshoot SQL and PL/SQL database objects (Oracle a plus).Basic skills associated with HTML, CSS, JavaScript, .NET and Visual Studio.Proficiency in at least one coding language (Python or R).Experience with ETL and data warehousing a plus.Familiarity with Microsoft tools including SSRS, SSAS, SSIS, etc. a plus.Intermediate to advanced proficiency with Excel, Word, PowerPoint, and Outlook with ability to tell a story using data.Ability to condense information and transform technical data into easily understandable concepts.Experience connecting and cleaning data and developing dashboards using business intelligence tools.Demonstrated analytical and problem-solving skills. Acts independently to plan and execute own work program.Strong time and project management skills, with the ability to prioritize requests, multi-task and maintain attention to detailGood writing, oral communication, and presentation skills with experience communicating effectively across all levels. "}