{"jobID": "2829050228", "jobLocation": "Troy_MI", "jobTitle": "Consulting Manager", "companyRating": "3.3", "companyInfo": {"Website": "www.plex.com", "Headquarters": "Troy, MI", "Size": "501 to 1000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Epicor Software, NetSuite, QAD"}, "estimatedSalary": "121000", "jobDescription": " We’re on a mission. As a fast-growing software company on the cutting-edge of technology, Plex is revolutionizing global manufacturing in the same way cloud solutions have transformed sales, marketing, and human capital management. We want manufacturers to succeed. That’s why we’re on a mission to replace underperforming, on-premise enterprise resource planning (ERP) systems with the Plex Manufacturing Cloud – ERP built for today’s model of manufacturing. If you want to see the future of business, we’re what’s next.  In support of our ongoing growth, we are looking for a Consulting Manager to manage, lead and develop a team of individuals who implement Plex solutions. Position can be located from our offices located in Irvine, CA or Troy, MI. Additional responsibilities include the following: Serve as mentor, and coach to develop skills of 40+ individual team membersPromote a team-oriented, challenging, and innovative work environmentMaintain and continuously improve the on-boarding, performance management and career development processesParticipate in the hiring process by conducting interviewsCollaborate with other departments and external partners to effectively staff projects and customer engagementsProvide leadership to individual team members to achieve a high level of customer satisfactionEnsure that team members are adhering to processes and proceduresBe knowledgeable of the Plex product, methodology and customer requirementsProvide a positive impression of Plex and incorporate customer service into all aspects of work plansCollaborate with upper management to develop MBOs to support growth of the teamSeek and share information with coworkers and respond to concerns with timely, meaningful, fact-based, and constructive feedbackForesee potential problems and take corrective action to ensure achievement of goalsQualifications:4+ years of experience in a supervisory roleExperience managing teams in a consulting environmentExperience with ERP implementation within the manufacturing industry is preferredAbility to manage multiple assignments in a timely and effective mannerClear and concise communication skillsIn-depth knowledge and understanding of business, technological and competitive trendsA./B.S. degree in human resources, communications, business or related fields, or equivalent experienceAbility to travel as required We are proud to be recognized as one of the top workplaces in the tech industry. In fact, it’s Plex employees themselves who say our company is a great place to work. We’ve created an inviting workspace that fosters a culture of collaboration, innovation, and excitement. Some of the things our employees enjoy include: Competitive wagesGenerous benefits including Health, Dental, Vision, Life, Disability Insurance, & 401(k) matching programVery generous PTO/paid holidaysTuition reimbursementHealth club dues reimbursementSustainable work-life balance and flexibilityOur multiple locations offer a casual-dress workplace, complimentary food and drink, and “de-stress areas” complete with video games, ping pong tables, and more We’re looking for high-skilled, passionate people to help us do something daring, difficult, and incredibly rewarding. If you’re ready to be inspired, solve problems, grow professionally, and unleash your talent…then apply today. You’re what’s next. The Plex Manufacturing Cloud Plex is the engine behind the manufacturing economy, powering the first ERP cloud built specifically for the plant floor. The Plex Manufacturing Cloud delivers anywhere, anytime industry-leading ERP and manufacturing automation through a secure web browser, connecting suppliers, machine, people, systems, and customers with capabilities that deliver continuous innovation. Plex now supports more than 550 organizations and 1,800+ manufacturing facilities in 22 countries around the world. Our customers make everything from diesel engines and aircraft to ice cream and candy, all in the Plex Manufacturing Cloud."}