{"jobID": "2789940592", "jobLocation": "Chicago_IL", "jobTitle": "Marketing Analytics Consultant", "companyRating": "3.3", "companyInfo": {"Website": "www.truevaluecompany.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1948", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Ace Hardware, Orgill"}, "estimatedSalary": "71000", "jobDescription": "Position SummaryJob Description True Value Company, a global wholesaler serving retail locations in 60 countries, has an immediate need for a Marketing Analytics Consultant. You will play a meaningful role in helping to create and execute data campaigns to analyze customer data for our new digital marketing program. Being an expert in statistics, including conducting quantitative analysis on large data sets, and having a strong understanding of how that data applies to the marketing team are critical in the success of this role. Are you ready to help apply innovative and technical quantitative analysis to drive critical business results?  Join the True Value Marketing Analytics team and assist in bridging the gap between mountains of data and actionable digital marketing programs. As a marketing analytics consultant, you can make an immediate impact by having strong quantitative and programming-based statistical skills, a polished business acumen, and an ability to tell stories with data. The Marketing Analytics team is a small, highly leveraged team in the organization where you can continue to learn, get strong exposure to the business, and work with cutting edge customer data practices. Joining True Value Offers a Culture ThatEmbraces personal and professional growthRecognizes diverse perspectivesProvides competitive compensation while balancing your work-life needs Your Value = Our Value. True Value.  Position DescriptionAdventure On And Check Out The Daily Responsibilities Expected Testing and analysis at both customer and store levels for all CRM and loyalty marketing efforts including test design, implementation and evaluation. Helps to determine and establish core CRM metrics methodology, reporting and analysis infrastructure including integration and possibly automation within existing and future third party CRM applications. This includes translation of business requirements and development of all relevant technical requirements for any associated software enhancements.  Develops, validates, executes and evaluates tactical CRM-related modeling regarding audience, offer, cadence, messaging, content, product trigger-based targeting including predictive modeling. Works with third party analytic and reporting technology vendor(s).  Partners with Insights team to create and translate through statistical modeling practices and integrate relevant existing and future strategic customer segmentations within customer loyalty program data. Also leads methodology and development of all customer transaction data-oriented strategic modeling for Marketing purposes.  Collaborates on the methodology development, reporting design and potential automation at both co-op and store/member level customer key performance indicators and customer life-cycle management analysis.  Position Qualifications Minimum Type and Years of Related Experience: Five to seven years of related experience requiredCustomer, Marketing, or Retail data experience requiredProgramming proficiency in at least one statistical software package: SAS/Base and SAS/Stat, (ability to write SAS macros preferred) or SPSSExperience in applied statistical techniques: correspondence and cluster analysis, logit model estimation, regression modeling, classification and regression trees, CHAID and confirmatory factor analysisExperience in attrition/ retention modeling, survival analysis methods, and time series analysis is preferredAbility to assume a wide range of analytic tasks including program measurement, customer segmentation, database analysis and more sophisticated modeling techniques; Ability to write programs to process and manipulate dataSQL and SAS proficiencyMinimum Education Requirements:Bachelor's degree in Mathematics, Statistics, Marketing or related quantitative field required or equivalent work experienceMaster's degree in Mathematics, Statistics, Marketing or related quantitative field highly preferred We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}