{"jobID": "2830637012", "jobLocation": "Detroit_MI", "jobTitle": "Institutional Trust Analyst II", "companyRating": null, "companyInfo": {"Website": "www.comerica.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1849", "Type": " Company - Public (CMA) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Regions Financial, BBVA Compass, Zions Bank"}, "estimatedSalary": null, "jobDescription": " Institutional Trust Analyst II  The Institutional Trust Analyst II processing daily cash, security and trust accounting transactions for a dedicated book of assigned accounts that are standard in nature.  Position Competencies  Successful incumbents possess integrity and trust, listening skills, problem solving skills, are compoused and focused on the customer and have a drive for results and intellectual horsepower, and are action oriented. Position Responsibilities:Manage client relationships which have been assigned by maintaining account profiles, developing and maintaining client specific procedures, and documenting unique account processing requirements.Monitor account balances/activity and initiate actions such as fund and trade orders, contributions and disbursements and required reporting to ensure accounts are in full compliance with established standards to reduce financial and reputational risk to client and bank.Verify input for accuracy when processing transactions in an assigned account. When approving a transaction, verify data input to the accounting system with the client directive. Proactively resolves inaccuracies (seeking guidance if necessary) to minimize financial impact and reputational risk to the client and bank.Communicate with clients, and third party providers such as consultants, auditors, actuaries, investment managers and various internal departments to ensure that all account activity is posted in a timely and accurate manner.Monitor and process incoming directives and log them into the appropriate database. Review daily to ensure requested transactions are processed accurately and within established deadlines. Monitor the Group mailbox for items related to your specific book of accounts or the analyst you backupComplete projects and special requests by the stated deadline. Deliver reports within stated deadline with no errors.Research, resolve and document all exception situations requesting guidance when necessary to increase knowledge.Complete all steps associated with new account set-up and closing account requirement. Complete all assigned annual account reviews and provide required documentation for annual relationship reviews to the assigned Relationship Manager. Travel  Travel is not required of this position.  Relocation  Relocation assistance is not provided for this position. Bachelor's degree from an accredited AND 1 year financial service or customer service experience OR High School Diploma AND 4 years of financial services/operations experience.2 years of experience with Microsoft Word and Excel Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}