{"jobID": "2784069399", "jobLocation": "Santa_Clara_CA", "jobTitle": "R&D; Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.agilent.com/go/careers", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (A) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Illumina, Danaher"}, "estimatedSalary": "138000", "jobDescription": " Agilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek ---- so they can do what they do best: improve the world around us. Information about Agilent is available at www.agilent.com.  Agilent Research Laboratories is seeking an enthusiastic, experienced and skilled data science researcher to be part of an innovative, multidisciplinary team developing next generation technologies and instrumentation for life science research and diagnostics. Agilent Laboratories computational teams focus on informatics, algorithmic, statistical and visualization aspects of technologies and systems under development. The focus of this position will be research in applying data science and artificial intelligence technologies to significantly improve the performance and increase the capabilities of the measurement systems for applications across life sciences research and diagnostics. Therefore, we are seeking a researcher to build upon a strong working knowledge of data science and artificial intelligence, statistics, computer science, scalable technologies such as Hadoop or Spark and strong working knowledge of a variety of structured and unstructured databases. In this way, the successful candidate will help Agilent Laboratories continue its track record of powering the growth of Agilent Technologies through breakthrough science and technology.  As part of this effort, the successful candidate will: in collaboration with other members of the team, use expertise in data science, machine learning, including in deep learning, statistics and broad understanding of life science measurement systems to investigate, define, develop and apply state of the art informatics, data analytics and data visualization tools and approaches to significantly enhance the performance and capabilities of analytical laboratory and measurement instrumentationcommunicate progress, results, challenges and opportunities to management and technical leadership, to selected external organizations, including collaborators, and, when appropriate, to the general scientific community via presentations at scientific conferences and in peer-reviewed publicationsREQUIRED QUALIFICATIONS:M.Sc., Ph.D. or equivalent research experience in Data Science, Computer Science or another relevant fieldExpertise in programming language commonly used for data science, such as Python, R or MATLABAdvanced knowledge of statistics and numerical/computational methodsExpertise in working with, parsing, and cleaning diverse data sourcesHands-on experience with scalable programming environments such as Hadoop or SparkHands-on experience with traditional relational databases, such as Oracle, SQL Server or PostgresHands-on experience with applied machine learningExperience with large scale data platforms such as Cassandra, MongoDB, Redshift, DynamoDB, Spanner, or BigTable.Self-motivated researcher able to work from broad objectives, detailed oriented and with strong problem-solving skillTrack record of innovation and scientific contribution as shown by peer-reviewed journal publicationsDemonstrated excellence in communication and working collaboratively in multi-disciplinary teamsExcellent leadership skillsDESIRED QUALIFICATIONS:Good understanding of analytical laboratory instrumentationUnderstanding of measurement technologies underlying Agilent productsDemonstrated expertise in analyzing high volume experimental measurement dataPassion for developing effective data visualizationsHands-on experience in Cloud computing, particularly Amazon Web ServicesHands-on experience with deep learning platforms, such as TensorFlow, PyTorch, or KerasFluency in one or more common programming languages such as Java, C# or C++Experience with JavaScript and browser-based interface frameworks such as React or AngularExperience with other scalable, state-of-the-art data exploration and visualization toolsExperience with analyzing real-time sensor dataExperience with Natural Language ProcessingExperience developing production software in a corporate environment or delivering research prototypes to such organizations Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}