{"jobID": "2639640713", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Computational Biologist", "companyRating": "4.3", "companyInfo": {"Website": "www.vai.org", "Headquarters": "Grand Rapids, MI", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " Computational Biologist  Van Andel Research Institute (VARI), a leading independent biomedical research facility, is dedicated to determining the epigenetic, genetic, molecular and cellular origins of cancer, Parkinson’s, and other diseases, and translating those findings into effective therapies. The Institute is home to more than 300 scientists and staff that work in on-site laboratories and collaborative partnerships that span the globe.  Dr. Tim Triche Jr. is seeking a full-time Computational Biologist to join his research team. The Triche Lab focuses on developing statistical and mathematical methods to dissect pediatric and adult cancers, with a focus on cancers of the blood in children. In pediatric tumors, recurrent mutations alone are rarely sufficient to characterize a person's disease, and the role of inherited susceptibility is poorly understood. The lab seeks to improve both outcomes and quality of life by rational selection of positive (“Patients with X usually respond to A”) biomarkers for response and negative (“Patients with Y rarely respond to B”) biological markers for non-response over the course of disease. Particularly in rare tumors, this approach is well suited to rapidly piloting clinical trials and re-purposing existing drugs; indeed, one such regional DNA methylation marker is currently in a Phase III trial for front-line chemotherapy.  We collaborate broadly with clinical and basic scientists. The role of chromatin- and DNA-modifying proteins, under the catchall term epigenetic regulators, is a primary interest. Recent work characterizing genetic influences on transcription suggests that rare variants dominate the landscape, motivating an alternate readout of regulatory aberrations. We are developing methods to improve both variant prioritization and interpretation of regulatory impacts by jointly analyzing both. To do so, we make heavy use of high-throughput sequence analysis, both in bulk and sorted cells, often from clinical trials.  Ours is a young lab. You will help determine its growth and direction, and it will help determine yours. In this role, you will be responsible for the following tasks:Handle data management and reproducible analysis for a variety of experimental designsDevelop, maintain, and support computational biology pipelinesPerform data mining at scale on both local and (where feasible) cloud pilot resourcesPre-print and publish results and novel methods, serving as primary or contributing author, while ensuring compliance with data sharing plans, and wherever possible, unsupervised replicationAnticipate and keep abreast of new developments in bioinformatics and works to ensure the availability of state-of-the-art methods, resources, and data sources to support the user groupsPerform other related duties as assigned (to include wet protocols if suited to the candidate) This list will likely change as projects evolve and you must be open-minded to learn new things. Expectations: The following expectations should be met within the first 3 months. 1 month – Develop solid understanding of at least one major collaborative project, adapt to VAI computing resources, and demonstrate analytical reproducibility, supervised by a senior collaborator3 months – Acquire significant data, prepare informative summaries of interim analyses, and take over both maintenance and development of analytical pipelines from our senior collaborators.Qualifications: You will possess a Master’s degree in computational biology, bioinformatics, mathematics, statistics, computer science, or other relevant discipline (a BS with experience will be considered).  The ideal candidate Has working knowledge of at least one scripting language (e.g. R) and systems language (e.g. C)Has substantial experience with the analysis of next generation sequencing data (e.g. RNAseq)Has experience, or interest in gaining experience, with data integration (e.g. ATAC, WGBS, Hi-C)Has an understanding of cancer biology or genetics; this is helpful but not absolutely required.May see this position as an ideal launching point for further graduate or clinical studies.Has a commitment to open, collegial, reproducible science, and the betterment of society. If you possess these attributes and desire to help us drive science from the bench to the clinic, while benefiting from a highly generous compensation package; we would welcome speaking with you and encourage you to apply today. VAI is actively striving to diversify its workforce and strongly encourages qualified individuals from underrepresented groups to apply.About Grand Rapids, MI Van Andel Research Institute is located in downtown Grand Rapids, MI which is the second largest city in Michigan and the largest city in West Michigan. Grand Rapids offers a remarkable combination of cosmopolitan atmosphere and small town warmth, known for its philanthropic and sustainability-driven community, and is ranked one of \"America's Top 100 Places to Live.\"  Located on the banks of the Grand River, Grand Rapids offers all the big-city excitement you'd expect from a million-resident metropolis, featuring hundreds of restaurants and nightspots, theatres, museums, sports and concerts. The safe and clean downtown is surrounded by an eclectic mix of walk-able neighborhoods.  With a medical and life sciences industry boom, strong entrepreneurial activity, dedication to green building and living, and innovative employers, Grand Rapids' diverse economy continues to grow, offering endless career opportunities.Required Skills Required Experience Job Location  Grand Rapids, US-MI "}