{"jobID": "2809122739", "jobLocation": "Northridge_CA", "jobTitle": "Data Marketing Analyst", "companyRating": null, "companyInfo": {"Website": "www.lakesidemed.com", "Headquarters": "Reseda, CA", "Size": "Unknown", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As one of the fastest growing Independent Physician Associations in Southern California, Regal Medical Group, Lakeside Community Healthcare & Affiliated Doctors of Orange County, offers a fast-paced, exciting, welcoming and supportive work environment. Opportunities abound, and enterprising, capable, focused people prosper with us. We promote teamwork, nurture learning, and encourage advancement for all of our employees. We want to see you excel, because we believe that your success is our success. Position Summary: Under the general direction of the Manager, Client Services this position will provide data analysis, management and reporting for various event requests that come from within the Marketing department. The specialist will be required to collect, input and disseminate accurate descriptive data into multiple platforms while managing the event schedules and supporting systems. Additionally, the candidate will need to effectively use charts, graphs and tables to convey analysis and summarize results and have a strong attention to detail.  A. Essential Duties and Responsibilities include the following: Enters all event information into in-house systems/excel documents to ensure accurate scheduling and execution of events (as well all materials supporting them on deadline).Ensures tracking of all key indicators to assist in managing the event team's performance and prepare analytical reports on a weekly basis.Perform statistical analysis, interpretation of data and presentation of high quality cumulative reports as well as visualizations with marketing data (monthly basis).Establishes and maintains effective, consistent reporting to management as needed.Provides recommendations for information and reporting initiatives that support the user community.Ensures all processes are completed in a timely manner and on deadline.Performs random audit on reports to validate accuracy, delivery and usage on a weekly basis.Attends administrative meetings and provides information to staff as appropriate.Develops and fosters a customer satisfaction focused, service mentality within department to strengthen and build relationships with other internal departments.Communicates a balanced view of information in relation to other business functions.Stay current on best practice and marketing analytics methodologies and trends.Take part in process improvement and update supporting documents as needed. Train the applicable staff on new processes accordingly. Continued focus on improved process and delivery is required consistently.Performs other duties as necessary, related to Marketing team initiatives. We offer a full benefits package which includes employer paid medical, pharmacy and dental benefits. We offer a generous PTO package, 401k Retirement Savings, Life Insurance, Flexible Spending Account (FSA), Tuition Reimbursement & Licensed Renewal Fees for our clinical staff.  Employer will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the LA City Fair Chance Initiative for Hiring OrdinanceSDL2017"}