{"jobID": "2814440843", "jobLocation": "Chicago_IL", "jobTitle": "Temporary Human Resources Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.pcsedu.org", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "About Perspectives Charter SchoolsAll Perspectives Charter Schools will provide scholars with a rigorous and relevant education, based on the ethical principles of A Disciplined Life®, preparing them for life in a changing world and helping them further become intellectually reflective, caring and ethical people engaged in a meaningful life.All of Perspectives Charter Schools achieved Level 1 or 2+ this year. As one of the first charter schools in Illinois, Perspectives has a long record of preparing scholars for success in college and beyond. Our five schools across the South Side of Chicago offer an education that combines character development and academic rigor through the A Disciplined Life® education model.Our scholars come from some of the most disadvantaged neighborhoods in the country, but they graduate from high school, enroll in college, and persist in college at a rate above the national average. The keys to our success are our dedicated, hard-working, creative, and compassionate colleagues.Position Overview Perspectives Charter Schools is seeking a Temporary Human Resources Data Analyst to complete HR data audits and analyses. This position is temporary, approximately 40 hours per week for approximately 3 months, and we are looking for someone to start as soon as possible. ResponsibilitiesManaging large, complex sets of data, including reviewing, cleaning, and manipulating dataUtilizing advanced Microsoft Excel skills, such as data formatting, Lookup formulas, IF functions, and pivot tablesPerforming audit and reconciliation analysis on historical HR data, identifying problematic areas and conducting research to problem solve potential causes for discrepanciesExtracting data from HR and Payroll system, when neededMaintaining confidentiality of sensitive informationPerforming other duties as assignedQualificationsExhibits a strong commitment to the ethos of Perspectives Charter Schools by thriving to live by the 26 principles of A Disciplined Life®Holds a deep belief that all students in Chicago deserve an education where social emotional learning and high academic expectations are delivered with excellenceAssociate’s or Bachelor’s degree preferredAdvanced Microsoft Excel skills, including VLookups, Pivot Tables, and IF functionsPrevious data analysis experience required, including working with large and complex datasetsCommunicates effectivelyMaintains confidentiality of sensitive informationStrong problem-solving skills This is a temporary position, not eligible for benefits. Perspectives Charter Schools works affirmatively to include diversity among its workforce and does not discriminate in the selection of its staff on the basis of race, color, religion, sex, national origin, age, sexual orientation, disability, income, marital status, or any other dimension of diversity. We encourage diverse candidates to apply for this position."}