{"jobID": "2820125708", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.hpfcu.org", "Headquarters": "Houston, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Houston Police Credit Union is excited about your interest is this open position with us. As part of our interview process, we will be using a video interviewing platform, Spark Hire. This platform will allow our hiring team and candidates to connect quicker without the pressure of synchronizing calendars for our initial phase of candidate assessments. Our goal with the video interviewing portion of our hiring  process is to learn more about your personality and previous work experience.  Please read the job description provided here. Afterwards, follow the instructions on how to apply.  Data Analyst(Full time)  Summary:Prepare routine and special reports for management review. Organizes credit union data to support the efficient and timely completion of transaction computations, and assist in the development of what-if scenarios and trend analysis. Operational research will also be required. Responsible for the maintenance and updating of specific data. In addition, this position will disseminate the data collected and organized to the appropriate parties. Duties include but not limited to: Researching credit union data to be used to assist in decision-making regarding pricing decisions, trend analysis, and service evaluations. Compiles the data into meaningful and useful structures. Provides analysis on data compiled in a timely and accurate manner.  Prepares routine and special reports for use by management.  Assists with data input and maintenance in an effort to maintain current and accurate data sources.  Develops dashboards and scorecards for various data. Visualizes and reports data findings in a creative manner.  Disseminates data collected and organized to the appropriate parties within specified time frames.  Must comply with all company policies and procedures, applicable laws and regulations, including but not limited to, the Bank Secrecy Act, the Patriot Act, and the Office of Foreign Assets Control.  Other duties as assigned by the manager. Experience: Six months to two years of similar or related experience, including time spent in preparatory positions. Education/Certifications/Licenses: A two-year college degree. Interpersonal Skills: A significant level of trust and diplomacy is required to be an effective subject matter expert in the position. In-depth dialogues, conversations and explanations with customers, direct and indirect reports and outside vendors of a sensitive and/or highly confidential nature is a normal part of the day-to-day experience. Communications can involve motivating, influencing, educating and/or advising others on matters of significance. Other Skills: Must be proficient in writing formulas, pivot tables, and charting and graphing data in Excel.  Ability to handle multiple assignments on a timely basis with a high degree of accuracy.  Ability to work with databases and reporting software. Physical Requirements: Able to bend, sit, and stand in order to perform primarily sedentary work with limited physical exertion and occasional lifting of up to 10 lbs. Must be capable of climbing / descending stairs in an emergency situation. Must be able to operate routine office equipment including computer terminals and keyboards, telephones, copiers, facsimiles, and calculators. Must be able to routinely perform work on computer for an average of 6-8 hours per day, when necessary. Must be able to work extended hours or travel off site whenever required or requested by management. Must be capable of regular, reliable and timely attendance.  First, please submit your resume on this site.  Next, click the link below. This will take you to sparkhire.com where we would like for you to complete the video portion of the initial hiring process by answering a few questions about yourself. It is easy to use, quick and painless! It should not take up more than 15-20 minutes of your time.  To submit your video answers, use your phone to download the free Spark Hire mobile app for iOS and Android devices, or your tablet or desktop with web cam. Advantages of video interviewing: · You can complete the interview on your own time.  · Put your best foot forward.  · Let your personality and professionalism show.  · Demonstrate your communication skills and why you are right for the position.  Link: https://hire.li/8e722d2  Only submitted resumes on this site and completed video submissions on sparkhire.com will be considered.  If you need any help with the Spark Hire site, please contact their 24-hour technical support team at support@sparkhire.com.  Have fun with the video process and take advantage of this opportunity to let your personality shine and stand out from the rest of the applicants."}