{"jobID": "2626211081", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.wuxiapptec.com", "Headquarters": "Shanghai, China", "Size": "10000+ employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " HD Biosciences, Inc. (San Diego), a WuXi AppTec Company, is expanding its in vivo Pharmacology Division. We are seeking highly skilled and motivated scientist to join the team. Design, implement, and perform projects for molecular and cell biology that include molecular design, vector cloning, recombinant protein expression, purification, and characterization.Accurately interpret experimental data regarding structure-activity relationships, formulate conclusions, and communicate data internally and externally.Routinely generates new ideas, systematically evaluates new technologies and implements those that add value.Effectively communicate with internal colleagues and external clients to promote a world-class service.Supervise associate(s) and lead projects and programs through cross collaboration of internal teams.PhD or advanced degree with 0-2 years of experience in the area of immune oncology or pharmaceutical related services.Broad expertise in tumor immunology, cellular immunology, autoimmunity and high dimensional flow cytometry.Extensive experience in immune oncology assays and biology, particularly T cell, Dendritic cell, macrophage and NK cell-related assays, flow cytometry, immune cell isolation and phenotyping, cell proliferation and cytotoxicity, and other functional assays.Demonstrated ability to guide groups through corporate change and growth.Interactive and collaborative approach; expert influence and conflict resolution skills are preferred.Excellent oral and written commutation skills and presentation ability.The successful candidate must be detail-oriented, have strategic planning skills and capability to multi-task, ensuring that all tactical details are managed efficiently and effectively.Design, develop and execute pre-clinical disease models to generate in vivo pharmacology data to support the development of novel oncolytic viruses, including efficacy, tolerability, PK/PD and biomarker endpoints.Work in CRO in a commercial setting is preferred.Outstanding written and oral communication skills and interpersonal skills to seamlessly fit within a teamwork driven environment. Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}