{"jobID": "2684534425", "jobLocation": "Ann_Arbor_MI", "jobTitle": "DevOps Engineer", "companyRating": "4.2", "companyInfo": {"Website": "www.llamasoft.com", "Headquarters": "Ann Arbor, MI", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": " Like Stats?  Yeah, us too!  Check these:  600+ enterprise customers in 60 countries  50% of Fortune 100 companies are customers  23 of the Gartner Top 25 Supply Chain are customers  So, yes, were all about business. But were also all about sustainability, see our 2017 Green Award **  ICYMI: We were named to the 2017 Best and Brightest Company in the US of A and in Metro Detroits 2017 Best and Brightest Company list  Were well funded, fun and focused on building the very best in supply chain and we want YOU to help us build complex models that allow global companies to quickly, safely model supply chain impacts.  Dont believe us - read the Gartner Supply Chain Masters and youll learn that nearly all of the Gartner Supply Chain Top 25 use our solutions to tackle the most complex supply chains issues the world has ever seen.  Smart, energetic and ready to make your mark in a best in class enterprise software company? Join our herd! ** from Supply and Demand Chain ExecutiveJob Description: We are searching for a DevOps Engineer who will be responsible for creating and streamlining continuous delivery pipeline. This role will be working very closely with developers and other ops teams to ensure reliability, scalability and performance of the next-generation of systems. Liaise between Operations, IT Security, Product and Development on deployment standards and best practices.Design and Cultivate Continuous Integration throughout the organization.Establish Best Practices for Continuous Integration and Development.Design and Improve Build Infrastructure.Develop code to automate deployments, enhance build systems, and monitor servicesEvaluate and prototype deployment of virtualized stacks on AWS or similar.Continuously review and enhance processes and operating procedures needed to maintain the most cost effective enterprise-grade cloud infrastructure.Proactively identify an issue, gather requirements, design and then implement the solutionCreate and maintain complete and accurate documentationIdentify and promote best practices and patterns for the setup, configuration and management including databases, servers, and network and storage systems.Support and administer software and applications, including: VMware hosts, Windows Server, SQL Server, and Microsoft Office.The Qualifications:3+ years experience with AWS (EC2, S3, VPC, Elastic Beanstalk, SNS, etc.)3+ years of production application support experience in a high uptime environment3+ years Scripting experience with PowerShell, Chef and/or Puppet5+ years Windows administration experience including diagnosis of performance issues, package management, load estimation, networking configuration, etc.Ability to proactively determine problems before they happen, dig deep for root causes, and implement solutions that prevent future occurrences.Customer and quality focused with excellent attention to detail.Desired Additional Skills:Experience working in a SCRUM environment.3+ years experience with VMWare administration.Experience supporting web-based applications built on IIS and SQL Server.3+ years experience MS SQL (scaling, replication, sharding etc.).3+ years experience with Active Directory.About LLamasoft LLamasoft provides software and expertise to help companies design and improve their supply chain operations. We enable companies to model, optimize and simulate their supply chain operations, leading to major improvements in cost, service, sustainability, and risk mitigation. Supply Chain Guru®, LLamasofts flagship product, is the leading supply chain design and predictive analytics application available in the market today. LLamasoft is expanding its product offering into multiple design platforms as well as enterprise solutions.  Since 1999, LLamasoft has helped hundreds of global organizations in over 30 countries leverage their unique blend of technology and deep domain expertise to drive competitive advantage and savings across their supply chain operations.  LLamasoft offers a stimulating small company atmosphere where your efforts will have a significant impact on global logistics and our companys success. We are a fun, results-driven company that centers on developing high quality software, not work schedules and dress codes. We are driven by people who have a passion for technology and innovation. If you are excited about software development and looking for a fun and flexible environment in a growing company, please apply!  LLamasoft is an equal opportunity employer, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}