{"jobID": "2826057880", "jobLocation": "Rockville_MD", "jobTitle": "NLP Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.xscion.com", "Headquarters": "Mc Lean, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview: As an NLP Data Scientist, you will be responsible for data-driven improvements to our language understanding models and text mining efforts. Your work will directly impact our clients in the form of products and services that can quickly analyze large amounts of unstructured text data in a variety of formats. As an NLP Data Scientist, You Will:Ensure data quality throughout all stages of acquisition and processing, including such areas as data sourcing/collection, ground truth generation, normalization, transformation, cross-lingual alignment/mapping, etc.Clean, analyze and select unstructured data to achieve goalsBuild and release models that can process large amounts of text data and extract useful information quicklyPresent results in a clear manner backed by data and coupled with actionable conclusionsDevelop efficient data querying infrastructure for multiple formats of unstructured language dataTo Be Successful, You Need:Bachelors or Masters degree in Statistics, Applied Math, Operations Research, Economics, or related quantitative fieldMS + 2 yrs experience (or BS + 5 yrs) experience with various data analysis and visualization toolsExperience in Python, Scala, or RExperience in Natural Language Processing modeling and applicationsTrack record of diving into data to discover hidden patterns and of conducting error/deviation analysisKnowledge of various machine learning techniques and key parameters that affect their performanceExperience developing experimental and analytic plans for data modeling processes, using strong baselines, and determining cause and effect relationsUnderstanding of relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etcBonus Points if you have:The motivation to achieve results in a fast-paced environmentExperience with statistical modeling and machine learningExperience with neural networks and deep learning technologiesStrong attention to detailExceptional level of organizationComfortable working in a fast paced, highly collaborative, dynamic work environmentAbility to think creatively and solve problemsWe Hire Great People. Period. If this description sounds like you and if you’re an NLP Data Scientist rockstar - then we want to hear from you. Why Work at xScion?We have an amazing culture – We were named a ‘Best Place to Work in VA’ for the last 3 years (2016, 2017 & 2018).We are poised for rapid growth – We are on the cutting edge of digital transformation in healthcare and finance and continuously welcoming new clients to the xScion family.We believe in your continuous development – We invest in our teams’ development, paying for certifications and trainings to improve their skills because we are committed to being the best at what we do.You’ll work with the best – We only hire great people.And because we truly care about you and our clients. - We are run by real people for real people, creating flexibility, balance, respect and fun in the workplace.We Offer Great Benefits: We not only offer standard benefits like great medical, dental, 401(k) match, flex spending and more, but we also offer unique perks such 11 holidays (including your birthday!), 3 weeks of paid time off, company events, games, and many other things that inspire balance and flexibility. We’re Transforming Businesses… xScion is a woman-owned NextGen Technology Consulting Firm that helps companies modernize their IT and business operations. We support leading Healthcare and Financial Services companies through innovative solutions including AppDev, DevOps, Data Services and Agile Transformation. Want to Learn More about xScion? Check us at out on www.xscion.com or socially at LinkedIn, Twitter and Glassdoor.  At xScion, we celebrate diversity in all forms. xScion is an Equal Opportunity Employer- Females/Minorities/Protected Veterans/Individuals with Disabilities.- provided by Dice  Python, Scala, R"}