{"jobID": "2794376691", "jobLocation": "Midland_MI", "jobTitle": "Analyst II - Procurement Operations (Data Analytics)", "companyRating": null, "companyInfo": {"Website": "www.styron.com", "Headquarters": "Berwyn, PA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Anaylst II - Procurement Operations (Data Analytics)  The Analyst II - Data Analyst will focus on designing, implementing, monitoring, and improving the reporting and metrics tools used by procurement. The objective will be translating raw data into valuable business insights that are easy to access and interpret. This role will provide strong logical reasoning skills and business intelligence experience. In addition this role will partner with IT to evaluate and select future technologies for procurement as they align to the corporate strategy. Another component of this role will be developing metrics and dashboards for procurement. An example would be metrics to monitor the performance and standing of procurement operations. As part of that activity the incumbent will be responsible for monitoring for errors or bad data and correcting it. All these activities will provide executive leadership, as well as operational leaders, insight into the performance and spend of procurement.  The position is located in Midland, MI. KEY RESPONSIBILITIES:Procurement Reporting and Analytics ManagementDevelop and implement databases, data collection systems, data analytics, and other strategies to optimize statistical efficiency, quality, and reliabilityAssist the connecting data from secondary data sources to standard procurement reporting toolsDevelop a catalogue of standard reports that can be available to all stakeholdersWork with management to prioritize business and information needsProvide executive level reporting assistance as neededSupport compliance related reporting needsProvide functional ownership of procurement related reporting tools including Diamond Systems Reporting and QlikExplore new technology opportunities that could improve the usability and availability of procurement dataPartner with IT to understand corporate technology strategies and objectivesMetrics and Dashboard DevelopmentUnderstand function needs and objectives in terms of metricsSelect, configure, and implement metrics and dashboards to monitor and support performance and complianceReview metrics and dashboards for accuracy and correct discrepancies to ensure quality of dataBuild systems that transform raw data into actionable business insightsInvestigate emerging technologies that can provide metrics and dashboards quickly and are available on multiple platforms such as mobileKNOWLEDGE, SKILLS, & ABILITIES:Procurement operations work process knowledge including payables, purchasing, vendor coding, auditing, freight, TER, scanning, and help deskSystems and technology ExpertiseInitiative and problem solving skillsInterpersonal effectiveness & strong communication skillsAmbition to innovate and constant searching for improvementAbility to effectively deliver trainings to groups of various sizesTechnical reporting experienceRead, write and speak English. Additional language skills may be required based on locationEDUCATION & EXPERIENCE:Education; Minimum Bachelor’s degree in a business, finance, or technology related field. 5+ years’ experience in a relevant service role (e.g. Procurement Services, Strategic Sourcing, Customer Service, Finance, Reporting, and/or Supply Chain disciplines) Experience:Proficiency using SAP/ECC and other technology and systems.Exceptional interpersonal skillsAbility to manage conflicting priorities, and delegate appropriatelyKnowledge and understanding of work processes performed by procurement operationsExperience in delivering and arranging education and development programsSolid Experience in data analytics and reportingKnowledge of industry reporting tools such as Excel, SQL, Tableau, Qlik and others"}