{"jobID": "2817650202", "jobLocation": "Fort_Worth_TX", "jobTitle": "Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "67000", "jobDescription": "Job Description What you'll be doing...  We are seeking an experienced Supply Chain Business Intelligence (BI) Manager with proven experience to define, develop and simplify the automation of data acquisition to enhance the BI capabilities for the Global Supply Chain organization. The successful candidate will be familiar with Verizon's data infrastructure and be responsible for defining the BI architecture to automate and extract data and simplify the current BI ecosystem, as well as, manage key reporting and analytics initiatives, development of data models and enable self-service capabilities. The candidate will partner with IT to identify the policies, processes, systems & data requirements to launch reporting and BI. Establish business intelligence, data acquisition and reporting for the Supply Chain organization. Develop the BI architecture, ETL capability and work closely with IT on the creation of the BI reporting and analytics platform which includes EDW, SAP BW on HANA, HANA Enterprise, Oracle SuperCluster, Hadoop, Qlik, AWS Cloud and Tableau. Provide the program management and business direction to IT, Analytics teams and the business users on all aspects of reporting, including guidance on building of practices, policies and procedures for data model development, data governance, data acquisition and data quality.Lead and coordinate the effort to manage the incoming report and analytics requests, be able to prioritize requests, build a prototype solution, identify key resources needed for report creation and coordinate the implementation of BI projects in partnership with IT.Manage the day-to-day direction and coordination of the business analysts and data scientists in the development and delivery of analytics and reports. Develop analytics and report plan and work with data scientists and business users to create requirements for reports. Report on project status and ensure the integrity of the data. Establish guidelines and set the standards for BI to ensure reports are using the appropriate data sources, drive a consistent look and feel across the organization.Manage and provide training for the BI tools and support for the users when needed to help them get connected to systems. As well as, establish and monitor the measures for success of the BI strategyWork with rest of reporting and analytics teams to develop requirements for BI, develop architecture and coordinate with IT to build infrastructure. What we're looking for... You'll need to have:Bachelor's degree in business, MIS or related field or four or more years of work experience.Six or more years of relevant work experience.Five or more years of experience with business intelligence tools.Three or more years of experience in data modeling, ETL and relational database reporting tools, such as, Cognos, Microsoft SQL Analytic Services, Tableau, OLAP, and/or other database technologies.Knowledge and experience with business intelligence processes and technologies (i.e. Hadoop, Teradata, Tableau, SAP BW on HANA, HANA Enterprise, SQL, Oracle, Microsoft SQL Analysis server).Even better if you have:A Master's degree.3+ years of relevant experience in retail and/or telecommunications industry, wireless experience.A broad, enterprise-wide view of the business and varying degrees of appreciation for strategy, processes and capabilities, enabling technologies, and governance.Strong program/project management skills.Experience influencing others to make decisions and take actions aimed at achieving common objectives that ultimately benefit the entire enterprise.Certified Business Intelligence Professional.Strong negotiation and conflict resolution skills.Demonstrated ability to recognize and resolve conflict; clarify differing needs; and execute strategies to resolve issuesWorking knowledge of the Kimball methodology for establishing data modelling.Experience with OLAP, relational databases and reporting tools. When you join Verizon...  You'll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America's fastest and most reliable network, we're leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we're about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.  Equal Employment Opportunity  We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}