{"jobID": "2795426586", "jobLocation": "Chantilly_VA", "jobTitle": "Lead Scientist II", "companyRating": "3.1", "companyInfo": {"Website": "www.covance.com", "Headquarters": "Princeton, NJ", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "Covance Bioanalytical Lead Scientist Play a pivotal role in the drug development process and grow your career  Are you interested in making a real scientific impact through your everyday work? Would you enjoy working in a team-focused environment as you explore unique career opportunities?  If you are looking for a company where you can gain exposure to a wide variety of science and explore a multitude of career paths across the drug development spectrum, consider working at Covance as a Lead Scientist. In this role, you will lead and direct scientific work to support external methods and projects while ensuring that client programs meet regulatory requirements and meeting defined milestones along the drug development pathway. In addition, the Lead Scientist will develop and review protocols and sample analysis plans, review data to ensure methods are ready for validation, and approve methods and raw data for sample analysis. You will also be expected to: Serve as an SD, RS, CS, LS, or PI for non-regulated, GLP-regulated, and GCP-regulated studies as applicableProactively identify and respond to circumstances that may affect study successEvaluate data and tables to ensure regulatory guidelines and expectations are metReview and approve reports for scientific accuracy and completeness, ensuring timely deliveryAssist with efforts to troubleshoot and solve assay problemsParticipate in scientific investigationsApprove QA project specific inspections and data archivalContribute to the evaluation of new proposals for technical feasibilityServe as the scientific point of contact for the clientIdentify scientific issues or scope changes within the studyWork with the client to determine project requirementsProactively identify ways to increase client satisfactionProvide a technical resource and mentoring for less experienced team membersThrive personally and professionally at Covance Working at Covance, you’ll continue to grow in our learning-based culture so you’ll know how to expertly respond and adapt as the industry continues to evolve. Here, you’ll put your education to work as you play a meaningful role in advancing healthcare and ensuring the well-being of our animal models.  We offer a comprehensive benefits package. This includes 21 days of personal time off, 7 paid holidays, medical and dental insurance as well as tuition reimbursement, a 401(k) plan with a generous company match, along with short and long-term disability and life insurance. Why Lead Scientists choose to work at Covance Make a direct impact in the lives of patients  Partner with and learn from supportive colleagues and industry leaders  Open up new opportunities for career growth within or outside the lab  What we’re looking for  Lead Scientists are the most successful at Covance with: A Masters (MS) degree in science or a related fieldA minimum of 3 years of experience as a Method Development Scientist or a higher level of education may be substituted for experienceExperience and skill with Watson, Nautilus, and Analyst software and good knowledge of regulatory agency guidelinesProven ability to prioritize and manage time with demonstrated ability to plan, prioritize, and manage a workload for large and complex projectsExcellent communication and interpersonal skills with excellent attention to detailGet to know Covance Covance, the drug development business of LabCorp, is the world’s most comprehensive drug development services company. Because of our broad experience, from early research to commercialization, our more than 20,000 employees from across the globe are in a unique position to supply insights that go above and beyond testing. Our team’s impact on healthcare is remarkable. Through their everyday work they’ve supported 100% of the top 50 drugs on the market and all the oncology drugs approved in 2016. Even though we span multiple businesses, we operate as one, sharing our knowledge to improve our efficiency and deliver on the promise of a healthier world.  The Covance team is driven by an energized purpose to improve health and improve lives across the globe. Here, you’ll work alongside exceptional people who each play an important role in bringing new scientific discoveries and therapeutic area advancements to life. And, because we span the drug development spectrum, you’ll directly impact a wide-range of initiatives as you explore unique career paths and discover your extraordinary potential.  Get ready to make a difference as we speed the delivery of groundbreaking therapies and improve lives of countless individuals. Masters (MS) degree in science or related fieldExperience may be substituted for education3-4 years of experience in the job disciplineExcellent communication and interpersonal skillsProven ability to prioritize and manage timeExcellent attention to detailAble to utilize word processing, database, spreadsheet, and specialized softwareExperience and skill with Watson, Nautilus, and Analyst preferredKnowledge of regulatory agency guidelines"}