{"jobID": "2835673058", "jobLocation": "Santa_Clara_CA", "jobTitle": "Siri - Research Scientist, Text-to-Speech R&D;", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "139000", "jobDescription": "Siri - Research Scientist, Text-to-Speech R&D; Job Number: 47384916Santa Clara Valley, California, United StatesPosted: May. 17, 2018Weekly Hours: 40.00 Job SummaryPlay a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, big data, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri Speech team at Apple. The Siri team is looking for exceptionally skilled and creative Engineers eager to get involved in hands-on work improving the Siri experience.Key Qualifications Experience building and tuning state of the art parametric and/or unit selection Text-To-Speech systemsProficiency in C/C++ including the ability to implement software, algorithms and data structuresExperience working with standard speech synthesis toolkits (such as Festival or HTS)Background of working on TTS systems in multiple languages is helpfulFive or more years of commercial software development experience DescriptionYou will join a team that is responsible for building and powering the voice of Siri. The Siri Text-To-Speech team conducts a wide variety of TTS activities, including linguistic analysis, statistical modeling, signal processing and voice development. You are a research and development engineer that has both extensive experience in TTS systems as well as the ability to implement software and solutions for shipping products. Because you will be working closely with engineers from a number of other teams at Apple, we are looking fo a phenomenal at teammate who thrives in a fast paced environment with rapidly changing priorities.EducationM.S. or PhD in Computer Science, Computational Linguistics or related field"}