{"jobID": "2787232276", "jobLocation": "Dearborn_MI", "jobTitle": "Data Ops Analyst 46382 (RP5)", "companyRating": null, "companyInfo": {"Website": "www.fastswitch.com", "Headquarters": "Dublin, OH", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionJob ID: 46382Data Ops Analyst? Position Description:The Data Ops Analyst role resides within the GDIA organization which was formed to support Blueprint for Mobility strategy and the Plan for profitable growth. In this role, you will support the data requirements of the Data Scientists who are using analytics to achieve business outcomes including insights to accelerate our Connected Customer and Connected Vehicle initiatives. Essential Responsibilities:  You will be responsible for providing the data support for enterprise data integration tasks, including ingestion, standardization, enrichment, mastering and assembly of data products for downstream applications. In addition, you will: Drive the Data Strategy and align it with continuously changing business landscape Work on all the data types across the enterprise including Customer, Dealer, Vehicle, Manufacturing, etc. Continuously increase Data Coverage by working closely with the Data Scientists, understanding and evaluating their data requirements and delivering the data they need Support the data requirements of the different functional teams like MS&S;, PD, Quality, etc. and all the regional KPI / Metrics initiatives Evaluate, explore and select the right data platform technologies including Big Data, RDBMS & NoSQL to meet the analytics requirements Provide visibility to Data Quality issues and work with the business owners to fix the issues Implement an Enterprise Data Governance model and actively promote the concept of data sharing, data reuse, data quality and data standards Perform any necessary data mapping, data lineage activities and document information flows Build the Metadata model & Business Glossary by gathering information from multiple sources: business users, existing data sources, databases and other relevant documents and systems Serve as data subject matter expert and demonstrate an understanding of key data management principles and data useSkills Required:Ability to work in different database technologies including Big Data / Hadoop (HDFS, MapReduce, Hive, Shark, Spark, etc.), RDBMS and NoSQL. Experience in creation of scripts to manipulate files within HDFS is preferred Knowledge of data transfer and ingestion technologies including Attunity Demonstrated experience building visualizations using Tableau/Qlikview Ability to write complex SQL queries needed to query & analyze data Knowledge of data management standards, data governance practices and data quality Ability to communicate complex solution concepts in simple terms Ability to apply multiple solutions to business problems Ability to quickly comprehend the functions and capabilities of new technologies Strong Oral and written communication skillsSkills Preferred:Strong team player, with the ability to collaborate well with others, to solve problems and actively incorporate input from various sources Demonstrated customer focus, with the ability to evaluate decisions through the eyes of the customer, build strong customer relationships, and create processes with customer viewpoint Strong analytical and problem solving skills, with the ability to communicate in a clear and succinct manner and effectively evaluates information / data to make decisions Strong interpersonal, and leadership skills, with proven abilities to communicate complex topics to leaders and peers in a simple, clear, plan oriented manner Ability to anticipate obstacles and develop plans to resolve those obstacles Change oriented, with the ability to actively generates process improvements, support and drives change, and confront difficult circumstances in creative ways Resourceful and quick learner, with the ability to efficiently seek out, learn, and apply new areas of expertise , as needed Highly self-motivated, with the ability to work independently -Superior organization, coaching and interpersonal skills, combined with effective leadership, decision-making, and communication Strategic and clear thinking to translate discreet and complex ideas to business-driven results Detail-oriented with a strong drive to enforce common standards Demonstrated acceptance and adherence to high ethical, moral, and personal values Six Sigma Green Belt Certified (Internal Only)Experience Required:Minimum of 5 years of experience in a Data Management role including running queries and compiling data for analytics Minimum of 3 years of experience in data design, data architecture and data modeling (both transactional and analytic) Minimum of 2 years of experience in Big Data / NoSQL technologies including Greenplum & Hadoop (HDFS, MapReduce, Hive, Shark, Spark, etc.), especially command line experience with loading and manipulating files within HDFSEducation Required:Bachelor's Degree in Engineering, Math, Information Technology, Analytics or related field from an accredited college or university Fast Switch, Ltd., delivering the Right Talent at the Right Time for over 21 years. We are an IT Consulting company with offices in Detroit, MI, Columbus, OH, Cleveland, OH, Cincinnati, OH, New York, Hartford, CT, Massachusetts, Minneapolis, MN, Los Angeles, CA, San Francisco, CA, and Tucson, AZ. We’re doing business in almost half the states in the union.  We're a financially strong, privately-held company that is 100% consultant and client focused. You are our most important asset!  We've differentiated ourselves by being creative, flexible, and fast. Throw out everything you've heard, seen, or felt about every other IT Consulting company.  We're different. Our consultants and clients tell us so, and it's our great people who make the difference! We do unique things, and we do them for Fortune 10 companies, Inc. 500 companies, and technology start-ups. We also have a strong belief in giving back to the communities we serve.  Our benefits are second to none and thanks to our flexible benefits options you can choose just the benefits that you need or want, options include:  • Medical and Dental (Fast Switch pays majority of the medical program)  • Vision  • Personal Time Off (PTO) Program  • Long Term Disability (100% paid)  • Life Insurance (100% paid)  • 401(k) with immediate vesting and 3% (of salary) dollar-for-dollar match  Plus, we have a lucrative employee referral program and an employee recognition culture.  In 2013, 2014, 2015, 2016 and 2017, Fast Switch was named one of the Top Work Places in Michigan by the Detroit Free Press and one of the Best Staffing Firms in 2016 and 2017. We have won the Columbus Business First “Fast 50” award 9 times in 12 years because of our strong growth which translates into more and better opportunities for our consulting staff members.  To view all of our open positions, please go to: www.fastswitch.com and at the bottom of the page click Job Opportunities, or get there directly at: http://tinyurl.com/z6r74up  You can also follow us on Twitter at: www.twitter.com/fastswitch  And you can become a fan of Fast Switch on Facebook at: http://tinyurl.com/y9y3gdp"}