{"jobID": "2820868624", "jobLocation": "San_Francisco_CA", "jobTitle": "Program Assistant", "companyRating": "4.2", "companyInfo": {"Website": "www.ncphs.org", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": "SUMMARY: Responsible for educational and social programs and assistance to Chinese members of the Aquatic Park Center 50+ community and persons with disabilities and to the residents surrounding the Center. Focuses on contact with 50+ Chinese speaking community members through first-hand delivery of the Living Well, Aging Well program, including teaching fitness. Works in a team setting to plan and develop this programming, then implement and evaluate. Responsible for data entry. Works Sundays to engage lunch participants and teach exercise.ESSENTIAL FUNCTIONS:Provides quality customer service for all center programs and services. Forges key relationships with the center’s Chinese speaking participants and community leaders.Assists all staff with general functioning of the center including set up, clean up, announcements, data entry, and participant forms and written translation of newsletters and flyers.Designs and administers surveys in the Chinese language to determine needs and interests of Aquatic Park participants and surrounding neighborhood residents age 50+ and persons with disabilities and evaluates results.Plans culturally appropriate content for presentations to Chinese community members and implements the presentations.Engages and instructs the Chinese commmunity to understand and collaborates in achieving the goals of the Living Well, Aging Well project.Trains in the Always Active and Fall Prevention program and recruits for and teaches the Chinese community with a Sunday class.Serves as a team member to develop multidisciplinary solutions to client problems, including working with social services and ADRC staff to meet client needs.Encourages participation in Aquatic Park Center programming. Identifies eligible participants for the program, interprets standards and guidelines to potential clients, answers questions, obtains consent for services, and makes referrals based upon program requirements.QUALIFICATIONS:High School degree or equivalent plus administrative training. Bachelor’s degree preferred. Minimum one year related experience in program delivery. Strong written and spoken Mandarin and Cantonese language skills preferred."}