{"jobID": "2766933863", "jobLocation": "Dearborn_MI", "jobTitle": "Automation Manager", "companyRating": null, "companyInfo": {"Website": "www.aksteel.com", "Headquarters": "West Chester, OH", "Size": "5001 to 10000 employees", "Founded": " 1989", "Type": " Company - Public (AKS) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " United States Steel, Nucor, ArcelorMittal USA"}, "estimatedSalary": null, "jobDescription": " Our Dearborn Works facility is seeking an Automation Manager. The Dearborn Works is located on a more than 350-acre site in southeast Michigan. Its carbon steel melting, casting, hot and cold rolling, and finishing operations are capable of producing 3.6 million net tons of hot rolled, 2.1 million net tons of cold rolled, 1.1 million net tons of galvanized and galvannealed sheet each year. Primary Responsibilities:Responsible for the Automation systems of the Dearborn Works Hot Dip Galvanizing facilityManage projects, coordinate vendors, technology and personnel appropriately to ensure completion of projects in a reliable and timely mannerWill be responsible for understanding the implications of any technical implementation with regards to safety, quality, productivity, and any environmental impactIdentify technical needs and opportunity using own initiative; constantly researching technology and potential implications Responsible for the documentation of automation tasks and operationsConfiguration of computer systems for a variety of tasks utilizing multiple operating systems (Unix, Windows NT through Windows 10)Software development in a variety of languages: C, C# C++, VB6, VB.NET, Java, Javascript, HMI, UI and UX design and a variety of web based technologiesDevelop and enhance existing systems using existing tools, and database design with SQL language, including experience with both Oracle and SQL Server, or other relational databases; experience with database tools such as Oracle SQL Developer or SQL Server Management Studio;Provide accurate technical reporting and generate information applicable to a wide variety of audiencesQualifications:Bachelors degree in electrical, electronic, computer or software engineeringFive (5) years hands-on experience in leading or managing teams in industrial manufacturing automation in both Level 1 and Level 2Experience in a team environment supporting operations and maintenance groupsStrong experience in Level 1 PLC programming, including Statement List, Block Diagrams and Ladder Logic; experience in Siemens S7 series PLCsExperience with rolling mill theory and practice in a metals environment preferredCan readily read and understand technical drawings and manuals for both electrical and mechanical devices used in an industrial environmentStrong statistical and analytical skills AK Steel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity, genetic information, disability, military or protected veteran status. "}