{"jobID": "2792149211", "jobLocation": "Long_Beach_CA", "jobTitle": "Director, Cloud Data Engineering", "companyRating": "4.0", "companyInfo": {"Website": "www.calstate.edu", "Headquarters": "Long Beach, CA", "Size": "10000+ employees", "Founded": " 1962", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "133000", "jobDescription": " CSU Job Listing Details  Printable version  E-Mail this listing Campus: Chancellor's Office  Job ID: 1013491 Job Title: Director, Cloud Data Engineering Time Base: Full-Time Date Posted: June 5, 2018 Closing Date: Open until filled Link to Apply Online: https://cmshr.cms-hr.csulb.edu/HLBPRD/cocsu_jobs.html Campus Employment Homepage: http://www.calstate.edu/HRS/jobs.shtml Description: Chancellor's Office Statement  Join our team at the California State University, Office of the Chancellor, and make a difference in providing access to higher education. We are currently seeking experienced candidates for the position of Director, Cloud Data Engineering.The CSU Chancellor's Office, located on the waterfront adjacent to the Aquarium of the Pacific in downtown Long Beach, is the headquarters for the nation's largest and most diverse system of higher education. The CSU Chancellor's Office offers a premium benefit package that includes outstanding vacation, health, and dental plans; a fee waiver education program; membership in the California Public Employees Retirement System (PERS); and 14 paid holidays a year.  Salary  Commensurate with qualifications and experience.  Position Information  The California State University, Office of the Chancellor, is seeking a Director, Cloud Data Engineering to will lead the enterprise data warehouse team and will help steer strategic technology direction, define reference architectures for data acquisition, storage and distribution, business intelligence/data warehousing, metadata management, data quality management, data modeling and MDM. The Director, Cloud Data Engineering will both mentor and lead others while championing and maturing the enterprise cloud data practice. This role will serve as a senior advisor to the CDO. Responsibilities Under the general direction of the Chief Data Officer, the Director, Cloud Data Engineering will: Perform a key leadership and mentorship role in the areas of advanced data techniques, including data modeling, data access, data integration, data visualization, data discovery, statistical methods, database design and implementation involving cloud-based, traditional and hybrid architectures.Create and maintain responsibility for the overall design of the enterprise-wide data architecture leveraging a range of new design techniques to ensure high levels of speed, effectiveness and availability across platforms.Establish analytic environments required for structured, semi-structured, and unstructured data.Identify information challenges and opportunities within CSU and develop innovative data architecture solutions that can assist with these challenges.Manage current and future data architecture, design, and content needs while producing design and development guidelines to ensure a consistent and highly effective data infrastructure.Collaborate with other technical resources including Infrastructure, database administration, operations, identity management, information security, web development and project management to ensure effective communication and prioritization across project areas.Collaborate with data governance and subject-area experts in order to interpret requirements and define subject area models aligned with enterprise operations.Develop processes for capturing and maintaining metadata from all data components to build a comprehensive meta-model.Develop knowledge of innovative industry-leading practices and products and explore opportunities to apply these innovations within CSU.QualificationsThis position requires:A Bachelor's degree in Computer Science, Engineering, Information Technology or a combination of education and seven years of related professional field experience.7+ years of experience working as a technical lead or architect in the data and BI space with expert knowledge of database structure, theories, principles and practices relating to relational databases (Oracle and MS SQL Server preferred) and cloud data stores (AWS preferred).3+ years of analytics, application or data pipeline development experience with exposure to analytics tools such as SQL, Hadoop, Spark, Kafka, Hive, Airflow, etc.Experience creating data visualizations through tools such as Tableau, Looker, Chartio, Mode, Periscope, etc. required.Programming experience with scripting languages such as Python or R required.Knowledge of statistics and data science to drive a scientific approach to analytics required.Strong project management skills, ability to influence cross-functionally in a rapidly evolving environment while managing multiple concurrent projects required. Application Period  Resumes will be accepted until job posting is removed.  How To Apply  To apply for this position, click on the link at the top of the screen.  Equal Employment Opportunity  The university is an Equal Opportunity Employer and does not discriminate against persons on the basis of race, religion, color, ancestry, age, disability, genetic information, gender, gender identity, gender expression, marital status, medical condition, National origin, sex, sexual orientation, covered veteran status, or any other protected status. Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose by contacting the Senior Human Resources Manager.  E-Verify  This position requires new hire employment verification to be processed through the E-Verify program administered by the Department of Homeland Security, U.S. Citizenship and Immigration Services (DHSUSCIS)' in partnership with the Social Security Administration (SSA).  If hired, you will be required to furnish proof that you are legally authorized to work in the United States.  Mandated Reporter Per CANRA  The person holding this position is considered a 'mandated reporter' under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment.  Conflict of Interest  The duties of this position will include participation in decisions that may have a material financial benefit to the incumbent. Therefore, the selected candidate will be required to file Conflict of Interest Form 700: Statement of Economic Interest when they first occupy the position, and on an annual basis, complete ethics training within 6 months of appointment, and attend this training every other year thereafter.  Background  The Chancellor's Office policy requires that the selected candidate successfully complete a full background check (including a criminal records check) prior to assuming this position.SDL2017"}