{"jobID": "2774673934", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.centratechnology.com", "Headquarters": "Burlington, MA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": " TS/SCI w/ polyUS Citizenship and a current TS/SCI clearance with Poly are required for the position.Courage Services, a CENTRA Technology company, is looking for a Data Scientist who: Brings passion, comfort with ambiguity, and desire to solve problems that matter.Communicates ideas in a clear and concise manner to diverse audiences.Has the ability to excel in fast pace environmentMaintains a current TS/SCI clearance with Polygraph (no exceptions)Required Qualifications:MS or equivalent in Computer Science, Applied Math and Statistics, Computer Engineering, with 2 years of relevant work, or a BS in the same disciplines with 4 years of relevant work experienceWorking knowledge of any three of the following programming languages: Python, Scala, PHP, Ruby, JAVA, HTML, or Javascript.Working knowledge of one of the following statistical/mathematical software packages: R and/or SASWorking knowledge of any two of the following programming languages: C++, C, C#, Visual Basic, and Visual Basic with Applications, SQL.Experience with Apache Spark, Flink, Storm, Kafka and HadoopExperience delivering solutions using AWSDesired Qualifications:Knowledge of Geographic Information Systems such as ArcGISFamiliarity with NLP and datadriven predictive model development Courage Services Inc. provides geospatial intelligence analysis services and data production to US Government and commercial customers and is an Equal Opportunity Employer. We offer a full range of benefits, including competitive salary, paid time off, comprehensive health plan including dental coverage, company-paid life & disability insurance policies, 401(k) plan with company match, incentive bonuses, and an educational reimbursement program. We have offices in Burlington, MA and Arlington, VA. EOE/Veterans/ Disabled. Interested candidates should send a resume to recruiter@centratechnology.com. Please reference job code 10-DS-28-16 in the subject line. #M #CJPostSDL2017"}