{"jobID": "2830471754", "jobLocation": "Culver_City_CA", "jobTitle": "Master Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.medmen.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Purpose: Oversee creation and validation of items and Bill of Materials. Execution of new items, product launches, and the maintenance of current master data. Summary: Facilitate information exchange between external departments and internal customers within the Operations department. This includes Capturing and Entering Data into all applicable System of Records to ensure an accurate Item Master. Perform Audit of Data for accuracy. Key Responsibilities:Create, change, and maintain product data in our systems of recordAudit data created and enriched in our system of recordEvaluate incoming requests to ensure they meet requirementsAt the direction of Management take ownership of work request in the backlog and execute them according to SOP at the right quality and on timeDefine Service Level Agreements with internal cross functional partnersCommunicate when necessary with various departments to confirm full and accurate item setupsEvaluate each request with the requestor to understand the end goalExecute request from Supply Chain to support daily taskSupport in special projects assigned by managementMaintain Standard Operating ProceduresCan consistently produce 2x more than the minimum output requiredAssists in the resolution of process-related issues and acts as an information resource for process-related issues/problemsActively engage an make recommendations to management that will help the team execute, learn or improveJob Specifications:Fully conversant with Microsoft Office applications, specifically Excel (power user), Access and WordMust be able to self-manage and operate with minimal supervision and handle assignments that are complex and urgent in natureGood interpersonal and leadership skillsStrong attention to detailWell-developed problem solving and time management skillsTakes ownership/responsibility of overall work qualityFlexible, able to adapt to shifting prioritiesHas worked and excelled under pressure and tight deadlines, in an uncertain environmentPossess strong communications skillsMust thrive in a team-oriented environmentTakes pride in a job well doneComfortable with Ambiguity and AdaptableRequirements:2 or more years of hands-on experience in ERP system2 or more years of experience in Operations/Supply Chain related fieldsERP implementation experienceBachelor of Arts or Science"}