{"jobID": "2836841633", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.nationalhomerentals.com", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "COMPANY OVERVIEW National Home Rentals is a rapidly growing Chicago based real estate private equity firm with thousands of properties across multiple markets throughout North America. We seek to add long-term value to the assets we acquire through our streamlined development and rigorous leasing processes, proactive management, and a data-driven analytical approach to all aspects of our business.  We are looking to add talent to our growing team with the potential to advance quickly and the opportunity to learn all aspects of the real estate investment business. We offer a fast-paced and entrepreneurial environment within an established and profitable industry leader. If you are a motivated self-starter who thrives in a high-energy culture with demonstrated excellence in prior endeavors and a strong desire to make an impact, apply to join our team. POSITION OVERVIEW We’re looking for a passionate, talented Sr. Data Engineer to join our rapidly growing team. In this role, you’ll have the chance to roll up your sleeves and apply cutting edge engineering and data pipelining techniques across a wide variety of business cases.  As our Data Engineer, you’ll report to the Director of Business Analytics and can look forward to digging into our data to help build and maintain an infrastructure that everyone can rely on. The Data Engineer will work as part of a collaborative team to design, develop, and maintain databases across the organization, perform ETL processing and implement solutions to produce seamless data flows across different parts of the business. This person will be responsible for all aspects of the design, development and delivery of data and database solutions. They will be instrumental in the design and build-out of high quality data sets to support business analysis & financial reporting needs. You will also be supporting & working with our business intelligence tools to continually improve data preparation and report automation.  The ideal candidate will have demonstrated strong technical skills, applied analytical skills and possess an interest in the Real Estate management industry, including property management metrics and variables impacting returns. This position is based in our downtown Chicago headquarters. JOBRESPONSIBILITIES Additional responsibilities include, but are not limited to: Gather and process raw data at scale from diversified sources.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and Cloud Based “big data” technologies.Create & implement scalable, fault tolerant and accurate ETL pipelines.Script & automate the retrieval of data from partners and 3rd parties.Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.Develop and implement controls and validation procedures around data ingestion for acquisition, construction, leasing and property management metrics.Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.Support the design & build-out of enterprise business analytics and reporting applications.Create data tools for Business Analytics team members’ that assist them in building and optimizing our report generation processes.Troubleshoot and correct inaccurate data in a timely manner.Manage more complex or special projects from beginning to conclusion.Be an effective overall data advocate within the company.QUALIFICATIONS We are looking for a candidate with 3+ years of experience in a Data Engineer role, who has attained a bachelor’s or higher Degree in Computer Science, Statistics, Information Systems or another quantitative field. Advanced working SQL knowledge, query authoring and experience working with relational databases.Experience building and optimizing data pipelines, architectures and ETL processes to transform raw data into structured data for analysisExperience architecting and implementing enterprise relational databasesExperience with processes supporting data transformation, data structures, metadata, dependency and workload management.Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.Ability to review, identify, and communicate issues in other developer’s codeStrong analytic skills working with structured & unstructured datasets.Experience with communicating insights and presenting concepts to a diverse audience of engineers and business development professionalsKnowledgeable about data modeling, data storage techniques, data warehousing and data architecture best practicesExperience with business intelligence tools such as Spotfire or TableauCandidates must be able to work well under pressure & deliver on multiple tasks in a deadline-driven environment, working both independently and in a team environmentOrganized/detail-oriented/extremely thorough with strong written and verbal communication skills National Home Rentals offers a competitive compensation package in addition to a comprehensive benefits package.  National Home Rentals is an Equal Opportunity Employer. National Home Rentals prohibits discrimination and harassment of any type and provides equal employment opportunities to employees and applicants without regard to race, religion, color, sex (including pregnancy, gender identity, and sexual orientation), parental status, national origin, age, disability, family medical history or genetic information, political affiliation, military service, or other non-merit based factors."}