{"jobID": "2809257506", "jobLocation": "Wayne_NJ", "jobTitle": "XRF Lab Supervisor/Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.matthey.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1817", "Type": " Company - Public (JMAT) ", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Summary of Position  The XRF Lab Supervisor/Scientist III takes direct responsibility for the delivery of small to mid-sized R&D; projects that generate new products, processes and understanding. Work may include routine and non-routine analytical assignments. The incumbent supports Johnson Matthey Development and Application groups through participation in all aspects of catalyst analysis including but not limited to: laboratory experiments, sample preparation, sample testing, test method development, interpretation, and experimental summaries. The ideal candidate will provide support to the broader analytical team and as such will be willing and able to learn multiple areas within the analytical services laboratory as requested. Initial focus will be in X-ray Fluorescence Lab (XRF) from standards preparation through analysis and problem solving to support Clean Air Global Operations. Materials are generally honeycomb substrates with and without washcoat catalytic materials as well as raw materials used in their manufacturer. As this is a service group, the ideal candidate must possess a customer focus; be respectful and team oriented; able to build strong working relationships, and augment a positive work environment.  The incumbent may be responsible for the provision of techniques to support research project and actively works to translate technical understanding into commercial value. The role may include responsibility for a functional analytical team. The incumbent will be critical in the support and leadership of organizational transformation programs to ensure that DAS are reliably designed, delivered, supported, and continuously improved to meet JM needs. This role requires the ability to provide project management, process management, and change management leadership independently or as a member of a cross functional team. The role will drive efficiency and effectiveness into the delivery of testing and services while improving customer satisfaction and global best practice implementation. This role may be focused on high value local and global projects while managing sub systems and teams. Nature and Scope:May have direct or indirect line management for more junior members of staff. Coaches and mentors participates in staffing decisions, appraisals and disciplinary actions.This role will work with others locally and globally as needed to complete job role.May be involved in estimating the costs, resources, and time required to conduct a research project and monitors performance to ensure these targets are met.Potential for Domestic and International Travel~15% of time.Key Responsibilities:Demonstrates leadership in EHS and contributes to safety review(s) in area(s) of expertise.Recognizes possible health and environmental risks and takes action to eliminate these hazards.Compiles, interprets and reviews multiple experimental records/reports providing relevant summary information into wider reports with limited requirement for supervisor input.Gathers/collates data and testing results for customer meetings. May be a key point of contact for customers (e.g. customer reviews, meetings, presentation lead) to understand their requirements and to effectively support, communicate and deliver the required technical support. May be involved in ensuring programs are resourced at the appropriate level and that customer requirements/expectations are met.May contribute to decisions on redesign/termination of projects.Capable of completing projects from definition to commissioning.Responsible for delivering on at least one research project.Collaboratively seeks to apply new and existing analytical approaches to Product, Process, and Applications Development Programs.Lead team in documenting, recommending and/or auditioning new and existing equipment with the goal of identifying/developing and maintaining best practices, independently translating these practices into other Clean AIr laboratories.Ensure that team processes, procedures and documentation are meeting site quality and environmental standards and performs audits as needed.Ensure that team equipment and workflow requirements are met and periodically reviewed for continuous improvement.Recommends new procedures and methods to improve utilization and accuracy.Plans and executes own experimental programs of work to meet objectives, timescales and budgets as well as developing or introducing new methodologies.May represent the business/research group as a technical expert. Establishes close and effective working relationships and networks with the JM Group, customers and others and seeks opportunities for future collaboration.May develop strategic external collaborations (e.g. universities) to bring new ideas and technology into the JM Group.Demonstrates an ability to effectively train and develop, as well as transfer technology into and out of the R&D; group. Works to understand the business units' needs to ensure effective technology transfer.Organizes and directs the daily activities of the laboratory across multiple shifts, overseeing most day to day operations of the group.Relies on extensive experience and judgment to plan and accomplish goals.Initiates and completes capital project.Manages inventory of supplies critical to the operation of the department.Works with area supervision to build/maintain appropriate Key Performance Indicators (KPI) and initiates actions as needed based upon data and trends.Provides effective leadership by setting standards for each task.Develop and communicate Goals and Objectives for staff and monitor progress against them. Are you the ideal candidate? PhD in Chemistry or a relevant discipline with 0+ years technical experience, or a Master's degree in a relevant discipline with 2+ years technical experience, or a Bachelor's Degree in a relevant discipline with 8+ years technical experience.Introductory to intermediate knowledge of XRF, its operating software, and the related sample preparation procedures preferred.Minimum of 2 years' experience in managing highly skilled technical personnel.Good mechanical skills preferred.Strong analytical skills with applied knowledge of general and instrumental chemistry with emphasis upon improving laboratory operations.Advanced knowledge of general and instrumental chemistry.Ability to apply these skills in the design and/or specification of new measurement systems.Able to communicate technical information effectively to a wide range of stakeholders, both internally and externally.Must have very good verbal and written communication skills, as well as problem solving skills.Professional relations with vendors and contractors to complete capital projects.Ability to operate independently and as an experienced professional.Demonstrated full competence in Microsoft Office applications (particularly Excel and Word).Must be able to lift 20lbs frequently and be willing and able to use full-face respirator as needed.LI-USAre you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here."}