{"jobID": "2375248376", "jobLocation": "Austin_TX", "jobTitle": "Data Engineer", "companyRating": "4.9", "companyInfo": {"Website": "www.bound360.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " Bound is an industry-leading B2B website segmentation and targeting platform designed to create the relevant content experiences that drive buyer behavior. Using behavioral, demographic, and firmographic data, our platform creates personalized web experiences for both anonymous and known website visitors by allowing marketers to better engage potential and current customers wherever they are to drive measurable growth.  Our culture is collaborative and high-energy. No role here is more important than another — or more important than our customers. We win as a team and it’s wonderful. And we’re looking to add a talented Data Engineer to our group.  What you’ll be doing…  As the Data Engineer, you will work in an agile team environment to drive the collection, storage, processing and analysis of huge sets of data for our platform. You’ll leverage your skills as a creative problem solver and be productive working both independently and collaboratively. We use AWS extensively, so your experience with EMR and other web services will put you ahead of the game. Further, you will: Build and refine a resilient data pipeline that efficiently processes and stores data in the appropriate database and data warehouse solutionsGather and process raw data at scale (including writing scripts, web scraping, calling APIs, writing SQL queries, etc.)Process unstructured data into a form suitable for analysis — and then review it for general structure and accuracyCollaborate with data scientists to develop and support modeling and machine learning processesStay on top of the latest web development and data engineering innovations and trends Who you are…  As a Data Engineer, you have a can-do attitude and a passion for technology, data and development. You take pride in and ownership of assigned projects and possess a desire to learn new approaches. You are a detail-oriented engineer with a passion for learning and leveraging the best technologies to architect and build efficient and resilient data pipelines. You want to be a critical part of a small, collaborative but growing team of talented engineers. You also have: 3-5 years of Python software engineering experience with a focus on data processing3-5 years building and maintaining data pipelines and ETL processesExperience with AWS tools and services (S3, Kinesis, Lambda, Redshift)Experience with systems for handling large datasets such as Spark and HadoopExperience with relational, non-relational and document data storesExcellent visual, written, and verbal communication skills Our Perks & Benefits… Smart, thoughtful team and a culture of teamwork and supportEquityHealth, vision and dental coverageCasual fun work environment — beer clubs, happy hours, game nights, kickball and skee-ball leagues, and more!Community involvementFlexible vacation policy The Senior UI Web Developer will report to the Bound CTO and Co-Founder, Michael Hovey."}