{"jobID": "2788013859", "jobLocation": "Pasadena_CA", "jobTitle": "Client Service Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.westernasset.com", "Headquarters": "Pasadena, CA", "Size": "501 to 1000 employees", "Founded": " 1971", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " PIMCO, TCW, Oaktree Capital Management"}, "estimatedSalary": "81000", "jobDescription": " Provide data analysis, reporting and other analytical services to both internal and external clients. Produce and maintain custom recurring and ad hoc client portfolio reports for all investment strategies and client types across Western Asset’s global offices. Leverage industry specific analytical tools, SQL and Excel to perform portfolio, benchmark and market analysis. The individual will work closely with other groups and departments, including Portfolio and Risk Management, Information Technology, Investment Support and the Product Team. The successful candidate will bring a working knowledge of financial concepts as well as strong technical ability. Excel proficiency is a must and experience with coding languages is desired. Produce all standard and custom portfolio exposure reports for Western Asset Management’s global client base; ensure accuracy and timely deliverySupport both internal and external clients by providing portfolio and benchmark analytics and market data for client specific requests, RFPs, presentations monthly commentaries and special projectsBuild and maintain custom Excel models to generate client portfolio and benchmark reportingPartner with IT on Client Service and Marketing technology projects and upgradesCoordinate across departments on client requestsKeep current on investment strategies, market conditions and key occurrences in worldwide marketplaceStrong communication skills, both written and verbalExperience with VBA, SQL, Python, or other computer languages highly desiredExperience with industry specific analytical tools (Bloomberg, FactSet and Yieldbook) and Tableau a plusStrong computer skills particularly in Microsoft Office applications, especially ExcelFamiliarity with investments and accounting conceptsAbilility to work in a team-oriented environment"}