{"jobID": "2836805189", "jobLocation": "Washington_DC", "jobTitle": "TBM Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " A TBM Data Analyst job in Washington D.C. with the U.S. Department of State in the Bureau of Information Resource Management is currently available at Belcan. This job is a full-time direct position with benefits. To be considered for this role, you will need a Bachelor?s degree or MBA or other advance degree preferred and an equivalent of 3-7 years of work experience in the field of IT portfolio management. Your job is to support analysis of Department of State IT portfolio management data related to Information Technology (IT) planning and federal governance IT initiatives. This position supports the development of specific reports and implementation of metrics to include reporting and dashboards on Department of State IT acquisitions and/or spending trends. You will be expected to work collaboratively in a Federal agency environment with multiple stakeholders and team members. You will be under the direction of a Senior Business Analyst, but will be expected to be able to work independently with minimum supervision. Duties:  ? Work independently and closely with staff for strategic implementation of Technology Business Management (TBM) to support analytical needs for making decisions related to the IT portfolio  ? Experience with constructing and performing complex data manipulation queries and data visualization  ? Support efforts to collect, compile, and validate data and make calculations in support for management to make financial decisions regarding IT  ? Responsible for producing reports on monthly, quarterly, and annual basis to support management on IT and financial information  ? Retrieve and analyze trends in data related to IT capital planning, IT portfolio investments, and adherence to Federal IT regulations  ? Comfortable working on ad-hoc requests when needed to help with oversight or management concerns regarding IT and financial data  ? Responsible for maintaining and checking the accuracy of data for assigned projects  ? Supports and contributes to innovative ideas towards the development of analysis work for IT financial and budgeting information  ? Identifies business reporting needs and designs appropriate analytical solutions Qualifications:Required Skills: ? Bachelor?s degree in Computer Science, Engineering, Statistics, Economics, Accounting, Business Administration, Information Technology, or other related field required  ? A minimum of 3-7 years professional experience  ? Strong expertise in excel is required  ? Experience with statistical packages like R, Python, SAS, STATA, Matlab is preferred  ? Experience conducting research work and conducting analysis in a fast paced environment  ? Detailed oriented and interested in IT regulation and guidance  ? Experience communicating data results verbally  ? Excellent time management skills and the ability to meet deadlines  ? Proficiency with Microsoft Office tools such as Word, Excel, PowerPoint, Visio, etc  ? Ability to obtain a secret clearance is required Clearance: ? This position requires a Secret security clearance Education: ? Bachelor?s degree in Computer Science, Engineering, Statistics, Economics, Accounting, Business Administration, Information Technology, or other related field required Certification Requirements:? N/ADesired Skills: ? TBM certification  ? Accounting, category management, IT strategy and management, IT service management, or IT financial management  ? Experience with creating dashboards  ? Experience in federal consulting  If you are interested in this TBM Data Analyst position in Washington, DC please apply via the, \"Apply now? link provided. As an employee with Belcan Government Services, you will be part of one of the largest engineering firms in the United States. We maintain a small-company atmosphere as well as open communication at all levels of our organization, allowing for much more dynamic decision-making processes. We offer flexible schedules as well as an excellent mentoring system to ensure that you have all of the knowledge and tools you need to meet a diverse range of engineering challenges. You will also have opportunities to advance to positions of greater responsibility, including management roles. Your hard work and professional dedication will be rewarded with a competitive compensation package.  Belcan is an equal opportunity employer. EOE/M/F/D/V  Build a challenging and rewarding career with an industry leader  http://belcan.com/"}