{"jobID": "2764428576", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.activecampaign.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " HubSpot, Infusionsoft, Ontraport"}, "estimatedSalary": "72000", "jobDescription": "We are currently seeking a creative Data Engineer to join our Data Science team. At ActiveCampaign the Data Engineer will deal with terabytes of platform transactional data, user UI interaction time series, email and marketing content, user e-commerce trails, email enrichment tags, etc. Our team is passionate about leveraging value from this data for end user e.g. predict deal closures, predict best email send schedules, predictively suggest best email and marketing automation and much more. If this sounds like you and your next career move, then we would love to hear from you!We cannot offer sponsorship for this role at the moment.What your day could consist of:Owns data loads between data lake, internal data structures, internal and external API’sBrainstorms with data science team and suggest data and architectural solutions.Participates in data exploration, analytics insight (machine learning models).Maintains data science IT infrastructure (data stores, ETL tools, visualizations and runtime environments.Validates any incoming data.Helps with data science model productionalization as containerized micro service.What is needed:Script scheduled data manipulation (excellent python).Excellent SQL skills.Experience with common file and concept data structures (JSON, CSV, lists, dictionaries, data frames, etc.)Ability to quickly grasp and troubleshoot internal and external API’s for data ingest and output.Experience with AWS (access, admin, etc.)Administer databases (SQL, no-SQL, etc.) for scale, stability, security, multi-user load management and performanceAdministering ETL scheduling environments for global data validation and process stabilityExperience with any data visualization and reporting tools (D3, Tableau, etc.)Optimization of large data processes (500GB to -5TB)Experience with both batch and streaming data processingDesire to acquire//sharpen data science skills (statistical data exploration, machine learning, etc.)Experience with any containerized micro service (preferred)Experience with distributed data environments (Hadoop, Spark) (preferred)Scripting in GO (preferred)Experience implementing ETL processes with Airflow (preferred)At ActiveCampaign, we are committed to maintaining a culture that is inclusive and diverse. Our colleagues foster an environment that is warm, supportive, and helpful where we treat each other exceptionally well. We are looking to add curious, driven, and creative individuals to our team who are ready to grow with us! We continually invest in our employees and offer comprehensive benefits including 100% coverage of your medical premiums and 50% for dependents, unlimited PTO, fully paid maternity and paternity leave, 401k matching, catered lunches everyday in a kitchen stocked with snacks and fresh fruit, free CTA or Metra passes, and a DIVVY bike membership (to name a few).We continually invest in our employees and offer comprehensive benefits including 100% coverage of your medical premiums and 50% for dependents, open vacation policy, fully paid maternity and paternity leave, 401k matching, catered lunches every day in a kitchen stocked with snacks and fresh fruit, free CTA or Metra passes, and a DIVVY bike membership (to name a few).At ActiveCampaign, we are committed to maintaining a culture that is inclusive and diverse. Our colleagues foster an environment that is warm, supportive, and helpful where we treat each other exceptionally well. We are looking to add curious, driven, and creative individuals to our team who are ready to grow with us!"}