{"jobID": "2808199813", "jobLocation": "San_Francisco_CA", "jobTitle": "Director - Risk & Compliance", "companyRating": "4.8", "companyInfo": {"Website": "www.crosscountry-consulting.com", "Headquarters": "McLean, VA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " MorganFranklin Consulting, Slalom, Deloitte"}, "estimatedSalary": "91000", "jobDescription": "CrossCountry Consulting’s Risk practice is quickly growing and we are seeking an experienced leader to join our San Francisco office. It's an exciting opportunity to make an impact not only with our clients but within our firm. Our clients include many of the premier commercial companies in the area, offering exciting projects and exceptional growth opportunities. We provide our clients with a comprehensive suite of consulting and advisory services that include internal audit outsourcing and co-sourcing, Sarbanes-Oxley (SOX) compliance, enterprise-wide risk assessments, regulatory compliance, IT audit, cyber security and privacy reviews, and fraud and investigation services. You can find out more about our award-winning firm on www.crosscountry-consulting.com and Glassdoor.Responsibilities Provide executive leadership in the development and delivery of services in the following areas:Internal Audit Outsourcing/Co-sourcingSarbanes-Oxley ComplianceGovernance, Risk, and ComplianceTechnology & Information Risk AdvisoryFraud & Investigation ServicesServe as a key leader in our practice by:Providing input on strategic directionRecruiting and cultivating exceptional talentGuiding the use of methodologies and frameworksSupporting business development efforts in new and existing clientsPlan and lead client engagements by:Understanding the client’s needsDeveloping a corresponding scope and approachOrganizing and providing oversight of a teamLeading fieldwork and reportingProviding quality assurance for deliverablesIdentifying and addressing issues before they manifestDevelop and manage client relationships by understanding their business, listening to their needs, and ensuring responsive service and exceptional qualityManage the operational aspects of ongoing projects including planning engagements, developing budgets, monitoring against progress, performing quality control of deliverables, and delivering on scheduleManage teams by guiding performance against objectives, creating an atmosphere of trust and collaboration, modeling leadership behaviors, and encouraging continuous improvement and innovation Manage the business (e.g., profitability, fees, contracts of the Enterprise Risk and Internal Audit practice)Guide and direct operational and strategic firm and practice initiatives as a member of the leadership teamRepresent the interests of the firm during internal and client initiativesQualifications 15+ years of professional services experience leading complex engagements at a Big Four accounting firm, leading consulting firm, or commensurate experienceA bachelor’s degree (or higher) in accounting, finance, information systems, or a similar business or technical disciplineOne or more certifications such as CIA, CPA, CISA or CFEExtensive expertise working with risks and internal controls, including internal audit, compliance, and consultingAn understanding and appreciation for the role of internal audit as a business advisor with a purview that spans throughout the organizationRecognition as an expert in one or more technical areasExperience managing departments or consulting businessesAbility to grow business through acquiring new client relationships and fostering existing relationshipsBusiness acumen with a strong understanding of accounting and business processes, as well as information systemsStrong scope and risk management skills at the client and project levelConsistent success in building and developing deep relationships with key client and non-client business peopleStrong leadership skills with the ability to foster collaboration and excellenceThe ability to interact effectively at all levels of an organizationAble to lead and direct the proposal effort towards an opportunity, including appropriately budgeting and suggesting staffing for the engagementA proven record of recruiting and cultivating top talentStrong attention to detail with the ability to think from a “big picture” perspectiveCreativity, confidence, and flexibilityHigh energy, enthusiasm and an entrepreneurial spirit!Great sense of humor!Certifications Desired CIA, CPA, CISA, CISM, CISSP, CEH, OSCAP or Security +CrossCountry Consulting is the trusted partner and expert advisor to leading organizations that are dealing with pressing business needs. We help our clients transform their finance, accounting, operations, risk, and technology functions in order to effectively prepare them for complex change, optimized performance, and accelerated business growth. Our consultants work collaboratively with our clients to provide customized solutions to our clients’ specific and ever-changing needs.CrossCountryConsulting is built on the fundamental principles of dynamic growth and shared values. Our culture reflects an environment that nourishes and promotes excellent client service, team collaboration, and individual advancement."}