{"jobID": "1134039694", "jobLocation": "Austin_TX", "jobTitle": "Data Engineers", "companyRating": "5.0", "companyInfo": {"Website": "www.infochimps.org", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Media", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Data Engineers Data Engineers We are looking for Data Engineers to join our Austin or San Francisco engineering teams and help advance our state-of-the-art Big Data Platform. This role involves direct implementation of our product, immersion in our bleeding edge technologies at very large scale, and build out of new applications and platform components.It’s an opportunity to develop your skills working alongside a world-class team passionate about unlocking the signal buried in the noise of Big Data. We offer an exciting start up environment as part of CSC’s fast growing Big Data and Analytics group, providing competitive benefits and free daily lunch at our Austin office. Areas of Focus Develop new features to enhance our enterprise big data platform, working with Hadoop, Storm, Kafka, and Elasticsearch.Expand our world-class automated testing and provisioning infrastructure.Perform research projects into the edge of the envelope for big data capacity and throughput capabilities.Contribute to community supported open source projects including our own Wukong and Ironfan. Characteristics: EffectiveSimple solutions delivered quickly and maintainably. Fire and Forget.Previous experience with Java and/or RubyDoesn’t try to swallow the world — learns just enough about system to do the jobDisciplined & CommunicativeNot a perfectionist — make the “least, interesting” change so we can find out what else is needed.Assertive — must push back on management if wrong balance is being specified.Constructive — habitually finds creative solutions to blockersThinks at scaleUnderstands that an elaborate system is better than a complex one, and a scalable system is superior to a performant oneHas and learns patterns for decoupling, truth flow, orchestration Apply Now If you want to be part of our team, please send a resume and details about why you would be excited to work at Infochimps to careers@infochimps.com.For more information, see these job descriptions online:Senior Data Engineer: 1300PHESenior Data Engineer: 1300PHGSenior Data Engineer: 1300MNT"}