{"jobID": "2835769029", "jobLocation": "San_Francisco_CA", "jobTitle": "SENIOR DATA SCIENTIST", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "172000", "jobDescription": " Are you passionate about working with Big Data to solve business problems that directly impact our customers & our revenues and costs? Are you excited about gaining new insights & intelligence, and answering critical questions based on data? Welcome to the Outlook Data Science team. *Responsibilities***We are looking for exceptional Data Scientist to:** + Dive deep into data to find key insights that impact the business  + Actively mine petabytes of data on cloud computing infrastructure  + Develop models of usage, user behavior & business behavior.  + Build key predictive, regression, causal, time-series & optimization models. In this role: + You will have the opportunity to make significant impact on user acquisition & retention.  + Work with other teams to develop key metrics to achieve business outcomes Surface actionable recommendations.  + Focus will be on final customer & business impact *Qualifications***Qualifications: A Successful candidate should:** + Show strong passion for & understand the need to deliver right business impact by working with stakeholders to turn business problems into data analysis questions, and then unearthing deep insights from data. Demonstrated history of innovative thinking and problem solving skills in Big Data problems.  + Be self-driven, and show ability to deliver on ambiguous projects with incomplete data.  + Have strong hands-on experience in econometrics, decision sciences, machine learning & data mining is a plus.  + Have a deep familiarity with statistical models & methods (time-series analysis, regression analysis, experimental design, hypothesis testing, etc.) is a plus. Experience on large scale computing systems like COSMOS, Hadoop, MapReduce and/or similar systems is a big plus.  + Have strong skills in R, Python, and related tools for large scale analysis Excellent communications & interpersonal skills.  + Have the ability to convince other strong personalities of their ideas and communicate complicated analysis & insights to non-technical audience.  Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to askstaff@microsoft.com."}