{"jobID": "2761501183", "jobLocation": "Washington_DC", "jobTitle": "Algorithm Developer", "companyRating": "3.1", "companyInfo": {"Website": "www.peraton.com", "Headquarters": "Herndon, VA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": " OverviewPeraton is seeking a Algorithm Developer with proficiency in signal processing in Washington D.C. to support our Naval Research Laboratory (NRL) Customer.Responsibilities This position will include algorithm development in signal processing, data fusion and multi-INT fusion processing.The work will be performed in a small team (30 or so) of individuals comprising Web applications developers, algorithm developers, Database Engineers, Cloud applications, Cloud Analytics and Infrastructure Engineers. QualificationsREQUIRED:Education required – Bachelors’ Degree in Physics, Math or Engineering (or equivalent work experience (10-15 years)Minimum of 10 years of algorithm development and/or engineering experiencePrevious experience in signal processing and/or fusion processing within the Intelligence Community and/or Department of Defense.Familiarity and/or experience with mathematical application programming using C and C++ with scripting languages.Knowledgeable about Database interfacesFamiliarity with SIGINT and GEOINT data characteristicsOperating Systems – LINUX (primary)Strong communication skillsSECURITY CLEARANCE:This position requires the candidate to already have a current Top Secret clearance with polygraph.About PeratonPeraton provides innovative, reliable solutions to the nation’s most sensitive and mission-critical programs and systems. Peraton has significant experience providing highly differentiated secure communications, space, and technology solutions to key customers, and has become a trusted partner on missions that are critical to the security priorities of the United States. Capabilities include complex software and technology services and solutions, as well as end-to-end mission operations abilities, including Software Systems Development, Cyber, Modeling & Simulation, Mission Operations, Signal Intelligence (SIGINT), and Quick Reaction Capabilities (QRC) / Research & Development. The company is headquartered in Herndon, VA, with approximately 3,500 employees across the U.S. and Canada.EEO StatementWe are an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law."}