{"jobID": "2836882591", "jobLocation": "Redwood_City_CA", "jobTitle": "Associate Analytics Manager", "companyRating": "3.3", "companyInfo": {"Website": "www.shutterflyinc.com", "Headquarters": "Redwood City, CA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Public (SFLY) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Snapfish, Vistaprint, Minted"}, "estimatedSalary": "87000", "jobDescription": " Shutterfly made an exciting move recently by acquiring Lifetouch. This acquisition represents the merging of two companies that are undisputed leaders in their respective spaces, as well as two uniquely complementary businesses. Most importantly, we share a common mission – to help customers share life’s joy through photos – and highly aligned values that guide how we work in service to our customers, to our business and to one another. As we move forward, our goals are twofold: 1) continue to drive both businesses forward while 2) finding opportunities to create real value as a combined company  The Associate Manager, Marketing Analytics role for Lifetouch will drive actionable insights through deep-dive behavior analyses, statistical modeling, campaign performance analyses and integrated reporting, supporting the marketing strategy teams at Shutterfly Inc. The role will primarily support analytics projects around Lifetouch and Shutterfly merger marketing strategy. This person will manage end to end project execution by gathering stakeholder requirements, developing proper methodology, identifying and locating requisite data, performing accurate overlap analysis between Shutterfly and Lifetouch, reporting on cross brand migration and acquisitions, guiding A/B test designs for measurement, and presenting the results in a digestible format for those without analytical backgrounds. The role will also need to respond to ad hoc / planning requests for analysis for planning purposes that will be used for understanding campaign performance for email, onsite, direct mail, and other channels as they develop; analyses should incorporate impact from multiple channels.  POSITION RESPONSIBILITIES: Provide actionable insights to drive key decisions across the marketing organization using a range of analytical/statistical techniques from descriptive analysis to predictive/explanatory modelsBuild analytical models, recommend targeting approaches and inform targeting strategies to improve marketing performanceDeep dive analyses on the effect of targeting frequency and impact of promo messagingGuide designs on A/B tests to measure the effectiveness of marketing programsAnalyze campaign performance and develop standard reports to share with cross-functional teamsUnderstand sources of customer information and partner with Engineering and Data warehouse teams to ensure data accuracyManage the reporting universe used to create reports for the marketing users and update as neededUnderstanding client needs through ongoing communication and managing projects to completion on time REQUIREMENTS: Bachelor’s degree in a quantitative field (Business, Statistics, Economics, Engineering, etc.) required.4+ years of prior experience in a role with heavy emphasis on data analysis and metrics development3+ years of hands-on experience analyzing and interpreting data, drawing conclusions, defining recommended actions, and reporting results across diverse stakeholders3+ years of advanced SQL development skills3+ years of experience with data visualization tools like tableauExperience with one of the following statistical tools/programming languages: R, Python, SPSSKnowledge and implementation skills of supervised and unsupervised machine learning algorithms: Feature set creation, feature optimization and imputation, algorithms (Clustering, Decision Trees, Regression, PCA) and their real-world advantages/drawbacksFamiliarity with online analytics tools such as OmnitureAbility to manage multiple projects on tight deadlinesExceptional problem-solving and analysis skills combined with the ability to communicate findings to all levels of an organizationAbility to think from both at the conceptual/strategic level as well execution/implementation. Accuracy is very important requiring great attention to detail."}