{"jobID": "2723850876", "jobLocation": "Hayward_CA", "jobTitle": "Distinguished Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.danisco.com", "Headquarters": "Palo Alto, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": " Job DescriptionCorteva Agrisciences is  seeking a Distinguished Data Scientist to join our global Data Science and  Informatics group working on predictive analytics for digital agriculture. If  you are interested in analyzing one of the largest collections of farm data; in  optimizing management practices for one of the largest farming operations; or  in developing simulation strategies that will provide the next generation genetics/crop-protection/farm-management-practices  for millions of farm-acres across the globe, our opening for a Distinguished  Data Scientist is your opportunity.  At Corteva Agriscience™, Agriculture Division of DowDuPont™, you’ll become part  of an interdisciplinary, global work environment in which you will operate as a thought leader and visionary that  will encourage and promote disruptive advances by applying state-of-the-art  methods in data science and artificial intelligence to critical problems  spanning multiple segments of the organization. Your strong and extensive  background in machine/deep learning, statistical simulations and systems  optimization will enable you to gain insights from a wide array of structured  and unstructured datasets consisting of global-scale spatio-temporal sources (farm-equipment,  UAV, satellite, weather, soils etc.), imagery, sequencing & gene-expression  data, proximal sensors and IoT streams. This  is a critical position with strategic impact on our business and you will play  a major role by driving innovation in agriculture technology.Working closely with data scientists, data engineers, researchers and  business collaborators across the organization, you will develop and deploy sophisticated  end-to-end solutions on a wide range of problems in digital agriculture. This  will require excellent interpersonal communication skills and an aptitude for  building networks, within and outside the companyJob Qualifications PhD or similar qualification in a quantitative  data science discipline6+ years of work experience post-PhDUnderstanding  of computational learning theory, graph theory, statistical methods,  simulations & optimization.Experience  in the design and optimization of ML/DL and AI architectures for pattern  recognition, object detection, anomaly detection, regression, causal network  analysis, unsupervised learning, natural language processing and sequence/gene-expression  analysis.Expertise  in numerical methods, mathematical modeling and combinatorial optimization  techniques in combination with machine learning methods for gaining model  insights.Expert  programming skills in R, Python and C/C++ programming with the ability to  quickly create prototype solutions on Unix / Linux / Cloud platforms using open  source tooling and libraries as necessary.Excellent  interpersonal, verbal and communication skills and a can-do attitude with the  ability to thrive in a fast-paced dynamic environment.Excellent analytical  and problem-solving skills with the ability to work as part of a global team  and, at times, independently while appropriately prioritizing tasksWe  are excited to announce that Corteva Agriscience™ is the name of the  new Agriculture Division of DowDuPont™. We are bringing together DuPont  Crop Protection, DuPont Pioneer and DowAgroSciences to create a  market-shaping, standalone agriculture company with leading positions in seed  technologies, crop protection and digital agriculture. We will work across the  global agriculture value chain to create a more efficient food system.At Corteva Agriscience™, we seek to  enrich the lives of those who produce and those who consume. This means we will  help rejuvenate the agricultural ecosystem to support people and the planet and  to ensure progress for generations to come.LI-CK1 About DowDuPontDowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the  intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty  products sectors that will lead their respective industries through productive, science-based innovation to meet the  needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.  The positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials  Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies.  Information on the division alignment will be provided during the recruitment process."}