{"jobID": "2787596022", "jobLocation": "Howell_MI", "jobTitle": "Associate Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.hanover.com", "Headquarters": "Worcester, MA", "Size": "5001 to 10000 employees", "Founded": " 1852", "Type": " Company - Public (THG) ", "Industry": " Insurance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Job Description The Hanover Insurance Group is seeking an Associate Data Analyst to join our growing Personal Lines Team in our Howell or Worcester locationsPosition summary:Applies analytical skills to the development and enhancement of unique proprietary business tools that drive the optimization and consolidation of Agent partners business and are strategic differentiator to the unique Hanover business model. Assists in developing tools, processes and reporting analytics in support of business growth and ongoing business needs. Communicates with customers, external partners and internal departments frequently.This is a full-time, exempt position.Responsibilities including the following, but others may be assigned:With oversight, provides support to complex business/technical processes and tools for multiple products, requiring the use of technical solutions across multiple departments or lines of business.Serve as a team member on projects of large scope and moderate to high complexity.Has aptitude to develop and learn multiple technical business systems enterprise wide.Develop data and reports for field and customers to clearly articulate value to agent partners and customers.Provide timely and accurate analytical support to team supported, ensures results are validated to ensure accuracy.Develop an understanding of business processes and the P&C; Insurance business to translate requirements into analytical reporting.Summarize information and effectively communicate analyses in writing and verbally to internal partners.Participate in the development of innovative solutions by approaching problems with curiosity and open-mindedness, using existing information to its fullest potential.Interview business users to obtain data requirements for applications.Collect, analyze, and report data to meet customer needs.Participate in the development of new tools and process enhancements to enable new capabilities and solutions to drive business growth.Assist in various projects, meet deadlines, and handle multiple priorities in a fast-paced, ever-changing and evolving business environment.Establish relationships with one or more business partners by building knowledge of business processes/drivers and technical systems.Document processes to allow for consistent approach to future initiatives.Proactively research and apply Best Practices to technology solutions.Participating in the development of prototypes for various reporting, system and tools.May research, prototype and write research briefs on emerging technologies related to data and analytics.May develop code, tests, debug and document working data and analytics systems to demonstrate the business value.May apply proven data management techniques, application development methodologies and other technologies to produce comprehensive prototype solutions. Position Requirements Bachelor’s degree1 to 3 years of related analytical experience requiredAdvanced understanding of Microsoft ExcelAbility to work independently with guidance and direction as appropriateStrong business and financial acumen, and has the aptitude to learnMust be intellectually curious, self-motivated, and organized Solid analytical and problem solving skillsStrong communication and interpersonal skillsKnowledge of programming language and scripting language related to data and integration is preferredEEO statement:“The Hanover values diversity in the workplace and among our customers. The company provides equal opportunity for employment and promotion to all qualified employees and applicants on the basis of experience, training, education, and ability to do the available work without regard to race, religion, color, age, sex/gender, sexual orientation, national origin, gender identity, disability, marital status, veteran status, genetic information, ancestry or any other status protected by law.Furthermore, The Hanover Insurance Group is committed to providing an equal opportunity workplace that is free of discrimination and harassment based on national origin, race, color, religion, gender, ancestry, age, sexual orientation, gender identity, disability, marital status, veteran status, genetic information or any other status protected by law.”As an equal opportunity employer, Hanover does not discriminate against qualified individuals with disabilities. If you require a reasonable accommodation, as a candidate for employment, please inform The Hanover Talent Acquisition office. The Hanover Insurance Group does not accept unsolicited Agency resumes. The Hanover Insurance Group will not pay fees to any third party agency or firm that does not have a signed \"Employment Agency Agreement\" already on file with Human Resources - The Office of Talent Management."}