{"jobID": "2812654424", "jobLocation": "Irving_TX", "jobTitle": "Customer Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.rmscorp.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " Title Customer Listening and engagement Journey analyst  Position Summary: - The Customer Listening and Engagement Journey Analyst will be responsible for understanding the end-to-end customer experience and leveraging the tools available to provide insights on Major Global Bank customers. The Journey analyst will be on the front line of gathering customer info, transactional behaviors and quantitative and qualitative data, such as feedback from customer surveys to help drive and support strategic initiatives  Description & Nature of Assignment: - The analyst will perform a crucial role in the development and implementation of customer journey analytics and insights in collaboration with Major Global Bank partners across the organization. In addition, the analyst will work to ensure initiatives are in line with strategic priorities and monitor their success criteria. To ensure effectiveness, this position will also be responsible for identifying, implementing and monitoring metrics to measure performance in these areas and to develop action plans and objectives to continuously improve.  Objectives: - Create and monitor metrics, dashboards and reports to identify opportunities to improve Customer Experience and track the impact of key initiatives. - Deliver reporting and strategic insights through analysis to drive improvements to the Customer Experience - Conduct deep-dive analysis and investigations to better understand end to end Customer Experience including touch points, cross-channel behaviors, drivers, preferences and segmentation - Provide compelling recommendations that drive action through the effective use of data, customer insight analysis and presentation skills. - Participate in cross-channel projects and teams to ensure CLE is supporting these efforts through analysis and is up to speed with potential upstream/downstream activities. - Contribute to the development of new Customer Experience KPIs, metrics, tracking methodologies and data visualizations that provide complete customer journeys  Required Skills: - Must have a high level of intellectual curiosity. - Must be highly proficient in Microsoft Office Suite, specifically PowerPoint and Excel - Excellent written, verbal and interpersonal communication, organization, analytical and statistical skills. - Must be able to multi-task efficiently and effectively. - Critical thinking skills and the ability to quickly assimilate new information. - Experience in analytical problem solving and working with large datasets. - Experience in Customer Experience analysis, including web analytics, customer segmentation analysis, contact center analysis, marketing analytics, etc. preferred. - Adobe Analytics and/or Tealeaf experience preferred - BA/BA or equivalent work experience required. - Financial Service and/or Consumer Banking marketing experience preferred. 121101 Please see our complete list of jobs at:  www.rmscorp.com"}