{"jobID": "2807725122", "jobLocation": "Montvale_NJ", "jobTitle": "Lab Research Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.rb.com", "Headquarters": "Slough, United Kingdom", "Size": "10000+ employees", "Founded": " 1823", "Type": " Company - Public (RB) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " The R&D; Scientist will work with technical product development on key projects for the R&D; team.  Key Responsibilities  Formulate and support development of new products and technologies based on relevant consumer insights in support of brand initiatives.  Support key projects through the product development process as R&D; representative.  Work cross-functionally and be R&D; lead on project teams to achieve key milestones and objectives.  Conduct performance and analysis evaluations of products.  Ability to perform basic laboratory techniques at the bench.  Maintain supplies inventory and order items when needed.  Read, understand and apply SOP / ISO / GLP protocols with regards to:  Data generation for Product Registration for submission to Global Regulatory Agencies.  Proper operation, standardization & maintenance of lab equipment.  Maintaining accurate laboratory notebooks.  Following Safety and Good Housekeeping requirements.  Is this You?  High school diploma and 5-10 years experience, or  BS/BA degree in a related science and 0-2 years’ experience  Strong formulation knowledge and understanding of chemical interactions.  Excellent organizational and problem solving skills.  Strong interpersonal skills to nurture teamwork and foster an environment of achievement.  Results-oriented and self-motivating.  Ability to display a degree of flexibility and adapt effectively to change.  Excellent networking and communication skills.  Proficient with common software, including MSOffice.  Proactive mindset fitting with RB Core Values and able to exhibit entrepreneurial attributes."}