{"jobID": "2796457630", "jobLocation": "Pontiac_MI", "jobTitle": "Industrial Maintenance Technician - (Piping)", "companyRating": "3.8", "companyInfo": {"Website": "www.leecontracting.com", "Headquarters": "Pontiac, MI", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "20", "jobDescription": "Lee Contracting, Inc. is dedicated to client satisfaction. We provide the highest quality design and implementation services available. Lee Contracting, Inc. is at the forefront of innovative changes in process manufacturing, plant optimization, business operations, and overall performance. Our staff is comprised of hardworking, dedicated and ambitious employees and we welcome candidates of the same stature to join and grow with our team!We are proud to offer our employees:Health Insurance401kCompetitive WagesPaid VacationPaid HolidaysESOP – Employee Stock Ownership PlanJob Requirements3–5 years of industrial repair experienceExtensive experience installing piping/lubrication systems on stamping pressesAbility to install, maintain, and repair lubrication systems (ie: Trabon) and pump systems (ie: Haskel)Possess the ability to perform preventative maintenance on industrial equipment and machineryAbility to interpret blueprints, schematics, shop drawing and other documents such as safety rules, maintenance instructions, and customer internal rules and regulationsRigging, welding, and industrial machine repair experience a plusExperience with minor electrical troubleshooting a plusWillingness to travelMust be willing to work off shift/be on call when necessaryCDL-A license a plusJob ResponsibilitiesPerform onsite diagnostics, troubleshooting, installation, and repairs of industrial machinery and equipment hydraulic and lube systemsMeasure, cut, thread, and bend various sizes of pipe/tubing to required angle/length using pipe cutters and benderCommunicate with internal departments and customers regarding scope and progress of equipment repairTrack work performed through detailed work summaries and work ordersOther duties as assignedThis job description reflects management s assignment of essential functions, and nothing in this herein restricts managements right to assign or reassign duties and responsibilities to this job at any time."}