{"jobID": "2837208777", "jobLocation": "Brea_CA", "jobTitle": "Quantitative Analyst - Cons Prod Strategy Analyst II/III", "companyRating": "3.6", "companyInfo": {"Website": "www.bankofamerica.com", "Headquarters": "Charlotte, NC", "Size": "10000+ employees", "Founded": " 1904", "Type": " Company - Public (BAC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": "Job Description: Responsible for performing more complex analysis and modeling for multiple products with the goal of maximizing profits and asset growth and minimizing risk and operating losses and/or other financial and marketing exposures. Develops complex program models to extract data and uses multiple databases to acquire statistical and financial data. Utilizes portfolio trends to propose policy/procedural changes within segmentation structure to produce optimal results. Excels at risk/reward trade off. Build relationships with external agencies. Participates in the rollout of company-wide pilot programs developed as a result of programmed models. Duties primarily include the regular use of discretion, independent judgment, the ability to communicate with multiple levels of management and the utilization of core leadership behaviors. SAS and/or MicroStrategy experience preferred; 2-5 years experience preferred. Position may be filled as an Analyst II or III depending on experience.Responsibilities Collection and Recovery Strategies / Operations Enablement develops initiatives and tactics that help our customers through difficult times while mitigating losses for the Bank. A Consumer Product Strategy Analyst must be able to work independently to develop recommendations that consider their research and analysis, the regulatory framework, and competing strategies. The analyst must then leverage communication and influencing techniques to build consensus and drive implementation. This high visibility position offers a unique opportunity to interact with senior managers and drive significant business results.  In addition to traditional voice-calling treatment, Collections utilizes alternative channel treatment to reach its customer base, including direct mail, email, text, and online websites. The Channel Strategies team leverages a data analysis to maximize ROI while maintaining operational quality and ensuring a positive customer experience. Areas of focus include: Leveraging data and/or models to identify customer preferences and response trends with respect to various alternative channel treatments.Optimizing the treatment sequence across both traditional and alternative channels to improve ROI as well as the customer experience.Trigger-based channel treatment.Channel sequencing and integration strategies.Leveraging existing channels to increase on-line visitation and self-servicing rates.Aligning operational processes to the current loss environmentRequired Skills & ExperienceStrong analytical and problem solving skills as demonstrated by 3-5 years of experience2+ years programming and analytics experience with SAS/SQLStrong evidence of leveraging analytics to drive business resultsQuantitative analyst experience, including skills like data mining and statisticsSkilled with MS Office (Excel, Access, Word, and PowerPoint)Proficient at written and oral communication, including presentation skillsDesired Skills & ExperienceAdvanced data mining / programming and analytics experience with SAS/SQLExperience working within the Bank's data infrastructure (BACARDI, The W, SQL Server, etc)Experience with business case development/financial statementsExperience with process design/redesign (ex. Six Sigma, Engineering)Advanced Degree (MBA (Operations preferred), Industrial Engineering, Statistics, etc.)Collections or channel campaign management experience"}