{"jobID": "2835262900", "jobLocation": "Chicago_IL", "jobTitle": "Data Architect", "companyRating": "2.9", "companyInfo": {"Website": "www.highpoint-solutions.com", "Headquarters": "East Norriton, PA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "REQUIRED EXPERIENCE: Healthcare experience, preferably from a Blue Cross Blue Shield plan, otherwise a healthcare payer  7-10 years of IT/Healthcare experience in a Technical Consulting, Data Architect/Scientist, or Developer position and recent experience as an Architect DESCRIPTION: Looking for a high level architectural candidate, but also looking for someone that is willing to be hands on as well. We need a Strong individual who can understand the different relationships they have with vendor partners and how taking that data back in house or vice versa is going to affect a specific data model moving forwardIdeally we want people who used to specialize in Data Modeling, Business Intelligence, Report Writing, Application Development, etc. who have moved into more architectural roles.Someone who came up from a technical type role and molded themselves into an architect is the ideal background.Client has different project that are floating around and he needs to assign an architect to these projects.This person will be responsible for interacting with two different types of groups. oThe first will be speaking with different business line leaders (Medicare, Medicaid, Commercial Insurance) to understand and gather specific requirements around the data.  oThe second will then be dealing with the technical teams/data modelers/analysts that will be taking this data to create data flow diagrams to ultimately create a solution document.  Need people who understand how to bring data in and out of the organization effectively. Need to understand the business impact but also the technical impact for each specific task  Additionally, we need people that understand MDM concepts and having a single source of truth around specific data sets RESPONSIBILITIES: oGather requirements/meet with the business to understand needs.  oListen to what they are saying, but also what they might not be saying (advisory).  oThis part will require the right individual to deal with business type leaders who don’t understand the technical side of the equation.  oFrom there, this person will need to understand the business technical design behind the requirement, how this design will impact the organization, and then be able to translate this to analysts and data modelers to create a solution document Need people who can hit the ground running and work off of minimal direction.- provided by Dice healthcare"}