{"jobID": "2787956467", "jobLocation": "Sunnyvale_CA", "jobTitle": "Senior Scientist I", "companyRating": "2.4", "companyInfo": {"Website": "www.pharmacyclics.com", "Headquarters": "Sunnyvale, CA", "Size": "501 to 1000 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Acerta Pharma, Kite Pharma, Genentech"}, "estimatedSalary": "150000", "jobDescription": "Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer.  More than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer.  To learn more about us, please visit us at http://www.pharmacyclics.com/ Pharmacyclics is seeking a Senior Scientist I.General Position Summary/Purposes Provide strong scientific and technical initiative and hands-on implementation of assay development and new target identification/validation in the fields of hematologic malignancies and immuno-oncology. Conceive and execute novel scientific approaches to achieve departmental project goals. Key Accountabilities/Core Job ResponsibilitiesDevise and implement strategies to identify new targets in hematological malignancies and immune-oncology.Actively participate in internal and external scientific meetings by presenting and critically evaluating emerging scientific literature to contribute to projects.Impact projects through experimental designs, critical analysis and interpretation of results and communication of results promptlyRead and evaluate scientific literatureStrong relationships with peers and cross functionally with partners to achieve high performance. Strongly embrace the ideas of others and nurtures innovations.Qualifications:Ph.D with postdoctoral training in molecular biology/ immunology/ cancer biology.Strong track record of peer-reviewed publications and presentations.Required Experience:Expertise in molecular biology skill sets including gain of function or loss of function techniques to validate targets (transduction of primary cells, CRISPRi etc)Expertise in ELISA, western blotting, cell culture, separation techniques for primary cells and cell-based assays, gene expression analysisStrongly prefer candidates with hands on experience with flow cytometryPreferred candidates with experience working with immune subsets and functional analysis of immune cells.Willing to troubleshoot experimental procedures and should be adaptable to changing requirements of the projectBasic knowledge on biological data analysis tool (GraphPad Prism, FACS DIVA software, FlowJo)Contribute to lab and equipment maintenance and order supplies/reagents to help create a safe, effective and efficient working environment.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}