{"jobID": "2837708541", "jobLocation": "Kenilworth_NJ", "jobTitle": "Senior Scientist, Analytical", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  The Protein Mass Spectrometry group in Bioprocess Development is seeking a talented and self-motivated scientist with solid experience in higher order structural characterization of proteins by LC-MS. As a Senior Scientist, you will work with a highly collaborative team of scientists from Bioprocess Development and Biologics Discovery to conceive, design, plan and implement MS-based experiments to advance the development of biotherapeutics.  Qualifications  Education Minimum Requirement:  Ph.D. degree by end of 2018 in Analytical Chemistry, Biochemistry or related field.  Required Experience and Skills:  Extensive experience in biological mass spectrometry and liquid chromatography;  Hands-on experience in higher order structural elucidation of recombinant proteins by mass spectrometry;  Experience in qualitative and quantitative MS studies of recombinant proteins or proteomics;  Ability to design experiments, interpret and track results, and utilize the information to optimize and advance MS-based analytical methods;  Hands-on experience with software for MS data analysis of proteins;  Experience of protein/peptide sample handling and processing for LC-MS;  Capability of trouble shooting issues in routine maintenance of MS instruments;  Excellent organizational skills to manage multiple projects;  Good written and oral communication skills and ability to work in a multidisciplinary working environment.  Preferred Experience and Skills:  Experience in bioinformatics tools and robotic sample handling;  Good understanding of biochemistry methodologies"}