{"jobID": "2797001367", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Marketing Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "91000", "jobDescription": "Basic Qualifications:Minimum of Bachelor's Degree required in related field; strong preference for fields of study in the data science, economics, statistics, and social sciences. Minimum of 5 years of increasing experience in management consulting or industry Minimum of 5 years delivery experience in advanced modeling environment: strong understanding of statistical concepts and predictive modeling. (e.g., AI neural networks, multi-scalar dimensional models, logistic regression techniques, machine-based learning (i.e. Azure, TensorFlow, etc.) Minimum of 5 years expertise with the Microsoft suite (including advanced Excel skills with embedded Pivot Tables & Macros; advanced PowerPoint usage) A minimum of 4 years experience with predictive analytics and BI tools which may include at least two applications from R / Revo R, SAS, Python, Spark, and TableauProfessional Skills:Possess a blend of marketing acumen, consulting expertise, and analytical capabilities that can will create value and insights for our clients. Experience in the analysis of marketing databases using SAS or other statistical modeling tools. Experience with analytic projects in the following areas: Applied Statistics/Econometrics, Statistical Programming, Database Marketing Management & Operations, Digital, Marketing Intelligence & Competitive Analysis Experience in professional services negotiations, deal shaping, and pricing Enthusiasm in executing the end-to-end sales cycle while performing work within an account Enthusiasm in supporting peers in designing and authoring proposals and RFPs Has project management, time management and communication skills necessary to execute the responsibilities and deliver against client expectations Demonstrated teamwork and collaboration in a professional setting; either military or civilian Plan and manage own work in collaboration with the team to meet assigned deliverables in a timely manner. Excellent written and oral communication skills with ability to clearly communicate ideas and results to non-technical business peopleAll of our consulting professionals receive comprehensive training covering business acumen, technical and professional skills development. Youll also have opportunities to hone your functional skills and expertise in an area of specialization. We offer a variety of formal and informal training programs at every level to help you acquire and build specialized skills faster. Learning takes place both on the job and through formal training conducted online, in the classroom, or in collaboration with teammates. The sheer variety of work we do, and the experience it offers, provide an unbeatable platform from which to build a career.Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  Applicants for employment in the U.S. must possess work authorization which does not require now or in the future sponsorship by the employer for a visa.Accenture is an Equal Opportunity Employer. Accenture is committed to providing veteran employment opportunities to our service men and women."}