{"jobID": "2750974441", "jobLocation": "San_Francisco_CA", "jobTitle": "Data and Policy Analyst III – Healthcare and Payment Policy Research Coordinator", "companyRating": null, "companyInfo": {"Website": "www.acumenllc.com", "Headquarters": "Burlingame, CA", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Government", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Acumen"}, "estimatedSalary": null, "jobDescription": " Job DescriptionPosition Summary: The Data and Policy Analyst III position provides analytical support for research and consulting projects for government and private clients, primarily in the area of health policy. This position is responsible for managing and analyzing data, researching and interpreting policy, and communicating findings to multiple audiences.  The Healthcare and Payment Policy group works with multiple federal agencies, including the Center for Medicare (CM) at the Centers for Medicare and Medicaid Services (CMS) and the Office of Assistant Secretary for Planning and Evaluation (ASPE). A major focus of the group’s projects is the development of data-driven tools to identify, monitor, and analyze the effects of payment policy changes in real time. The group also develops and evaluates Medicare payment policy, including working directly with CM to propose and implement major payment policy reforms. Lastly, the group performs detailed data analysis and statistical modeling to simulate the effects of alternative payment models (APMs), and to design and propose changes to existing APMs. Currently, this research area covers over 15 active projects that span multiple policy settings, and continues to expand.  As the group coordinator, you will work under the supervision of the group’s research manager. This role is intended to support long-term development of the teams and projects under this research area, and you will play a critical role in improving sustainability and scalability of projects that are active across the group. Job Functions and Responsibilities: Under general supervision, the Data and Policy Analyst III performs some combination of the following job functions: Prepares descriptive statistics in draft formConducts literature searches and other independent research and drafts summaries of findingsAssists with conducting econometric and statistical analyses of data using statistical software such as SAS and STATAAssists with coordinating project activities and communications among diverse groups of internal and external clients and team membersAssists with interpreting study specifications, research findings, and quantitative analyses for relevant audiencesAssists with developing research files from large confidential datasets, such as health care claims, enrollment data, and payment dataAssists with preparing project reports, memos, presentations, and proposalsAssists with delivering technical assistance and presenting findings to clients In addition, the Data and Policy Analyst III: Complies with company policies and with applicable laws and regulationsDemonstrates professionalism in the workplacePerforms other duties as assigned Required SkillsQualifications Required:Education and ExperienceBachelor’s degree in a quantitative, public policy, or related field, or equivalent relevant experience18 months of work experience (in addition to experience in lieu of degree)Position-specific QualificationsExcellent quantitative analytical skillsExcellent organizational skills and attention to detailExcellent oral and written communication skillsExperienced in one or more of the following technical competencies: StatisticsProgrammingPolicy writingResearch methods documentationProject managementSkilled in Microsoft Office SuiteExperienced in prioritizing tasks and meeting deadlines in a fast-paced environmentExperienced at working in a team-oriented environmentExperienced in demonstrating initiative, critical thinking, and problem-solvingAble to demonstrate strategic and goal-oriented thinkingFamiliar with identifying relationships among projects or tasksAble to leverage efficiencies among projects or tasksQualifications DesiredDemonstrated aptitude and enthusiasm for learningDemonstrated interest in health and social policyStrong critical thinking and a high level of initiativeExperience with file management and task trackingFamiliarity with database managementBasic knowledge of PowerShell and/or VBAAny application without a cover letter will not be considered. Transcripts and writing samples are not required, however highly preferred and may be requested. We are excited to review your application and look forward to seeing how you may best contribute to our work.Job Location  Burlingame, California, United States  Position Type  Full-Time/Regular"}