{"jobID": "2836812625", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.chegg.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Public (CHGG) ", "Industry": " Consumer Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "212000", "jobDescription": "SENIOR DATA SCIENTISTData Science | San Francisco, CA, United StatesYour goal to improve the education process and better the lives of students -- through data and algorithms.The Problem: 63% of high school graduates lack the writing skills to succeed in college, leading to poor outcomes in their careers. The vision of Writing Tools is to help students with the entire writing process from planning, outlining, drafting, to citations. With the recent acquisition of WriteLab, Chegg's immediate focus will be on improving the drafting process and becoming the best-in-class writing platform. The Writing Tools Team at Chegg is looking for an exceptional data scientist with a linguistic bent to join the team.  Organization:Learning Services Data Science (LSDS) The LSDS team is an embedded Data Science team that works directly with Cheggs biggest business lines. By moving quickly and iterating constantly, we strive to improve the experience of millions of students with projects that go live in weeks, not years. We work side-by-side with managers, engineers, designers, and other data scientists to get straight to the heart of problems. Role: Senior Data Scientist As a Senior Data Scientist, your primary focus will be to improve the automatic feedback system for grammar. You will be working with the product team and a community of data scientists to solve interesting problems. Responsibilities:using a mix of rule-based and machine learning methods to detect errors and generate suggestionsimproving the data pipelines by generating realistic data and gathering labeled data from annotation communitiesowning the deployment of your models and A/B testing them to make sure you gain the user's trustmanaging tens, if not hundreds, of models and developing a QA processpresenting your work to data scientists within Chegg and to the outside communityRequirements:Strong foundations in linguistics and natural language processing 2-4 years of experience preferredAbility to write linguistic rules (preferably in Python) that simulate or detect linguistic phenomenaWork experience deploying machine learning productsA deep learning experience is a plusPreferred:Advanced degree in Linguistics or Computational Linguistics.Deep experience in python.Experience working with big data platforms such as Hadoop, Spark, or Elastic MapReduce a plus.About Chegg: As the leading student-first connected learning platform, Chegg's Student Hub makes higher education more affordable and more accessible, all while improving student outcomes. Chegg is a publicly-held company based in Santa Clara, CA with offices in San Francisco, New York, Portland, India, Israel, Berlin, and Ukraine. Chegg Student Hub Services Includes; Chegg Study, Tutoring, Writing Tools, Math Help, Test Prep, Careers Search, Internship Admissions, and College Admissions. Video Shorts - Life at Chegg: https://jobs.chegg.com/Video-Shorts-Chegg-ServicesCertified Great Place to Work!: http://reviews.greatplacetowork.com/cheggFor More Information: https://jobs.chegg.com/Chegg is an equal opportunity employer #LI-BR"}