{"jobID": "2796352920", "jobLocation": "Troy_MI", "jobTitle": "Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.nabancard.com", "Headquarters": "Troy, MI", "Size": "1001 to 5000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "PAYPROTEC - For almost a decade now, we've helped tens of thousands of merchants nationwide seamlessly accept payments at their storefronts, web property, and/or mobile environment. We listen to our customers and partners to better serve their needs. We pride ourselves on the relationships we have with our partners and clients and the support that is provided. SALES RECRUITER -- PayProTec is seeking a full time sales representative to recruit and develop new ISO's, agents, and other merchant and business relationships. This position is a remote role based anywhere in the US. You will focus on self-sourcing activities to expand outside sales, grow a network of prospects to acquire new sales partners and to develop strong relationships with clients to maximize revenue.  Here are some of the other responsibilities you might have: Recruit and develop new Sales Partners (Agents/ISO's/ISV's/Strategic Partners) primarily via self-generated leads by utilizing cold calling, professional networking, and personal connections and resources within the candidate's network.Respond to sales partner inquiries generated by company advertising campaigns, media events, and attendance at industry conferences.Grow revenue within existing accounts using value selling methods.Understand products and services of PayProTec and provide value based sales skills to secure additional revenue.Conduct effective negotiations.Research organizations and individuals online (especially on social media) to identify new leads and potential.Contact potential customers via email or phone to establish rapport and set up meetings.Attend conferences, meetings, and industry events.Prepare PowerPoint presentations and sales displays.Contact customers to inform them about new developments in the company's products and service offerings.Develop quotes and proposals.Maintain a professional strong relationship with all partners and clients. Here is what we need from you: Bachelor's degree or equivalent work experience.Minimum three (3) years' of proven direct merchant services sales experience and/or merchant services sales partner recruitment.Previous experience successfully managing to a revenue quota.Solid understanding of merchant services industry.Track record of growing revenue.Ability to work independently, but also collaborate with with team.Excellent communication skills, written and oral.Demonstrated ability to meet or exceed performance goals.Strong financial acumen, ability to understand common merchant services financial metrics.Ability to accurately and truthfully explain all benefits and costs to prospective partners.Ability to leverage strong business development skills and maintain an aggressive desire to grow business.Ability to travel 25% or more as needed.THIS IS A REMOTE--WORK FROM HOME ROLE -- Anywhere in the US#LI-DM1"}