{"jobID": "2801817907", "jobLocation": "Bethesda_MD", "jobTitle": "Data Analyst (Center for the Study of Traumatic Stress)", "companyRating": "3.3", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "Updated: TodayJob ID: 214019Status: Full-TimeRegular/Temporary: RegularLocation: Bethesda, MD, United StatesJoin the HJF Team!HJF is seeking a Data Analyst to support the Center for the Study of Traumatic Stress (CSTS) in the Department of Psychiatry at the Uniformed Services University (USU), our nation's federal medical school in Bethesda, MD. HJF provides scientific, technical and programmatic support services to USU.  The Data Analyst will work with scientists conducting various laboratory and clinical studies, providing statistical expertise, organizing and maintaining data bases, and conducting data analyses. Work at the Center addresses a wide scope of trauma exposure from the consequences of combat, operations other than war, terrorism, natural and human-made disasters, and public health threats. Recent and ongoing studies at the CSTS have focused on suicide, posttraumatic stress disorder, traumatic brain injury, child neglect, intimate partner violence, and sleep disturbances, as they pertain to military Service members.  Responsibilities:  Work with the Project PI(s) to achieve project goals. Provide guidance in statistical methods and input into design of planned studies. Maintain databases, including establishing, organizing, cleaning, testing, and modifying databases comprising new or existing data. Perform statistical analyses Work with PI(s) to interpret statistical analyses Provide relevant statistical and project status reports. Maintain clear and accurate records of analyses Perform other duties as neededRequired Knowledge, Skills, and Abilities: Knowledge of statistics and study design; proficiency in SAS or SPSS including programming and use of statistical procedures; knowledge of databases and other software such as Microsoft Word, PowerPoint, Excel and Access 2003 and 2007; experience in data management, statistical analysis of longitudinal or repeated measurement data; ability to communicate effectively; excellent writing skills; knowledge of qualitative data analytic procedures preferred but not required.Minimum Education/Training Requirements: Master's or Doctoral degree in Biostatistics, Measurement, or related field. Minimum Experience: 4 to 6 years of academic or clinical research-related experience. Physical Capabilities: Long periods of sitting Work Environment: Office environment Background: US Citizenship required; eligibility and hold Secret Clearance. Eligibility to obtain a Common Access Card. HJF is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Chief Human Resources Officer."}