{"jobID": "2829973994", "jobLocation": "Houston_TX", "jobTitle": "Data and Analytics Engineer", "companyRating": null, "companyInfo": {"Website": "www.wxfordgroup.com", "Headquarters": "Valrico, FL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview: Weatherford International Inc. is one of the largest multinational oilfield service companies providing innovative solutions, technology and services to the oil and gas industry. The Company operates in over 90 countries and has a network of approximately 1,000 locations, including manufacturing, service, research and development, and training facilities and employs approximately 29,500 people.  Weatherford delivers innovative technologies and services designed to meet the world's current and future energy needs in a safe, ethical, and sustainable manner. Grounded by our core values and inspired by our world-class people, we are committed to being a trusted business partner to those we serve. Job Summary: Weatherford International Inc. a game changing big data analytics startup that services the O&G; industry, is looking for an expert data engineer to join our one of a kind tech team. Responsibilities: Managing large amounts of data.  Advise on the storage platforms, physical data organization techniques, logical data modeling techniques, and transformation methods appropriate to their requirements and enterprise architecture preferences.  Design and create the data structures needed to support data science projects and reporting.  Design, build, and develop database architecture based on application related function and type of the data; design, code, and implement databases. Qualifications: A working knowledge of real-time systems (SCADA), streaming data architecture.  Basic knowledge of a scripting language (Python preferred).  Work with members of other groups, including data scientists, engineers, software developers, and clients.  Advanced degree in Engineering, Applied Math, Statistics, Computer Science or any other quantitative field (preferred).  O&G; industry experience (preferred).Job Posted by ApplicantPro"}