{"jobID": "2824971845", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst-Economist", "companyRating": null, "companyInfo": {"Website": "www.devtechsys.com", "Headquarters": "Arlington, VA", "Size": "1 to 50 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DevTech Systems, Inc. (DevTech) is an international consulting firm dedicated to development, with 35 years of experience providing advisory services and technical assistance to government, private sector, and civil society stakeholders in more than 100 countries. DevTech core practice areas include: Economic and Data Analysis, Monitoring and Evaluation, Education and Youth Development, Gender and Inclusive Development, and Public Financial Management. The Data Analyst will work on the Foreign Aid Reporting portfolio of the new USAID Analytics, Data, Visualization, and Information Services (ADVISE) project. ADVISE is a follow-on to the USAID Economic Analysis and Data Services (EADS) project. ADVISEs main purpose is to improve the usage of USAID data and information, so that the Agency continues to ensure its development outcomes are supported by evidence. Overview: The Data Analyst manages project databases using SAS software, supports the completion of official reporting requirements, and responds to client requests for data, analyses and web-based applications. The Data Analyst provides USAID and other official clients with technical assistance on the reporting of international development finance by collecting and harmonizing information from databases, enterprise systems, and other primary development data resources. The Data Analyst supports special projects (reports, visualizations, maps and other geospatial products) for the multiple systems, websites, and services of ADVISE. The Data Analyst reports to the Task Lead. Primary Duties and Responsibilities:Support the collection and harmonization of data from a disparate range of information sources, including USAID enterprise systems, U.S. government project management and financial systems, and third-party socio-economic indicator publishers;Administer data calls and surveys, and other inter-agency data collection efforts;Support processes related to collecting, verifying, redacting, normalizing, and otherwise processing data received from multiple sources;Support the development of reporting methodologies, and business processes by using statistical packages such as SAS, SPSS, STATA, and R;Examine trends in U.S. foreign aid financial flows to draw conclusions and present results in visually intuitive formats;Develop compelling data visualizations tailored to USAID client needs;Summarize and communicate U.S. foreign aid reporting trends to a variety of USAID staffQualificationsEducation: Masters Degree in Economics, international development, or related field.Experience: At least two years of related experience in economics, international development, data science, or related subject.Knowledge: Knowledge of and interest in economics, international development, and related fields.Skills: Strong interest in database management and understanding of relational database principles, high level of data literacy, and solid grounding in the principles of data validity and integrity; sectoral knowledge in one or more fields relevant to USAID work, such as economic growth, poverty alleviation, trade, international development finance and aid effectiveness; knowledge of statistical software such as SAS, Stata and R preferred; excellent interpersonal and communication skills, especially with communicating technical issues to non-technical audiences; capability to work independently and collaboratively. The applicant must be a U.S. citizen to qualify for the required U.S. government security clearance for this project. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, national origin, disability, sexual orientation, protected veteran status or other status protected by applicable law.  NOTE: This position description should not be construed to imply that the requirements are the exclusive standards of the position nor will it be the sole basis for any subsequent employee evaluations. Incumbents will follow any other instructions and perform any other related duties as may be required by their supervisor."}