{"jobID": "2784213773", "jobLocation": "Moffett_Field_CA", "jobTitle": "Researcher/Data Scientist I-II", "companyRating": "3.4", "companyInfo": {"Website": "www.usra.edu", "Headquarters": "Columbia, MD", "Size": "501 to 1000 employees", "Founded": " 1969", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": " NAMS’ mission is to perform strategic multi-disciplinary research and development that supports NASA’s long-term mission requirements across aeronautics, space and earth sciences, and advanced information technologies. Today’s air traffic management is evolving into a more demanding and complex airspace environment than when it was first designed. As air traffic demand continues to grow, it is projected that there will be increases in terms of passenger delays, impact on the environment and costs to flight operators, as well as higher and more complex workload demands on air traffic service providers, and new innovative types of operations (large volumes of unmanned aerial systems, urban air mobility eVTOL vehicles etc.). Researchers and service providers must find ways to increase airspace capacity and flexibility. Position Summary: The Researcher/Data Scientist will support aeronautics research developing the next-generation air transportation system for both conventional aircraft and unmanned aircraft systems through development and integration of advanced autonomy and software systems. Our team works closely with the FAA and aviation industry to enable development and testing of future capabilities.  The Researcher/Data Scientist will contribute to the Aviation Systems team to develop multiple aspects of research in air traffic management to meet the demands of air traffic service providers, with a particular focus on analytics, including machine learning applications, operations research, simulation and analysis. Essential Duties/Responsibilities:Conduct research, development, and evaluation of advanced air traffic control and management automation concepts.Apply machine learning methods, numerical algorithms and optimization techniques in the analysis and development of new automation concepts.Interact with the customer to execute research plans, including requirements, design & development, schedules, milestones, deliverables, and satisfaction.Deliver monthly progress report and metrics.Publish as first or second author in peer-reviewed technical papers and journals.Present own research at seminars and conferencesWork productively in a team environmentRequired Qualifications:Education: M.S. in Aerospace Engineering, Computer Science, Computer Engineering, or related degree preferred. Experience:2-3 years of experience with analytics, machine learning applications, operations and simulation and analysisDemonstrated excellence in related research and development experience and a record of academic publicationsPrior experience with machine learningPrior experience in air traffic management, aircraft control, aerodynamic modeling, flight simulation, and/or trajectory optimization.Background and experience in numerical analysis, optimization, simulation, algorithms and/or scientific computationSkills:Strong analytical skill is required.Excellent written and verbal communication skillsInterpersonal skills sufficient to work collaboratively and effectively with the customer and team members.Desired Qualifications:Experience in aerospace engineering, machine learning, control systems and system dynamics, linear and non-linear optimization, or simulation and modeling of dynamic systemsExperience in air transportation system operations and dynamics, and decision-support tool development and testingUnderstanding of deep learning techniquesExperience with big data a plusAbility to prioritize and self-manage work to critical project timelines in a fast-paced environmentAbility and/or experience directing the work of support staffAttributes:Demonstrated ability to interact effectively in an interdisciplinary teamSelf-motivated to independently work productivelyTechnology:Scripting languages such as Python or Matlab for data analysis.Python, R or Matlab for data mining/machine learningExperience with Spark ML, Hadoop a plusWorking Conditions: This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, etc. Extensive online usage. This is largely a sedentary role. Travel: Occasional travel.  Applicants should apply to the posting at https://usracareers.silkroad.com/ and include a letter of interest, resume, or curriculum vita. Review of candidates will begin immediately. Additional information on USRA can be found at www.usra.edu.  USRA is an Equal Opportunity Employer Minorities/Females/Protected Veterans/Disabled/Sexual Orientation/Gender IdentityRequired Skills Required Experience Job Location  Moffett Field, US-CA "}