{"jobID": "2738424145", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.intelliprogroup.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "136000", "jobDescription": "Project Overview:SOP Writing and Process Mapping xWS (Extended Workforce Solutions) launched earlier this year with ambitious goals to develop software to track contingent workforce to meet our client's goals. We are looking for process analysts to assist with our goals. Overall Responsibilities:Conduct gap analysis of current state processes and future state processes to determine areas that will need future state operating models Track plan development and identify potential areas of dependencies, escalation, and roadblocks. Help test cases in the system to ensure that our customers have as seamless experienceTop 3 Daily Responsibilities:Analyze a process and produce standard operating procedures which are scalable and reproducible across our client Design an E2E (End to End) User journey to map out future state processes, outcomes, client sentiment, and highlight opportunities Assist with post-system launch support efforts by providing white glove customer service in an effective and tactful mannerRequired Skills:Bachelor's degree in any field 3-5 years of experience working on large projects in a project management role 3+ years in client services, engaging with stakeholders and/or managing deliverables and schedules Proven organizational skills with attention to detail and the ability to prioritize and work well in an environment with competing demands. Ability to create and organize process flows in a minimally structured environment. Solutions and client service-oriented, with an emphasis on creativity and relationships. Ability to work in a team environment with a high sense of urgency. Good written and verbal communications skills as well as strong interpersonal skills. Deep interest and experience in high touch customer serviceNice to have skills/Not Required:Knowledge of our client docs/our client Sheets to create pivot tables or other data tables Knowledge and use of Lucid charts"}