{"jobID": "2765297245", "jobLocation": "San_Francisco_CA", "jobTitle": "Financial Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.squaretrade.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "Financial Data AnalystSan FranciscoAccounting/FinanceFull-timeApply for this jobThe Financial Analysis team combines the functions of financial planning and data analysis. We take an end-to-end view of the business financially and operationally. The team is responsible for reporting cadence & dashboard development, budgeting & forecasting, long-term financial planning, risk management & pricing, company-wide business intelligence, and decision support for sales & operational business units. We use complex modeling to build connective tissue between raw data and financial performance.The Financial Data Analyst will work in the revenue reporting segment of the team. This group reports and builds models related to the company’s sales performance, while working closely with the sales/business development team. The Analyst will support the Senior Manager in the group in creating financial and operating reports, sales budgets and forecasts, pricing analysis / product optimization, and developing financial support for operating decisions. Well-qualified candidates will have experience building and maintaining financial models in Excel, organizing data in SQL and building dashboards in business intelligence tools (e.g., Tableau). This position will also provide other ad hoc analyses and data as needed.This role provides opportunities to get involved with complex projects that touch a variety of different teams throughout the company, and will challenge you to use your analytical skills to solve problems creatively. The position reports to the Senior Finance Manager.RESPONSIBILITIES INCLUDE: In-depth exploration of causes or trends to identify problems, opportunities and specific actions requiredBuild and use financial models that simulate and forecast revenue and margin implications; quantify uncertainty and statistical variance in projections/scenariosIdentify and research monthly and quarterly variances to forecast and prior years results, actively recognizing opportunities for improvementUncover new opportunities to grow and optimize the business through analytics, financial modeling, and business case developmentImprove processes for current reporting, automation, frequency, efficiency, etc.Create and overhaul dashboards and underlying data structuresEnsure integrity of financial models, reporting and databasesPresenting analysis to senior level managementSupport operational departments with ad hoc analysis and reportingKEY QUALIFICATIONS:"}