{"jobID": "2829870524", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Analyst, Programmatic Operations - Entertainment and Media Industry Opportunity", "companyRating": "3.1", "companyInfo": {"Website": "www.forbes.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Media", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Economist Group, Wall Street Journal"}, "estimatedSalary": "57000", "jobDescription": " DescriptionForbes Medias Revenue Operations team is currently seeking a Data Analyst, Programmatic Operations. This position reports to our Manager of Programmatic Operations & Sales.  As advertisers begin shifting sales to a programmatic structure, our goal is to optimize Forbes revenue within these platforms. Our programmatic team works directly with exchanges, trading desks, and demand-side platforms to set up and execute media buys in an automated fashion. Responsibilities Analyze data and provide reports of overall programmatic efforts for executives  Generate client-facing campaign performance reports weekly  Help identify new opportunities, and present recommendations for growth (i.e. new technologies, improved optimization, ad placement audits, etc.).  Provide semi-monthly company revenue reports and analysis  Build, monitor, and maintain dashboards to track key monetization metrics for departmental managers  Further the development of existing reporting tools and create new tools to optimize and test product changes or revenue impacts  Translate data into recommendations and plans for revising campaign strategy and maximizing revenue generation  Participate in regular knowledge share sessions to share and learn new strategies for optimizing and enhancing programmatic campaigns Requirements Digitally focused individual with 1+ years of experience (internships count!) in the digital media space.  Experience within ad-tech is a plus!  Advanced Excel Skills (Pivot Tables, V-Lookups)  Strong analytical skills - ability to gather, analyze, summarize, and present data  Must be detail oriented and organized.  Eager to stay up to date with industry news, trends and events.  Willingness (and passion) to learn.  College degree required.  Forbes Media is a global media, branding and technology company, with a focus on news and information about business, investing, technology, entrepreneurship, leadership and affluent lifestyles. The company publishes Forbes and Forbes Asia magazines, as well as Forbes.com. The Forbes brand today reaches more than 117 million people worldwide with its business message each month through its magazines and 40 licensed local editions covering more than 70 countries, Forbes.com, TV, conferences, research, social and mobile platforms. Forbes Medias brand extensions include conferences, real estate, education, financial services and technology license agreements.  Forbes is an equal opportunity employer."}