{"jobID": "2771472438", "jobLocation": "Sacramento_CA", "jobTitle": "Java Data Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.peoplefinders.com", "Headquarters": "Sacramento, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Media", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "Company ProfileWho We Want Have you always excelled at building technology solutions? Do you enjoy working on Data problems at a massive (many TB) scale? Are you the type that is always looking to squeeze performance and push your hardware to the limits? If yes, then we want you.  We are looking for the best. We need a Data Engineer to help our engineering team build a modern data processing platform. We are investing resources into setting up a more flexible and scalable data infrastructure to support the addition of new data sets and improve overall data quality. An ideal candidate will be excited to be in a smaller company that moves quickly on a constant flow of ideas, is able to weed through the maze of available technologies and possible approaches to find the solutions that work. ResponsibilitiesDesign and develop scalable, automated and maintainable near real-time and batch data pipelinesAdopt and enforce best coding practices and practices related to data ingestion and extraction of data from the big data platformDevelop tools to monitor, debug, and analyze data pipelinesTroubleshoot hadoop cluster and query issues, evaluate query plans, and optimize schemas and queries.Develop Hive/MySQL stored procedures, scripts, and indexes.Benchmark, analyze, and tune indexes and SQL queries for optimal performance.Take initiative to learn about new technologies (Hadoop, NoSQL, etc.).Strong interpersonal skills to resolve problems in a professional manner, lead working groups, and negotiate consensus.Qualifications & SkillsBS, MS, or PhD in Computer Science or related experience2-5 years minimum experience in languages such as Java, C++, Scala, Perl, Shell Scripting or PythonStrong Experience working with data pipelines in multi-terabyte data warehouses. Experience in dealing with performance and scaling issues.Experience with performance tuning of Hadoop Hive queries, data processing, and database queries.Strong knowledge in advanced SQL techniques (T-SQL or PL/SQL).Knowledge of data modeling, partitioning, indexing, and architectural database design.Experience using Source Code and Version Control systems like GIT etc.Experience with Search Engines, Name/Address Matching, or Linux text processing a plus.Must be knowledgeable of data warehouse concepts including the use of dimensional modeling and schema designs.Location Sacramento, CA- provided by Dice  Java, C++, Scala, Perl, Shell Scripting, python"}