{"jobID": "2729563898", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.staffmanagement.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Integrity Staffing Solutions, Adecco, Kelly Services"}, "estimatedSalary": null, "jobDescription": "SUMMARY The fast paced environment of an entrepreneurial organization requires the Data Analyst to use judgment to prioritize work, handle multiple projects at once and meet objectives.  The Analyst will focus on compiling and analyzing data from multiple disparate sources and develop semi-automated continuous monitoring reports that can be used to monitor current operations and trend potential outcomes. Must also be able to interpret the results of these reports using a variety of techniques, ranging from simple data aggregation via statistical analysis to complex data mining. The position works directly with clients, project leaders, and business leaders to identify analytical requirements. ESSENTIAL DUTIES & RESPONSIBILITESProvide analytical support and give data-driven insight. Looking for someone who has an affinity for data to work closely with our largest clients to automate processes, drive efficiencies, and provide real time reporting.Data Reporting: Design and develop reports that provide useful information to operations and other departments. Ensure that reporting is readily available and that reporting needs are met in a timely fashion.Ad Hoc Reporting: Respond to ad hoc data reporting requests in a timely fashion and interact directly with client to gather requirements, provide reports and answer questions.Continuous Monitoring: Centralized Services provides support to over 160 field operations. Some reports are run daily, others weekly and others monthly. The Analyst would help create, run and analyze some of these data and analysis reports and conduct follow-up research, as necessary.Special Projects: Ability to assume responsibilities for assigned special projects with a minimum of supervision. Such projects might include providing data analysis support around legal or compliance requests, fraud reviews, and others.Effectively work with other internal departments such as training, sales, VMS and IT on a variety of issues.SKILLSDemonstrated analytical, statistical and problem solving skillsCreation of new reports, and modification of existing reportsAbility to translate business requirements into subsequent reportsAbility to manage multiple complex projects independentlyStrong written and verbal communication skillsAbility to prioritize and planOrganizational skillsAttention to detailFlexibility in fast paced settingIndependent judgment and creativity to solve problemsWORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  * Note: This job description provides a general description of the responsibilities of this position and is not meant to be all encompassing. Job descriptions will be updated periodically; however, changes to the responsibilities of the position may change before the job description can be updated. This job description does not constitute a guarantee of employment for any length of time, and either party can sever the employment relationship at any time with or without notice."}