{"jobID": "2831967322", "jobLocation": "San_Jose_CA", "jobTitle": "Deep Learning Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.roberthalftechnology.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "130000", "jobDescription": " This is a full time, PERMANENT role with Robert Half Technology that includes bonuses, vacation, holidays, and full benefits. For more information on this exciting full time Deep Learning Data Scientist opportunity, please email ?????????????Aly at alarisse.velasquez@rht.com. No third parties please.  Are you a Deep Learning Data Scientist looking to build a great career, yet still maintain a great work-life balance? Do you love being challenged and want to work with cutting edge technology? Like the idea of consulting but need the security of a full time, permanent position? Then Robert Half Technology's Salaried Professional Service is the opportunity you have been waiting for!  Our Salaried Professional Service (SPS) division of RHT is a team of experienced, full-time consultants and developers that complete project-based work. SPS Consultants face the challenge of bringing their experience to many diverse client environments and are seen as subject-matter experts.  Due to immense growth, we are looking to add another Deep Learning Data Scientist to our talented team. We are looking for a strong, up-and-coming engineer with fantastic potential for growth and learning. Ideal candidates will have a background in technology or business, and harbor a deep passion for learning and developing great products.  This is a great opportunity for a Deep Learning Data Scientist who has always wanted to work as a consultant but doesn't want to take on the risk or burden of finding their own projects and likes the idea of full time, permanent employment. Projects generally run from 6-18 months and consultants maintain employment with RHT between engagements. ? We are looking to fill a key role in our Advanced Analytics team in the analytic hub of the Corporate Research Center. Be at the forefront to learn and apply groundbreaking data science techniques to the development of product solutions and business strategies.  If you are highly motivated, love gaming, and relish working on big-data scale problems to make a significant impact on business, we want you!  ? Mine data and perform large-scale data analysis to derive useful business insights into product, customer, and market behavior  ? Understand business problems, translate them into quantitative models, and choose the best applicable statistical and analytical tools to drive a solution  ? Develop descriptive, predictive, and prescriptive models using deep learning/machine learning algorithms.  ? Identify actionable insights, suggest recommendations, and influence the direction by effectively communicating results to many crucial groups within the company"}