{"jobID": "2701128100", "jobLocation": "Plano_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.orangepeople.cl", "Headquarters": "Santiago, Chile", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Are you interested in learning and growing each day? Join us, and unleash your potential while delivering value-centric solutions for one of the world's most recognized brands in the automotive Industry. As our team builds and supports new applications at a rapid pace, we are looking for an exceptional Data Analyst. Responsibilities:Minimum of 2 - 3 years’ experience with complex data analysis and reportingGeneral knowledge of Information Technology functional areas and responsibilitiesExpertise in technical documentation and the tools used to create and maintain itExpertise in Microsoft Excel and other tools for filtering, sorting, and analyzing large amounts of dataExperience with major telecom carriers’ ordering and reporting portalsExperience with large data migration and data transformation projects as a working team memberAbility to prioritize tasks appropriately under changing conditionsExcellent organizational skills with a commitment to meeting deadlines and expectations while ensuring high quality of deliveryStrong analytical skills including requirements documentation, troubleshooting, and creative problem solvingExcellent communication skills, both written and verbalAbility to foster strong working relationships between user communities, management, and vendorsRequirements:Strongly Preferred:Expertise in Microsoft Access, SQL, and other database toolsExperience with Scrum/Agile project management methodologiesBasic or intermediate scripting abilities to support data manipulationExperience with a variety of Operating Systems, including macOS, Windows, iOS, etc.Basic knowledge of how MDM/EMM/UEM works and MDM data interpretation in a large enterprise environment (~10,000 devices under management) (MDM admin skills not necessary)Additional Responsibilities:Participate in OrangePeople monthly team meetings, and participate in team building efforts.Contribute to OrangePeople technical discussions, peer reviews, etc.Contribute content and collaborate via the OP-Wiki/Knowledge Base.Provide status reports to OP Account Management as requestedAbout us : Orange People is an Enterprise Architecture and Project Management solutions company. Our most valuable asset is our people: dynamic, creative thinkers who are passionate about doing quality work. As a member of the Orange People team you will have access to industry-leading consulting practices, strategies & technologies, innovative training & education. An ideal Orange Person is a technology leader with a proven track record of technical achievements and strong process/methodology orientation."}