{"jobID": "2658275463", "jobLocation": "Roseville_CA", "jobTitle": "Sr. Test Automation Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.clearcapital.com", "Headquarters": "Reno, NV", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Black Knight, CoreLogic, Pro Teck Valuation Services"}, "estimatedSalary": "125000", "jobDescription": "About you: You're passionate about helping developers build quality software quickly with automation. You enforce decoupling with build tools like maven, automated testing tools from junit and mockito to cucumber-jvm and webdriver, jvm embedded web containers, continuous integration with Jenkins, and automatic releases to repositories like git are some of the tools you use to empower developers with fast, accurate, and automated feedback.Your role with us: You are a part of a cross-functional Agile team testing cloud based REST/SOAP services and web based client applications. Primary responsibilities include creating, documenting, maintaining and executing scalable, high performance automated test coverage solutions using Java, Jenkins, and other languages/tools where appropriate. Candidates are expected to have a passion for replicable, structured approaches to automated testing and a desire to collaborate with senior application architects and developers in the creation of automation solutions that other development team members can contribute to independently.WHAT YOU WILL DO Participate in ongoing collaborative development, improvement, implementation and adoption of automation test solutions, test data and test result reporting.Create, document, maintain, extend and execute automation test coverage in close coordination with developers and other SQA team members.Collaborate with the integration of test automation in software build and deployment processes.Participate in the design, development, documentation, analysis and testing of assigned projects.Work with Agile team members to analyze project requirements with the goal of increasing automated testability and decreasing risk.Work as part of the team to develop processes for effective monitoring and reporting of automation test cycle results.Act as key knowledge resource for testing automation and train and support other team members as appropriate.Communicate and support all project-related information in a timely and professional manner as dictated by team need and testing processes.Coordinate automated testing for and participate in release activities.Investigate, reproduce, log and escalate reported defectsYOUR QUALITIES Commitment to teamwork and excellent verbal and written communication skills.Dedication to quality and delivering on commitments.Flexibility with hours and workload and strong ability to multi-task and independently prioritize tasks.Interested in teaching from experience and learning from others.Positive attitude and results-centered problem solving approach.YOUR SKILLS 5+ years work-related programming experience with a focus on testing and automation.A strong command of Java for building unit and automation tests.An understanding of automation design patterns and software testing principles and methodologies.Experience with load and performance testing including design, development, implementation and reporting.Leadership experience and the desire to drive a successful testing automation buildout.Proven success using open source testing tools and projects (JUnit, TestNG, Mockito, etc).Experience developing and maintaining test data sets and associated documentation.Experience with team software development life-cycles across multiple concurrent projects.SKILLS YOU MAY HAVE Experience in Continuous Integration environments ideally using Jenkins.Experience working with a team using Agile and sprints.Experience working with and testing API / Restful services.Familiarity with Java, Selenium, Maven, Git, Jira, and Linux/Unix/OS X command line utilization.Groovy, Python, Javascript and other relevant language experience.Experience testing cloud based (AWS) distributed applications.Experience with SQL (Oracle, PG) / NoSQL (Cassandra) databases.Experience with Mockito would be nice.Experience with VirtualBox and VagrantAt Clear Capital, we have an underlying philosophy that guides our efforts: Go wherever it leads, and do whatever it takes to help clients find their optimal solution. This philosophy guides how we create and deliver products, and how we interact with our clients, vendors and each other. We offer an exciting fast-paced work environment, challenging and rewarding careers, and competitive compensation and benefits. Relocation assistance is available.CLEAR CAPITAL 101Clear Capital is an industry leading, privately held Real Estate Valuations and Analytics company headquartered near Lake Tahoe, with offices in Truckee, CA, Reno, NV and Roseville, CA. We aim to consistently improve the lives of our clients by innovative approaches to service, analytics and technology. We firmly believe that a thoughtful combination of ethics, good old fashioned care for your client and constant thoughtful innovation using progressive technology is a good way to drive positive and healthy progress.CompensationSalary commensurate with experienceClear Capital is an equal opportunity employer"}