{"jobID": "2779712029", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.caremessage.org", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " TeleVox Software, Wellpass, mPulse Mobile"}, "estimatedSalary": null, "jobDescription": " CareMessage is the leading solution focused on patient engagement for the underserved. Since launching our product in 2013, we have grown to work with over 200 healthcare organizations across the United States and reach over 1.5 million lives. Our web-based platform allows healthcare providers to reduce no shows, increase attendance to preventive care screenings, and improve chronic disease management- all via simple \"nudges\" sent through text message. What we’re looking for -- The CareMessage team is looking for our first Data Scientist to help us gain valuable and actionable insights from our patients on our platform. This role will work closely with our Health Outcomes, Engineering and Product teams to help prepare, model and operationalize large datasets. You will work with Engineers to build data pipelines that will allow the company to analyze data in real-time. As the company grows, you will help us develop and scale our data strategy. We see this as a great role for someone who is passionate about improving the health of vulnerable populations and is looking for an opportunity to have a meaningful impact on our company's future. Within 1 month, you will…Gain a deep understanding of our product, customers and our team/company goalsUnderstand internal processes and collaborate with product, design, engineering and health outcomes teamsPerform queries and become an expert in our data infrastructure and data sourcesWithin 3 months, you will…Work fluidly across teams to spearhead the prioritization of CareMessage’s data needsEnable CareMessage and our customers to make more data-driven decisions by performing statistical analyses that describe, diagnose and predict user behaviorDemonstrate value of work by visualizing and communicating your insights to the company in an effective and engaging mannerWithin 6 months, you will…Create and lead a short- and long-term data strategy that will help the company scale our efforts and improve the health of our patient populationExperiment to find innovative ways to tackle potential roadblocks and gain deeper insights out of our data (e.g. machine learning techniques)Must haves:Proficient in R, SQL and PythonAt least 2 years professional work experience as a Data ScientistSolid foundation in statistics (e.g., multivariate analysis, A/B testing)Advanced degree (Masters or PhD) in applied science, mathematics or engineeringVery strong written and verbal communication skillsPositive attitude, self-starter and excited by challengesNice to haves:Experience with machine learning and working with healthcare dataExperience working with underserved patient populations in a healthcare or community-based setting or personal experience within a community negatively impacted by health disparitiesAbility to work from our San Francisco office, or relocate to our San Francisco office for the first three monthsBenefits:Flexible work from home policy and transportation stipendCompetitive salary and 401kHealth, dental, and vision insurance- partial coverage for dependentsProfessional development and formal performance review processTransparency with financials and metricsWork on a product that impacts millions of underserved patients in the United States We are committed to equal opportunity regardless of race, color, religion, sex, gender identity, national origin, military or veteran status, marital status, sexual orientation, etc. We actively encourage candidates from diverse backgrounds to apply.  ---------------------------------------------------------------------------------------------  You can learn more about our team by visiting our profile on The Muse.  Learn more about our users here  ---------------------------------------------------------------------------------------------"}