{"jobID": "2830592580", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Ecommerce Manager - ShopStyle", "companyRating": "3.9", "companyInfo": {"Website": "www.ebates.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": "ShopStyle is looking for someone who will be in charge of leading platform merchandising and merchandising analytics for Shopstyle. Responsible for understanding top retailer’s performance across all platform & by category, identifying retailers that could generate incremental revenue and which retailers are not performing to plan. Develop and manage weekly platform (desktop, m.web and app) reporting to measure growth of the ShopStyle’s consumer business and identify areas for improvement. Support Global team by sharing US performance optimization projects and analysis for all platforms. The person will be responsible for the shopper’s journey from inspiration to intent working closely with cross-functional partners including: Product, Business Development, Creative, Business Operations, Membership and Performance Marketing. This role will have a clear understanding of our markets, our customers, our tools and our catalog of partners, as well as, why customers love ShopStyle, and the value we provide. The ideal candidate is a mix of web and app merchandiser and strong analytics who always thinks about the customer first. They must love online shopping are technically curious, creative, analytical, organized, and an excellent collaborator.Responsibilities:Work with Director of Marketing to develop the strategy for creating, merchandising and optimizing ShopStyle’s curated trend pages, as well as, the shoppers journey to arrive on these pages, driving growth in shoppers and GMV.Build and lead the ShopStyle’s Ecommerce and merchandising team.Build and analyze weekly reporting for ShopStyle consumer business that has actionable items to improve partner and category performance. Present platform merchandising performance to cross-functional partners monthly.Participate in integration conversations around how to leverage ShopStyle Collective Influencer content throughout ShopStyle’s shopping platform.Lead shopping editorial to use analytics to select partners and products for platforms, email and PR. Set up and track KPIs to increase performance.Work with Business Development to assure we are optimizing the product assortment and collaborating on which retailers we have growth potential.Partner with Business Development and Business Operations on optimizing the catalog for current and new partners. Understand which new brands we should on board and removing product categories that don’t perform.Evaluate data and develop merchandising strategies and create models to test. Share recommendations with Business Development and Product teams.Work with performance marketing on new brands, top search keywords and landing pages to optimize marketing and platform performance.Collaborate with the Head of Shopper Insights on seasonal surveys to receive qualitative data to assure ShopStyle is delivering on the shopper value prop and merchandising strategies.Qualifications:6+ years of experience in direct-to-consumer marketing and/or website merchandising \u2028 \u2028Outstanding results orientation with consistent track record in driving business impactStrong ability to synthesize quantitative and qualitative data into actionable insightsProven ability to develop strategy and execute day-to-day tacticsGreat work ethic and sense of ownership and accountabilityClear demonstration of internal cross-functional partnership and collaborationComfort with change in a fast-paced startup environmentExtensive knowledge of retail, fashion and ecommerce industryExcellent written, verbal, communication and presentation skills"}