{"jobID": "2725778263", "jobLocation": "Cherry_Hill_NJ", "jobTitle": "Quantitative Analyst – Model Validation", "companyRating": "3.6", "companyInfo": {"Website": "www.td.com", "Headquarters": "Toronto, Canada", "Size": "10000+ employees", "Founded": " 1855", "Type": " Company - Public (TD) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Chase, BB&T, SunTrust"}, "estimatedSalary": "84000", "jobDescription": " Company Overview About TD Bank, America’s Most Convenient Bank®TD Bank, America’s Most Convenient Bank, is one of the 10 largest banks in the U.S., providing more than 8 million customers with a full range of retail, small business and commercial banking products and services at approximately 1,300 convenient locations throughout the Northeast, Mid-Atlantic, Metro D.C., the Carolinas and Florida. In addition, TD Bank and its subsidiaries offer customized private banking and wealth management services through TD Wealth®, and vehicle financing and dealer commercial services through TD Auto Finance. TD Bank is headquartered in Cherry Hill, N.J. To learn more, visit www.tdbank.com. Find TD Bank on Facebook at www.facebook.com/TDBank and on Twitter at www.twitter.com/TDBank_US.  TD Bank, America’s Most Convenient Bank, is a member of TD Bank Group and a subsidiary of The Toronto-Dominion Bank of Toronto, Canada, a top 10 financial services company in North America. The Toronto-Dominion Bank trades on the New York and Toronto stock exchanges under the ticker symbol “TD”. To learn more, visit www.td.com.Job DescriptionThe Quantitative Analyst provides the quantitative analysis and validates the advanced quantitative models to meet DFAST and CCAR requirement. In addition, the Quantitative Analyst provides highly specialized quantitative analytical and modeling support at the assigned line(s) of business.Requirements• Identifies data resources and provide support to for data collection. Assists in developing quantitative analysis and statistical models for stress testing.Assists in writing code for data collection, model development, and model implementation.Creates routine model review and audit reporting.May review results of assigned analyses with more experienced staff, assisting in the identification of unexpected results.Resolves issues and problems by conferring with team members.Assists in the development of analyses of performance and predictive data.Assists in developing and analyzing key metrics and plan variances and related information.May assist in research for popular industry CCAR and DFAST models.Assists in the development, forecasting, and analysis of potential responses to regulators."}