{"jobID": "2730334411", "jobLocation": "Dallas_TX", "jobTitle": "EBI Data Analyst III", "companyRating": null, "companyInfo": {"Website": "www.bswhealth.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Texas Health Resources, Seton Healthcare Family, UT Southwestern Medical Center"}, "estimatedSalary": null, "jobDescription": "The EBI Data Analyst III provides oversight for the design and creation of relational databases. Maintains and enhances the integrity, security and performance of the database operating environment. Administers and controls database resources. Provides performance and tuning of the database, advanced technical support and serves as key resource for special projects.The EBI Data Analyst III plans, researches, designs, tests, and implements upgrades and enhancements to databases; responsible for security and data integrity; responsible for daily database back-up and recovery, evaluates capacity and performance of production systems; installs and upgrades production, testing and training; and provides an advanced level of technical support to users and Information Services (IS) Staff. Studies and researches features of new versions of databases and tools to prepare for future growth; provides status reports regarding database usage; responds to customer questions and problems in a timely and appropriate manner; establishes technical standards and guidelines for the effective use of databases and trains and assists in the development of personnel.The ideal EBI Data Analyst III candidate will have experience with databases and security, ability to research, customer service, and strong oral and written communication skills.Location/Facility - Baylor Scott & White Health, DallasFor more information on the facility, please click our Locations link.Specialty/Department/Practice - Information Technology/Enterprise Business IntelligenceShift/Schedule - Full-time, daysBenefits - Our competitive benefits package includes*:Immediate eligibility for health and welfare benefits401(k) savings plan with dollar-for-dollar match up to 5%Tuition ReimbursementPTO accrual beginning Day 1Note: Benefits may vary based upon position type and/or level.Baylor Scott & White Health (BSWH) is the largest not-for-profit health care system in Texas and one of the largest in the United States. With a commitment to and a track record of innovation, collaboration, integrity and compassion for the patient, BSWH stands to be one of the nation's exemplary health care organizations. Our mission is to serve all people by providing personalized health and wellness through exemplary care, education and research as a Christian ministry of healing. Joining our team is not just accepting a job, it's accepting a calling!QualificationsBachelor's degree required5 years of relevant, applicable experience required"}