{"jobID": "2754212259", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.coursera.org", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "201000", "jobDescription": "Coursera is scaling a global platform to provide universal access to the world’s best education, and we’re motivated by the passion and mission to transform lives through learning. Our platform has reached over 30 million learners worldwide and we have partnered with 150+ elite universities around the globe with over 2,000 courses in our catalog. We offer Courses, Specializations, Certificates, and Degrees to meet the needs and goals of the diverse learners who come to Coursera.In 2016, we began offering fully accredited online Masters degrees which ​provide ​a​ more convenient, lower-cost,​​ “stackable”​ means of earning credentials identical ​to their ​​traditional​ on-campus​​ counterparts. We also launched Coursera for Business, partnering with enterprise companies around the world to provide access to curated skill development for their employees.BI is unique at Coursera. Our team doesn’t simply build reports on demand. Rather, we build the semantic infrastructure and products that empower our internal and external customers with the data to innovate and perform their jobs better.We’re looking for a talented and driven business intelligence engineer with a keen eye for data. Our ideal candidate is an independent, analytically-minded individual with strong data modeling and software engineering skills, who shares our passion for education. In this role, you’ll directly work with cross-functional teams to design, develop, and deploy data solutions.You personally exhibit a conviction that the world needs Coursera to be wildly successful and alignment to our core values:Betterment: a tireless pursuit to drive resultsBoldness: take risks and act decisivelyDeep Honesty: invite and offer candid feedback in order to learn, change, and growSolidarity: recognize that we are part of something bigger than ourselves and are committed to our missionYour responsibilities:Architect scalable data models and build efficient and reliable ETL pipelines to bring the data into our core data lake Design, build, and launch visualization and self-serve analytics products that empower our internal and external customers with flexible insightsBe a technical leader for the team; guide technical and architectural designs for the major team initiatives; mentor junior members of the teamBuild data expertise, and partner with data scientists and product engineers to define and standardize business rules and maintain high-fidelity dataDefine and partner with other engineers in the development of new tools to enable our customers to understand and access data more efficientlyWork cross-functionally (eg: product managers, engineers, business teams) to support new product and feature launchesYour skills:5+ years experience in a data-related field, including data engineering, data warehousing, business intelligence, data visualization, and/or data scienceStrong software engineering skills and at least one scripting language (e.g., Python)Proficient with relational databases and SQLFamiliarity and experience with big data technologies (eg: Hive, Spark, Presto) preferredAbility to communicate technical concepts clearly and conciselyIndependence and passion for innovation and learning new technologiesIf this opportunity interest you, you might like these courses on Coursera - Data Warehousing for Business Intelligence Specialization"}