{"jobID": "2599797046", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.ingrooves.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " Company DescriptionJoin the INgrooves team! At INgrooves Music Group, we are committed to powering creativity in today’s dynamic music marketplace by providing the best distribution, marketing, and rights management tools and services to content creators and owners. We develop state-of-the-art, cost-efficient, and scalable technology platforms. Our partners benefit from our experienced, knowledgeable people, unparalleled commitment to customer service, and thoughtful marketing solutions that drive results. We aspire to be the most transparent and solution-driven partner for all of the labels and artists we work with. What does it take to be successful at INgrooves?Passion For making things happen. For a great working environment. Business Acumen The successful candidate aligns with the INgrooves culture by being solutions-oriented, collaborative and leveraging best practices. Interpersonal/Communication Skills The successful candidate will be open minded, personable and enjoys working well with everyone. They build and foster strong relationships and effective partnerships with cross-functional teams. Executing for Results The successful candidate will demonstrate an ability to generate strategy, develop strategic planning, and translate into actionable plans with timely execution and accountability. Leadership/Collaboration Establishes and maintains positive working relationships, operates with integrity, influences and supports others, and remains open to ideas and better ways to get things done. Problem Solving The successful candidate will be self-motivated and have a demonstrable record of resolving issues and providing solutions. Demonstrates eagerness and ability to learn quickly and leverages a flexible mindset in response to shifting dynamics, adversity and/or change. Job DescriptionThe Role This is an execution and delivery-oriented, highly visible role in the Insights & Analytics team with primary responsibility for building, testing, and validating scalable data storage, ETL processes and optimized data retrieval techniques. This includes development of project plans, handling of potential issues and risks, collaborating constructively with project team members, providing effective cross-functional communication, and advancing multiple projects at once.  The successful candidate will report directly to the EVP of Insights & Analytics and will be based in the Victoria BC office.QualificationsDesired Qualifications and Experience:Undergraduate degree in Computer Science, Engineering, or Mathematics - Graduate degree with a specialty in data engineering and/or related activities preferred3-5 years of data extraction/transformation (e.g. coding with Python, Scala, Java, Javascript, Go, C\\C++)Advanced knowledge of and practical experience with SQL and\\or NoSQL and big data platforms (e.g. Oracle, SQL Server, Cassandra, Postgres, HBase, Couchbase, BigQuery, Redshift, Snowflake)Very comfortable and proficient working in AWS and Linux environmentKnowledgeable of the software design and development lifecycle, TDD, and Agile development practicesExperience in a fast-paced, professional services environment is a decided advantageKey Responsibilities:Create and maintain scalable and optimized data models and schemas for storing multi-TB size data in our ever-growing data warehouse(s)Create and maintain automated, scalable and optimized ETL processes for loading and retrieving data for use by our data science, and business development teamsIntegrate with APIs and external data sources to supplement and enhance core dataOther duties as determined bu the EVP of Insights & Analytics"}