{"jobID": "2802935401", "jobLocation": "Chicago_IL", "jobTitle": "Data Analytics Analyst, Internal Audit", "companyRating": null, "companyInfo": {"Website": "www.cmegroup.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (CME) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Intercontinental Exchange, Nasdaq"}, "estimatedSalary": null, "jobDescription": "DescriptionCME Group: Where Futures Are Made  CME Group (www.cmegroup.com) is the world's leading and most diverse derivatives marketplace. But who we are goes deeper than that. Here, you can impact markets worldwide. Transform industries. And build a career shaping tomorrow. We invest in your success and you own it, all while working alongside a team of leading experts who inspire you in ways big and small. Joining our company gives you the opportunity to make a difference in global financial markets every day, whether you work on our industry-leading technology and risk management services, our benchmark products or in a corporate services area that helps us serve our customers better. With 2,500 employees located around the world, we're small enough for you and your contributions to be known. But big enough for your ideas to make an impact. The pace is dynamic, the work is unlike any other firm in the business, and the possibilities are endless. Problem solvers, difference makers, trailblazers. Those are our people. And we're looking for more.Job Summary: Identifies risk through use of data analytic tools and processes. You will work closely with audit teams comprised of Audit Managers and Senior Auditors to create data-driven objectives that help assess and identify potential risk (e.g. inefficient processes, fraud, weakness in controls, etc.). This includes identifying data sources, validating control totals, and developing and executing data analytic procedures that will allow you to analyze and communicate results to the audit teams and clients. Leveraging analytics, you will support 4-5 audits annually, spanning various processes within Information Technology, Human Resources, Legal, Compliance, and Risk, General Accounting and Reporting, Clearing House Operations, etc. These activities, along with internal improvement projects, are just a sample of the business processes to which you will be exposed. Principal Accountabilities:Partner with the Director of Audit Analytics and Audit Analytics Manager to refine GA’s audit analytics methodology and processesUnderstand the in-scope business risks and associated business processesLearn the systems and data-sources to retrieve and validate the dataDevelop data-driven objectives to assess risks and controlsUse analytic tools to script/program/visualize the data and audit analytics objectivesAnalyze and document observations and potential issues for use in audit planningCommunicate results and recommendations to audit teams and clientRequirements:Bachelor's degree in Information Systems, Analytics, Mathematics, or related field3 years of professional IT experience2 years of data visualization experience (Tableau, Power BI, Crystal Reports, etc.)2 years of information/data analytics experienceProgramming experience (e.g., C#, Java, Visual Basic, Ruby, T-SQL, Oracle PL/SQL, R, Python)Familiarity with ETL tools (e.g., SSIS, DataStage)Database Management experience (e.g., design, performance, DBA)Risk and controls experienceExcellent technical and analytical skillsStrong oral and written communication skillsStrong interpersonal skillsPreferred Requirements:ERP business/system knowledge (e.g. SAP, Workday)CME system knowledge (e.g. Globex, InfoSource, Exchange Fee SystemRelevant audit certification (e.g., CPA, CISA, CIA)"}