{"jobID": "2725276130", "jobLocation": "Oakland_CA", "jobTitle": "Billing Assistant", "companyRating": null, "companyInfo": {"Website": "www.fredfinch.org", "Headquarters": "Oakland, CA", "Size": "201 to 500 employees", "Founded": " 1891", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Lincoln, Seneca Family of Agencies"}, "estimatedSalary": null, "jobDescription": "Job Summary: The Billing Assistant is responsible for all aspects of the billing data entry, via the county run billing systems. The Billing Assistant is responsible for supporting the Compliance Manager with all aspects of the compliance and billing process. A primary responsibility for the Billing Assistant is to enter the majority, if not all, billing each month. The Billing Assistant is responsible for ensuring all client sensitive information is kept safeguarded at all times.Duties and Responsibilities:Data Entry: 1) Responsible for all data entry, completed in a timely and accurate manner.2) Responsible for utilizing daily/weekly/monthly reports to balance all entries made into the billing systems utilized by the agency. Audit: 1) Responsible for supporting and participating in the agency’s Quality Assurance process, especially in regards to Internal, County, and State Audits. Administrative Support: 1) Creating, updating, and fixing of all records entered into the billing systems2) Filing all forms and documents associated with the billing process; 3) relief for receptionist coverage, to include lunch coverage and back up if the receptionist is not in attendance (i.e. sick, vacation). Reporting: 1) Check M/cal Eligibility for every client, in all programs; 2) report to Supervisor regarding issues, workflow, and any possible delays with the billing process; 3) responsible to assure limited risk of unauthorized exposure to PHI (Protected Health Information) through careful attention to report processing and transactions, assuring use of confidential data management and other activities as assigned; 4) end of the month reporting to various program heads and as requested reporting throughout the month Professionalism/Customer Service: 1) Responsible for creating professional working relationships with all levels of staff 2)Responsible for maintaining a professional manner with the use of business calls, internal business email, written memos, and face to face contact 3) Greet staff/visitors to the agency in a personable and helpful manner and refer them to appropriate personnel if need be. 4) Recognize the importance of an understanding and professional relationship with clients and their families, and help them to gain a feeling of confidence in the agency 5) Responsible for maintaining open communication with the immediate Supervisor and all levels of staff that this position will be in contact with on a daily basis. 6) Responsible for upholding all agency policies Other Duties: 1) May drive on agency business as required. 2) Other duties as assigned by Supervisor. SALARY RANGE STARTING AT $15.86 PER HOUR.Qualifications:Two years general office experience and strong computer/data entry skills.Accounting/billing experience highly preferred. Experience in Medical Billing, including the understanding of CPT/HCPCS Codes, 1500 form for Other Health Insurance, and Medicare billing.Strong attention to detail, and organizational skills needed.Ten-key experience required.Ability to present professional, courteous, and helpful at all times."}