{"jobID": "2789004388", "jobLocation": "Los_Angeles_CA", "jobTitle": "Programmer Analyst, Data Science - Information Technology", "companyRating": "3.4", "companyInfo": {"Website": "www.hl.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1972", "Type": " Company - Public (HLI) ", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Lazard, Morgan Stanley, Greenhill & Co."}, "estimatedSalary": "72000", "jobDescription": "Job Summary We are looking for a Programmer Analyst with heavy experience in Data Science to support our bankers, group heads, and leadership teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for leads and service offerings. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating data visualizations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes. Primary Responsibilities:Build, optimize and quickly decipher patterns within large data sets and to reference key characteristics using visualization techniques.Build and optimize predictive models using machine learning and other algorithms.Identify and track the metrics to measure the success of the operation and overall business.Work with big data, crunching samples for data mining, recommendation, or search relevance solution.Perform Data Hygiene responsibilities working with external vendors, internal resources and end users. Create algorithms to identify, report, and improve Data Hygiene functions.Conduct research on Industries, potential partners, and deals.Provide on-going performance monitoring of decision system and statistical models.Work with the varied business departments in conjunction with IT Department in mapping broader business goals into detailed functional requirements.Collaborate with different teams to understand their problems from a business perspective and come up with a solution based on the data.Candidate should take the complete ownership of the analytics initiative and work with business executives; data owners; and internal implementation team. Qualification:Advanced Degree in Math, Physics, Computer Science, Statistics, Economics or any quantitative fields.Expert SQL experience required.Proficiency with business intelligence tools like Tableau, Cognos, Crystal Reports or similarExperience with scripting languages: R, Python, Perl or programming languages.Knowledge and past experience in Finance, Accounting, Project Management.Experience with in-depth data analysis, data profiling and modelingExperience developing and designing aggregates used for modeling and analysisStrong understanding of statistics, descriptive data analysis and Data analysis techniques.A proven resource in developing systems requirements, designing and prototyping, testing, training, defining support procedures, and implementing practical business solutions under multiple deadlines. Equal Opportunity Employer M/F/D/V"}