{"jobID": "2829556607", "jobLocation": "Smithville_TX", "jobTitle": "Senior Research Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "This is a temporary (non-benefits eligible) full-time position which will not exceed 4 and ½ months in duration.This position will reside at the Virginia Harris Cockrell Cancer Research Center located in Smithville, Texas.Salary Range: $59,200(min) $74,000(mid) $88,800(max)MISSION STATEMENT The mission of The University of Texas M. D. Anderson Cancer Center is to eliminate cancer in Texas, the nation, and the world through outstanding programs that integrate patient care, research and prevention, and through education for undergraduate and graduate students, trainees, professionals, employees and the public.SUMMARY The primary purpose of the Senior Research Scientist position is to apply technical expertise and experience to plan, coordinate, design, supervise and carry out research projects in the Department of Epigenetics and Molecular Carcinogenesis.JOB SPECIFIC COMPETENCIESResearch Support Plans, organizes, coordinates and participates in scientific research projects. Assist the Principal Investigator with complex research services provided as part of a research laboratory. Provide consultation services in an area of expertise, including experimental design, experimental technique, data analysis, troubleshooting, and use of software and databases. Determines specific goals or objectives to be attained, evaluates resulting research data, and revises techniques or approaches to resolve problems and advance the project. Applies considerable scientific knowledge and experience in advancing the aims of the project. Functions in a separate and independent manner in the design and initiation of research experiments. Compile, write and submit results to Principal Investigator. Presents findings of research projects to professional groups and prepares scientific documents for publication.Expertise and Specialization Provides highly specialized skills, knowledge and/or expertise that is essential to the success of the project. Provide expertise in a specific line of investigation and/or specialized area of technology. Develops innovative new approaches and/or new technology. Supervises the design, development or adapting of equipment used in experiments or research to obtain desired results. Review scientific findings/articles and develop and adapt techniques, production methods or procedures. Plans and provides specialized training and supervises the training of technicians and other laboratory personnel with respect to proper laboratory techniques, the use of laboratory equipment and safety procedures.Bioinformatics Research Support Support standard statistical data analysis and power calculations in support of research projects. Independently design and implement advanced bioinformatics and statistics strategies for more complicated objectives of the supported projects. Independently attend project meetings with principal investigator and determine analysis plans. Make original contributions to research plans. Provide consultation and instruction to principal investigator in the interpretation of data. Perform other duties as assigned.Other duties as assigned.REQUIREMENTSEducation: PhD in one of the natural sciences or related field or Medical degreePreferred Education:NoneCertification: NonePreferred Certification: NoneExperience: Five years of experience in experimental or scientific work.  Preferred Experience: Seven years of related experience, part of which involved research work at MDACC.WORKING CONDITIONSFrequencyDeadlines  Electrical  Exposure to animals  Exposure to Radiation  Hazardous Chemicals and Materials  Operating Equipment  Sedentary Environment  Wearing Protective Equipment  Exposure to blood, bodily fluids, and/or tissue  Frequent 34-66%  Frequent 34-66%  Occasionally 11-33%  Frequent 34-66%  Constant 67-100%  Constant 67-100%  Constant 67-100%  Frequent 34-66%PHYSICAL DEMANDSFrequency  WeightArm/Hand Steadiness  Balancing  Bending/Stooping  Carrying  Depth Perception  Eye/Hand Coordination  Fine finger movement  Handling  Keyboarding  Lifting  Neck Movements  Night Vision  Olfactory Perception  Pushing/Pulling  Reaching  Sitting  Standing  Tactile Perception  Twisting  Visual Acuity  Visual Color Discrimination  Walking  Wrist Motion  Constant 67-100%  Constant 67-100%  Occasionally 11-33%  Occasionally 11-33%  Frequent 34-66%  Constant 67-100%  Constant 67-100%  Constant 67-100%  Constant 67-100%  Occasionally 11-33%  Occasionally 11-33%  Frequent 34-66%  Constant 67-100%  Occasionally 11-33%  Constant 67-100%  Constant 67-100%  Frequent 34-66%  Frequent 34-66%  Frequent 34-66%  Frequent 34-66%  Constant 67-100%  Frequent 34-66%  Constant 67-100%  10-20 lbs  10-20 lbs  20-50 lbs  20-50 lbs  20-50 lbsCOGNITIVE DEMANDSAnalytical Ability  Appropriate Behavior  Attention to detail  Comprehending  Creativity  Critical Thinking  Following Instructions  Giving and Receiving Constructive Feedback  Interpersonal Skills  Mathematical Skills/Reasoning  Memorizing/Remembering  Multitasking  Oral Communication  Organizing  Performing in a Leadership Role  Problem Solving  Reading Skills/Comprehension  Responding in emergency situations  Selective Attention  Working Alone  Written CommunicationIt is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}