{"jobID": "2822167255", "jobLocation": "Foster_City_CA", "jobTitle": "Director of Global Supply Chain", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "About Sycomp:Delivering Enterprise Infrastructure Technology and Security Solutions Globally. For more than 20 years, Sycomp has successfully created, delivered and implemented complex IT solutions for the global marketplace. Internationally recognized as a global trusted advisor, Sycomp has locations in major metropolitan cities throughout the United States, Europe, Asia and South America.Sycomp employs a globally diversified culture of talented sales, engineering, and support teams to efficiently manage universal technology requirements through configuration, logistics, installation, implementation, and on-going 24/7 support. With missions to provide outstanding management and support in the community, and encourage a supportive family-oriented culture for employees, the company optimizes system performance, reliability and availability for Fortune 500 clients to deliver exceptional business results.About the Job:We are looking for a Director of Global Supply Chain, a critical role in our growth and success. This position will develop and be responsible for driving information, analysis and systems that improve the supply chain performance, communication and efficiency. This role will evaluate and implement ways to make the supply chain faster, more efficient and more responsive to Sycomp’s changing customer needs. This role will assist in solving operational challenges to improve performance and create a sustainable competitive advantage for Sycomp.Key Responsibilities:Develop and communicate a Global Supply Chain vision, strategic direction, and resource requirements sufficient to deliver robust global supply solutions and distribution channels.Establish, oversee, and manage the Supply Chain Group (Logistics). Support and encourage key communication to all internal departments regarding logistics and scheduling.Interface directly with the Sales and Finance teams.Support new sales initiatives, assign resources and provide guidance as requested.Initiate and participate in strategy discussions (at departmental, global and partner levels) to ensure that decisions align with agreed strategic vision, business goals and processes.Establish and implement inventory policy and materials risk mitigation strategies.Work with internal business partners to negotiate, review, and oversee freight/supply chain agreements. Modifications of current agreements as well as additions of new agreements must be approved by the CEO/CFO.Partner and collaborate with other Senior Management to achieve and continually maintain maximum operational efficiency, intra and inter departmental coordination, and initiative / projects prioritization.Prepare management reports, metrics, presentations, to communicate and measure functional area performance.Ensure that Supply Chain is in compliance with all supply and distribution Corporate policies and that all Company products comply with Federal, local and international laws and accepted practices of supply and distribution of goods, both for import and export.Skills and Experience Required:10+ years of experience in supply chain managementAbility to develop and implement a well-thought-out sourcing strategyStrong understanding of import/export regulationsDemonstrated ability to work autonomously, both as a lead and as a part of a teamSelf-motivated, with initiative and the ability to take ownership of, and follow through with, specific tasksAbility to manage multiple priorities of business partners in a complex, multi-business unit environmentExcellent project management and cross-functional team leadership skills.Strong communication skills with the ability to communicate effectively at any level.Strong analytical, research, and negotiation skillsKey Attributes Necessary for Success:Ability to develop and implement a well-thought-out sourcing strategy.Ability to drive aggressive implementation plans and schedules.Advanced knowledge of business operations, systems, organizational structure, performance metrics (KPI) and supply base.Ability to travel globallyEducation: BA/BS Degree; Degree in Supply Chain Management or International Business is preferred.Sycomp Perks & Benefits:Competitive SalaryFully stocked snacks and drinksCompetitive and complete benefits (medical/dental/vision) for you and your dependentsWellness Benefits ( ie. Gym reimbursements)A place to grow your careerSupportive team members and managersA unique friendly, have fun, diversified culture to be a part of"}