{"jobID": "2524549177", "jobLocation": "Santa_Clara_CA", "jobTitle": "Big Data Software Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.paloaltonetworks.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 2005", "Type": " Company - Public (PANW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Check Point Software Technologies, Fortinet"}, "estimatedSalary": "131000", "jobDescription": "Palo Alto Networks® is the fastest-growing security company in history. We offer the chance to be part of an important mission: ending breaches and protecting our way of digital life. If you are a motivated, intelligent, creative, and hardworking individual, then this job is for you!  In this service, we ingest tens of terabytes of data daily from several sources into the system. As the historical data is always valuable for analysis and correlation (i.e. the malware does not expire), the total amount of storage can easily get to peta bytes. By doing several data correlation among this vast amount of data, we can provide intelligence to our customers to help them prioritize threats and decide what actions they should take.  Responsibilities:As a Big Data Software Engineer, you will be an integral member of our threat intelligence service, i.e. auto focus, team responsible for architecture, design and development.Having the dynamic ability to adapt to conventional big-data frameworks and tools with the use-cases required by the projectAbility to communicate with research teams and data scientists, finding bottlenecks and resolving themDesign and implement different architectural models for our scalable data processing, as well as scalable data storageBuild tools for proper data ingestion from multiple heterogeneous sourcesQualifications:2+ years of experience in design and implementation in an environment with hundreds of terabytes of data4+ years of experience with large data processing tools such as: Hadoop, HBase, Elastic Search, etc.2+ years experience with JavaPassion for doing research on large data sets containing ill-formatted dataCan-do attitude on problem solving, quality and ability to executeExcellent inter-personal and teamwork skillsBS in Computer Science/Engineering, or equivalent experienceLearn more about Palo Alto Networks here and check out our fast facts  #LI-PALSAAS"}