{"jobID": "2837813744", "jobLocation": "Dearborn_MI", "jobTitle": "Machine Learning Data Scientist - Product Analytics", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Job Description/Overview: The Global Data Insights and Analytics (GDI&A;) Product Analytics team supports Fords Product Development organization with analytical solutions. We are looking for a data scientist with expertise in Machine and Statistical Learning. As a member of this dynamic team, you will have the opportunity to work with some of the brightest global subject matter experts in product development and vehicle connectivity who are transforming the automobile industry. We are seeking a Machine Learning scientist to assist in all phases of ongoing and future projects, including problem formulation, model development, and deployment for use in support of Ford Design, Product Development, and Connectivity initiatives. The job candidate should have great autonomy, exceptional collaboration skills, and self-discipline to conduct original research and choose appropriate methodologies to solve related problems. We are especially excited about candidates with a strong technical mindset who demonstrate a passion for learning and applying state-of-the-art solutions to novel and challenging problems.  Ford GDI&A; situated in greater Detroit, Palo Alto, Chennai, Europe, and China is a growing team committed to enabling Ford to better understand business, know our customers, and act in a meaningful way. We enable evidence-based decision making by providing timely, actionable, and forward-looking insights to our Ford business partners. Together, our team works to understand our changing world, identify new opportunities, and take actions to design and innovate for the future of mobility Fords vehicles and surrounding experiences.  Responsibilities: Analyze source data and data flows, working with both structured and unstructured dataManipulate high-volume, high-dimensional data from a variety of sources to identify value-generating patterns, anomalies, relationships, and trendsCollaborate with Product Development experts to understand their requirements and overall business needsDevelop and apply Machine Learning solutions to address real-world automotive and mobility challengesCommunicate and present model insights to business customers and executivesCollaborate internally and externally to identify new and novel data sources and explore their potential use in developing actionable business resultsExplore emerging technologies and analytic solutions for use in quantitative model development Job Requirements:  Basic Qualifications: Masters degree in a quantitative field such as Computer Science, Computer Engineering, Statistics, Economics, Mathematics, or Physics2+ years of experience with Machine Learning methods and tools, including but not limited to: deep neural networks, linear and nonlinear regression, classification, tree-based models, and clustering2+ years of experience in at least one of the following languages: Python, R, MATLAB, Java, C/C++/C#, SAS Preferred Qualifications: PhD in a quantitative field such as Computer Science, Computer Engineering, Statistics, Economics, Mathematics, or Physics2+ years of experience with SQL, Spark, OR Hadoop1+ year of post-graduate work experience (in a business or post-doc setting) involving complex quantitative modeling and analysis in any of the areas mentioned under Basic QualificationsDemonstrated ability in the application of Machine Learning to real-world industrial settings with large scale dataExperience with high-performance Deep Learning frameworks such as TensorFlow, PyTorch, Theano, Caffe, Caffe2, or MXNetExperience with version control systems such as GitStrong oral, written, and interpersonal communication skills and an ability to work in a collaborative team settingComfortable working in a fast-paced and innovative environment where problems are not always well-defined The distance between imagination and creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities youd expect from a diverse global leader. Youll become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always ready to go further.  Candidates for positions with Ford Motor Company must be legally authorized to work in the United States on a permanent basis. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status."}