{"jobID": "2746934666", "jobLocation": "Chicago_IL", "jobTitle": "Data Production Engineer", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is one of the world's leading, tech-driven hedge funds. They have one of the best track records in the industry due to their rigorous investment in quantitative and algorithmic research, machine learning and their versatility in embracing new technologies. They seek the best and brightest software engineers, quant traders and machine learning researchers globally. We are seeking Data Production Engineers for our client to support their data scientist and quant researchers in data production and data engineering. As a Data Production Engineer you will own various projects in Data Collection, Cleansing and Processing of structured and unstructured data. Some of the techniques used will involve web scraping, text, image, audio and video processing, 3rd party open-source data collection and other fun and innovative ways to gather and process data. You willPerform Data Collection, Cleansing and Processing of thousands of datasets from more than 300+ sources of structured and unstructured data.Evaluate and model new data sources and collaborate with the research and high frequency trading teams.Build checks for anomalies in data.Build and update libraries.You haveA genuine passion for data and have been involved in competitions/projects outside of your day-to-day role.Contributed to the open-source or GitHub community or can show a genuine passion for technology.Skills requiredPython and/or RMongoBD or NOSQL database experienceLinux(Ubutu, Debian, or other Linux-based OS experience)Shell-scripting, familiarity with OS terminalsSkills desiredNode.jsBig data tools(Hadoop, Spark, Casandra, PySpark)EducationA STEM degree from a leading university. If you would like to be considered for the position of Data Production Engineer, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team"}