{"jobID": "2787109020", "jobLocation": "Skillman_NJ", "jobTitle": "POSTDOCTORAL SCIENTIST", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "76000", "jobDescription": "Johnson & Johnson Consumer & Personal Products Worldwide, a member of Johnson & Johnson's Family of Companies, is recruiting a PostDoc.Johnson & Johnson Consumer & Personal Products Worldwide Division of Johnson & Johnson Consumer Companies, Inc. develops and markets baby care, wound care and skin care products that address the needs of consumers and health care professionals and incorporate the latest innovations. The portfolio includes heritage brands JOHNSON'S® Baby and BAND-AID® Brand, as well as leading skin care brands such as AVEENO®, NEUTROGENA® and CLEAN & CLEAR®. Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer. The Sun Platform Team is an upstream innovation team responsible for creating the future of sun protection and delivering new technology to fuel the long-term Sun Protection pipeline within the Global Skin Care Innovation Platforms group.The Postdoc will be responsible for conducting research directed toward the development of new technologies in the Sun Innovation Platform. The individual is expected to develop and apply in vitro and in vivo preclinical safety and/or clinical study strategies, to elucidate biological mechanisms of action, and to develop novel models to support new benefit areas. Expertise in biological model development and study design is required; and expertise in at least one of the following areas: pharmacology, pharmacokinetics, drug metabolism, biomaterials, biomolecular interactions, toxicology, skin biology, photobiology, diabetes or cancer research is preferred. The Postdoc will be responsible for conducting literature and patent searches; organization and assimilation of literature search results; design of experiments; execution of experiments and clinical research; data acquisition; providing direction to external testing laboratories through strategy and protocol development; analysis and interpretation of data; presentation of findings to technical and non-technical audiences; and preparation of technical sections of written regulatory dossiers.This individual is expected to conduct and lead independent and innovative research programs within a multifunctional environment. This individual will be expected to work collaboratively internally with cross-functional partners across the R&D; organization, and also with external partners such as academic institutions, contract laboratories or material suppliers to define project objectives and timelines and execute projects.QualificationsA minimum of a Ph.D. in pharmacology, toxicology, biological or chemical engineering, biophysics, chemistry, molecular biology, or similar field is required. 1+ year of industrial experience preferred.Solid working knowledge of in vitro or in vivo preclinical safety models and the ability to develop novel models and elucidate mechanisms of action is strongly preferred.Demonstrated professional scholarly activity (e.g. conference presentations, peer-reviewed publications, patents, etc.) is required.Ability to clearly articulate complex technical information and mechanisms of action to technical and non-technical audiences is required.Strong written communication skills with the ability to prepare sections of documents for regulatory submissions is required.Ability to generate innovative ideas to create value, to manage multiple complex tasks, to be highly detail oriented and organized is required.Ability to work individually (independently) as well as on a cross-functional research and development team, and to participate in decision-making in collaboration with others is required.Ability to acquire, analyze, interpret and organize data and document research experiments and protocols in compliance with regulatory guidelines is required.Must be available to work full-time.Must be legally authorized to work in the United States and not require sponsorship for employment visa status (e.g. H1-B status) now or in the future.A minimum G.P.A. of 3.0 is strongly preferred.Primary Location United States-New Jersey-Skillman Organization J & J Consumer Inc. (6101) Job Function Administration Requisition ID1416180515"}