{"jobID": "2837706806", "jobLocation": "Austin_TX", "jobTitle": "Senior Healthcare Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.fmc-ag.com", "Headquarters": "Bad Homburg vor der Hohe, Germany", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (ADR) ", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " PURPOSE AND SCOPE:  Under the direction of the Chief Actuary, this individual is responsible for driving the analytical strategy for contracting with health plans, ACOs, ESCOs, C-SNPs and other risk arrangements. Responsible for contract model creation, feasibility studies, experience studies, trend studies, statistical analysis, identification of savings opportunities, network analysis and in depth analyses of operational gaps and variances to plan. Provides actionable analytical interpretations to drive improvements in operational outcomes.  PRINCIPAL DUTIES AND RESPONSIBILITIES:  Acts as a subject matter expert in the area of medical economics in relation to Medicare and Managed Care.  Development of revenue and medical claims expense models for evaluating and projecting risk based contracts with health plan clients, ACOs and government partners.  Drive decision making around proposed contract changes and financial evaluation of specific contract terms.  In depth claims analysis of baseline and ongoing contract monthly data.  Management dashboard report creation.  Responsible for experience studies and medical trend studies.  Profitability analysis and drill down analysis into actual expected variances.  Report production to support financial reporting and operations activities.  Responsible for all claims reconciliation and member reconciliation activities.  A seasoned, experienced professional with a full understanding of area of specialization; resolves a wide range of issues in creative ways.  Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions. Networks with senior internal and external personnel in own area of expertise.  Normally receives little instruction on day-to-day work, general instructions on new assignments.  May provide assistance to junior level staff with more complex tasks that require a higher level of understanding of functions.  May escalate issues to supervisor/manager for resolution, as deemed necessary.  Mentor other staff as applicable.  Review and comply with the Code of Business Conduct and all applicable company policies and procedures, local, state and federal laws and regulations.  Assist with various projects as assigned by a direct supervisor.  Other duties as assigned.  Additional responsibilities may include focus on one or more departments or locations. See applicable addendum for department or location specific functions.  PHYSICAL DEMANDS AND WORKING CONDITIONS:  The physical demands and work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  EDUCATION:  Bachelor’s Degree required (such as in economics, statistics, actuarial science, mathematics, finance or business administration); Advanced Degree desirable.  EXPERIENCE AND REQUIRED SKILLS:  5 – 8 years’ related experience; or a Master’s degree with 3 years’ experience; or a PhD without experience; or equivalent directly related work experience.  Minimum of 5 years of experience in medical cost analysis, trend driver and data mining for medical cost savings.  Experience in both Managed Care and Medicare, highly preferred.  Must be able to communicate and work effectively with leadership as well as independently.  Proficient with PCs, Microsoft Office applications, systems databases and content management systems (such as SharePoint).  Experience in programming languages and BI software (such as SQL, SAS).  Strong oral and written communication skills.  Strong analytical skills.  Ability to prioritize work."}