{"jobID": "2562845284", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.6", "companyInfo": {"Website": "www.avanitechsolutions.com", "Headquarters": "Rochester, NY", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "137000", "jobDescription": "Data Scientist San francisco, California - United States  Posted Date - 10/16/17Primary SkillsImproving,• Deploying best-in-class / rapid delivery capability for mobile solutions. • Simplifying,and standardizing business work management processes for mobile needs. • Delivering high value analytics across all Lines of Businesses. • Rapid delivery of web applications.OverviewRole: Data ScientistLocation: San Francisco, CADuration: 6+ MonthsTeam Overview: The Digital Catalyst Team is a new enterprise team that is responsible for working collaboratively with the lines of business to implement consumer grade mobile and analytical solutions across various user groups (e.g., field users, office workers, etc.). This includes, but is not limited to: Deploying best-in-class / rapid delivery capability for mobile solutions.Simplifying, improving, and standardizing business work management processes for mobile needs.Delivering high value analytics across all Lines of Businesses.Rapid delivery of web applications. Digital Catalyst consists of a staff of highly skilled professionals working together to produce mobile solutions following an agile methodology and design thinking. We are a “start-up” department within IT and building driven and creative mobile development team. We take the time to understand our partners’ needs and translate those into solutions that delight our users. Our goal is to deliver products with intuitive user experience that will improve employees’ and customer’s safety, productivity and overall well-being. Position Summary: We are seeking an experienced Data Scientist in the Digital Catalyst Team who will provide strong execution and delivery of data science. Working as a part of the product team, this Data Scientist will translate business needs into advanced analytics and machine learning models. The successful candidate will be responsible for model selection and identification of appropriate training data sets; building, training, and evaluating models; and delivering results to the business on a regular cadence. This role is part of a fully Agile Scrum team, so the data scientist will work alongside a product owner, technical lead, and team of developers and data engineers to support delivery of high-value analytics and software products. Position Responsibilities:Leads development of high complexity models and training setsProvides hands-on execution and implementation of data science modelsTranslates business analysis needs into well-defined data science problems, and selecting appropriate models and algorithms and communicates model evaluation and implications of results back to stakeholdersRecognizes and prioritizes the most important work related to data science models to achieve highest operational impact for analytics in the businessBalances tradeoffs among analytics value, model development methods and design and technologies used to implement data science models with a bias toward actionPerforms collaborative work on data science problems and mentor junior data scientistsCreates shared process models, business objects, activity diagrams and process documentation to effectively articulate multiple views of the business solutions that support technical architecture.Manages development of quantitative models and tools.Collaborates with leaders, other LOBs, and business partners to work on issues, projects or activities.Develops new or revises complex models to predict business demand trends, and volume and expenditures forecasts capacity analysis, and various other metrics to identify potential opportunities.Assesses business implications associated with modeling assumptions, inputs, methodologies, technical implementation, analytic procedures and processes, and advanced data analysis.Partners with leaders to drive high performance in their lines of business.Develop deep understanding of business drivers and financial levers to provide strategic decision support.Oversees resolution of complex projects and programs.Develops and maintains up-to-date detailed project schedules and work plans.Performs analysis on complex data models requiring customized reports and data and presents recommendations.Minimum Education/Skills:Bachelor’s Degree in Econometrics, Economics, Engineering, Mathematics, Applied Sciences, Statistics or job-related discipline or equivalent experienceJob-related experience, 8 years, OR Master’s Degree and job-related experience, 6 years, OR Doctorate Degree and job-related experience, 3 yearsExperience in data modeling, 5yrsDesired Education / Skills:PhD in engineering or a related field (computer science, natural sciences, mathematics)Experience with Python, R, Scala, SQLExperience developing solutions with Pandas/Scikit-learn, Spark or comparable technologiesExperience data science notebooks (Jupyter, Zeppelin or other)Experience with AWS, Azure, cloud computing technologiesScrum team experienceEnergy industry experienceExperience designing efficient data science workflows and database architecture for data science purposesExperience with forecasting, Bayesian networks, and graph analyticsStrong statistics experienceExperience with software development methodologies and software engineering principlesKnowledge of program management theories, concepts, methods, best practices, and techniques as needed to perform at the job levelKnowledge of relevant programming languages - for example Visual Basic, Ladder Logic,Programmable Logic Controller, C, SharePoint, HTML, Java, Adobe – as needed to perform at the job levelCompetency in knowing the most effective and efficient processes to get things done, with a focus on continuous improvementKnowledge of principles, techniques, and procedures used for production and design of technology based equipment and systems as needed to perform at the job levelKnowledge of statistical theories, concepts, methods, best practices, and analyses as needed to perform at the job levelAbility to develop reports, models, and simulations as needed to perform at the job levelCompetency in developing and delivering multi-mode communications that convey a clearunderstanding of the unique needs of different audiencesKnowledge of data model design philosophies and methodologies for data warehouse and OLTP systems"}