{"jobID": "2760264392", "jobLocation": "Round_Rock_TX", "jobTitle": "Sr. Research Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.dell.com", "Headquarters": "Round Rock, TX", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " IBM, Apple, HP Inc."}, "estimatedSalary": "95000", "jobDescription": "Hopkinton, MA / Round Rock, TX Dell provides the technology that transforms the way we all work and live. But we are more than a technology company we are a people company. We inspire, challenge and respect every one of our over 100,000 employees. We also provide them with unparalleled growth and development opportunities. We cant wait for you to discover this for yourself as a Sr. Research Scientist on our Customer Insights and Improvement team. Technical Skills:Teradata ExperienceGreenplum ExperienceLinux Administration skillsSQL, PL/SQL, Data Modeling, Data Mining, ETLHTML, CSS, JavaScript, D3Tableau Development and VisualizationData Warehousing Concept & SDLCSkills:Ability to work in a team environmentStrong technical aptitude of network, systems and applicationAppropriate understanding and ability of computer architectureStrong knowledge of appropriate development languagesProblem solving skillsBenefits We offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment.  Dell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Dell here."}