{"jobID": "2823590697", "jobLocation": "Austin_TX", "jobTitle": "Marketing Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.bulldogsolutions.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " MarketOne, gyro, The Pedowitz Group"}, "estimatedSalary": "74000", "jobDescription": " The Bulldog Solutions Marketing Data Analyst serves to advance Bulldog's operational goals to measure and continuously improve our performance, while simultaneously serving Bulldog's clients and client success teams as a trusted analytical resource. As such, the Marketing Data Analyst must be equally comfortable interacting internally, as well as acting in a consultative role with Bulldog clients. Moreover, the position will serve to bridge the gap between analytical efforts and the data management necessary to support them. DETAIL DESCRIPTIONResponsibilities: As a Marketing Data Analyst at Bulldog Solutions, you will be called upon to: Conduct data analyses and subsequently develop, implement, and maintain internal and client facing reporting and dashboard solutionsPerform regular data management activities including but not limited to: data exportation/importation, data validation, data cleansing, and data integration in support of analytical effortsSelecting/developing and applying key metrics that serve to inform decisions and subsequent actionParticipate in the design/recommendation of processes, process automation, structures, and/or technology to optimize data management and analytical effortsApply testing methodologies and analyzes performance to support Bulldog campaign optimizationPrepare campaign/project analysis reports and deliver findings and recommendations to stakeholdersSupport the optimization of client relationships through internal and/or client facing consultationAbility to understand and make recommendations to improve the businessQualifications:3 to 5 years of hands-on experience with Power BI or other similar visualization/analytics applications (i.e. Tableau, DOMO, Google Analytics, Adobe Analytics)3 to 5 years of experience with Microsoft Office applications; especially MS ExcelTechnical experience using/interpreting data models, designing database schema, understanding data relationships, and/or mining and segmenting dataUnderstanding of common database technologies (SQL Server, MS Access, Oracle, etc.)Experience analyzing data to extract insights from observed patterns and outliersExperience in the development/application of data visualizationUnderstand the Web and Web technology (HTML, CSS and basic JavaScript)Experience interfacing with marketing and sales departments and/or organizationsBachelor's degree in Marketing, Computer Science/MIS, Business Administration, Mathematics, Information Management, Statistics, Analytics or equivalentPreferred Technical Qualifications:Experience using and/or interacting with marketing automation and CRM tools and the relevant data sets like Salesforce, Eloqua, Marketo and/or PardotExperience using cloud computing platforms like Microsoft Azure or Amazon RedshiftNon-Technical Qualifications: Communication&Environment; Strong interpersonal skills and the ability to establish, develop, and maintain business relationshipsAbility and/or experience working in cross-functional teamsAbility to communicate with multiple different audiences (internal and client) and adjust the communication to fit the specific audience appropriately Time Management&Flexibility; History of meeting or exceeding deadlines and business targetsMature organizational skills and capacity to manage multiple priorities and tasks simultaneouslyExperience establishing and maintaining system and/or project documentation including schedules, plans, and other relevant work productCapable of adjusting to changing priorities, sometimes daily Working Conditions (Physical requirements and office environment):  Physical Demands The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Physical Activity: while performing the duties of this job, the employee is regularly required to sit, reach with hands and arms, and talk or hear. The employee is occasionally required to stand; walk; climb or balance; and stoop, kneel, crouch, or crawl.Hearing: within normal limits with or without use of corrective hearing devices. The noise level in the work environment is usually moderate.Vision: close visual acuity to perform extensive reading, analyze data, and to view computer terminal with or without corrective lenses.Manual dexterity of hands/fingers for writing, computer input.Work Environment: works indoors protected from weather conditions; temperature controlled environment Travel %: Less than 1% of the time  Bulldog Solutions is an organization of motivated, passionate and hard-working individuals. We hire the best talent for the job and reward our team members for hard work and ingenuity. We are committed to providing our employees the opportunity to develop personally and professionally. If you're tenacious, dedicated, brave and resourceful, we'd like to hear from you.  Out of town of town candidates please provide information on relocation plans. NO SPONSORSHIP IS AVAILABLE FOR THIS POSITION. U.S. CITIZENS OR GREEN CARD HOLDERS ONLY PLEASE."}