{"jobID": "2815027764", "jobLocation": "San_Francisco_CA", "jobTitle": "Solutions Architect", "companyRating": "4.4", "companyInfo": {"Website": "www.skuid.com", "Headquarters": "Chattanooga, TN", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": "Job Description | Solutions Architect About Skuid The number one reason people join our company? Our culture. The number two reason? They believe in our mission and our product.  Skuid provides a cloud UX platform and services for customers to create beautiful, bespoke enterprise applications, no code required. By building apps with Skuid companies drive user adoption and productivity, speed development cycles, and reduce the cost of development. With offices in Chattanooga, San Francisco, Zurich and London, we have a rapidly growing, international, base of raving fans who consistently give us 5-star reviews for both the Skuid UX platform and our amazing level of customer support.  Skuid hires exceptional individuals for the long term, invests in their growth and development, and offers them a warm environment of shared goals and values, rich experiences and opportunities. In turn, our employees take their projects and responsibilities very seriously, without taking themselves too seriously. We seek people whose talents and accomplishments will contribute to a thriving company, who have the character to support their capacity, and can make a positive impact on our culture. If you believe you have what it takes to earn the trust of others, you will fit in well at Skuid.  If your idea of a good job is \"a paycheck and a cubicle,\" please don't apply. We're looking for people who like to collaborate—who propagate a culture or “we” vs. “me.” We reward transparency, honesty and humility. If you think our name is fun, just wait until you meet our people. No pretense here. We just want to make our customers very, very happy and we're willing to do whatever it takes to make that happen. About This Position As a Solutions Architect on the Professional Services team, you will be a critical business contributor by implementing customer use cases from pilot stages to production. Production deployments translate to more business value contributed to our customers.  Because you will be working directly with customers you must be a strong communicator with a positive attitude, and have the ability to understand the needs of customers and translate them into solutions that solve problems with a remarkable user experience. When customers encounter the manner in which you engage with them, and the way in which you design and implement solutions to address their needs, you become a key contributor to achieving or exceeding the customer’s objectives.  Getting first hand interaction with customers and problems they are trying to solve also makes you a key conduit into influencing the product roadmap. Some of what you develop may also make its way into the product. This is not smoke and mirrors, as there are scores of real success stories to reference. Understanding how and when to interact with the product engineering team will be also key. You will often have to think on your feet, and you will have the full stack of Skuid resources to back you up. ResponsibilitiesPresent Skuid product and solution capabilities in a clear and understandable manner to customers and partners, including executives.Lead the analysis process in understanding customer challenges and requirements.Design and develop exceptional user experiences & solutions with Skuid that fulfill customer requirements in the expected timeframes.Develop proof of concepts, demos, and pilots to prove that Skuid understands and can address customer and partner requirements.Develop custom solutions as needed to fulfill requirements not available directly in the Skuid product.Educate customers and partners to get them proficient in using Skuid.Understand complex heterogeneous environments and design cloud and hybrid cloud solutionsContinually act as a liaison with Skuid Technical Support, Engineering, Marketing, and Sales teams to provide input from customers, as well as be educated on new advancements in products and programs.Become certified with SkuidUp to 25% of travel to customer sites may be required with the potential of some travel being international.Other duties as required.QualificationsBS in Computer Science, related technical fields, or equivalent practical experience.7+ years app development experience.Experience writing SQL queries with relational databases.Exposure to various integration architecturesUnderstanding of Javascript, HTML, CSS, however coding expertise is not a requirement.Experience working with REST API’s.Strong interpersonal, presentation, written and verbal communication skills, including the ability to adapt your message to the context of the audience.Experience administering or developing with Salesforce and MS Dynamics is a plus. If no previous experience you will go through training once hired.Ability to respond quickly and manage time effectively in a fast-paced, dynamic environment.Working experience with agile processes.Ability to understand and solve complex problems.Project management skills, and attention to detail."}