{"jobID": "2776897458", "jobLocation": "Lisle_IL", "jobTitle": "Business Intelligence Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.glory-global.com", "Headquarters": "Basingstoke, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1918", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "JOB TITLE: Business Intelligence AnalystLOCATION: Lisle, ILREPORTING TO: Director, Thought LeadershipCOMPANY OVERVIEW As a global leader in cash technology solutions, we provide the financial, retail, cash centre and gaming industries with confidence that their cash is protected and always working to help build a stronger business.  Our cash automation technologies and process engineering services help businesses in more than 100 countries optimise the handling, movement and management of cash. While we span the globe, we personally engage with each customer to address their unique challenges and goals — enhancing staff efficiency, reducing operating costs and enabling a more rewarding customer experience.  We offer peace of mind. We enable transformation. We generate options. We empower people. We do all this by releasing companies from the burden of cash management, putting cash to work, and helping customers enhance the value that their staff and facilities add to their business ROLE PURPOSE The Business Intelligence Analyst is responsible for supporting the business in planning and developing business strategies and key initiatives through market analysis, competitive business analysis and strategy development. This role will also support the broader leadership team as necessary to ensure the success of priority business initiatives. MAIN RESPONSIBILITIES The role is characterized by two main areas of responsibility: Review current vertical markets from a geographic perspective, identifying overall potential, local market drivers, decision-making behaviours/motivators and recommending product strategies for these markets, co- ordinating with Product Management and Planning for products and with the Thought Leadership and Marketing teams for go-to-market activities (sales training, sales collaterals, indirect marketing activities, etc.)Evaluating potential new vertical markets, leading efforts to understand market potentials, our best go-to-market strategies and our best product opportunities. Partnering with the Thought Leadership and Innovation and Strategic Alliances teams to build new business pillars; co-ordinate and lead external consulting engagements in the market discovery process. Key responsibility for specific tracks of work including the compilation of market trends and research, business analysis (e.g., synthesis of business, competitive and market driver data, financial analyses, construction of business cases), business modelling and other strategic planning activities as needed. Summary of Main Duties/Responsibility:Conduct market analysis including business opportunity analysis, market share, competitive analysis, market sizing and other market-focused activities.Build and maintain/refresh market analysis database.Support and build models for buy/build/partner analysis and other business development activities as required.Engage with both internal and external partners to develop analyses; identify and qualify external partners as required.Develop business analysis to support product and operations strategies including new product development (hardware, software, services), competitive pricing analysis, service delivery models, etc.Build models to support the development of business cases for strategic growth initiatives including cost/benefit/ROI models.Models for both purposes of business growth and business selling (i.e. client facing)Models support current lines of business/proposed lines of business (innovation activities).Provide training in new strategies and business models to wider organization.Remain current on industry best practices in current vertical markets (financial, retail, gaming) and related trends by conducting market research, reading analyst reports, etc.Conduct research and analysis in evaluation of potential acquisitions, partnerships, investments, licensing and other strategic growth opportunities for the industry.Support development of presentations and marketing collateral that champion our view of the marketplace.Support corporate strategy and planning annual cycles, including planning/governance processes across business units.Assist with the definition and tracking of key strategic performance metrics.REQUIRED EDUCATION AND QUALIFICATIONSEducation/Experience:BA or BS in Business, Finance, Marketing, Information Management or related fieldPossessing at least 10+ years professional business consulting experienceExperience operating in a strategic function (strategy, product strategy, competitive analysis, management consulting) preferred.REQUIRED SKILLS AND COMPETENCIESStrong analytical and research skills, including ability to independently build business case models/P&Ls;, conduct market analysis, regression analysis and other financial data analysis.Ability to work across functions and business units in a matrix environment as well as across different leadership levels.Excellent communication skills including ability to summarize data/analysis for executive leadership review, including preparation of Board-level presentations.Ability to successfully navigate a matrix organization, mapping stakeholder needs and supporting action plans.Ability to understand, analyze and assimilate complex issues, draw correct conclusions and formulate recommendations.Highly self-motivated with ability to manage and prioritize multiple projects and initiatives.GLORY SPIRITS The Glory Spirits & Behaviours reflect the values and behaviours that are critical to the ongoing success of Glory and as such represent the foundations of our behaviour globally to lead us to realise our mission: Value Creation – strive to create value for customersSelf Starter – understand the objectives of your own work and are proactive in achieving goalsCollaboration -respect diversity and create a culture of collaboration to work with each other to achieve a common goalIntegrity -understand Glory’ Mission and act with responsibility and pride to realise achievement and act and behave with high integrity and a strong sense of ethicsOwn Growth – leverage our own talent and achieve personal development by adopting a broader perspective; looking beyond our own work.An Equal Opportunity / Affirmative Action Employer / An E-Verify Employer It is the policy of Glory Global Solutions, Inc. to provide equal opportunity for all qualified persons and not to discriminate against any applicant for employment because of race, color, religion, national origin, sex, age, disability, protected veteran status, or any other status protected by federal, state or local law governing the Glory Global Solutions, Inc. location to which this application is submitted. Third Party Agencies Unsolicited resumes will not be accepted by Glory. Should an agency choose to send unsolicited resumes, Glory reserves the right to review such resumes but will not be held liable for any fees/charges associated with a candidate hire except where a formal written agreement is in place between Glory and the Agency to source candidates for a specific role."}