{"jobID": "2738465734", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.dosh.cash", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Do you love data? How about money? Do you love money, too? Have you learned to rank, boosted a tree, and embedded a feature? As a Data Scientist at Dosh, your role is to follow the data and the money: analyze, visualize, and model related data, and build systems to predict and recommend where money will next go. You will build and implement machine learning models to make timely decisions. You will have access to unparalleled resources to grow and develop both personally and professionally. We are building a team of statisticians, scientists, machine learning experts, and engineers to extract business insights from our rich data and to craft products to use those insights to give our customers and merchants increased value. If you are someone who has passion for building and improving Internet-scale products informed by data, can chase down threads of ideas in data and knows a thing or two about human behavior, then we want to talk to you.About you.Requirements: Ph.D. or M.S. in a quantitative field such as Computer Science, Statistics, or Mathematics 7+ years of recent professional industry experience in data science/software engineering Expertise in machine learning and statistical modeling Passion to answer Product/Engineering questions with data Strong ability to code in Python and/or RWe get excited about candidates who: Have full stack experience in data collection, aggregation, analysis, visualization, productionization, and monitoring of data science products Are proficient in small data modeling work: Python, R, Julia, Octave Are proficient in big data modeling work: Hadoop, Pig, Scala, Spark, Graph DBs Can fish for data: SQL, Pandas, SageMaker Deploy data science solutions: Python, Java, C++ Can operate in the cloud Know when Deep Learning is useful and know when a simple regression is all it will take Communicate concisely and persuasively with engineers and product managers"}