{"jobID": "2837216204", "jobLocation": "Allen_TX", "jobTitle": "Data Architect /Data Modeler", "companyRating": "4.3", "companyInfo": {"Website": "www.viva-it.com", "Headquarters": "Rolling Meadows, IL", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": " Req Ref No: LSTXA0347  Location: ALLEN , TX  Duration: 3 month(s)  Description Description/Comment: Title: Sr Data Architect /Data Modeler Roles and Responsibilities: The ideal candidate will have advanced Data Modeling and Data Warehouse with strong Data/ETL Architecture.  Creates logical and physical data models for as is and proposed or to be systems.  This role is expected to form a deep relationship and partnership with the BI and ETL Development teams.  This resource will be responsible for strategic projects that focus on source system knowledge/analysis, complex business requirements, design and delivery.  Creates entity-relationship diagrams for relational systems and dimensional diagrams for the Data Warehouse, DataMarts, ODS, and data lake.  Reviews report design documents to understand where data model structures can address requirements. Skill Set: Extensive hands-on technical knowledge of Data Warehouse Architecture, ETL, Oracle & Teradata Server databases.  10+ years of related experience in large corporate system environments working with large and complex data warehouse systems.  Strong SQL and data analysis skills.  Strong experience using at least one of the top data modeling tools, such as ERwin, ER/Studio or PowerDesigner.  Hands-on experience with modern enterprise data architectures and data toolsets (ex: Kimbell, Inman, relational, and hybrid data models, modeling tools, profiling tools).  Must be able to create and maintain enterprise data models with multiple subjected areas.  Familiar with designing data warehouses for metrics driven BI and reporting environments for Spotfire or similar reporting tool..  VIVA is an equal opportunity employer. All qualified applicants have an equal opportunity for placement, and all employees have an equal opportunity to develop on the job. This means that VIVA will not discriminate against any employee or qualified applicant on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}