{"jobID": "2754708365", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist, NSW", "companyRating": "3.9", "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": "143000", "jobDescription": "Nokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things. Serving customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly transform the way people and things communicate and connect. NSW (Nokia Software) Job Position Summary Description: The role of the Data Scientist is to work on the conception, design, development of analytical models and algorithms in the areas of machine learning, statistics and optimization of Nokia networks and systems with assets and resources participating in networks.  The work includes the creation of both prototype “proof of concept” models to prove out specific technologies and algorithms as well as production models. In addition, the Data Scientist will provide general analytical advice and inputs to the professional services, product management and engineering organizations. Key Responsibilities / Functions:Develop and Apply state-of-the-art algorithms for large scale stochastic optimization, predicting failure times and other machine learning technologies like deep learning, signal processing and to build and validate algorithms that satisfy specific customer requirementsSome travel to customer sites is required to capture requirements, give demos, support projects and customer account teams. Input to technical sections of RFP/RFI responses is also required.The Data Scientist will also own the technical roadmap for analytic functionality in specific areas. Location: Candidate should be located in: San Jose, CA; Austin, TX; Ottawa, CA.Required Qualifications: (Education, Technical Skills/Knowledge)At least 3 years of experience in a relevant roleEducation Required:An advanced degree in statistics, physics, operations research, computer science or applied mathematics at the PHD level GeneralExtensive experience solving analytical problems using quantitative approachesComfortable manipulating and analyzing complex, high-volume, high-dimensionality data from varying sourcesAbility to communicate complex quantitative analysis in a clear, precise, and actionable mannerA strong passion for empirical research and for answering hard questions with dataBusiness skills to build the algorithms necessary to find the right answersA flair for presenting complex results in a visual and intuitive mannerAbility to abstract models across very different industries and formulate repeatable modelsAbility to work in a fast-paced multidisciplinary environmentAbility to work both autonomously and in a team TechnicalStrong skills in Python, and/or R and/or ScalaProficiency in Java or C# (or Mono, or C++), SQLAt least 2 years of experience building and applying predictive modeling in real-world use casesAt least 2 years of experience in solving large scale mathematical programming / operations research problemsStrong Statistical, mathematical, predictive modeling, machine learning skillsExposure to big data systems and methodologies Desired Qualifications: (Education, Technical Skills/Knowledge)Domain experience in building models for transportation, supply chain, scheduling, vehicle routing is a plusExposure to deeplearning frameworks a plusExperience in large scale optimization and meta heuristics a plusExperience in applications of computer vision a plus Nokia is an equal opportunity employer that is commited to diversity and inclusion. At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law."}