{"jobID": "2837775809", "jobLocation": "Brea_CA", "jobTitle": "Analytical Seperation Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Aerotek Scientific is currently seeking an Analytical Separation Scientist. The qualified individual will have experience with separation sciences and methods used for analysis of complex protein samples, including recombinant protein therapeutics and therapeutic protein products.  Qualified candidates are encouraged to email resumes directly to Amy Nguyen.  Analytical Seperation Scientist - Pay Rate - $40-46/hour 6-12 month contract with potential to be hired on permanently Monday - Friday 8AM - 5PM Eligibility of medical benefits on a contributory basis Must have a BS or MS degree in chemistry, biochemistry, biology or related field and 2 - 5 years post-graduation experience in bio-pharmaceutical industry or closely related field Must have experience with protein analysis characterization by capillary electrophoresis Good verbal and written communication skills, meticulous documentations, and possess excellent troubleshooting and interpersonal skills. Key words: capillary electrophoresis, 32 Karat, PA 800 Plus, Empower. Prior experience with Agilent CE - capillary electrophoresis system and familiarity with Waters Empower software is required.  Familiarity with instrumentations, methods development & validation, and system verification's are a plus. The position will require candidate to perform analytical method development using Waters Empower software on PA800Plus CE system and validate various assay performance between Sciex 32Karat software and Empower3 software on the Sciex PA 800Plus system. Ideal candidate will work independently, interact and collaborate with team members in product management, software engineering, system engineering, service and customers. The candidate will also need to have experience making detailed observations, analyzing data, interpreting results, preparing reports and standard operating procedures, and exercising appropriate technical judgment in the design, execution, and interpretation of experiments.About Aerotek: We know that a company's success starts with its employees. We also know that an individual's success starts with the right career opportunity. As a Best of Staffing® Client and Talent leader, Aerotek's people-focused approach yields competitive advantage for our clients and rewarding careers for our contract employees. Since 1983, Aerotek has grown to become a leader in recruiting and staffing services. With more than 250 non-franchised offices, Aerotek's 8,000 internal employees serve more than 300,000 contract employees and 18,000 clients every year. Aerotek is an Allegis Group company, the global leader in talent solutions. Learn more at Aerotek.com. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law. If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please call 888-237-6835 or email accommodation@aerotek.com for other accommodation options. However, if you have questions about this position, please contact the Recruiter located at the bottom of the job posting. The Recruiter is the sole point of contact for questions about this position."}