{"jobID": "2829161775", "jobLocation": "Chicago_IL", "jobTitle": "Developer Specialist - Data Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.hcsc.com/careers/index.html", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1936", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " UnitedHealth Group, Aetna, Humana"}, "estimatedSalary": "63000", "jobDescription": "Job ID: PA-1025724 Description: \"As the health care industry continues to rapidly transform, our IT team conceives, develops and delivers impactful technology solutions to support access to quality, affordable health care for our members. We are driven by our collective company purpose: To do everything in our power to stand with our members in sickness and in health®. Our IT team unleashes the power of this purpose through technology. We come to work every day to make a difference, and we deliver the highest quality and best solutions to our members.\" Job Purpose: This position is responsible for developing, integrating, testing, and maintaining existing and new applications; knowing one or more programming languages; knowing one or more development methodologies / delivery models. Required Job Qualifications:Bachelor Degree and 5 years Information Technology experience OR Technical Certification and/or College Courses and 7 year Information Technology experience OR 9 years Information Technology experience.Possess ability to sit and perform computer entry for entire work shift, as required.Possess ability to manage workload, manage mutliple priorities, and manage conflicts with customers/employees/managers, as applicable.Experience in traditional app languages ( COBOL / Perl / C).Experience in scripting languages (BASH / PERL / PYTHON / RUBY).Experience in application / product feature design.Experience in integration technologies (Tibco/Informatica/CAS).Experience in mobile technologies (HP Anywhere / iOS / Android / Java / HTML5).Experience in service oriented architecture (SOA).Experience in web technologies (HTML/CSS/Java/ASP.Net/PHP/Ruby/C).Experience in cloud computing technologies (SaaS / IaaS / PaaS).Experience in application configuration.Rapid prototyping.SDLC Methodology (Agile / Scrum / Iterative Development).System performance management.Systems change / configuration management.Business requirements management.Problem solving /analytical thinking.Creative thinking.Ability to execute.Preferred Job Qualifications:Bachelor Degree in Computer Science or Information Technology. HCSC is committed to diversity in the workplace and to providing equal opportunity and affirmative action to employees and applicants. We are an Equal Opportunity Employment / Affirmative Action employer dedicated to workforce diversity and a drug-free and smoke-free workplace. Drug screening and background investigation are required, as allowed by law. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.  Requirements: Expertise Information Technology Job Type Full-Time Regular Location IL - Chicago"}