{"jobID": "2757308919", "jobLocation": "Reston_VA", "jobTitle": "Business Development/Capture Lead", "companyRating": null, "companyInfo": {"Website": "www.noblis.org", "Headquarters": "Reston, VA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Booz Allen Hamilton, SAIC, LMI"}, "estimatedSalary": null, "jobDescription": " ResponsibilitiesNoblis is a nonprofit science, technology, and strategy organization dedicated to creating forward-thinking technical and advisory solutions in the public interest. We are seeking a senior capture and business development professional for the Air Force and other DoD markets. Noblis enjoys a sterling reputation in all facets of the federal market and is seeking to expand its presence in these critical areas. With well-established long term delivery in the defense business, we are in the process of expanding our capabilities for growing our footprint. Our current needs include demonstrated capture and proposal experience as well as team leadership for client delivery.  Successful candidates will have demonstrated sales capture and delivery experience in one or more of the following mission areas: engineering, R&D;, operations, life science, mission support, intelligence, C4I(SR), telecommunications, IT deployment, and/or technology transition. Industry experience in business development and capture with the Air Force is a must. Life science technology R&D; preferred.  Other responsibilities include: long range strategic planning; business opportunity identification/validation, capture plan development/execution and customer interaction.  Responsibilities center on leading business development and capture efforts for our DoD sector within Noblis. Responsibilities include applying knowledge and experience to: Understand DOD customer organizations, budgets, and near and long term opportunities.Business development, capture and program management of USAF/DoD systems and programs.The selected individual will be responsible to support account growth, new business development, and customer relationship management across all accounts.Be a liaison point of contact with key customers within assigned market segment and perform ongoing assessments of customer requirements, determine market trends, and develop strategies that align the customer’s needs/opportunities with Noblis’ capabilities and discriminators.Maintain ongoing dialogue and outreach to clients regarding existing or future service needs.Understand program and organization financial data to continuously monitor revenue projections.Plan and work to execute relevant marketing and advertising related to new business development.Provide valued BD products and capabilities to assist mission area management to grow the impact of our current portfolio and serve as a consultant to the business unit management.Provide counsel, mentoring and support to other programs and initiatives throughout the corporation, as neededLead capture and proposal efforts as required. QualificationsBasic Qualifications: TS/SCI EligibilityBachelor’s degree in related field and at least ten (10) years of experienceMust demonstrate experience navigating DoD industryKnowledge/experience within DoD organizational and operational structuresMinimum of five (5) years of experience in the DoD industry supporting various customers to include Army, Navy, Air Force, DTRA, DISA, DARPA, etc.Proven track record of managing IDIQ/BPAs, performing capture on task orders, and winning task ordersProven track record in securing new, large government contracts (multi-million annually), as well as operating in complex environments that include both public agencies and the private sectorFive (5) years’ experience using formal sales capture processes (Preferably Shipley)Five (5) years’ experience with relevant acquisition processes, procedures, and lawsThree (3) years project management or capture management experienceUnderstanding of DoD contracts, finance and program management systems, including processes related to various types of competitions, types of contracts, and timely strategies and trends within DoD sector.Knowledge/experience related to growing business within DoD and military services through expansion into similar business areas. Professional Skill Requirements: High energy level, sense of urgency, decisiveness and ability to work well under pressureExperience managing sales pipeline, forecasting, and closing dealsStrong facilitation and communication skills – both written and verbalProven record as a team playerUnquestionable integrity, credibility and characterPrevious experience in conceptualizing, planning, and implementing new products or services for a large business entityStrong leadership, problem solving, and decision making abilities OverviewNoblis and our wholly owned subsidiary, Noblis ESI, are solving difficult problems that help our government and our country. We bring the best of scientific thought, management, and engineering expertise with a reputation for independence and objectivity. We support a wide range of government and industry clients in the areas of national security, intelligence, transportation, healthcare, environmental sustainability, and enterprise engineering. Learn more at noblis.org/about. Why work at a Noblis company? Our employees find greater meaning in their work and balance the other things in life that matter to them. Our people are our greatest asset. They are exceptionally skilled, knowledgeable, team-oriented, and mission-driven individuals who want to do work that matters and benefits the public.  Noblis has won numerous workplace awards. Noblis maintains a drug-free workplace and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race."}