{"jobID": "2744507204", "jobLocation": "Los_Angeles_CA", "jobTitle": "Reconciliation of Health Benefit Exchange Enrollment Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.lacare.org", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Government", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Health Net, Kaiser Permanente, Molina Healthcare"}, "estimatedSalary": "85000", "jobDescription": " Reconciliation of Health Benefit Exchange Enrollment Data Analyst Job Category:  Accounting/Finance Department:  Medical Payment System & Services (240) Location:  Los Angeles HQ, California, US Position Type:  Full Time Requisition ID:  442Established in 1997, L.A. Care Health Plan is an independent public agency created by the state of California to provide health coverage to low-income Los Angeles County residents. We are the nation’s largest publicly operated health plan. Serving more than 2 million members in five health plans, we make sure our members get the right care at the right place at the right time.  Mission: L.A. Care’s mission is to provide access to quality health care for Los Angeles County's vulnerable and low-income communities and residents and to support the safety net required to achieve that purpose. DUTIES: The Data Analyst will be responsible performing the daily reconciliation of the membership data of the health benefit exchange business. The Reconciliation process ensures enrollment is correct and accounted for, variances are identified, root causes are resolved and explained and ultimately reported and remediated. they will have input in creating workflows and reconciliation processes. This would include responsibility for the daily, monthly, and APTC (Advanced Premium Tax Credit) reconciliation processes, ensuring QNXT, Benaissance and CalHeers systems are synchronized. This Data Analyst support the Manager in creating Financial Activity reports to communicate with cross functional teams to resolve system challenges and discrepancies, Interfaces and serves as liaison with multiple departments. QUALIFICATIONS & REQUIREMENTSEDUCATION:Required: High School Diploma Preferred: Bachelors in Business Administration, Computer Science or related fields EXPERIENCE:Required: With High School Diploma: 5+ years experience in a technical function utilizing multiple software applications. Expert knowledge in databases and report writing Advanced knowledge of and /or data base systems, SQL or, Oracle, or Access.  Reconciliation of Health Benefit Exchange Enrollment Data Analyst  Must have strong accounting skills, analytical and problem-solving skills, and excellent database skills.  Solid communication skills (oral and written) and strong interpersonal skills required.  Ability to effectively plan and advise in system enhancements or new implementations.  Ability to prioritize multiple projects without compromising desired timelines.  High level of independent judgment.  Must be flexible, organized, and able to handle multiple tasks simultaneously.  Strong time/project management skills. Preferred: With Associate's Degree: 4 years experience in a technical function utilizing multiple software applications. Expert knowledge in databases and report writing Advanced knowledge of and /or data base systems, SQL or, Oracle, or Access.  With Bachelor's Degree: 2-3 years experience in a technical function utilizing multiple software applications. Expert knowledge in databases and report writing Advanced knowledge of and /or data base systems, SQL or, Oracle, or Access.  Medi-Cal, Medicare and QNXT knowledge  L.A. Care offer a wide range of benefits including Paid Time Off (PTO)Tuition ReimbursementRetirement PlansMedical, Dental and VisionWellness ProgramJob Segment: HR, Medical, Medicare, Human Resources, Healthcare"}