{"jobID": "2633282891", "jobLocation": "San_Francisco_CA", "jobTitle": "Payroll and A/P Specialist", "companyRating": "4.7", "companyInfo": {"Website": "www.tripactions.com", "Headquarters": "Palo Alto, CA", "Size": "201 to 500 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "ABOUT TRIPACTIONSTripActions is a rapidly growing travel startup that is changing the way companies and employees approach business travel. Today companies struggle to rein in costs while employees are forced to endure an ever-growing list of inconveniences: more travel restrictions, tighter policies, lost travel perks. TripActions is here to save business travel with a modern, mobile-first travel solution that works for companies and their employees.We’re saving customers 30% on their travel budgets with the only end-to-end business travel offering on the market. We’ve built best-in-class mobile-first technology, a 24/7 proactive support solution and a massive & unbiased collection of consumer, direct and corporate inventories for flights, accommodations, cars and more. Employees love us because we empower them to travel on their own terms. They’re in control of how they travel, earning points and rewards for personal use along the way.We’re modernizing and re-defining what it means to travel for work. Come help us build the future.TripActions is headquartered in Palo Alto, CA and backed by Zeev Ventures, Lightspeed Venture Partners, and SGVC.ABOUT THE ROLEThe Payroll & A/P Specialist oversees all Payroll and Accounts Payable processes, ensuring accuracy and timeliness in monies distributed to employees and vendors.Responsibilities:Processing semi-monthly payroll for 75+ employeesManage daily A/P activity including invoice processing, employee T&E; reimbursement, and W-9 authorizationPrepare salary budget files and process budget reports to assist the Finance team with the annual budget processSupervise annual 1099 tax reporting for accounts payableEnter semi-monthly payroll journals in QuickBooksPerform monthly general ledger reconciliation of payroll and benefits accountsAdminister and maintain employee credit card transactionsOrganize Workers Compensation and Payroll tax related auditsPrepare option grant schedules and coordinate Board of Directors approval documentation with external legal counselQualifications and Requirements:Bachelor's degree with emphasis in Accounting or at least 5 years’ experience in a Payroll and/or A/P capacityWorking knowledge of both payroll and accounts payableWorking knowledge of travel & expense reimbursement processesExperience using Gusto, Zenefits, Expensify, Bill.com and QuickBooks preferredKnowledge of internal controls required in a disbursement environmentAbility to handle confidential information in a discreet and professional mannerAbility to manage multiple areas and projects while simultaneously meeting payroll and departmental deadlinesAbility to identify, analyze, and implement process improvements, including new technology pertaining to the disbursements areaEMPLOYEE BENEFITSHealth: Medical, dental and visionFood: Catered meals and drinksStock: Be invested in our futureSavings: Take advantage of our 401KTravel: $2000 personal travel stipend to use on the app every yearCommuter benefits: Pre-tax benefit plus a $1000 yearly transportation stipendPeople: Friendly, nice and smart coworkersWork/life balance: Take time off when you need it with an open vacation policy. Monthly recharge days ensure you’re at your bestLocation: Work from Palo Alto, the heart of Silicon Valley. "}