{"jobID": "2782583204", "jobLocation": "San_Diego_CA", "jobTitle": "Business/Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.sharp.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1990", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Kaiser Permanente, Scripps Health, UC San Diego Health"}, "estimatedSalary": "82000", "jobDescription": "Sharp HealthCareFacility:Sharp HealthPlanCitySan DiegoDepartmentFinanceJob StatusFull-TimeShiftDay JobFTE1.0Shift Start TimeVariableShift End TimeVariableLocationThis position is located in Kearny Mesa, San Diego County Hours8-hour shift: 8:00 am 5:00 pm, weekends as needed. Required Skills and QualificationsBachelor's degree in health, business, computers or equivalent work experiencePrevious experience in a managed care settingSQL skills including stored procedure development in SQL Server/Transact SQL and/or OracleExperience with SSIS or other ETL solution, reporting tools such as SSRS or Power BI. An understanding of database design concepts, data analysis, BI development and exposure to data warehousing. Ability to interact with customers and gather reporting requirements. Ability to meet frequent deadlines and tight schedules. Preferred Skills and QualificationsExperience in a managed care environment General hospital, medical or other clinical experience SummaryUnder the direction of the Director of Medical Economics and Contracts, the Business Data Analyst provides Plan with data, database development and technical support, reporting and analyses that enable data driven decision making. Accesses a variety of databases and data storage devices which requires thorough investigation to ensure data integrity.Utilizes spreadsheets, data links from different sources and databases to include functionality of formulas, queries, importing and exporting of data to other programs, and monitors internal and external data needs on an ongoing basis.Provides summary analyses in written and oral presentation settings. Makes recommendations and/or participates in brainstorming activities related to issues that should be addressed and improvements made that can impact negative financial performance. The Finance division is responsibel for the management of money and processing of reporting of information using a variety of different applications. The Finance division includes many functional areas such as Accounting/Billing, Claims Research, Contracting, Data Analytics, Data and Information Systems and Underwriting/ Actuarial.Sharp Health Plan is San Diegos largest locally based commercial health plan. With a personal approach and a network of medical groups and physicians, Sharp Health Plan advocates for its members by providing unparalleled quality and access to health care services. It operates as a not-for-profit health plan, committed to delivering the best health care for the best value.As the top-rated health plan in California*, Sharp Health Plan serves a growing number of companies, large and small, in San Diego and southern Riverside counties.* Consumer Assessment of Healthcare Providers and Systems (CAHPS) Survey, 2010Essential Physical Requirements may includeIncumbent spends approximately 2-3 hours per day sitting at desk, entering data on computer terminal and talking on telephone. Incumbent spends approximately 1-2 hours per day walking between Plan departments. Must be able to hear and speak clearly by telephone. Must be able to meet frequent deadlines and tight schedules. Must be able to lift 5 20 pounds, primarily paper reports and filing.Additional physical requirements of position may be discussed during interview.Sharp HealthCare is proud to be an Equal opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, gender identity, transgender status, sexual orientation, protected veteran status or any other protected class.Keywords: Business Analyst, Finance, Database Development, Database, Data Analytics, Contracts"}