{"jobID": "2761632798", "jobLocation": "San_Rafael_CA", "jobTitle": "Grocery Customer Service Representative", "companyRating": "4.1", "companyInfo": {"Website": "www.traderjoes.com", "Headquarters": "Monrovia, CA", "Size": "10000+ employees", "Founded": " 1967", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "15", "jobDescription": "Crew Member Location: Store #061 - San Rafael Street Address: 337 Third Street, San Rafael, California 94901 Pay Range: $15.00 - $18.00 Employment Duration: Part time Hours Per Week: Up to 38 DescriptionWho are we? Trader Joe's is your favorite neighborhood grocery store! With over 460 stores nationwide (and growing), we are the place to be. Looking for coconut oil and friendly conversation? At Trader Joe's, you can find both. We love being your first and favorite place to shop. What do we do? Like shopping at Trader Joe's? Then, maybe you'll love working with us. We look for individuals who enjoy working in an environment that is as fun as it is challenging.  Our Crew Members create a warm and friendly shopping experience in our stores. We answer questions, offer suggestions and ensure our customers know they are welcomed and cared for. We entertain customers and making grocery shopping an exciting adventure. Some responsibilities include: Working on teams to accomplish goalsOperating the cash register in a fun and efficient mannerBagging groceries with careStocking shelvesHelping customers find their favorite products You're not stuck doing one task here. Each Crew Member contributes to creating a WOW customer experience by participating in all aspects of the job. Is it you? Love to make people smile? Love to eat? All you need is a passion for people and a fervor for food. We can teach you the rest. Physically active, upbeat, positive and fun individuals are the folks we want on our Crew. A high school graduate with flexibility to work evenings and weekends is strongly preferred. We can't wait to meet you! We do things the old fashioned way. We'd like to meet you. To apply, visit the store listed above.  Trader Joe's is an equal opportunity employer and is committed to hiring a diverse Crew."}