{"jobID": "2762634468", "jobLocation": "Redwood_City_CA", "jobTitle": "Billing Operations Analyst - Oracle Data Cloud (MOAT)", "companyRating": "3.4", "companyInfo": {"Website": "www.oracle.com", "Headquarters": "Redwood City, CA", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (ORCL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " SAP, Salesforce, Microsoft"}, "estimatedSalary": "73000", "jobDescription": " Provides programs to improve operational efficiency, consistency, and compliance in support of the organization's financial and tactical business objectives. Provides business practices and processes. Develops, communicates, and trains the organization on business practices and processes.Serve as a liaison with other divisions such as Finance, Contracts, HR, Legal, Shared Services, Accounts Receivable, Purchasing, and Risk Management in an effort to ensure accurate and timely transaction processing. Collect, input, verify, correct, and analyze data to measure key performance indicator actual versus business objectives. Provide updates to management regarding budget to actual, informing them of deviations and opportunities. Provide management with economic impact and compliance issues surrounding key business decisions and/or deals. Communicate Oracle Business Practices to the organization and monitor process and approvals for full compliance. Drive implementation of new processes and procedures.Job duties are varied and complex utilizing independent judgment. May have project lead role. Attention to detail critical. Ability to collect, organize, and display data in spreadsheet format. Follow-through skills necessary to get information from internal and third parties and have data errors/omissions corrected. For this, relationship management skills strongly desired. Strong written and verbal communication skills to interact with management and possible clients desired. 5 plus years relevant work experience.Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.Billing Operations AnalystProvides programs to improve operational efficiency, consistency, and compliance in support of the organization’s financial and operational business objectives. Serve as an accounts receivable liaison between Oracle Finance, Moat Operations and Brand/Agency/Publisher clients. This team member will collect, correct, and analyze revenue transactions and invoices while maintaining a customer facing role. Communicate Oracle Business Practices to the organization and monitor process and approvals for full compliance. Drive implementation of new processes and procedures within Moat’s Billing Team.Job duties are varied and complex, often utilize independent judgment. Ability to handle multiple inbound requests and prioritize accordingly is critical in this role. Relationship management skills, strong written and verbal communication skills and attention to details are strongly desired characteristics.3 plus years relevant work experience ideal.Oracle will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco's Fair Chance Ordinance.Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.Business Operations at Oracle's MoatMoat is a brand intelligence and SaaS analytics company focused on transforming digital advertising with our two products: Moat Analytics and Moat Pro. Moat Analytics is a proprietary solution which enables the collection of signals and metrics to better understand ad effectiveness, engagement, and overall consumer attention. Moat Pro is an industry wide real-time search solution providing insights across brands, publishers, and the ad tech landscape.About the Opportunity• Create and own the invoice generation and support processes to Agencies, Brands, Platforms and Publishers• Verify client invoices in Salesforce for completeness, details and alignment with contract• Identify areas for improvement around controls, reporting and process• Work with Oracle Finance and Moat Engineering to identify and resolve inefficiencies• Assist with process improvement initiatives within the Moat billing team• Assist with closing periods on a monthly and yearly basis• Correspond with Clients and be a point of escalation within Billing.About You• You have 3 years of experience• You have a BS or BA Degree from a highly competitive school• You have experience in Accounts Receivable or Accounts Payable and are comfortable being client facing• You have experience with Salesforce.com or a comparable platform• You are extremely detail oriented• You are tech savvy and an expert with Excel and other operational tools; knowledge of Quickbooks or Oracle Financial Systems a plus• You’re curious, insightful and have great business acumenAbout the Team• We value teamwork, superior writing skills and a friendly, considerate, and value-driven communication style• We strive for incredible attention to detail• We get stuff done. And fast."}