{"jobID": "2541887121", "jobLocation": "Chicago_IL", "jobTitle": "Big Data Consultant", "companyRating": "3.8", "companyInfo": {"Website": "www.amazon.jobs", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (AMZN) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Apple, eBay"}, "estimatedSalary": "71000", "jobDescription": " At Amazon Web Services (AWS), we’re hiring highly technical cloud computing architects to collaborate with our customers and partners on key engagements. Our consultants will develop and deliver proof-of-concept projects, technical workshops, and support implementation projects. These professional services engagements will focus on customer solutions such as HPC, batch data processing, Big Data and Business intelligence. This role will specifically focus on Data processing capabilities and helping our customers and partners to remove the constraints that prevent our customers from leveraging their data to develop business insights.  Professional Services engage in a wide variety of projects for customers and partners, providing collective experience from across the AWS customer base and are obsessed about strong success for the Customer. Our team collaborates across the entire AWS organization to bring access to product and service teams, to get the right solution delivered and drive feature innovation based upon customer needs. Responsibilities include:Expertise - Collaborate with AWS field sales, pre-sales, training and support teams to help partners and customers learn and use AWS services such as Amazon Elastic Compute Cloud (EC2), Amazon Data Pipeline, S3, DynamoDB NoSQL, Relational Database Service (RDS), Elastic Map Reduce (EMR) and Amazon Redshift.Solutions - Deliver on-site technical engagements with partners and customers. This includes participating in pre-sales on-site visits, understanding customer requirements, creating consulting proposals and creating packaged Big Data service offerings.Delivery - Engagements include short on-site projects proving the use of AWS services to support new distributed computing solutions that often span private cloud and public cloud services. Engagements will include migration of existing applications and development of new applications using AWS cloud services.Basic Qualifications  Basic Qualifications:BA/BS degree or equivalent experience; Computer Science or Math background preferred5+ years’ experience of IT platform implementation in a highly technical and analytical role.Demonstrated industry leadership in the fields of database, data warehousing or data sciences.Deep understanding an implementation experience of database and analytical technologies in the industry including MPP databases, noSQL storage, Data Warehouse design, BI reporting and Dashboard developmentExtended travel to customer locations may be required to sell and deliver professional services as needed"}