{"jobID": "2813161081", "jobLocation": "Jackson_MI", "jobTitle": "Saw Operator - Plastics", "companyRating": null, "companyInfo": {"Website": "www.alro.com", "Headquarters": "Jackson, MI", "Size": "1001 to 5000 employees", "Founded": " 1948", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Alro Plastics is currently seeking a Saw Operator to join our team in Jackson, MI.Join the Alro team and start building your tomorrow! Whether you are a recent graduate or an experienced professional, Alro offers rewarding and challenging career opportunities, as well as a competitive compensation and benefits package. We work hard to provide our teammates with comprehensive on-the-job training for a multitude of business disciplines, so that they can maximize their career expectations.  Most importantly, employment at Alro is about being a part of something bigger. It’s about being on a team that employs the highest levels of loyalty, honesty and integrity. It’s about exceeding customer expectations on a daily basis by taking a true interest in their needs. An Alro career provides a dynamic work environment that allows our teammates to learn, grow and succeed in whatever they put their minds to, both personally and professionally.  The successful candidate will be responsible for: filling and preparing customer orders for shipment,operating heavy equipment including, saws, forklifts, and overhead cranes,working afternoon or evening hours as needed, based upon shift assignment. The successful candidate must be able to demonstrate a previous work history that includes: 2 years minimum experience in operations for a plastics service center (preferred),experience operating CNC equipment (preferred),a willingness to work 2nd shift,excellent attendance,safe work habits,computer and keyboard skill development,a record of accurate order fulfillment.Benefits:Competitive payMedical BenefitsDental BenefitsVision CoverageFlexible Spending AccountsRetirement Savings PlanPaid VacationPaid HolidaysLife InsuranceDisability BenefitsTuition ReimbursementAbout the company:Alro Plastics supplies a diverse range of plastic raw materials products to a variety of manufacturing and other industries. Our customer base, ranging in size from small to very large users of plastics, has come to depend on Alro's commitment to excellent delivery service. Alro Plastics is a division of Alro Steel Corporation. Established in 1948, Alro is a privately held corporation with over 60 facilities strategically located throughout the Midwest and Southeast. Please visit our website at www.alro.comfor more information. EOE Alro Steel Corporation is an Equal Opportunity Employer (EOE) and offers a Drug-Free Environment and Opportunities for Advancement."}