{"jobID": "2738447850", "jobLocation": "Folsom_CA", "jobTitle": "Machine Learning Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": "Job DescriptionIntel's Non-Volatile Memory Solution group NSG is seeking an artificial intelligence and machine learning expert to lead the deployment of Saffron across NSG. The team is razor focused on executing projects to deliver Saffron's value proposition across NSG and is seeking a technical expert to drive implementation. You will lead proof of concepts, pilots, and implementation. Your primary responsibilities include:Performing exhaustive data analysis to understand the shape, volume, and relevance of NSGs data, mitigating program risks and optimizing resources and effectiveness, and ensuring cross-functional teams are highly engaged and trained.You will work closely with Systems Engineering, Firmware & Software Engineering, and Customer Engagement & Marketing to integrate Saffron.Non-Volatile Solutions Memory Group:The Non-Volatile Memory Solutions Group is a worldwide organization that delivers NAND flash memory products for use in Solid State Drives SSDs, portable memory storage devices, digital camera memory cards, and other devices.The group is responsible for NVM technology design and development, complete Solid State Drive SSD system hardware and firmware development, as well as wafer and SSD manufacturing.QualificationsEducation: Bachelor's degree, Master's preferred in Computer Science, Data Science, or related field + 8yrs of industry experience. Minimum Requirements:4+ years of experience as a software engineer or a data scientist4+years with one or more of the following languages; Python, Java, etc., and related skills - SQL, JSON, XML, Https, RESTful APIs.Conversant in Natural Language Processing and related tools Stanford NLP, Apache OpenNLP, etc.Addition Requirements:Strong communication skills and the ability to work in a stakeholder facing capacity.Ability to switch among multiple projects in short periods of time and sometimes support multiple projects.Hands on experience with machine learning frameworks Tensor Flow, Cafe, Spark, scikit-learn, etc...Experience with a variety of data stores relational, noSQL, graph, Hadoop, etc...Hands-on! You still like to roll the sleeves up, learn, and build!Inside this Business GroupNon-Volatile Solutions Memory Group: The Non-Volatile Memory Solutions Group is a worldwide organization that delivers NAND flash memory products for use in Solid State Drives (SSDs), portable memory storage devices, digital camera memory cards, and other devices. The group is responsible for NVM technology design and development, complete Solid State Drive (SSD) system hardware and firmware development, as well as wafer and SSD manufacturing.Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}