{"jobID": "2730650619", "jobLocation": "El_Paso_TX", "jobTitle": "Data Analyst Associate", "companyRating": "3.5", "companyInfo": {"Website": "jobs.prudential.com", "Headquarters": "Newark, NJ", "Size": "10000+ employees", "Founded": " 1875", "Type": " Company - Public (PRU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " AIG, MetLife, Fidelity Investments"}, "estimatedSalary": "41000", "jobDescription": " https://video.digi-me.com/prudential/jobs/IT/Take Your Tech Talents to New Heights/ZP0056  The Prudential El Paso office is seeking a Data Analyst Associate to work with stakeholders across Group Insurance in defining objectives and the associated business requirements. This will be a broad and dynamic role which will require the skills to incorporate different stakeholder perspectives into the analysis and build consensus on priorities based on the business value to be derived for Group Insurance.  This presents an exciting challenge and opportunity in a large, evolving and dynamic organization for an individual with initiative, creativity and a passion for delivering business value.  This role will require flexibility in terms of working hours. The expectation is that the Data Analyst Associate will work US (EST) office hours during the initiation, requirements elicitation and definition stages of the projects they are assigned to. Beyond that you can work Texas (MST) office hours, but are expected to be flexible when the need arises.  This is both a Business and an IT facing role in which you will be required to develop a detailed understanding of the Group Insurance business and the applications\\systems supporting their business. The Data Analyst Associate will apply the knowledge acquired to improve and increase the success of the business by working with both business and technical stakeholders who are responsible for building, modifying and maintaining the systems that support the business.  You will be expected to quickly and comprehensively evolve your understanding of the domain, the objectives and the challenges so that you can assist senior-level business and technology stakeholders in making informed decisions about which activities or initiatives to tackle and how to tackle them.  SUMMARY OF DUTIES: Key to this role are the skills, abilities and techniques required to act as the 'enabling bridge' between the Business and IT with the emphasis on representing the Business need throughoutWhile the Data Analyst Associate is expected to develop a good understanding of the capabilities of existing IT solutions in place within Group Insurance, the focus of the role is to ensure that business requirements are captured, understood, analyzed, validated, verified, communicated and ultimately satisfiedThink independently, which will involve focusing on the business and operational processes within Group Insurance to understand where improvements can be madeMust be prepared to proactively lead and own the analysis effort on projects of varying size and complexityNeed to have a good appreciation of technology delivery processes and be able to learn the technology in use and its capabilities in meeting the needs of Group InsuranceEngage with all stakeholders to elicit, analyze, document, verify, and validate business requirements and applicable techniquesBachelor’s Degree or equivalent work experience required2 years of relevant experienceSufficient understanding of Excel and AccessExcellent organizational skills, multi-tasker capable of handling multiple projects at any one timeStrong time management and organizational skills and ability to adapt to frequent changeProven ability to work well with technical and non-technical staffGood presentation, written and verbal communication skills as Analysts front many critical discussions across the businessDemonstrated problem-solving ability, with acute attention to detail, sharp analytical skills and customer focusSelf-starter with the desire to grow and excel in a dynamic environmentTeam player with excellent interpersonal and motivational skillsPositive attitude and a proactive approach to problem solvingAbility to work in a challenging environment handling the management of issues in a calm, professional and controlled mannerAbility to deal with and resolve conflicting, as well as competing demandsAdaptability to handle work beyond defined responsibilitiesAbility to specify, prioritize and organize own work to meet deadlinesAbility to manage tasks and assignments with little to no supervision"}