{"jobID": "2788616084", "jobLocation": "Chicago_IL", "jobTitle": "Senior Scientist, Genetics Research", "companyRating": null, "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": null, "jobDescription": "The Genetics Research Center (GRC) is a newly created center of excellence for genetics and genomics that supports both Discovery and Development. The GRC will play an integral role towards our goal of developing world class genetics and genomics research, focusing on finding the right targets and helping us better understand not only human disease biology but also the behavior of and response to our drugs in clinical trials. Within the GRC, the Department of Computational Genomics is responsible for data analysis and provides analytical insight for both internal and external data. This involves the identification and characterization of underlying genetic, epigenetic, or genomic factors that are associated with disease diagnosis, prognosis and response (efficacy and safety) to drug treatment, identification of new targets, and interpretation of the impact of genetic and genomic evidence from population-based studies. We have an exciting opportunity for a Principal Research Scientist, based in North Chicago, IL reporting to the Head of Computational Genomics. The level is commensurate with experience.Key Responsibilities:Devise and execute analyses to extract meaningful and actionable information from large genetic sequencing databases with an emphasis on target discovery and clinical translational markersConduct statistical genetic analyses to determine genotype-phenotype relationships including mixed model regression, linear and logistic regression, rare variant aggregate tests, and family-based tests for quantitative biomarkers and disease traitsSupervise quality control checks and data management of large genomic sequencing and phenotypic datasets, derived from disparate sources, such as electronic health records and internal clinical trialsIndependently translate and implement algorithms and protocols in a high performance computing environmentOptimize existing pipelines and review current workflows, as well as contribute to the establishing new pipelines, workflows, and underlying methodologyPosition will be hired base on the level of experience. Basic:BS, MS or PhD in Statistical Genetics, Biostatistics, Statistics, Bioinformatics, Genetics, or closely related field, with 10-12+ (BS), 8-10+ (MS) or 0-3+ (PhD) years of experience. Expertise in statistical analysis of next generation sequencing data in large studies, GWAS, and/or PheWASThe ideal candidates will have a high degree of statistical and mathematical competency with experience applying these skills to human statistical genetics problems (e.g. demonstrated with relevant publications).Strong communication skills are essential as well as fluency in one or more or relevant programming languages, such as R, Python, Java, or C++Preferred Qualifications:Experience analyzing large GWAS or WES data setsExperience analyzing PheWAS data and working with controlled vocabularies in such environments, e.g., HPO or ICD9Experience analyzing and interpreting family-based and rare disease genetic databasesKnowledge and experience with rare variant tests (e.g. SKAT) and other burden/collapsing testsExperience analyzing family-based studies and incorporating relatedness in the analysis, including phasing by transmissionExperience with cloud computing, version control, and Docker or similar technologiesFluency with genomic databases, such as those relating to genome annotation, genetic variants, public data repositoriesFamiliarity standard tools and data formats related to genetic data, such as those encountered when analyzing high-throughput whole exome or whole genome data, such as GATK, (g)VCF, CRAM, BAM, FASTQStrong oral and written communication skills in a collaborative environmentKey AbbVie Competencies:Builds strong relationships with peers and cross functionally with partners outside of the team to enable higher performance.Learns fast, grasps the “essence” and can change the course quickly where indicated.Raises the bar and is never satisfied with the status quo.Creates a learning environment, open to suggestions and experimentation for improvement.Embraces the ideas of others, nurtures innovation and manages innovation to reality.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}