{"jobID": "2745193034", "jobLocation": "Watsonville_CA", "jobTitle": "Research Scientist - Applied Markers, Molecular Biology", "companyRating": null, "companyInfo": {"Website": "www.driscolls.com", "Headquarters": "Watsonville, CA", "Size": "1001 to 5000 employees", "Founded": " 1900", "Type": " Company - Private", "Industry": " Agriculture & Forestry", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Dole Food, Naturipe Farms, California Giant"}, "estimatedSalary": null, "jobDescription": "About the Opportunity The Research Scientist will be responsible for deployment of applied markers that accelerate traditional plant breeding. This role will work together with the molecular genetics team and applied breeders to support marker deployment and will help ensure a steady lab output. Responsibilities include assay design, optimization, validation, and deployment in applied breeding programs. Other responsibilities include supervision of other technical staff and maintenance of laboratory equipment including genotyping machines, robots, and sequencers. The candidate will have a strong background and experience in plant breeding and molecular genetics. The marker scientist will stay current with the newest molecular techniques that would aid Driscoll’s in accomplishing our mission.ResponsibilitiesResearch:  ·Assist in translation of marker-trait associations from the statistical genetics team into functional markers for use in applied breeding.  ·Design and optimize KASP, droplet digital PCR, HRM, qPCR, or other assays as needed.  ·Plan successful deployment of marker-assisted selection assays in applied breeding programs.  · Maintain a portfolio of optimized MAS assays for internal use or deployment to our outsourcing partners.  · Management of data streams and relationships with third party service providers during marker screening season.  Supervision:  · Supervise technical staff to assist in the research efforts as needed.  · Support and promote safety.  · Develop, train, and evaluate performance of employees on a continuous basis. Collaboration/Communication: · Establish collaborative relationships with other researchers in the field through attendance of conferences and symposia.  · Maintain strong relationships with applied plant breeders in all crops.  · Occasional travel to locations in the European Union will be required. General: · Follow Company policies and practices while representing Driscoll’s in an ethical and business-like manner in all interactions with employees, governmental agencies, growers, customers, etc.  · Other duties as assigned.Candidate Profile· Ph.D. or Master’s degree with work experience in plant breeding or an applied molecular genetics program.  · Demonstrated ability to manage high throughput DNA extraction and genotyping.  · Experience with high throughput genotyping in plants using a variety of technologies.  · Experience in design of KASP, qPCR, HRM and droplet digital PCR preferred.  · Experience with lab organization, sample collection, RNA & DNA extraction from plant tissues.  · Experience with sequencing library preparation highly desired.  · Experience with laboratory automation and sequencer operation highly desired.  · Individual must possess the ability to develop strong trust in all working relationships.  · Demonstrated ability to lead programs and work in a cross-functional team environment.  · Excellent communication skills, including written, verbal, and presentation.  · Some travel will be required.  · A California driver’s license and the ability to be covered under company-sponsored vehicle insurance program are also required.  · Passport and the ability to travel internationally without restrictions is also required.Driscoll's"}