{"jobID": "2631436654", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Public Relations", "companyRating": null, "companyInfo": {"Website": "www.brndlss.life/glassdoor", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2017", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Thrive Market, Glossier, Amazon"}, "estimatedSalary": null, "jobDescription": "About Brandless Brandless is a new kind of company, a community that puts people first and makes better products at fairer prices. Everything is just $3, BrandTax free and sold exclusively on brandless.com. In a sentence: Better everything for everyone, all $3. Brandless makes hundreds of everyday essentials, aka the stuff you use all the time, including non-GMO food, clean personal care products, non-toxic cleaners and home goods. At Brandless, you can shop your values while getting great value. What youll do: As the Director of Public Relations you will be responsible for the execution of PR and Communications for the Company Brand, Product & Industry Communications and Executive PR. This role presents a rare opportunity to work across all aspects of a fast-paced company to lead cutting-edge PR and communication initiatives from ideation through execution. Youll have the chance to shape and lead awareness and customer-centric campaigns that maximize company, product and leadership media exposure across all sectors (lifestyle, tech, business, food, beauty, home). You will be in a key role at the company thats responsible for driving brand equity, credibility and visibility that advances business goals. Youll Create Impact By:Landing stories and opportunities that tell the Brandless story in consistent and creative ways that create momentum for the company and its consumer-centric strategyDevelop and drive communications strategies to elevate consumer awareness of Brandless vision, growth and products that help drive ongoing customer acquisition, engagement and loyaltyGuardian of the Brandless company and product story; capturing the voice, vision and tone of co-founders across all mediumsDevelop, update and deliver consistent messaging and proof points to use in communications materials, product visuals, presentations, executive interview prep and blogs, social and outbound PR messaging to media etc.Lead agency strategy and team that plays a big role in media outreach campaigns - includes business narrative, events and product placement programs.Develop speaker bureau program for CEO and secure executive media interviews that elevate and strengthen the leadership teams profile in sharing the Brandless story and missionServe as company media contact and build key relationships by identifying most appropriate and influential industry validators/analystsCollaborate closely with internal Brandless stakeholders including marketing, social media, creative and CSR functionsWhat youll need:Experience thriving in high-growth, fast-paced startup environment - digitally native vertically integrated brands are preferredSuccessful prior experience building and running communications/PR function from ground up at a startup consumer brand - demonstrated track record as an implementerHighly organized and influential in driving outcomes while incorporating feedback and educating a growing company about Communications best practicesCreativity and problem-solving instincts that keep PR programs and the brand moving forwardLeadership: executive presence, ability to advocate for your ideas and back it up with data, make compelling case to support strategy and recommendationsExperience with CPG and/or Ecommerce B2C is requiredHighly successful at reaching consumers through targeted communications programs and strategy. Able to execute directly whenever requiredAnalytical: Knows how to track and map research, trends and data points and incorporate into the Brandless narrative, media pitches and other tactical activitiesEntrepreneurial, scrappy and proactive, able to work independently to both develop and implement new ideas within finite resourcesHighly collaborative style, keen listening skills and experience managing a small teamExcellent writing and ability to create compelling stories, strong editing skills8-10 years experience in-house/agency Brandless provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Brandless follows applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}