{"jobID": "2776620374", "jobLocation": "Annapolis_Junction_MD", "jobTitle": "Senior Software Engineer - TS/SCI Required", "companyRating": null, "companyInfo": {"Website": "www.synergistcomputing.com", "Headquarters": "Annapolis Junction, MD", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As a Senior Software Engineer at Synergist, you will work with a team of developers on a specific project critical to one of our customer’s needs. You'll be an active contributor on an Agile Software development team to deliver custom solutions to the customer. You will perform design, development, and testing activities related to assigned tasks and manage individual project priorities, deadlines and deliverables.**Position Requires a Top Secret Clearance with a Full-Scope Polygraph**Degree and Years of ExperienceBS degree in Computer Science or a similar technical field of study and 8 years of experience software development/engineering experience. An additional 4 years of experience may be substituted for the degree. ResponsibilitiesBe an active contributor on an Agile Software development team to deliver custom solutions to the customer.Perform design, development, and testing activities related to assigned tasks.Manage individual project priorities, deadlines and deliverables.Minimum Qualifications:Must be a U.S. Citizen.Ability to lead, direct, and/or mentor a software development team.Ability to collaborate across multiple teams and develop ideas, architectures and agreements to support the interfaces between products.Software development experience in one or more programming languages such as Java, Python, C++, Ruby.Experience developing software within a Linux environment.Experience working with any of the following: web/mobile application development, distributed systems, user interface development, big data analytics.Excellent communication skills.Passion for technology and the drive to learn new programming languages and frameworks.Desired Qualifications:We realize that we are about to enumerate a bunch of skills and experience here. Don’t worry if you don’t have all of these, but we’d like you to have touched some of these technologies or concepts or at least be familiar with them.Experience with NoSQL technologies such as MongoDB, REDIS, Neo4J, etc.Experience with Relational Databases such as MySQL, Oracle, POSTGresExperience with developing RESTful Services using a framework such as Jersey, Spring MVC, CXFExperience with an Enterprise Integration Framework such as Apache Camel, or Spring IntegrationExperience with JMS to include messaging Frameworks such as Apache ActiveMQ or Apache Artemis.Experience with Spring to include Spring Boot, Spring DataExperience with the Java Persistence API through a persistence framework such as Hibernate, OpenJPAExperience developing and deploying applications to Servlet containers such as Tomcat or Jetty or Application Servers such as Glassfish, JBoss, WeblogicExperience developing Applications with NodeJSExperience with JavaScript frameworks such as Ext-JS, AngularJS, Vue or React.Experience with Javascript, Flex, JSP, HTML, CSS, SpringMVC, or equivalents for UI developers and Spring, Hibernate, JPA, Servlets or equivalents for Java developersExperience developing web applications leveraging ES6 and component based packagingExperience with Bootstrap framework.Experience with JQueryExperience with Hadoop and MapReduceExperience developing applications within utility clouds such as AWS, Rackspace, or HerokuExperience wtth continuous integration tools such as Gitlab I or Jenkins --Know anyone who may also be interested in a position with us? Refer them and receive a substantial referral bonus! https://synergistcomputing.com/referral"}