{"jobID": "2834351687", "jobLocation": "San_Francisco_CA", "jobTitle": "Treasury Manager/Data Reporting Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.schwab.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SCHW) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " Description:San Francisco - CA, SF211MN, 211 Main St, 94105-1905  Anthony Jason Pacheco  20180517-3367 We believe that, when done right, investing liberates people to create their own destiny. We are driven by our purpose to champion every client’s goals with passion and integrity. We respect and appreciate the diversity of our employees, our clients, and the communities we serve. We challenge conventions strategically to create value for our clients, our firm and the world. We live and bring to life the concept of ‘own your tomorrow’ every day. We champion our employee strengths, guide their development, and invest in their long-term success. We hire optimistic, results-oriented, curious, innovative, and adaptable people with the desire to help our clients and one another succeed.  As a company, we were established by Chuck over 40 years ago to champion Main Street over Wall Street, and to help Americans transform themselves from earners to owners. Through advocacy and innovation, we work to make investing more affordable, accessible and understandable for all. As we enter our fifth decade, we are looking for talented, innovative and driven people who believe they can help themselves, and our clients, create a better future. Our Opportunity: The Asset Liability Management (ALM) Reporting team is situated in the Treasury department and is responsible for identifying and implementing end-to-end reporting solutions. This technology-driven work is part of the strategic initiatives to advance the maturity of the treasury reporting infrastructure. This business intelligence manager position will be involved in the development, maintenance and documentation of integrated solutions for reporting and analytics. This will be an individual contributor role. What you’ll do: This role provides a terrific opportunity for someone who has strong business knowledge of the financial industry, excellent problem-solving skills and the technical aptitude to deliver solid technical solutions for reporting and analytics. This role will be uniquely positioned to work with a variety of Treasury teams and business subject matter experts to implement innovative data reporting/analytical solutions and functionality that provide direct business value. Key Responsibilities Include:Develop, maintain, and enhance the Treasury-ALM reporting infrastructure by building a scalable and flexible data repository from various source systems across the companyAbility to leverage business knowledge and facilitate working sessions from inception to completionProvide reporting and analytical strategy and solutions for large data sets from disparate systemsIntegrate, transform, consolidate and cleanse data to provide meaningful data visualizationEstablish productive relationships with internal business partners and information technology partnersDocument business requirements, data definitions, controls and maintenance proceduresFamiliar with SQL queries for small to large sets of data and optimize as neededUnderstand process inputs and create solutions to automate reporting while following established computing standardsSupport daily/monthly operations and troubleshooting of issuesWhat you have:Bachelor’s degree in Information Science / Information Technology, Computer Science, Engineering, Mathematics or Business Administration with a focus on information systems or related technical field3+ years of experience, knowledge of Tableau products (Tableau desktop, Tableau server, Visualization, Tableau, Saas, R)with development and implementation experienceExperience in data analysis, design, testing, development and implementationExceptional reporting skills to access combine and analyze multiple data sources (strong comfort level with advanced formatting, formulas, graphs, pivot tables, etc.)Understanding of financial statements (ex. General Ledger, Balance Sheet, and Income Statement)Strong data management, analytical, communication, and technical writing skillsDemonstrated experience with data visualization best practice and other visualization toolsIndividual must be self-motivated and able to bring projects to their conclusionWhat you’ll get:Comprehensive Compensation and Benefits packageFinancial Health: 401k Match, Employee Stock Purchase Plan, Employee Discounts, Personalized advice, Brokerage discountsWork/Life Balance: Sabbatical, Paid Parental Leave, New Mothers returning to work Program, Tuition Reimbursement Programs, Time off to volunteer, Employee Matching Gifts ProgramEveryday Wellness: Health and Lifestyle Wellness Rewards, Onsite Fitness Classes, Healthy Food Choices, Wellness ChampionsInclusion: Employee Resource Groups, Commitment to diversity, Strategic partnershipsNot just a job, but a career, with an opportunity to do the best work of your life Learn more about Life@Schwab.  Charles Schwab & Co., Inc. is an equal opportunity and affirmative action employer committed to diversifying its workforce. It is Schwab's policy to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, disability, legally protected medical condition, genetic information, marital status, sexual orientation, protected veteran status, military status, citizenship status or any other status that is protected by law. Schwab also does not discriminate against applicants or employees because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. At Schwab, we believe that every employee, through their diverse abilities and experiences, can contribute to our growth, innovation and client loyalty. We embrace diversity and are committed to providing equal opportunity to all employees and applicants. If you have a disability, and require reasonable accommodations in the application process, call Human Resources at 800-725-3535. We will be happy to assist you. Schwab will only share your accommodation request with those individuals who have a specific need to know. The request for an accommodation will not affect Schwab's hiring decisions. All other submissions should be performed online.Job Specifications  Relocation Offered?: No Work Schedule: Days Languages: English - spoken Current Licenses / Certifications: None Relevant Work Experience: Analyst/Strategy-2-5 yrs, Financial Services-6+ yrs, Analyst/Strategy-less than 2 yrs, Analyst/Strategy-6+ yrs, Financial Services-less than 2 yrs, Financial Services-2-5 yrs, Risk Analysis Position Located In: CA - San Francisco Education: BA/BS Job Type: Full Time Category:Accounting/Finance  Activation Date: Wednesday, May 30, 2018  Expiration Date: Saturday, July 21, 2018  Apply Here"}