{"jobID": "2783093221", "jobLocation": "Monterey_CA", "jobTitle": "Data Management Analyst 2", "companyRating": "3.7", "companyInfo": {"Website": "www.northropgrumman.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (NOC) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Northrop Grumman seeks a Data Management Analyst 2 to provide support to a Department of Defense research laboratory in Monterey, California.  The data management analyst will:  - Formulate and maintain metadata for a variety of DoD datasets in Oracle and web forms.  - Provide timely and accurate metadata input to the data catalog to ensure proper naming conventions and adherence to standards. Ensure that all data assets can be viewed and understood to promote the sharing and reuse of data across applications and business areas.  - Assist and advise laboratory researchers on the structure and content of data resources.  - Provide front-end technical assistance and organizational guidance as liaison to an affiliated DoD research institution  - Coordinate with client institution's liaison to arrange meetings and maintain clear line of communication between organizations.  - Conduct facilitation sessions with project managers, team leads, and researchers to gather requirements.  - Work closely with database administrators and developers to ensure that use cases and requirements for the data catalog are accurately implemented.  - Ensure data compliance with existing project documentation and data use agreements. Contribute to the upgrading of standards and best practice guidelines  - Be responsible for establishing and staffing data use agreements with DoD agencies and other data providers, ensuring that all required legal and procedural language is present for all data assets. Basic Qualifications:Bachelor's degree with 3 years of relevant experience or Master's degree with 1 year relevant experience.7 years of experience may be used in lieu of a degree.Excellent and well founded, written and oral communication skills are absolutely essentialMust demonstrate flexibility with client and meet demanding deadlinesMust be detail oriented, highly organized, motivated, and a self-starterAbility to multi-task and prioritize multiple projects, deadlines, and responsibilitiesExperience with databases:Understanding of relational databases, SQL queriesWorks independently or as a member of a teamUS Citizenship is required for this positionPreferred Qualifications:Customer service / research assistance experienceKnowledge and experience of metadata standards in the domain of data curation of scientific data assetsExperience with formulating and maintaining metadata schemas and ontological frameworksExperience with statistical programming and/or quantitative researchExperience with Army or DoD databasesExperience with military/government organizational structure and protocolsFamiliarity with DoD and Army policies regarding data use agreements and written communication, including AR 25-50 and DoDI 4000.19.Firm understanding of HIPAA and Privacy Act regulations Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}