{"jobID": "2749473564", "jobLocation": "San_Francisco_CA", "jobTitle": "Executive Assistant", "companyRating": null, "companyInfo": {"Website": "www.forgerock.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Executive AssistantCEO Office & Admin | San Francisco, CAAbout the company: ForgeRock® rocks when others are rolling. We arent your typical high tech company and arent looking for typical people. We look for real people. Whoever you are. Whatever you are. While you play well with others you arent afraid to be you and let others be themselves. Someone has called you wicked smart before, but you would never refer to yourself that way.  ForgeRock pioneered open source identity and access management, went on to invent identity relationship management for customer identities, and is now busy playing with the identity of things. Yes, were growing fast, but we remain true to our start up culture. Were decidedly creative, were always learning, no one hesitates to ask questions, and were on a never-ending search for new ideas.  Our customers are some of the biggest companies, organizations, and even countries in the world. On any given day, its likely that the ForgeRock Identity Platform helped keep your data safe, gave you access to stuff, and supported trusted relationships between you, companies and the devices you were using. Please read more about us at forgerock.com or follow ForgeRock on Twitter at http://www.twitter.com/forgerock. The Role: ForgeRock is seeking a seasoned, full-time Executive Assistant to support its C-Level Management at our headquarters in San Francisco. The Executive Assistant will be reporting to the Executive Assistant Manager. This Rock Star will demonstrate the ability to juggle many competing priorities and maintain poise under pressure with a great sense of humor and professionalism in a fast-paced dynamic entrepreneurial culture. The EA will be interfacing with everyone from our global colleagues to vendors to high-profile clients so will need to have excellent interpersonal skills, a proactive approach to problem-solving, and the ability to work independently alongside staff and management of all levels. Responsibilities:Book Travel domestically and globally, including airlines, transport and hotels.Manage and assist with calendaring complex meetings with multiple parties across global companies.Process expense reports in multi-currencies.Book executives into conferences/events.Schedule and coordinate weekly and monthly team meetings/calls.Develop and plan QBR and global events.Develop strategic relationships with client/vendor/partner EAs.Review annual / long-term travel planning and assist with travel planning, recommended routes etc.Cover support when Executive Assistant on vacation (EAs will reciprocate).Assist team members with planning larger scale internal and external events such as company-wide trips and summits.Required Skills & Qualifications:Bachelors Degree preferred or equivalent experience in a fast-paced office environment.Computer savvy. Must be comfortable to navigate with online ordering, Google Docs, online research, and simple troubleshooting of audio-visual systems. We operate on Macs and use Apple TVs.Attributes:Extremely motivated and performance-driven individual. We seek Rock Stars who have the potential to grow as we grow.Strong ability to multi-task while prioritizing responsibilities.Highly organized and detail-oriented.Excellent written and verbal communication skills.High level of integrity and social awareness for different cultures and languages.Be comfortable and assertive working and communicating with internal and external people of all levels C-level executives to administrative assistants.Friendly, personable, cheerful, and professional.Life at ForgeRock:We believe in and facilitate a flexible, collaborative work environment. Weve grown enormously, but remain true to the innovative, can-dostart-upvalues that got us here. Most important of all, we keep hiring talented, smart, fun, and genuinely nice people because thats who we want to succeed with every day. Below are just a few of the great things we have to offer at ForgeRock:A great team of smart, fun and genuinely nice individuals.Awesome company culture focused around providing a flexible and collaborative work environmentRegular office bonding events, from lunches and happy hours to group offsites and hack-daysWell-stocked fridges, whether youre hungry or thirstyCompetitive benefits and perksWere Mac-friendly!Generous employee referral bonus programAmazing offices across the globe San Francisco HQ; Vancouver, WA; Austin, TX; Munich, Germany; London & Bristol, UK; Grenoble & Paris, FR; Oslo, NO; Singapore, Australia & counting!ForgeRock is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law."}