{"jobID": "2761649466", "jobLocation": "Arlington_VA", "jobTitle": "Treasury Desk Manager", "companyRating": null, "companyInfo": {"Website": "www.promnetwork.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job OverviewLevel ExperiencedJob Location HQ - Arlington, VAPosition Type Full TimeEducation Level Not SpecifiedTravel Percentage NoneJob Shift DayJob Category SalesDescriptionDo you like to work in a fast-paced environment, providing creative solutions for financial institutions? Are you a team player that enjoys working towards a shared goal? Do you get satisfaction from helping banks accommodate their largest customers while achieving their funding goals?  Do these questions excite you? Do they define you? If so, we have an opportunity for you on our Treasury Desk (inside sales). Utilizing our suite of services, you will work with an established network of banks to meet their funding needs.  At Promontory Interfinancial Network, we prosper by working hard in an open and creative environment, leading us to be designated as the No. 1 Fintech company to work for in the country by American Banker magazine, as well as named among the best places to work in the Washington, DC area by the Washington Post and the Washington Business Journal.QualificationsWhat qualifications are required?Excellent understanding of bank functions and processes, including an understanding of funding markets and balance sheet managementWell-versed in the capital markets; prior banking experience a plusSelf-starter with ability to work independently, as well as with other team membersBe able to effectively communicate with C-level executives—both on the phone and in personComputer literate—advanced Microsoft Excel skills a plus; knowledge of S&P; Capital IQ (SNL Financial) preferredSeries 7 license (or must complete within one year from date of hire)Bachelors degree or equivalent experience; Masters degree preferred"}