{"jobID": "2762980118", "jobLocation": "Dearborn_MI", "jobTitle": "Sr. Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.marketingassociates.com", "Headquarters": "Detroit, MI", "Size": "201 to 500 employees", "Founded": " 1967", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " MRM//McCann, Urban Science"}, "estimatedSalary": "62000", "jobDescription": "Job Description:SUMMARYOneMagnify is seeking a client-orientated Sr. Analyst.ESSENTIAL DUTIES AND RESPONSIBILITIESIndependently interacts with client management to prioritize projects, tasks and deliverables.Independently attends project meetings to ensure alignment with client expectations and timelines.Independently executes data analysis using appropriate tools and techniques.Interprets results and presents to the both internal and external clients.Interface with business partners and programming staffs to determine data-related requirements and priorities.Recommend and document business rules required to process and store new data.Documents data requirements and assist in in translating to IT specs.Test database changes prior to implantation.Monitor data flows for quality issues.Develop/enhance data quality reports.Perform Root Cause analysis and investigation on data quality issues.Create end-user documentation for database operations process.Additional duties as required for the efficient, smooth and timely flow of work and information. Required Experience:QUALIFICATIONSUtilizing SQL to query and interpret data from a database or data warehouse required.Familiarity with automotive financial and automotive customer data required.Real-time data experience required.Knowledge of MDM conceptsEDUCATION AND/OR EXPERIENCERequired: BA / BS in computer science, management information systems, statistics, mathematics, marketing research or equivalent technical or semi-technical undergraduate degree with emphasis in statistics.Three to five years leading client projects and initiatives that may include multiple team members.Five to seven years of assessing and trouble-shooting data issues on multiple platforms.Five to seven years of hands on experience mining and analyzing data.Three to five years presenting clear and concise data analysis to management.Three to five years interacting with both business and technical management.OneMagnify is an equal opportunity employer. Keyword: Sr. Analyst  From: OneMagnify"}