{"jobID": "2778255474", "jobLocation": "Farmington_Hills_MI", "jobTitle": "Software Modeling Engineer Auburn Hills, MI - 576563", "companyRating": null, "companyInfo": {"Website": "www.trilliumstaffing.com", "Headquarters": "Kalamazoo, MI", "Size": "5001 to 10000 employees", "Founded": " 1984", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " 05/15/2018 - Now hiring an Instrument Cluster Software Modeling Engineer for work in the Auburn Hills, MI area!Trillium Technical, a leader in the staffing industry is currently seeking an Instrument Cluster Software Modeling Engineer!  The Instrument Cluster Software Modeling Engineer is responsible for building model application software with behavior functionality in Statemate /Stateflow and Altia. These feature models will of consist of regular customer behavior functionality and the subsystem interface. The Engineer will design and develop models by understanding the system, Human Machine Interface (HMI), and graphical requirements. The Engineer will work as part of the modeling team and independently to design feature steering wheel controls, which support a variety of platforms, and will work very closely with requirement engineering, component engineering and validation engineering to meet software release timelines and project milestones.  Req#: 2754824  If you're interested and meet the qualifications below, please apply today!• Bachelor of Science in Electrical Engineering, Mechanical Engineering or equivalent from an ABET accredited university. MathWorks experience (Simulink/Stateflow)Experience in Statemate/Stateflow. Experience in C, C++ and MS Visual StudioEE systems knowledge.Two years of experience with Statemate/Stateflow or embedded software engineering.Five Years of experience in automotive and modeling embedded software engineering.Altia and HMI design experience.Experience in Autosar. Strong technical problem solving skills.CMMI /Autospice experience. Multiple language skills. Software in Loop (SIL)/ Model in Loop (MIL) experience"}