{"jobID": "2296790330", "jobLocation": "San_Francisco_CA", "jobTitle": "Sales Development Representative, Outbound", "companyRating": null, "companyInfo": {"Website": "www.newrelic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (NEWR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AppDynamics, Datadog, Dynatrace"}, "estimatedSalary": null, "jobDescription": "New Relic  Sales Development Representative, Outbound  San Francisco, CA Are you full of energy, curious, creative and ready for a role in a fast paced, SaaS based, high tech company? New Relic is looking to grow our Sales Development team to help us manage the ever growing demand for our solutions and to drive new customer engagement.  The New Relic SDR role holds an important position at the top of the sales funnel for the entire company. The SDR is often our customers first experience with New Relic so you need to be able to make a great first impression to earn the right to qualify our leads and identify what the appropriate next steps should be.  And to answer the question that should be on your mind: Yes, our successful SDRs are the Talent Pipeline that feeds our Sales organization.  The ideal SDR candidate, along with having a track record of top performance, will also have the organizational skills to handle a high lead flow and should have a strong interest in advancing his/her career in Sales. Some of your responsibilities will be to:Articulate the New Relic business value proposition to decision makers to assess buying interestResearch accounts, identify key players, and generate interestConduct high-level conversations with senior level executivesUpdate prospect interaction in salesforce.com to ensure efficient lead managementConsistently achieve qualified opportunity quotas to ensure territory revenue objectivesSkills and experience needed:1+ years prior sales experience (within a Software/High Tech company is a plus)Fearless attitude willing to take intelligent risksAbility to work in a time-sensitive and high volume environmentAbility to work in a team environmentArticulate with strong business acumenExperience using Salesforce.com or other CRMBA/BSA little about us: New Relic is a leading digital intelligence company, delivering full-stack visibility and analytics with more than 14,000 paid business accounts. The New Relic Digital Intelligence Platform provides actionable insights to drive digital business results. Companies of all sizes trust New Relic to monitor application and infrastructure performance so they can quickly resolve issues, and improve digital customer experiences. Learn more at newrelic.com.  New Relic is a San Francisco Best Places to Work award winner, an Oregon Top Workplace award winner, named a leader in the Gartners 2012, 2013, 2014 & 2015 Magic Quadrant for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high quality teammates, a standard-setting product, and a company on the move.  Our office is in the tech-rich urban center of San Francisco, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up. This role is ineligible for visa sponsorship.  New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law.  Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance."}