{"jobID": "2829307330", "jobLocation": "Burbank_CA", "jobTitle": "Sr Staff Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.disney.com", "Headquarters": "Burbank, CA", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (DIS) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " News Corp, WarnerMedia, NBCUniversal"}, "estimatedSalary": "171000", "jobDescription": " As a trusted creator of premium entertainment experiences for the whole family, The Walt Disney Studios is committed to making it easier than ever for consumers to grow their digital movie libraries in a seamless and family-friendly experience. Disney Movies Anywhere (DMA) is The Walt Disney Studios? exclusive cloud-based digital movie service. This app for iOS, Android and Web experiences enables consumers to discover, purchase, manage, and watch movies from Disney, Pixar, Marvel, and Star Wars at home and on the go. *Responsibilities :** + Work on all phases of projects from design to implementation including specifications, development, testing, rollout, documentation and, if applicable, turnover to the Maintenance Engineering and Operations Team.  + Work within state of the art engineering practices (i.e. SCRUM, unit testing, design review, code reviews, continuous integration, etc.).  + Partners with team lead to identify technical requirements and alternatives to accomplish project.  + Providing accurate estimates for project development and implementation. Work with management to meet those estimates.  + Participates in design, code, test, maintenance, enhance and decommission phases throughout software life cycle to contribute technical expertise and to identify issues.  + Presents status, plan and issues/risks at daily stand-ups.  + Mitigates risk for the project, team and company.  + Work with the Architecture team in defining software and infrastructure technical solutions.  + Serve as a mentor and advisor to team members.  + Ensures knowledge transfer to team members within and outside of immediate group.  + Participate in interviewing technical candidates and provide feedback.  + Iteratively improves projects with agile delivery practices *Basic Qualifications :** + 8+ years of full software development lifecycle experience  + 5+ years of experience developing web applications  + 5+ years of Object-Oriented analysis, design and development experience  + 5+ years of experience in a data oriented role  + Strong Java 1.7+ Experience  + Strong Linux Experience  + Significant exposure to and demonstrated proficiency in all aspects of programming and analysis including design patterns, hardware and software requirements, systems requirements and deployment protocols  + Agile experience using Scrum  + Experience with open source technologies  + Experience with unit testing & test driven development (TDD)  + Experience with the Hadoop batch processing framework and map reduce design patterns  + Experience with a widely used RDBMS? and SQL  + Experience with at least one columnar NoSQL solution *Preferred Qualifications :** + Experience developing, maintaining, and innovating large scale, consumer facing web applications  + Experience working in a large big data enterprise organization  + Experience with Apache Spark including Spark Streaming  + Experience with LinkedIn?s Azkaban, Apache Closure  + Experience with Enterprise Integration Patterns and Apache Camel  + Experience with social, mobile, cloud/SaaS integrations  + API level experience with Youtube, Twitter and Facebook  + Experience creating robust and reliable data pipelines  + Familiar with the development challenges inherent with highly scalable and available web applications.  + Experience with various, modern web frameworks  + Experience with PostgreSQL RDBMS  + Experience with Apache hBase  + Experience with Apache Hive and/or Apache Crunch  + Experience with Apache Avro.  + Experience with Pentaho Weka or Apache Mahout  + Experience with the uses of various NoSQL solutions including hBase, MongoDB, Neo4j  + Operational experience with large software systems  + Experience with Amazon EC2 and EMR  + Schema and/or Cube design experience  + Experience with a visualization tools such as D3.js, Tableau, MicroStrategy  + Experience with ETL tools such as Pentaho Kettle, Informatica, Talend, OpenRefine  + Exposure to statistics, machine learning and natural language processing applications  + Exposure to security, PII and PCI compliance issues  + Exposure to R, Python, Julia, Haskell *Preferred Education :** + BS in computer science, engineering, mathematics or physical sciences  + BS or MS in computer science, engineering, mathematics or physical sciences *Job ID:** 550066BR*Location:** Burbank,California*Job Posting Company:** Studio Entertainment"}