{"jobID": "2756267344", "jobLocation": "Irvine_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.kore1.com", "Headquarters": "Irvine, CA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " CyberCoders, Kforce, ASGN Incorporated"}, "estimatedSalary": null, "jobDescription": " KORE1, a nationwide provider of staffing and recruiting solutions, has an immediate opening for a Data Scientist. Description:The Data Scientist anticipates future business needs and identifies opportunities for complex analysis.The Data Scientist, Lead will gather and analyze data to solve and address highly complex business problems and evaluate scenarios to make predictions on future outcomes and provide prescriptive solutions that support decision making.The Data Scientist will be involved in all phases of (Big Data) analytics projects including question formulation, research, development, implementation and testing. The Data Scientist will be able to explore and understand data and build advanced analytical models, then present and discuss the resulting models to any level of audience.The Data Scientist will design and drive the creation of new standards and best practices in the use of statistical data modeling, big data and optimization tools. Identify and direct special studies and analyses for unique business problems and scenarios. Proactively identify algorithms or products with high intellectual property content, assist in the evaluation of their potential for patents, where appropriate assist in the patent applications, and contribute to the intellectual property.Qualifications Education RequirementsM.S, or Ph.D. in math, statistics, operations research, computer science engineering, econometrics, or other quantitative fieldRequired Experience and QualificationsMust have at least 3+ years of actual working experience performing advanced quantitative analyses.Advanced hands-on working knowledge of Python/SQL required.Working knowledge of SAS/R is preferred.Working knowledge of big data manipulation is plus.Ability to apply advanced statistical methodologies such as mixed model (random and fixed effects), simultaneous equations, ARIMA, neural networks, and multinomial discrete choice. Ability to apply mathematical operations to such tasks as cluster analytics, sampling theory and design of experiments, analysis of variance, correlation techniques, and factor analysis.Ability to apply advanced optimization methodologies such as linear and mixed integer optimization.Ability to apply advanced simulation modeling methodologies and techniques.Utilize complex computer operations (intermediate programming in 3rd and 4th generation languages, relational databases, and operating systems) and advanced features of software packages (word-processing, spreadsheet, graphics, etc.).Must have relational database experience.• A strong passion for empirical research and for answering hard questions with data ABOUT KORE1 Specializing in creative and technical recruiting, KORE1 is committed to supporting top IT and Creative professionals in their career paths. We build deep relationships with leading companies, connecting them to exceptional talent every day. With extensive industry expertise and unmatched opportunities, our goal is to provide a unique experience for our contractors and consultants as they prepare for their next role. We are passionate about matching the right people with the right companies. Kore1 provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Kore1 complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Kore1 expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.Improper interference with the ability of Kore1's employees to perform their job duties may result in discipline up to and including discharge."}