{"jobID": "2770886748", "jobLocation": "Palo_Alto_CA", "jobTitle": "Product Data Analyst, Sponsored Products", "companyRating": "4.2", "companyInfo": {"Website": "www.criteo.com", "Headquarters": "Paris, France", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public (CRTO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " MediaMath, Conversant, AppNexus"}, "estimatedSalary": "109000", "jobDescription": "Who we areAt Criteo, we connect 1.2 billion active shoppers with the things they need and love. Our technology takes an algorithmic approach to determining what user we show an ad to, when, and for what products. Our dataset is about 45 petabytes in Hadoop (more than 90 TB extra per day) and we take less than 10ms to respond to an ad request. This is truly big data and machine learning without the buzzwords. If scale and complexity excite you, join us.The Data Analytics team at Criteo sits between the business and technology groups. Our business is built on a strongly quantitative culture, and our analysts are involved in setting the agenda and driving decisions across the organization. Youll be given access to one of the worlds biggest datasets, and the computing power to exploit it. Well ask you to produce data-driven recommendations that can be clearly understood and quickly put into action.Overview We are looking for a highly motivated Data Analyst to join our growing Global Data Analytics Team. As this is a newly created position, you must thrive in a start-up environment, be proactive, detail oriented and eager to learn and keep-up with an evolving product landscape.What will you be doing?You will be assigned to one of the new product Criteo is developing: Criteo Sponsored Products (CSP). You will be in charge of identifying and quantifying opportunities for optimizations and solve issues as they will arise on this new product.You will be joining at an initial stage of the project, which is an opportunity to shape its direction and focus. Among the tasks foreseen:Mine product data and turn them into understandable and actionable insightsDefine and execute a stream of analysis and tests to inform and support the strategic roadmapMaster our internal analytic datasets and reporting tools, oversee the definition and maintenance of reports or dashboards to monitor our product KPIsTrain and support other analysts on best practices to analyze, troubleshoot and tune performance on your products or projectWork closely with our R&D; engine team and become an expert of the Criteo Engines What do we expect? You have previous experience in an analytical role in Technology, Consulting or FinanceYou hold a degree in Computer Science, Math, Statistics or quant economicsYou have previous experience of problem solving end to end, in autonomyYou are versatile, self-driven, detail-oriented and hands-onYou are outgoing with good communication skillsYou are passionate about analytics, statistics and predictive approachesYou have a demonstrated interest in internet and technology; youll probably have used databases or have programming experienceThis is an amazing opportunity to join the worlds leading performance advertising company and be at the center of our strategic business initiatives. Join us to contribute to one of the latest disrupting technologies in online technology. We share the same passion for e-Commerce, Advertising and Technology. We value team work, openness, technical innovation, and results-orientated thinking. Criteo corporate culture is all about attracting and retaining the best talent. We aim to reward excellence so there are fantastic opportunities for the right candidate.At Criteo, we dare to be different. We believe that diversity fuels innovation and creates an energy that can be seen and felt all over Criteo. We champion different perspectives and are committed to creating a workplace where all Criteos are heard, feel a sense of belonging, and are treated with respect and dignity.Criteo collects your personal data for the purposes of managing Criteo's recruitment related activities. Consequently, Criteo may use your personal data in relation to the evaluation and selection of applicants. Your information will be accessible to the different Criteo entities across the world. By clicking the \"Apply\" button you expressly give your consent."}