{"jobID": "2809117844", "jobLocation": "N_o_n_e", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.econosoftinc.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Title - Data Scientist Our Client is looking for someone who can dive into logs and databases and help us drive more accurate metrics on things like an upsell. Further, the person will also suggest the area of improvement and pass those to the application team. This involves getting into micro-environment (e.g. what does 20 transactions on a specific day in a specific restaurant tell me), as well as macro environment (now that I learned how the data works, let me go up a few levels and suggest a national level interpretation). Definitely a person familiar with Data Science concepts should work out well. A knowledge of statistics and statistical significance is a must. What has NOT worked, is a traditional report developer.  A Data Scientist with good business acumen, someone who can interface with end users all the way up to C-level. Looking for someone who can dive into data, create reports and dashboards, and also present to business partners.Someone that is used to working with large data sets – enterprise environments. Various BI Reporting and Analytics tools, ideally ones below.Not absolutely required but manager prefers strong background with statistics and math –– some credentials, could be a degree or hands on work experience. REQUIRED – looking for someone familiar with the following tools. ** The candidates can have 2 of the 4, doesn’t have to be exact but the ones they use are below and looking for at least a couple of these, others can be a different toolMicrostrategyPower BI (can be tableau)Google AnalyticsAginity Workbench"}