{"jobID": "2809155175", "jobLocation": "Mountain_View_CA", "jobTitle": "(USA-CA-Mountain View) Online Care Data Analyst, Consumers and Partners", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "106000", "jobDescription": " Note: By applying to this position your application is automatically submitted to the following locations: Boulder, CO, USA; Mountain View, CA, USA  The Google Technical Services Consumers team is on a mission to delight the hundreds of millions of consumers who rely on our flagship products like Gmail, Android, Chrome and Google Play. Were an operational team that focuses on delivering excellent customer care and being there for consumers when they need us most. Our team engages consumers across the globe through our online resources and communities, social outreach, and 1:1 care. We represent the voice of the consumer and work closely with cross-functional partners across Google to make our products and policies better. We're looking for people with excellent analytical and communication skills who are passionate about the consumer and helping them get the most out of Google.  Our team is user-focused and will delight all customers with care. As the Online Care Data Analyst, you will work on our flagship consumer products like Gmail, Chrome, Android and Wallet to deliver Google grade user experience.  Google Technical Services is a global support and operations team, with a mission to delight our customers with care so good, its got to be Google. Our team. le to most of our customers, and we want their Google support experience to set new standards, just like Googles products do. Our team cares for customers by solving problems and scaling solutions, incubating new Google products, and sharing user feedback with internal teams to influence product development. We support a wide variety of products, from Ads to Project Fi and just about everything in between, and our customers include advertisers, consumers, partners, publishers, retailers, and our own Sales Googlers.  ## Responsibilities Work on data modeling, metric development, data prototyping, and insight generation using statistical techniques (beyond traditional business intelligence).Work with operations teams to identify where to focus their effort.Untangle ambiguous problems and find the insights that drive operational and product excellence. ## Qualifications Minimum qualifications:Bachelor's degree or equivalent practical experience.2 years of experience in an analytical field such as Mathematics, Physics, Statistics, Computer Science, Engineering, Operations research, Economics, etc.2 years of relevant experience at a leading management consulting firm or corporate strategy team at a technology firm (i.e., software, Internet or media).Experience in one or more programming languages (Python, Java, C++, Ruby, Perl, etc.) and data analysis tools (SQL, R, Pandas, etc.).Preferred qualifications:Master's degree or other advanced degree in engineering or technical/scientific field of study or equivalent practical experience.3 years of industry experience in a consumer-internet, web analytics, or closely related analytics role.Experience writing and maintaining ETLs, which operate on a variety of structured and unstructured sources.Data analysis skills in a business context with demonstrated success in presenting large data sets in a clear and compelling manner that inspires action.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}