{"jobID": "2836063415", "jobLocation": "McLean_VA", "jobTitle": "Data Reporting Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "61000", "jobDescription": "Job Number: R0031668Data Reporting AnalystKey Role: Provide basic reporting coverage regarding internal contracts and subcontracts data. Collect, analyze, and layer internal business intelligence to meet the firms information and reporting needs. Produce high-quality analytical products for internal staff, senior leaders, and business decision-makers and produce a series of monthly metrics, reports, and analyses using internal business intelligence, including proposal and contracts activity. Field ad hoc requests from internal customers for both standardized or canned and customized reports and data exports. Review the quality and integrity of leveraged data regularly, conduct data clean-up efforts, recommend data collection improvements, support the development of new analytical products, and suggest improvements for current products. Develop comprehension of internal sources of data, data collection methods and systems, and available reporting tools and build internal relationships with key data providers and data or report consumers.Basic Qualifications: -1+ years of experience in a research or analysis role-Experience with Microsoft Office software, including Word, Excel, Access, and PowerPoint-Knowledge of research methods and concepts-Ability to work in a fast-paced and collaborative team environment-BA or BS degreeAdditional Qualifications: -Experience in a professional services environment-Experience with government contracting practices-Experience with various reporting tools, including Hyperion, Tableau, and PowerBI-Possession of excellent oral and written communication skills-Possession of excellent analytical and problem-solving skillsWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.ESG1"}