{"jobID": "2728916410", "jobLocation": "Rockville_MD", "jobTitle": "Genomics Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "86000", "jobDescription": "Job Number: R0026237Booz Allen Hamilton has been at the forefront of strategy and technology for more than 100 years. Today, the firm provides management and technology consulting and engineering services to leading Fortune 500 corporations, governments, and not-for-profits across the globe. Booz Allen partners with public and private sector clients to solve their most difficult challenges through a combination of consulting, analytics, mission operations, technology, systems delivery, cybersecurity, engineering and innovation expertise.Genomics Data ScientistKey Role:  Leverage technical and analytical expertise to explore and examine data from multiple disparate sources with the goal of discovering patterns and previously hidden insights, including providing a competitive advantage using information or address a pressing business problem. Use expertise in CS, software development, and the latest technologies to design and implement analysis infrastructure and tools, analytic workflow processes, including complex data visualizations. Leverage knowledge of mathematical and statistical concepts, CS, and domain expertise to bridge the gap between technologists and mathematicians, ensuring software solutions meet analytic requirements.  Basic Qualifications:  -Experience in working with big datasets using Python and R  -Experience with Bioinformatics  -Experience with analyzing data, specifically processing omics data, including genomics, transcriptomics, and metabolomics  -Ability to lead group discussions and present data findings  -MA or MS degree  Integrating a full range of consulting capabilities, Booz Allen is the one firm that helps clients solve their toughest problems by their side to help them achieve their missions. Booz Allen is committed to delivering results that endure.  We are proud of our diverse environment, EOE, M/F/Disability/Vet.SIG2017 "}