{"jobID": "2821604578", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Research and Economics", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Team The Research and Economics team, led by the Chief Economist, is responsible for addressing the thorny policy and business challenges impacting Uber globally. As a data scientist on this team, you would be expected to bring analytical and empirical rigor to bear on important questions relating to economics, transportation policy, and urban planning. About the Role Depending on your background and interests, you could focus your work in one of two areas: Economics: Conduct research to understand our business and driver-partners in the context of the economies in which Uber operates. For example: We know that the flexible work model is very valuable to Uber drivers (see Chen et al., Angrist et al.) and that dynamic pricing is vital in protecting the health and efficiency of the dispatch market (see Castillo et al., “Surge Pricing Solves the Wild Goose Chase”); however, it’s likely that consistency (e.g., of pricing or earnings) also carries some value for riders and drivers. What values should we put on these opposing virtues?Cities and Urban Mobility: Study Uber's impact on riders and cities around the world with a special focus on different facets of urban mobility. For example: What is the relationship between on-demand transportation and existing public transport systems. Do they complement or compete with each other? Or, does this relationship change depending on external factors? What could these external factors be and how do they change rider behavior?What You’ll DoConduct rigorous, careful statistical and econometric analysis in support of our research prioritiesDevelop assets (maps, visuals etc.) that explain our research for policy and communications needsManage relationships with outside academics and research partners to ensure research collaborations run smoothlyCommunicate cross-functionally to understand the intersection of policy, product, legal, and operations and develop research that informs business or policy decisionsPresent your results internally and externally; in some cases, writing academic papers with great researchers from top universitiesWhat You’ll NeedA bachelor’s degree in Economics, Statistics, Math, Engineering, Computer Science, Transportation Planning, or another quantitative field; PhDs welcomedCandidates with a relevant PhD and/or extensive experience will be evaluated (and paid) commensurate with their education and experience.1+ years of quantitative research or data science experienceStrong data skills and the ability to learn to use tools such as SQL, Python, R, and GIS mapping tools to work efficiently at scaleThe capacity to work independently and execute a research plan with minimal oversightThe ability to organize and synthesize analyses and communicate data insights with clarityEnthusiasm for learning and growth"}