{"jobID": "2750357634", "jobLocation": "Los_Angeles_CA", "jobTitle": "Watson Health- Analytic Consultant", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "85000", "jobDescription": "Job Description Work independently to provide consulting support and actionable recommendations for our health plan and large employer clients, using basic statistical analysis of medical, drug, dental and disability claims data, in combination with benefits eligibility, sociodemographics and health survey data. Use basic statistical methods and knowledge of health benefits to analyze client experience and trends and evaluate success of health-related program investments.Research client strategies and current industry solutions to develop actionable recommendations that support future client strategy and direction.Confidently present recommendations to clients.Advise clients on analytic methods and ad hoc reporting.Train clients on Watson Health tools.Mentor junior staff and foster engagement and teamwork. Required Technical and Professional Expertise 3+ years in healthcare-related industry3+ years of quantitative analysisAbility to work on-site 5 days a week in one of these locations - Ann Arbor, MI, Chicago, IL or Cambridge, MA. Preferred Tech and Prof Experience 5+ years in healthcare industry5+ years of quantitative analysisMaster's Degree in mathematics, statistics, informatics, economics or public health EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}