{"jobID": "2829534246", "jobLocation": "Morris_Plains_NJ", "jobTitle": "Scientist, Validations", "companyRating": null, "companyInfo": {"Website": "www.immunomedics.com", "Headquarters": "Morris Plains, NJ", "Size": "51 to 200 employees", "Founded": " 1982", "Type": " Company - Public (IMMU) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview  Immunomedics is seeking a Scientist, Validation with experience in process validation, equipment qualification, cleaning validation, technology transfer and process improvements for its Morris Plain site. Successful execution of this role requires established expertise in upstream and/or downstream process development for therapeutic proteins, process characterization, process validation, and technology transfer experience. This position will report to the Manager, Validations.  Responsibilities  Responsibilities  · Perform process characterization, process validation, equipment qualification and technology transfer of large molecules, including but not limited to monoclonal antibodies, fusion proteins, and antibody-drug conjugates in preclinical to late stage development.  · Execute technology transfer to support scale-up and cGMP manufacturing.  · Collaborates effectively within Process Development as well as with Manufacturing, Quality Control, Quality Assurance and Regulatory Affairs.  · Participate in Project and CMC development teams, as required.  · Perform data review to ensure accuracy, completeness, and validity  Qualifications  Education/Experience  · Ph.D. in biochemical engineering, pharmaceutical chemistry, biochemistry, or appropriate technical discipline with 2-3 years of industrial bioprocess development and manufacturing experience, including mammalian cell culture and associated downstream unit operations or Masters + 5 years of relevant experience.  · Experience in working with monoclonal antibody, fusion proteins, and antibody conjugates is preferred, with demonstrated expertise in upstream and/or downstream process development and analytical expertise.  · Proven experience in early stage biologics process development, manufacturing, process characterization and process validation.  · Experience in supporting launch and commercial manufacturing.  · Familiarity with cGMP operations and working in an FDA regulated environment.  · Proven technology transfer and scale-up experience, from development lab to cGMP manufacturing.  · Experience with statistical methodologies such as DOE, process control charting, multivariate analysis  · Excellent written/oral communication skills.  · Experience in the principles of quality by design (QbD) and quality risk management is preferable"}