{"jobID": "2828336433", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.morganlewis.com", "Headquarters": "Philadelphia, PA", "Size": "1001 to 5000 employees", "Founded": " 1873", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Morgan, Lewis&Bockius; LLP, one of the world's leading global law firms with almost 4,000 lawyers and staff in 30 offices is currently seeking a Data Analyst who will be resident in either of our Philadelphia or Washington offices. The Data Analyst will report to the Manager of Data Analytics and provide analytical and statistical support to the Labor and Employment Practice Group.  Responsibilities include, but are not limited to: Working with large scale disparate data sets;Mining and investigation of data;Serving as the liaison with the client's HR and Payroll Departments to collect the necessary raw data for purpose of analysis;Preparing compensation analyses from electronic payroll records;Preparing analyses of demographics for client audit and affirmative action plans;Preparing OWBPA attachments and separation agreements;Preparing detailed summaries of statistical results from Reduction in Force (RIF) analysis.Experience/Requirements:A bachelor's degree from an accredited college or university in computer science, statistics, engineering, mathematics or technology related curriculum along with one year of relevant experience is preferred.The candidate must be a self-starter, team player, manage projects to completion, and be able to work with minimal supervision.Candidates must have the ability to: monitor, track and document processes; follow and prepare SOPs and protocols; assess and meet the needs of attorneys.High degree of customer/client service and exceptional organizational skills.Willingness to work in a team environment and adhere to firm standards.Excellent problem solving ability and verbal/written communication skills.Ability to exercise good judgment in advising firm clients and attorneys and work under strict deadlines.Ability to work with mathematical concepts, such as probability and statistical inference, and fundamentals of plane and solid geometry and trigonometry, and apply concepts such as fractions, percentages, ratios, and proportions to practical situations.Ability to apply advanced mathematical concepts such as exponents, logarithms, quadratic equations, and permutations, as well as apply mathematical operations to such tasks as frequency distribution, determination of test reliability and validity, analysis of variance, correlation techniques, sampling theory, and factor analysis.Ability to define problems, collect data, establish facts and draw conclusions.Ability to interact with all levels of staff and attorneys.Ability to work independently in a production environment, flexibility for off-hours work and availability for occasional travel are essential.Proficiency in Microsoft SQL, MS-Excel, MS-Word, MS-Access, Citrix, Oracle required.PeopleSoft or SAP databases preferred.Familiarity with KNIME analytics platform is a plus. Qualified candidates can apply online by visiting our website at www.morganlewis.com and selecting \"Careers.\"  Morgan Lewis is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.  Pursuant to applicable state and municipal Fair Chance Laws and Ordinances, we will consider for employment qualified applicants with arrest and conviction records."}