{"jobID": "2829232852", "jobLocation": "Washington_DC", "jobTitle": "GIS Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": "60000", "jobDescription": "Working at ICF Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.  Join ICF and support Department of Homeland Security (DHS) in protecting the integrity of our immigration system and combating criminal threats facing the nation by leveraging cutting edge data analytics tools and techniques. Apply your skills and expertise in increasing DHS's mission effectiveness and thereby make our nation safer and stronger. ICF is comprised of experienced professionals with the skills required to unlock the power of governed data discovery. Our staff provides deep technical and business support for data acquisition, data analysis/data science, and interactive data visualizations. Job Description: We’re looking for a seasoned GIS Data Analyst who enjoys working directly with clients to design and implement custom mapping and spatial analytic and reporting solutions, start to finish, in a dynamic and fast paced environment. You’ll be immersed in a variety of projects, helping government and commercial clients evaluate spatial data and data sources, design analysis requirements, and build GIS tools and applications to meet pressing business needs. This includes working with ICF colleagues and clients to assess, define and implement improved business processes. As part of a larger team of data scientists and data engineers, you’ll help deliver comprehensive analytics solutions leveraging cutting edge tools and technologies. *Location Washington, DC What you’ll be doing: - Perform GIS analysis to develop client focused outputs, maps, and dashboards that integrate large quantities of complex data and provide context and insights relevant to mission objectives. - Perform extensive data profiling and analysis based on a client’s spatial and non-spatial data. - Evaluate and integrate spatial data from various data sources and data types (geodatabases, web services, raster and image files) using extract, transform, and load (ETL) processes. - Work directly with clients and ICF subject matter experts to translate business needs into spatial analysis requirements. - Work with UI teams and/or client to define mapping and reporting requirements. - Support development of custom reports and other data visualization products.  Basic Qualifications: - Master’s/Bachelor's degree in a technical field (e.g., Geographic Information Systems, Computer Science, Engineering or related discipline) - 4+ years of experience designing and implementing spatial analysis in a desktop GIS and data analyst role using ArcGIS or QGIS - Experience managing and creating web-based mapping applications using tools such as ArcGIS Online, Carto, or Mapbox. - Knowledge of GIS scripting languages such as Python or R. Preferred Skills/Experience: - Experience working with databases and BI tools such as PostgreSQL, Qlik, Tableau, PowerBI etc - Knowledge of open source enterprise GIS Systems such as GeoServer. - Ability to obtain a Public Trust Clearance. - Solid understanding of the software development cycle paired with an ability to define/document business processes and software requirements for technology initiatives. ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity) Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf For a listing of other career opportunities at ICF, please visit our Career Center at www.icfi.com/careers About ICF ICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.  Washington Client Office (WA88)"}