{"jobID": "2827318907", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist - Separation Science", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.  The individual will be a hands-on analytical scientist working in a team environment to provide separation support for discovery of synthetic drug molecules. The position will involve performing chromatographic separations for analysis and purification of synthetic molecules, including the use of a variety of detction methods. The chosen individual will be a key contributor to regular chromatography and optical spectroscopy support of the synthetic chemistry department. The responsibilities will include: Perform analytical chromatographic separations using HPLC, SFC, CE and GC, including maintainence and utilization of sophisticated parallel SFC and HPLC method development systems.Participate in developing chiral and achiral separation methods and performing purifications for challenging drug molecules and metabolites using preparative-HPLC or SFC with UV and MS detectors.Perform weight percent assays and special characterization of key compounds.Maintain and utilize specialized instruments that include but not limited to 2D UPLC/ToF MS; HPLC/Chemiluminescence Nitrogen Detector (CLND), UPLC/FLD, SEC/MALS/RI, and parallel SFC/UV/CD. In addition, the chosen candidate will assist senior scientists to develop and implement innovative chromatographic and spectroscopic solutions for non-routine problems such as chiral interconversion kinetics and thermodynamics, biomarker assay development, and to investigate high order structure using optical and chiroptical spectroscopic techniques (IR, VCD, CD, FL).  The candidate will have a B.S. or M.S. in Analytical Chemistry or a related field with at least three years of relevant biopharmaceutical experience. The following qualifications are required or preferred. Hands on experience in separation science, inlcuding analysis and purification of small molecules with HPLC, LC-MS, SFC, and/or SFC-MS.Familiarity with instrument control software for the above from major vendors such as Waters, Agilent, Shimadzu.Familiarity with the concepts of modern chromatography, including method development, mobile and stationary phase selection, method optimization, and data interpretation.Hands-on experience in maintaining, automating and customizing chromatographic and spectroscopic instrumentation is desirable but not required.Skills in computer programing, modeling and statistical analysis are desirable but not required.Strong written and oral communication and interpersonal skills are required to effectively interface with customers and collaborators with diverse areas of expertise in a highly matrixed environment.Scientific curiosity and enthusiasm in pursuit of best solutions for challenging problems are essential."}