{"jobID": "2430014388", "jobLocation": "San_Mateo_CA", "jobTitle": "Clinical Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.roam.kg", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "At Roam, our mission is to dramatically improve the health of the world’s population by bringing ever-more complete knowledge to patients, providers, professionals, and companies.Roam’s machine learning and data platform powers rich analysis of patient journeys to reveal the factors affecting treatment decisions and outcomes. Analysis built on this platform enables life sciences organizations and health care providers to better leverage large, disparate data sources to identify and improve patterns of care.The Roam platform is powered by machine learning and a proprietary data asset we call the Health Knowledge Graph. The Health Knowledge Graph converts billions of disparate, often unstructured, data elements into a coherent picture of healthcare. The relationships and information captured in the Graph are continuously enriched using machine learning and natural language processing to extract more information, and by making connections to new data sources. The result is a comprehensive view of the healthcare industry that allows life sciences companies to follow information instead of instincts when seeking to improve patient outcomes.The clinical data scientist role focuses on leveraging Roam’s data and machine learning assets to create analyses of patient pathways through disease and treatment progression for clients and internal development efforts. Our ideal candidate will have deep familiarity with data intensive analytics in a healthcare or a commercial life sciences industry context. Relevant experience the limitations and challenges associated with clinical data, and how analysis of clinical data might shape strategy within life sciences organizations. Candidates will work at the intersection of statistical and medical expertise, meaning that strong communication skills and creative approaches to visualizing findings are critical. Experience working with healthcare data using computational statistical approaches is required, with a preference for those with industry experience in a data science focused role. Ideal candidates will have a portfolio of projects or research to demonstrate their capabilities.Responsibilities Apply statistical tools to identify potential opportunities (e.g., variances, significant outliers, percentile ranked groups) for quality of care improvement.Develop tabular and graphical presentations of data which clearly and concisely illustrate current levels of care and patient journeys.Contribute to the development of data supported intervention strategies which will improve healthcare processes and patient outcomes.Design measurement strategies to assess the impact and ongoing behaviors related to intervention efforts undertaken by clients.Develop creative approaches to best leverage incomplete or noisy health data to address high value analysis questions.Bridge the gap between healthcare and machine learning experts for collaborative problem solving.Work with life sciences clients, data partners, and academic medical centers to ensure high quality clinical data analysis consistent with relevant research.Define use cases within our platform and identifying the data narratives that support them.Serve as the subject matter expert to convey clinical and client considerations to our broader analytics team.Key Qualifications PhD or MS in a scientific field, relevant coursework in bioinformatics. MDs also considered.Professional experience within life sciences or healthcare provider organizations.An extensive background and demonstrated experience in creating statistical models using large, longitudinal healthcare datasets (such as claims, EMRs, or patient registries).Understanding of disease incidence, prevalence, risk factors, co-morbidities, co-medications, outcome measures, and how these are represented in (or created from) dataAbility to translate and infuse clinical knowledge and best practices for cross-functional teamsAbility to understand scientific literature and experimental procedures, as well as the limitations and applications of this information in a clinical settingStrong understanding of clinical data analysis market strategy; ability to see how Roam’s platform and applications fit into the competitive landscape"}