{"jobID": "2611824938", "jobLocation": "San_Francisco_CA", "jobTitle": "Paid Social Account Manager", "companyRating": null, "companyInfo": {"Website": "www.growthpilots.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Growth Pilots is a San Francisco-based marketing agency that specializes in paid acquisition for high-growth companies. We selectively partner with leading companies as an extension of their marketing team to help achieve efficiency, scale, and ROI from their paid marketing channels. Were growing quickly and looking for a sharp Account Manager to join our Paid Social team to manage scalable direct-response Facebook advertising campaigns for a number of exciting clients.Job Description: This role has significant responsibility - you will personally be driving the results and the client relationship for the accounts you manage. We're looking for someone who's whip-smart and knows how to get results while having fun along the way. If we could describe the perfect candidate for this role, words like analytical, strategic, proactive, conversion-focused, and hustler come to mind.What Youll Be Doing: Owning account management from end-to-end Leading client communication via slack, email, and weekly calls Building out and launching campaigns Analyzing campaign performance Creating reports Optimizing bids and creative Constantly experimenting and testing new ideas Developing expansion opportunitiesQualifications: 2+ years of heavy direct response paid advertising account management experience (ideally managing $50K+ monthly budgets) Well versed in Facebook advertising (you can build lookalikes in your sleep) Strong business acumen (you're no stranger to supply and demand) Superior Excel skills (you eat pivot tables and vlookups for breakfast) Superb written and verbal communication (your emails have been called Shakespearian) Agency experience a strong bonus Experience using Facebook ad management software also a bonusPerks: Competitive salary + bonus Company-paid-for health, dental and vision benefits Flexible PTO Policy Commuter Benefits 401(k) Plan Learning stipend to foster personal growth and development Work from home Wednesdays Breakfast burrito A/B testing every Monday to start the week of right Catered lunch every Friday Challenging yet laid-back work environment Team activities and outings (Settlers of Catan, Team Lunches, Napa Wine Tasting Field Trips - these are a few of our favorite things) Wicked-smart coworkers with a lot of knowledge and experience to shareBeing authorized to work in the U.S. is a precondition of employment with Growth Pilots. We will not sponsor applicants for work visas.Growth Pilots provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Growth Pilots complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}