{"jobID": "2812165235", "jobLocation": "Sunnyvale_CA", "jobTitle": "Lead Data Scientist - Machine Learning", "companyRating": "3.4", "companyInfo": {"Website": "www.target.com", "Headquarters": "Minneapolis, MN", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (TGT) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": " Description: Join the Target.com interactive  team, where your goal is to make the digital shopping experience as simple,  secure and enjoyable as a visit to your local Target store. Youll develop  strategies that drive sales and innovation while creating a fast, fun  experience that inspires guest loyalty.  The Lead Data Scientist anticipates  future business needs and identifies opportunities for complex analysis. Gathers  and analyzes data to solve and address highly complex business problems and  evaluate scenarios to make predictions on future outcomes and support decision  making. Designs and drives the creation of new standards and best practices in  the use of Statistical Modeling and Optimization at Target.  Use your skills, experience and  talents to be a part of groundbreaking thinking and visionary goals. As a  Lead Data Scientist, youll take the lead as you, Execute solutions to business problems using Data Mining  & Analysis, Statistical Modeling, Machine Learning and OptimizationPerform statistical analysis and develop statistical models  to drive data-driven automatic pricing and promotion systemsDesign and large-scale deployment of different statistical  models including Linear Regression, Time-Series Methods, Generalized Linear  Models (Logistic Regression, Count Data Models, Survival Analysis, etc.), Hierarchical  Models and Longitudinal Data AnalysisEvaluate new and lead-edge commerce data technologies to determine  the effectiveness of the solution and its feasibility of integration with  Targets current Digital commerce platformsRequirementsM.S. in Mathematics, Advanced Statistics, Physics, Machine  Learning, Computer Science or equivalent work experienceExperience with demand modeling, dynamic pricing and price  optimizationA strong passion for empirical research & connecting  empirical findings with theoryStrong programming skills in R or Python & knowledge of  the Hadoop ecosystem3+ years of experience deploying algorithms in a production  environmentExcellent written and verbal communication skillsPreferred Requirements:PhD in  Mathematics, Advanced Statistics, Physics, Machine Learning, Computer Science  or equivalent work experienceExtensive  experience working with large data sets and model within ecommerce products/solutionsQualifications:"}