{"jobID": "2735717287", "jobLocation": "Weehawken_NJ", "jobTitle": "Data Analyst - Wealth Management(Temp-to-Perm)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Data Analyst - Wealth Management (Temp-to-Perm) - NJ Fortune 500 Company located in Northern New Jersey seeks a Data Analyst - Wealth Management for a long-term, temporary position expected to last 4 - 6 months, possibly longer. The hourly rate is up to $30/hour (overtime not payable), depending upon experience.The location is conveniently commutable by NYC and NJ public transportation. This role requires the ability to work extended hours and has potential for permanent conversion. Primary Duties The Data Analyst will be working as part of the firm's Corporate and Institutional Advisory Solutions team within Wealth Management USA, supporting the development of the Financial Wellness business by amassing and consolidating data and information from multiple sources, and identifying and implementing key reporting for internal and external stake holders. The Data Analyst will have strong knowledge of the Wealth Management business with the ability to build a database using MS Access and generate reports from Access.  Key Roles and Responsibilities: Understand the firm's strategic vision and quickly formulate a view on how to support various facets of a new businessDesign, coordinate, and implement a business solution to support the launch and near term management for the firmDesign, coordinate, and implement impactful reporting for internal stakeholders and corporate clients using MS AccessAssist with project management across the businessDrive corporate client employee email engagement strategy in partnership with 3rd party vendorKeep a pulse on competitive activity in the financial wellness industrySupport senior management and Financial Wellness team with ad-hoc requests as neededRequirementsAdvanced Microsoft Access and Excel skills, with the ability to create complex forms and reports in Microsoft AccessDegree in an analytical field such as engineering, mathematics, accounting, finance, economics, or information technology5+ years of data analysis experience in the wealth management business in the financial services industryAdept understanding of the wealth management and/or banking industryStrong knowledge of Structured Query Language (SQL) is preferredStrong project management skills, with the ability to manage multiple, concurrent projectsAbility to work extended hours when necessary and consistently contribute to the forward growth of the business"}