{"jobID": "2829290463", "jobLocation": "Raritan_NJ", "jobTitle": "Forensic Certifying Scientist", "companyRating": "2.9", "companyInfo": {"Website": "jobs.labcorp.com", "Headquarters": "Burlington, NC", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " The integration of LabCorp and Covance in 2015 makes LabCorp the largest health care diagnostic company in the world. LabCorp operates in over 60 countries creating great opportunities for career growth and advancement across the world. If you are motivated by job satisfaction LabCorp is the place for you. Every day we make a difference in the way the medical community receives accurate results for our clients and patients.  LabCorp Occupational Testing Services in **Raritan, NJ** has a great opportunity for a **_Forensic Certifying Scientist._** Come join an industry leader to grow your career in the Medical Laboratory field.  The **_Forensic_** **_Certifying Scientist_** is responsible for reviewing, certifying and reporting results. This position interacts with both internal and external clients on interpretation of results and issues arising from testing, and routinely consults with Laboratory Managers and Directors concerning results and client test management. *_Key Responsibilities:_** + Review all test results for applicable screening and confirmatory testing methodologies, relevant Quality Control data and associated documentation; certify and release results; ensure that results meet quality standards  + Apply QC practices and procedures to the review, interpretation and reporting of results and when applicable monitor chain-of-custody documentation  + Take proper remedial action in response to test systems being out of control limits, detect aberrant results of quality control and takes appropriate action  + Provide consultation and assistance to clients when technical, interpretive, and/or regulatory questions arise  + Advise/consult with laboratory technical staff regarding routine testing issues and practices  + Assist in preparation of litigation packages and affidavits. Potential to provide testimony under subpoena  + Assist in preparation for inspections and audits. Interact with inspectors and auditors when appropriate  LabCorp provides leading-edge medical laboratory tests and services through a national network of primary clinical laboratories and specialty testing laboratories. With scientific expertise in esoteric testing, genomics, and clinical and anatomic pathology, LabCorp processes tests on approximately 470,000 specimens each day, applying advances in medicine and science to laboratory testing. LabCorp operates a sophisticated laboratory network, with corporate headquarters in Burlington, NC, and more than 48,000 employees worldwide. LabCorp's Specialty Testing Group is a family brand that ties together fully integrated specialty laboratories recognized for industry-leading expertise and the latest developments in medical diagnostics. Each lab has a reputation for innovation and quality: Bode Cellmark Forensics, Colorado Coagulation, Dianon Pathology, Endocrine Sciences, Integrated Genetics, Integrated Oncology, LabCorp DNA Identity, Litholink, MedTox Laboratories, Monogram Biosciences, National Genetics Institute, and ViroMed. With the addition of Covance in 2015, LabCorp's companies that focused on clinical trials (LabCorp Clinical Trials and Tandem Laboratories) aligned under the Covance brand. With more than 48,000 employees in over 60 countries, Our 220,000 clients include physician offices, hospitals, managed care organizations, and biotechnology and pharmaceutical companies. Laboratory Corporation of America Holdings is listed on the New York Stock Exchange (NYSE) under ticker symbol LH. We have continued to innovate internally and invest strategically in scientific excellence, and we continue to be passionate about patient care and quality. *Requirements** + Bachelor's degree in Chemistry, Biology, Clinical Laboratory Science or related field or equivalent education and experience  + At least five years of pertinent laboratory experience or a Master's degree or higher in one of the above disciplines  + At least two years Confirmations experience (GCMS and/or LCMS)- _not required for those with a Master's degree in one of the disciplines listed above_  + Must have the training and experience in the theory and practice of methods and procedures used in the laboratory for which the individual is certifying data  + Excellent communication and interpersonal skills including written, verbal, and listening skills Excellent research and problem resolution skills  + Must be able to perform work with a high degree of accuracy and attention to detail  + Work effectively in fast paced high volume environment *_3rd_** **_shift position; shift differential pay in addition to hourly base_***Shift**2*Schedule** Tuesday - Saturday, 4:00pm-12:30am  As an EOE/AA employer, the organization will not discriminate in its employment practices due to an applicant's race, color, religion, sex, national origin, sexual orientation, gender identity, disability or veteran status."}