{"jobID": "2819463691", "jobLocation": "Boise_ID", "jobTitle": "System Architecture and Performance Modeling Engineer", "companyRating": null, "companyInfo": {"Website": "www.micron.com", "Headquarters": "Boise, ID", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (MU) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Samsung Electronics, Hynix, Toshiba"}, "estimatedSalary": null, "jobDescription": "    Req. ID: 118792     Micron Technology’s Inc., vision is to transform how the world uses information to enrich life and our commitment to people, innovation, tenacity, collaboration, and customer focus allows us to fulfill our mission to be a global leader in memory and storage solutions. This means conducting business with integrity, accountability, and professionalism while supporting our global community.    As a System Architecture and Performance Modeling Engineerat Micron, you will work with the memory industry’s leading architecture team on new concepts which will shape the future of electronic systems. Site Location for this role is flexible.   Responsibilities include, but not limited to:   Performing open- and closed-loop system performance analysis of new advanced memory architectures in comparison with existing paradigmsCreating or modify and tune processor micro-architectures tuned to selected process technology nodesWorking with internal engineering teams and external customers to optimize and characterize new memory and or processing components, functions, and architectures Activities entail choosing the appropriate simulation tools/environment; constructing or modifying component models including memory devices, controllers, processors; verification, generating or acquiring relevant workloads; constructing performance monitoring means (e.g. energy, cycles, statistics gathering, etc.); controller/strategy optimization; recommendationsScope spans from component-level to full system-level modeling, analysis and benchmarking and designing and tuning micro-architectures which interact with memory and or processing elements   Qualifications include, but not limited to:   A Master’s or PhD (Preferred) in Electrical Engineering in computer architecture or closely related subjects and 10+ years of relevant industry experienceDemonstrated capability in performance modeling and familiarity, experience using a variety of available tools, demonstrated capability in processor micro-architectureStrong knowledge of DRAM and NAND memory systemsKnowledge of other memory types is an asset. Strong knowledge of error-correction and mitigation methodsStrong knowledge of various processor micro-architectures. Understanding of operating systems and hypervisorsExcellent problem solving and troubleshooting skillsExcellent verbal communication and written skillsSolid programming language and computer skillsMust be open-minded and creativeHighly organized and self-motivated   About Us   As the leader in innovative memory solutions, Micron is helping the world make sense of data by delivering technology that is transforming how the world uses information. Through our global brands — Micron, Crucial and Ballistix — we offer the industry’s broadest portfolio. We are the only company manufacturing today’s major memory and storage technologies: DRAM, NAND, NOR and 3D XPoint™ memory. Our solutions are purpose built to leverage the value of data to unlock financial insights, accelerate scientific breakthroughs and enhance communication around the world.   Micron Benefits   Employee Rewards Program, Healthcare, Paid time off (Combined Sick and Vacation Time), Retirement savings plans, Paid maternity/paternity leave, Employee Assistance Program, Professional development training, Workplace wellness programs, Micron Health Clinic (Boise only), Fitness Center / Activity rooms (Boise only), Tuition Reimbursement, Micron Corporate Discounts, Casual Dress attire. We recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices.  Each manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters.  To request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748).  Keywords: Boise || Idaho (US-ID) || United States (US) || NVE (Non-Volatile Engineering Group) || Experienced || Regular || Engineering || #LI-MP1 ||   "}