{"jobID": "2722488767", "jobLocation": "Washington_DC", "jobTitle": "IT Maintenance Mangement Analyst - Active Top Secret clearance required - WSP", "companyRating": null, "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Clearance Level Must Currently Possess:Top SecretClearance Level Must Be Able to Obtain:Top Secret SCISuitability:Yankee WhiteJob Family:Engineering & SciencesJob Description: CSRA, a Federal marketplace leader in next-generation IT solutions and professional services, is seeking a highly qualified and motivated IT professionals like you who is eager to contribute to our critical Homeland Security missions. In this position, you will serve as liaison to the client on solutions to support the client maintenance program. You will ascertain industry best practices to identify new and/or unique solutions that drive customer satisfaction and be responsible for communications that drive presentations related to key performance metrics, maintenance updates and maintaining on-going equipment information. The successful candidate manages the day to day supply of logistics and maintenance -related data to the client. Identifies potential risk and other matters of significance, and provides solutions to ensure the client is successful in their mission; works in conjunction with various work centers from a customer service perspective to handle issues and ensure support is in place to meet the client’s expectations. Responsible for assisting the strategic and operational planning of customer maintenance operations; ensures that the client’s guidelines and requirements for all logistic and maintenance operations are being followed by both contract personnel and military residing in the maintenance work centers. Ascertain industry best practices to identify new and/or unique solutions that drive customer satisfaction; be responsible for communications that drive presentations related to key performance metrics, maintenance updates and maintaining on-going equipment information; manage the day to day supply of logistics and maintenance -related data to the client and identifies potential risk and other matters of significance, and provides solutions to ensure the client is successful in their mission.The successful candidate works in conjunction with various work centers from a customer service perspective to handle issues and ensure support is in place to meet the client’s expectations and is responsible for assisting the strategic and operational planning of customer maintenance operations.He/she will also ensure that the client’s guidelines and requirements for all logistic and maintenance operations are being followed by both contract personnel and military residing in the maintenance work centers.MANDATORY QUALIFICATIONS: TS (Top Secret) security clearance with SCI eligibility, Security + QUALIFICATIONS: BS or equivalent + 2 yrs related experience, or MS + 0 yrs experience,TS (Top Secret) security clearance with SCI eligibility,Security +, Net +, CCNA #cjobs #dicepost #gdjobs # of Openings:1Scheduled Weekly Hours:40Telecommuting Options:Telecommuting Not AllowedWork Location:USA DC Washington - Not Applicable (DCC076)Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}