{"jobID": "2749655297", "jobLocation": "Sterling_Heights_MI", "jobTitle": "Maintenance Supervisor", "companyRating": "3.5", "companyInfo": {"Website": "www.paragonapartments.com", "Headquarters": "Bingham Farms, MI", "Size": "51 to 200 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "36000", "jobDescription": " We are seeking energetic and knowledgeable Maintenance Supervisor to join our team. This is a unique opportunity to join a growing management company that promotes a professional work environment.  The Maintenance Supervisor will play a critical role within our organization. Your dual and equally important missions are to attract and retain residents, coordinate and direct service team, conduct weekly and monthly maintenance inspections and provide top tiered customer relations. To accomplish these objectives, you must possess a unique combination of top-notch customer service skills, administrative skills, and general maintenance knowledge and management skills. Are you up for the challenge? If so, read on to learn the specific job responsibilities and qualifications.  Administrative Responsibilities: Preferably familiar with MRI or YARDI systems. Greeting residents (by phone or in-person), assessing their maintenance needs in detail and coordinating completion of this work with the service team.Generating detailed service requests for each resident and Management.Meeting deadlines daily by entering in and closing out service requests in computer system.Conducting audits on open service requests daily in computer system.Updating appliance information in computer system.Schedule contractors timely for drywall, painting cleaning and carpet cleaning or replacementFollow up with residents via phone and email on completed service requests.  Maintenance Responsibilities:Participating in the monthly lease renewal program and preventative maintenance.Responding to resident concernsContinually inspecting property and reporting any service needs to maintenance staff.Conducting move-in/move-out inspections.Conducting fire suppression inspections, irrigation inspections, boiler inspections and emergency lighting inspections.  We offer a competitive salary and benefits package.  Requirements Qualifications:General maintenance knowledge preferably with background in fire suppression systems, boiler systems, appliance repair, rough carpentry and electrical.Highly motivated and team-oriented personal style.Open to change and able to multi-task in a fast-paced environment.Exemplary communication skills.Candidates must pass physical and drug screen."}