{"jobID": "2693253768", "jobLocation": "Dearborn_Heights_MI", "jobTitle": "Auto Glass Technician Trainee - $18/hr after paid training", "companyRating": null, "companyInfo": {"Website": "www.safelite.com", "Headquarters": "Columbus, OH", "Size": "10000+ employees", "Founded": " 1947", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Auto Glass Technician TraineeWant to be one of our famous technicians in red? We thought so. Join us as a technician trainee, the first step to becoming a technician at Safelite. You'll earn money as you learn how to install auto glass and provide exceptional customer service for Safelite AutoGlass.  Technicians become experts at troubleshooting, working independently, and focusing on attention to detail -- all while enjoying the camaraderie of a larger team. This is not your typical desk job. You'll take charge, work outside, use your hands, maximize your mechanical aptitude, and take pride in providing your customers with an experience so great, it's memorable.  Start an exciting adventure! What you'll do:Learn through hands-on, classroom, and on-the-job training. Install and repair auto glass.Understand Safelite's commitment to customer experience.Use smart phone applications and Safelite systems.Complete supervised installations by embracing a positive attitude and following taught techniques.Study to pass a required Safelite certification in order to take the next career step toward becoming a technician.Commit to the Safelite Spirit. We like going out of our way to help solve people's problems and make their day better.We genuinely care about people, treat each other like family, and show courage to do the right thing -- always.We find creative ways to get the job done and go above and beyond the expected.What you'll bring:Resilience to work in the great outdoors (in all weather conditions).Perseverance and strong problem-solving abilities.Just enough mechanical knowledge/aptitude to learn auto glass installation.An interest in working with cars.Valid driver's license with a track record of safe driving.Ability to lift and carry up to 75lbs, routinely lift 30lbs.High school diploma or GED.What you'll get:Competitive hourly pay -- paid weekly.Performance-based incentives and bonuses.Paid training, vans, smart phone, tools, and uniforms.401k with company matching.Tuition reimbursement (up to $5,250 annually).Competitive medical insurance.Paid time off for R-R and volunteering opportunities in your own community.Being part of a national organization with career growth potential.Working with a purpose. This role makes a difference every day!Celebrated as one of our valued technicians. Let's further explore to make sure this is the right job for you. Grab some popcorn, take 7 minutes to learn more, enjoy the video, and we'll see you soon."}