{"jobID": "2815874293", "jobLocation": "San_Antonio_TX", "jobTitle": "Tactical Data Link Systems Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.scires.com", "Headquarters": "Atlanta, GA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": "Requisition NumberATS-8722Job TitleTactical Data Link Systems AnalystLocationLackland AFB - TXJob DescriptionScientific Research Corporation is an advanced information technology engineering company that provides innovative products and services to government and private industry, as well as independent institutions. At the core of our capabilities is a seasoned team of highly skilled engineers and scientists with multidisciplinary backgrounds. This team is challenged daily to provide cutting edge technology solutions to our clients. PRIMARY DUTIES & RESPONSIBILITIES: SRC is on contract supporting the 625 Air Force Operation's Center (OC) under the Digital Integration for Combat Engagement (DICE) contract. The mission of the 625 OC is to conduct data link operations to support Air Force initiatives that enable and enhance National-Tactical Information-Operations with capabilities including integration, testing, training, and TTP development of C2 & ISR common & tactical data link (CDL/TDL) systems. Conduct data link operations supporting 25 AF initiatives that enable and enhance National-Tactical Integration-Operations with capabilities including integration, testing, training and TTP development of C2 & ISR common and Tactical Data Link (TDL) systemsResponsible for planning, designing, and operating Tactical Data Systems (TDS), networks, and architectures supporting Link 16, AF-DCGS, AF-NTI, and 25 AF operationsProvide subject matter expertise on a variety of technical aspects including operational execution, systems support, and data analysisThis position may require shift work Scientific Research Corporation offers a competitive salary, an extensive benefits package and a work environment that encourages excellence. Applicants selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information. Scientific Research Corporation is an equal opportunity and affirmative action employer that does not discriminate in employment.All qualified applicants will receive consideration for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, or national origin, disability or protected veteran status.[*MON *CB]RequirementsMINIMUM SKILLS & REQUIREMENTS:Current SSBI Top Secret/Sensitive Compartmented Information (TS/SCI) clearancePossess understanding of Command and Control Systems and Link 16Proficiency with Microsoft Office (i.e. Word, Excel, PowerPoint)Must have experience in an intelligence disciplineMust pass and maintain 625 OC TDL certificationAbility to work independently and with a teamDESIRED SKILLS & REQUIREMENTS:JT301 or JT310 Certification plus 5 years' experience in C2 weapons systems or Certification and BS degree with less than 5 years' experience in C2 weapons systems.AFMAN 33-285 IAT Level II cybersecurity baseline certification. This includes one of the following:GIAC Security Essentials Certification (GSEC), Security+, Security+ Continuing Education (Security+ CE), System Security Certified Practitioner (SSCP), or Cisco Certified Network Associate-Security (CCNA-Security).National-Tactical Information-Operations experience and ISR systems knowledgeExcellent communications and writing skills; to include experience with technical and professional writingPossess strong organizational skills and have ability to manage multi-taskingTHIS POSITION REQUIRES AN ACTIVE DoD TOP SECRET / SCI CLEARANCEPosition Details Continued"}