{"jobID": "2576748503", "jobLocation": "Chicago_IL", "jobTitle": "Data Developer", "companyRating": null, "companyInfo": {"Website": "www.cars.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Public (CARS) ", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description Cars.com is one of Chicago’s original tech companies. Our online platform makes it easier for consumers to shop for, sell and service their cars. With our expert content, mobile app features, millions of new and used vehicle listings, a comprehensive set of research tools and the largest database of consumer reviews in the industry, Cars.com offers innovative products to connect consumers with dealers across the country.  Data is the driver for our future at Cars. We’re searching for collaborative, analytical, and innovative engineers to help utilize the almost 20 years of data we have at our disposal. If you are passionate about using data to solve problems and build game changing products, we’d love to work with you! Responsibilities Include:Collaborate with product owners, data scientists or other developers in a lean/agile environment.Develop, scale and optimize real-time ETL or batch data processing jobs.Analyze potential data issues to determine the root cause and implement effective solutionsRequired SkillsExpertise in SQL programming, relational databases, and data modeling.3+ years of solid experience with either MPP Databases or RDBMS and NoSQL technologies like Teradata, Oracle, and Couchbase.Solid understanding of relational data structures and data integration techniques.Experience with ETL tools such as IBM DataStage or Talend.Proficiency with one or more programming languages like Java, R and Scala.Proficiency with scripting languages such as bash or Python in Unix/Linux environments.Strong written and verbal communications skillsBS or MS degree in Computer Science, Engineering, or similar fieldPreferred:Experience with internet scale data engineering in an e-commerce setting.Understanding of Hadoop or other Big Data Platforms.Prior experience extending or migrating existing data pipelines to cloud platforms such as AWS"}