{"jobID": "2632344894", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Platform Engineer", "companyRating": "4.5", "companyInfo": {"Website": "www.tala.co", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " Were looking for a Data Platform Engineer to design and implement core components of our data platform and scale it to serve millions of users across the world. In this role you will lead these vital initiatives.  We expect you to work collaboratively with the data science and analytics teams to ship scalable software solutions. Your work takes into consideration the holistic user experience from mobile to data science driven loan decision. You value the craftsmanship of clean and efficient code as well as solving problems using the most appropriate technology. You help set the standards and drive your teammates productivity. Responsibilities:Develop and deploy platforms, services, abstractions, and frameworks that enable Data Science to iterate and launch data models into productionDesign and implement database and storage solutions that fit the needs for both data transaction and reportingMentor engineers, data scientists, and analysts on best practices and code efficiencyRequirements:Strong Computer Science fundamentals4+ years experience working on backend software using modern languages and frameworks (Java, Scala, Python)Strong database experience (MySQL, PostgreSQL, NoSQL)Strong familiarity AWS (EC2, S3, RDS, ELB)Experience with Hadoop data and underlying file systems (HDFS, HBase, Cassandra, Hive)Working knowledge in API development for mobile/web usePreferred Skills & Experience:Expert proficiency in Agile development processAdvanced degree in Computer Science and/or MathExcellent ability to prioritize and communication in a fast pace environmentBonus: Experience in predictive analysis and machine learning We strongly believe that inclusion fosters innovation and were proud to have a diverse team with a wide variety of backgrounds and experiences. We focus on hiring talented people regardless of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. About Tala Tala is the leading mobile technology and data science company committed to financial inclusion globally. More than 1.3 million people have borrowed through Talas smartphone app, which provides instant credit scoring, lending, and other personalized financial services in emerging markets. Tala has raised more than $105 million from leading venture and impact investors including Revolution, IVP, Ribbit Capital, Data Collective, and Lowercase Capital. Talas global team is headquartered in Santa Monica, with additional offices in Nairobi, Manila, Dar Es Salaam, Mexico City, Mumbai, and Bangalore."}