{"jobID": "2838084118", "jobLocation": "Dallas_TX", "jobTitle": "HMDA-CRA Data Analyst, Sr.", "companyRating": null, "companyInfo": {"Website": "www.everbankcenter.com", "Headquarters": "Jacksonville, FL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The HMDA-CRA Data Analyst, Sr. is responsible for ensuring the bank's compliance with the Home Mortgage Disclosure Act (HMDA) and Community Reinvestment Act (CRA) reporting requirements. The role is accountable for all aspects of the process including, but not limited to, ensuring completeness and accuracy of HMDA/CRA data reported; timely reporting to regulators; timely report generation for the bank's leadership team; promoting organizational awareness; training; and ensuring strategic goals are achieved. Advise executive and line management on emerging risk issues, and assist various business units in establishing policies, procedures and controls to achieve accurate HMDA, HMDA Plus and CRA regulatory reporting.ESSENTIAL FUNCTIONSMaintain a company-wide regulatory compliance program focused on HMDA and CRA.Provide input on HMDA business regulatory requirements including guidance on best practices, industry standards and procedures.Manage the capturing, maintaining and analyzing of HMDA, HMDA Plus and CRA data, interpreting it to ensure consistency and adequate compliance risk management.Manage annual submission of HMDA and CRA data to ensure accurate and timely filings.Maintain strong partnerships and collaboration with relevant line management to ensure HMDA reporting and CRA reporting requirements are met.Prepare and present reports to management regarding status of compliance in areas of regulatory risk focus and analyzes quality control results to determine areas for improvement.Perform quality assurance on loan applications to ensure HMDA and CRA data is complete and accurate and ensures all errors identified are remediated.Perform targeted tests on lines of business HMDA and CRA controls and provide guidance on identified risks.Deliver subject matter expertise with respect to HMDA, HMDA Plus and CRA reporting requirements and stay abreast of all changes in regulations.Interpret performance analysis reports, documenting the factors that are impacting the bank's performance, and helps develop corrective strategies where needed.Maintains the Banks CRA Public File, ensures it is up-to-date, compliant and available at all branch bank locations via hard copy and electronic version.Support regulatory examinations by federal regulators or other internal or external auditors.Manage and oversee work of HMDA / CRA Data Analysts.KNOWLEDGE, SKILLS, AND ABILITIES REQUIREMENTSDemonstrated ability to manage and lead team members including consulting, presentation and project management skills.Proven ability regarding complex laws and regulations to line personnel and senior management to analyze, communicate verbally or in writing and make recommendations effectively.Proficient with CRA WIZ, RATA, Compliance Ease or other regulatory reporting software for CRA and HMDA submissions is required.Significant MS Excel and full Office Suite skills desired.Effective time management skillsAbility to interface with all levels of employees and managementTRAINING AND EXPERIENCEBachelor's degree plus 7-10 years of HMDA /CRA data integrity management experience with a mortgage or lending institution is required. Or, if no degree, 9+ years of HMDA /CRA data integrity management experience with a mortgage or lending institution is required.5+ years Regulatory Compliance experience required.In depth comprehensive knowledge of OCC rules including HMDA, HMDA Plus, CRA and Fair Lending regulations.Exceedingly detail oriented and investigative mindset to problem solve.Strong ability to build collaborative relationships with various business unit managers to improve operational processes associated with regulatory reporting requirements.Pre-Employment Screening May Include:Credit CheckCriminal Background CheckFingerprintingDMV CheckPast Employment VerificationSocial Security Verification Note: The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified, and they may change at any time.  TIAA, FSB is an equal opportunity employer. No associate or applicant for employment will be discriminated against on the basis of race, creed, ethnicity, color, age, religion, sex, sex stereotype, pregnancy (including childbirth, breastfeeding or related medical conditions where applicable), sexual orientation, gender, gender identity, gender expression, transgender, marital status, national origin, ancestry, physical or mental disability, requesting a reasonable accommodation based on mental or physical disability, medical condition (as defined by applicable law), genetic history and information, citizenship status, military or veteran status, or any other status protected by federal, state, or local law or ordinance or regulation.  TIAA, FSB is not seeking assistance or accepting unsolicited resumes from search firms for employment or contractor opportunities. Regardless of past practice, all resumes submitted by search firms to any employee at TIAA, FSB via e-mail, the Internet, or directly to hiring managers at TIAA, FSB in any form without valid written search agreements executed by the VP, Talent Acquisition for that specific position will be deemed the sole property of TIAA, FSB, and no fee will be paid in the event the candidate is hired by TIAA, FSB as a result of the referral or through other means.  TIAA, FSB will not discharge or in any other manner discriminate against associates or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another associate or applicant. However, associates who have access to the compensation information of other associates or applicants as a part of their essential job functions cannot disclose the pay of other associates or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by TIAA, FSB, or (c) consistent with TIAA, FSB legal duty to furnish information. "}