{"jobID": "2735654886", "jobLocation": "Los_Angeles_CA", "jobTitle": "Information Technology Intern- Junior Data Analyst (Programmer)", "companyRating": "3.5", "companyInfo": {"Website": "www.aidshealth.org", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1987", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Kaiser Permanente, CVS Health, Walgreens"}, "estimatedSalary": "50000", "jobDescription": "AMAZING INDIVIDUALS WORKING FOR POSITIVE PEOPLE at AIDS Healthcare Foundation! Does the idea of doing something that really makes a difference in people’s lives while being well-compensated intrigue you? Are you looking to work for an organization that encourages growth and success from each and every one of its employees? If so, AIDS Healthcare Foundation is the place for you! Founded in 1987, AIDS Healthcare Foundation is the largest specialized provider of HIV/AIDS medical care in the nation. Our mission is to provide cutting edge medicine and advocacy, regardless of ability to pay. Through our healthcare centers, pharmacies, health plan, research and other activities, AHF provides access to the latest HIV treatments for all who need them. AHF’s core values are to be: • Patient-Centered  • Value Employees  • Respect for Diversity  • Nimble  • Fight for What’s Right STILL INTERESTED? Please continue! AHF is currently seeking a Information Technology intern to work full-time that will start on June 18th through August 10th. The program will be a full time internship of 40 hours per week, and will provide insight for a student who has interest in working in the field of IT and for a non-profit organization. This position is paid $13.00 hourly.  The Intern will be responsible for: Programming using MS SQL or T-SQLUse T-SQL to store procedure; views; functionsSSRS- use of MS SQL service reporting servicesUse of MS SQL 2008Responsible for CareWare Interface and AthenaData Analyst will be responsible for other systems including Aries, Casewatch, SDIS, CodeBookSalesforce patient merge monitoringIntern will need to adhere to HIPPA confidentiality agreementQualifications:Must be a fulltime student (junior/senior) at an accredited 4-year college or post graduateMust have a gpa of 3.0 or higher majoring in Computer Science, Business Adminitstration, or related fieldMust commit to the full duration of the program and full time hoursMust have exceptional computer skillsWe at AIDS Healthcare Foundation believe that each individual is entitled to equal employment opportunities without regard to race, color, creed, gender, sexual orientation, gender identity, marital status, national origin, age, veteran status or disability. The right of equal employment opportunity extends to recruiting, hiring selection, transfer, promotion, training and all other conditions of employment."}