{"jobID": "2834090690", "jobLocation": "Manhattan_Beach_CA", "jobTitle": "Senior Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.pancan.org", "Headquarters": "Manhattan Beach, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "POSITION SUMMARY: The Sr. Data Analyst is responsible for providing meaningful and actionable trend analysis that will improve department and organizational efficiency and effectiveness, support better decision making and provide insight on next steps and future strategy. This position will act as a data clearinghouse and ensure that all reporting is accurate, complete and timely. ESSENTIAL FUNCTIONS: Partner with departments on projects to determine KPIs, set targets and define report templates needed.Integrate and interpret data from all areas, provide trend analysis and identify opportunities for improvement or additional action based on data and results of reporting.  Collaborate with staff to execute department and organizational reporting and analysis needs.Acquire data from primary or secondary data sources and work with the data team to identify additional fields for tracking and measuring data.  Design and provide reports that allow users to easily digest and interpret the data and includes potential solutions for improving efficiency and/or effectiveness.  Provide reports and analyses that are timely, accurate, complete and properly summarized.  Work closely with the Development Department to identify the best donor prospects and build an effective pipeline of potential donors Analyze data through data mining and modeling to improve and inform our fundraising and drive our donor solicitation, cultivation, and stewardship strategiesMaintain a level of comprehensive knowledge of systems and processes and the manner in which data is integrated. Review report request tickets on a consistent basis to ensure customer satisfaction and timeliness of delivery.  Provide support to the Finance team to create multi-year financial forecasting models.QUALIFICATIONS AND REQUIREMENTS: The following are the minimum qualifications which an individual needs in order to successfully perform the duties and responsibilities of this position. A Bachelor's Degree in Business, Accounting, Finance, Economics, Statistics or equivalent experience.  Minimum 5+ years of progressive experience in an accounting, financial, fundraising or other data analyst role.  Proven work experience as a data analyst.  Excellent analytical skills with the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracy.  Deep understanding of nonprofit fundraising metricsKnowledge of statistics and using statistical packages for analyzing large datasets.Advanced-level knowledge of Excel.Experience with Power BI a plus.Minimum of 3 years experience with Blackbauds Raisers Edge and Financial Edge systems or equivalent constituent database experience.  Adept at queries, report writing and presenting findings.  Marketing analytics experience a plus.  Strong oral and written communication skills.  Exhibits a customer service focus.  Comfortable with both hands-on and supervisory work assignments."}