{"jobID": "2831381291", "jobLocation": "Irving_TX", "jobTitle": "SENIOR DATA SCIENTIST - CREDIT RISK", "companyRating": "3.1", "companyInfo": {"Website": "www.linkedin.com/company/cottonwood-financial", "Headquarters": "Irving, TX", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "139000", "jobDescription": "Reporting to our Credit Risk Management Director, this position’s charter is to increase the company’s profits through advanced statistical analytics, traditional risk management, machine learning and data science techniques. This individual will be a senior member of an exciting, fast-paced, and growing team making an immediate impact across the entire customer lifecycle (prospecting, acquisitions, customer management, and collections). This is a great opportunity for a talented person to broaden his/her business skill set through exposure to a wide variety of business problems and challenge him/herself with projects that can span from tactical to strategic in nature. This position is based at our company headquarters in Irving (Las Colinas), Texas.KEY RESPONSIBILITIESDevelop and implement effective scoring models to be used in decisioning across all aspects of the customer lifecycleProactively collaborate with Information Technology (Database Engineers, Application Development, Business Intelligence), Product Development, Marketing, Compliance, Decision Science, Marketing Analytics, and other internal groups to implement credit risk policies and underwriting criteria for new products and business opportunitiesProfitably manage credit risk for all prospects and customers by monitoring trends, identifying opportunities, developing and presenting recommendations, implementing the strategies and measuring the impactSuccessfully manage and complete multiple concurrent projects without losing focusProvide timely and justified recommendations in response to ad hoc analysis requests by internal groupsAct as an internal resource for SAS best practicesDevelop actionable reports for use by the senior leadership teamLead company-wide initiatives related to credit risk decisioningBS in an analytical field such as Statistics, Econometrics, Applied Mathematics, or highly quantitative engineering (e.g. Chemical Engineering, Mechanical Engineering)Master’s degree in Statistics or MBA with a Statistics focus2-5 years of work experience as a Data Scientist, Statistician, Risk Analyst, Quantitative Analyst, Marketing Analyst, or other analytics roles in a consumer credit environmentAdvanced user of SAS/STAT procedures and ExcelAdvanced user of SAS and SQL to merge and mold data sets into a useful formatResults-oriented self-starter who is confident in defending his/her critical thinking abilitiesProven track record of developing successful predictive analytics and decisioning strategiesExperience developing and implementing robust and compliant custom credit risk scoresAdvanced knowledge of the data and service providers in the industryCapitalistic mindset supported by a strong business acumen and work ethicDemonstrated ability to communicate ideas and analysis results effectively both verbally and in writing to a non-technical audienceWork experience in consumer creditLocal (Dallas/Fort Worth area) candidates only – no relocationMust be currently authorized to work in the United States without sponsorship and not require sponsorship in the futurePREFERRED QUALIFICATIONSExperience in subprime consumer creditCOMPENSATIONAnnual salary of $90,000BENEFITSMedical, dental, and visionVoluntary life/ AD&D;Short-term & long-term disability401K with company matchPaid vacation, holidays, and sick timePaid maternity, paternity, extended medical leave, and jury dutyCorporate discount program on personal cell phone accounts with select providersBusiness casual work environmentABOUT COTTONWOODFounded in 1996, Cottonwood Financial is one of the largest privately held retail consumer finance companies in the United States. We have zero debt, have been profitable every year since inception, and our growth is funded entirely through internally generated capital. Headquartered in Irving (Las Colinas), Texas, we have company-owned locations, under our Cash Store brand, across the country. Through this national brick-and-mortar footprint, we provide best-in-class customer service and offer an innovative mix of financial products and services to our customers.We have been named multiple times to the Inc. 5000 list of America’s fastest-growing private companies, as well as to the Dallas 100 list of the fastest-growing private companies in North Texas."}