{"jobID": "2831147552", "jobLocation": "El_Segundo_CA", "jobTitle": "Research Scientist Contamination Transport", "companyRating": "3.6", "companyInfo": {"Website": "www.aerospace.org", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": "Requisition ID: 40084All Locations: El Segundo, CA (California) A trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning clandestine to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation&apos;s space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?ResponsibilitiesEffective contamination control is critical to space mission success. Understanding the underlying physical and chemical processes that contribute to spacecraft contamination plays a key role in developing mitigation strategies and enhancing space mission performance. The candidate will have continuous learning opportunities to collaborate with experts from a wide range of technical areas, such as material science, thermal, fluid mechanics, optics, and propulsion. In addition, the candidate will also have opportunities to be mentored by experienced staff members and gain insights into programmatic aspects in supporting US government space programs. The candidate will perform applied research and customer program support in the area of contamination transport and space vehicle component surface degradation effects relevant to space programs. The candidate is expected to design and execute laboratory experiments, collect and analyze data, and present the scientific results in reports, conferences and journal publications. The scientist will participate in developing contamination transport simulation modeling capabilities. In addition, the candidate is expected to contribute to research proposals and to leverage his/her expertise to address contamination issues in support of various space system programs. The candidate will be expected to lead experimental investigations and play key leadership roles in program support relevant to spacecraft contamination issues.Key FunctionsLead applied research and customer program support in the area of contamination transport and degradation effects relevant to space programsLead laboratory experiments, collecting and analyzing data, and presenting scientific results in reports, conferences and journal publications Plan contamination transport simulation modeling capabilitiesInitiate research proposals and leverage his/her expertise to address contamination issues in support of various space system programsCommunicate with line management, inter-organization personnel, program office contact, and customer contact to provide timely and expert support to multiple programsAct as point-of-contact for technical activities and provide independent assessments relevant to spacecraft contamination controlServe as a mentor for developing staff by providing technical guidance and insightPlay key leadership roles in program support relevant to spacecraft contamination issuesQualificationsRequired Bachelor’s degree in physical sciences such as chemistry, physics, or a closely related fieldAt least eight years of relevant experienceMust have excellent verbal and written communication skillsDemonstrated ability to work effectively with other members of the laboratory in a team environment, and to establish and maintain effective working relationships with program office, contractors, and customersDemonstrated ability to lead and coordinate teams to resolve technical issuesShow high levels of innovation, creativity, initiative and leadershipSome travelThe ability to obtain and maintain security clearancePreferredA Ph.D. in physical sciences is highly preferredHands-on laboratory experience is highly desirableExpertise in analytical modeling and computer programming (e.g., Python/Matlab) is beneficialPreferred experience shall include designing and conducting unique experimental studies, performing data analysis, and presenting scientific results at symposia and in peer-reviewed publicationsTranscript RequirementTranscripts are required for this position. Additional Requisition DetailsSystem Job Title: RES SCIENTIST Clearance Requirement: Secret Access: None Polygraph: None Relocation Available: Yes Employment Type: Regular Work Schedule: Full Time Company StatementThe Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.From our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world.Equal Opportunity CommitmentThe Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement."}