{"jobID": "2672367574", "jobLocation": "San_Diego_CA", "jobTitle": "Caregiver - Atria Rancho Penasquitos", "companyRating": "3.5", "companyInfo": {"Website": "www.atriaseniorliving.com", "Headquarters": "Louisville, KY", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "12", "jobDescription": "ResponsibilitiesProvide daily living assistance to our residents with a friendly smile.Provide medication reminders and verbal encouragement and support to our residents.May also include basic housekeeping and dining room duties as needed.May perform other duties as assigned.QualificationsHigh school diploma or general education degree (GED)Must successfully complete all Atria specified training programs.Able to read and comprehend instructions, correspondence, and memos.Able to work various schedules and shifts as needed. Atria is an equal opportunity employer. Atria provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, age, national origin, disability, veteran status, or any other classification protected by applicable law. Atria also does not condone or tolerate an atmosphere of intimidation or harassment based on these protected classifications. We require the cooperation of all employees in maintaining a discrimination-free and harassment-free work environment.  Memory Care, Dementia, Alzheimer’s, Alzheimers, certified nursing assistant, certified nurse assistant, nurse assistant, Caregiver, care giver, RSA, r.s.a., resident service assistant, resident services assistant, , personal care assistant, helperOverviewAtria Senior Living is a leading operator of independent living, assisted living, supportive living, and memory care communities in 190 locations in 27 states and seven Canadian provinces. We are the residence of choice for more than 21,000 seniors, and the workplace of choice for more than 14,600 employees. We create vibrant communities where older adults can thrive and participate, know that their contributions are valued, and enjoy access to opportunities and support that help them continue making a difference in our world."}