{"jobID": "2787601126", "jobLocation": "Chantilly_VA", "jobTitle": "Project Data Analyst I", "companyRating": "3.1", "companyInfo": {"Website": "www.akima.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " L3 Technologies, Chugach Alaska, Booz Allen Hamilton"}, "estimatedSalary": "68000", "jobDescription": "Cloud Lake is a provider of services to today’s Big Data and Cloud market with one crucial difference: our services are highly-specialized, data-centric services. This enables us to focus laser like on helping our government and commercial customers quickly and cost effectively harvest, analyze and leverage the greatest possible value from the increasingly vast amounts of data they are acquiring and need to manage.Cloud Lake’s strategic partners include leaders in virtually every area of IT strategy, implementation and management.SummaryCloud Lake Technology, LLC is looking to hire a Project Data Analyst I to join us supporting one of our current government customers. Duties & Responsibilities:Record a variety of source documentation into financial and other management systems, spreadsheets and databases; Process, verify and submit payments; Provide support in general accounting clerical operations; Checking transactions and expenditure not to exceed the amount of the obligations; Complete data input assignments, prepare letters/emails; Performs one, or more routine accounting clerical operations, such as: examining, verifying, and correcting accounting transactions to insure completeness, accuracy of data and proper identification of accounts;Totaling, balancing, and reconciling collection vouchers; Posting data to transaction sheets where employee identifies proper accounts and items to be posted; Coding documents in accordance with a chart (listing) of accounts;Basic QualificationsMinimum of a bachelor’s degree in Accounting, Finance or Business Administration preferred; or 4 years specialized or relevant educational experience/knowledge of accounts payable/receivable experience and/or Financial/Logistics training to include the development of financial diagrams, exercises and training or a combination of both totaling 4 years. Must be able to work within stringent time constraints and meet deadlines. Good oral and written communication skills.Must have an active and ability to maintain a Secret clearance.Prospective employees will receive consideration without discrimination because of race, color, religion, creed, gender, national origin, age, disability, marital status, veteran status, sexual orientation, or any other legally protected status.We are committed to Equal Employment Opportunity and providing reasonable accommodations to applicants with physical and/or mental disabilities. If you have a physical and/or mental disability and are interested in applying for employment and need special accommodations to use our website to apply for a position please contact, Recruiting Services at job-assist@akima.com or 571-353-7053. Reasonable accommodation requests are considered on a case-by-case basis.The dedicated email and telephonic options above are reserved only for individuals with disabilities needing accessibility assistance to apply to an open position using our website. Please do not use the dedicated email or phone number above to inquire on the status of your job application.We wish to thank all applicants for their interest and effort in applying for the position; however, only candidates selected for interviews will be contacted.In order for our company to stay compliant with government regulations, please apply on line. Please DO NOT email resumes or call in lieu of applying online unless you have a physical and/or mental disability and need assistance with the online application."}