{"jobID": "2507452532", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Data Analyst - Pharmacy Technician - Part Time", "companyRating": "3.4", "companyInfo": {"Website": "www.trinity-health.org", "Headquarters": "Livonia, MI", "Size": "10000+ employees", "Founded": " 1976", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " HCA Healthcare, Vanguard Health Systems"}, "estimatedSalary": "56000", "jobDescription": "Department: AA102_10001 Ip-Pharmacy - Aa Expected Weekly Hours:8Shift: Rotating Shift Position Purpose:Job Description Details:GENERAL SUMMARY AND PURPOSE: Under general supervision analyzes data issues, develops computerized solutions, identifies trends, resolves problems, and modifies existing systems to meet Pharmacy needs. Demonstrates knowledge of general business principles and pharmacy-specific issues to provide accurate, organized information for management decision making. SKILLS, KNOWLEDGE, EDUCATION AND EXPERIENCE:Education: Associate degree in Computer Science or equivalent combination of education and experience required Experience: Minimum of 2 years progressively more responsible related work experience Licensure: Current State of Michigan Pharmacy Technician license REQUIRED SKILLS AND ABILITIES Strong interpersonal skills necessary to effectively communicate and interact with all levels of hospital and medical staff.  Excellent oral and written communication skills.  Experience using advanced tools and techniques of database management software. Experience in combining data from multiple databases and creating templates for inexperienced users to do ad hoc reporting. Experience writing macros / modules to automate redundant processes.  High level analytical and problem-solving skills.  Organizational ability to prioritize and coordinate multiple projects and meet required deadlines. Ability to work with multiple interruptions  Presents and operates in a professional manner which commands respect, reflects a high level of competency, and encourages collegiality. ESSENTIAL FUNCTIONS: Performs programming tasks to develop requested new applications and/or changes to existing systems. Generates ad hoc reports, participates in analysis of user needs, recommends system projects, action plans and software updates / additions.  Monitors system security and control procedures.  Documents current system operations and procedures.  Maintains systems and application software.  Performs maintenance and trouble-shooting as required on an ongoing basis.  Generates customized reports and graphs from department and commercial software, accessing a variety of disparate databases.  Provides microcomputer and related application support for users. Pertinent applications include operating network and microcomputer operating systems, spreadsheet, word processing, database, graphics, communications and utility packages.  Supports additional initiatives including telephone support, after-hours phone support, site support, and planned training and work sessions.  Trains Pharmacy staff on the System-wide patient clinical information system. Performs as a resource person for staff related to software applications and automated systems. Maintains training manuals and applicable materials/  Provides presentations to internal and external groups regarding systems and procedures.  Develops procedures, protocols and training practices in conjunction with departmental computer support personnel  Interacts with varying levels of staff to gather information and problem-solve issues  Manages Health System patient and inter-departmental billing processes, monitors for accuracy, and recommends and/or implements solutions.  Maintains good rapport and cooperative relationships. Approaches conflict in a constructive manner. Helps to identify problems, offer solutions, and participate in their resolution.  Maintains the confidentiality of information acquired pertaining to patient, physicians, associates, and visitors to St. Joseph Mercy Hospital. Discusses patient and hospital information only among appropriate personnel in appropriately private places.  Behaves in accordance with the Mission, Vision and Values of SJMH.  Assumes responsibility for performance of job duties in the safest possible manner, to assure personal safety and that of coworkers, and to report all preventable hazards and unsafe practices Trinity Health's Commitment to Diversity and Inclusion Trinity Health employs more than 120,000 colleagues at dozens of hospitals and hundreds of health centers in 21 states. Because we serve diverse populations, our colleagues are trained to recognize the cultural beliefs, values, traditions, language preferences, and health practices of the communities that we serve and to apply that knowledge to produce positive health outcomes. We also recognize that each of us has a different way of thinking and perceiving our world and that these differences often lead to innovative solutions.  Trinity Health's dedication to diversity includes a unified workforce (through training and education, recruitment, retention and development), commitment and accountability, communication, community partnerships, and supplier diversity."}