{"jobID": "2506338999", "jobLocation": "Troy_MI", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.eta.com", "Headquarters": "Troy, MI", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Code: 1-0809-2 Posted On: Wednesday, 9th August 2017 Education: Graduate Degree Job Description:  In this role, you will support the development of optimization models by assembling data from a variety of sources as a member of the Advanced Operational Analytics team in Global Data, Insight & Analytics. The developed models and insights obtained from data analysis will provide decision support to other internal organizations, such as Product Development, Corporate Strategy, and Sustainability. Additionally, you will lead initiatives to leverage unique data streams using predictive analytics, and quantify the customer value of vehicle design choices and implemented technologies. Skills Required:A data analytics role including running queries and compiling dataPredictive analytics including machine learningBig Data technologies including Greenplum, Python, or Hadoop (HDFS, MapReduce, Hive, Shark, Spark, etc.), and command line experience with loading and manipulating files within HDFSOptimization techniques Experience Required: 2+ years in one or more of the primary skills listed Education Required: Master's degree in a quantitative field, such as Engineering, Math, Statistics, or Computer Sciences Education Preferred: PhD in a quantitative field, such as Engineering, Math, Statistics, or Computer Sciences. Please send resumes to resume@eta.com . ETA is an EEO/AAP employer.  Note: ETA follows all appropriate Affirmative Action policies. This includes but is not limited to all equal employment opportunity and affirmative action requirements set for in 41 C.F.R. Sec. 60-1.4(a) and (c), which is incorporated herein by reference. In addition, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, or national origin."}