{"jobID": "2831777187", "jobLocation": "Los_Angeles_CA", "jobTitle": "Marketing Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "OVERVIEW OF THE COMPANYJOB DESCRIPTION Fox Digital Consumer Group Digital Marketing and CRM Operations  Job Description: Marketing Data Analyst  Fox Digital Consumer Group is looking for a Marketing Data Analyst with strong expertise and a passion for understanding marketing applications and uses for data, and managing data requirements against those applications. This position is responsible for ensuring and providing timely, accurate, and consistent data to campaign teams to support development and execution of customer-facing campaigns. It interfaces primarily with Marketing partners accountable for campaign business results, operations managers responsible for building and executing campaigns, and product and technology teams responsible for delivering against data requirements. Responsibilities:Function as Marketing's subject matter expert on internal data, definitions, usage and sources to support Marketing's campaign and reporting needs and other applications for data.Assess and analyze available data vs. intended applications and use cases. Develop recommendations and implications for using existing data vs. sourcing net new data to marketing stakeholdersPerform end-to-end management of work streams including requirements and sourcing, testing and validation of development to ultimately ensure data availability to support campaigns and reporting.Prioritize portfolio of data requirements to ensure sprint delivery teams are working on the most impactful. Create and manage steady backlog of new data requirements.Monitor data quality in production systems to ensure ongoing accuracy and readiness. Identify issues, determine impacts if any, and drive appropriate issue resolution via tech and support teams while communicating to affected stakeholders.Conduct proactive and reactive analysis on data to determine best fields to use and values to key off of for campaigning and reporting. Includes sizing.Develop and manage scorecards on data quality and delivery.Ensure Marketing data documentation is up to date and accurate.Qualifications:3-5 years of experience as a data analyst, preferably with an entertainment or digital media company working in Marketing, Product, or Technical/IT teams3+ years working with marketing campaign management tools - SAS, SFMC (Exact Target)Exceptional analytical and quantitative skills with ability to interpret and summarize complex data that drive actionable plans that add value to the businessExpert in MS Excel3-5 years of professional experience using advanced SQLPrior experience working in an Agile development model for data development and delivery2-3 years of experience with BI tools such as Looker, Tableau or AWS QuickSightDisciplined, analytical but creative thinker and problem solverStrong attention to detail, strong ability to complete work under pressure on tight deadlines, logical thinking, curious, self-motivatedSuperior verbal and written communication skills at all levels of an organization with the ability to present complex data, influence others and build relationships. Positive attitude and ability to operate in a fast-paced environment  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law.SDL2017"}