{"jobID": "2795203646", "jobLocation": "Princeton_NJ", "jobTitle": "Hiring!!!! Sr/Lead IT Data Analyst----Princeton, NJ---Need Locals---In-person Interview MUST", "companyRating": null, "companyInfo": {"Website": "www.stiorg.com", "Headquarters": "Princeton, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "One of our Direct clients has an opening for a Sr/LeadIT Data Analyst for Princeton, New Jersey location for 6+ Months contract. If you are interested and looking for opportunities please review the job details given below and share your latest resume with Amrutha at amrutha.duddula@stiorg.com.  For more details please call or shoot an email. Title: Sr/Lead IT Data AnalystDuration: 6+ MonthsLocation: Princeton, New Jersey---Need LocalsInterview: Phone & In-personMUST HAVE:Working experience as a Data Analyst or Business Data AnalystKnowledge of statistics & statistical packages for analyzing datasets e.g. Excel, SPSS, SSAS, R, etcKnowledge and experience in Data MiningHighly proficient in SQLHighly proficient in Data Model concepts (both logical and physical)Hands on experience with HADOOP toolsets such as HDFS, HIVEJOB ROLE: We are looking for a passionate Data Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions. This role will provide the successful candidate with an enterprise wide view of client's data and be a driver in providing insights into improving process and decision making.  The IT Data Analyst applies developed subject matter knowledge to solve common and complex business data issues within established guidelines and recommends appropriate alternatives.  Works on problems/projects of diverse data complexity and scope. Exercises independent judgment within generally defined policies and practices to identify and select a solution. May act as a team or project leader providing direction to team activities and facilitates information validation and team decision-making process. Ability to handle most unique situations. May seek advice in order to make decisions on complex business information issues. MUST Key requirements: Must have proven working experience as a data analyst or business data analyst. There is a strong preference for the candidate to have a solid working knowledge of client's business processes.  Knowledge of statistics and knowledge of statistical packages for analyzing datasets e.g. Excel, SPSS, SSAS, R, etc. Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy. Adept at queries, report writing and presenting findings. Must have a proven track record of working with business and IT partners in delivering solutions. Such experience must include lead roles in driving a strong data culture in project deliveries. Knowledge and experience in data mining, or information retrieval utilizing database toolsets. Must be highly proficient in SQL, data model concepts (both logical and physical). Experience processing large amounts of data. Practical experience and programming knowledge to clean and scrub noisy datasets. Hands on experience with HADOOP toolsets such as HDFS, HIVE is required. RESPONSIBILITIES: Document structure of client's company business data which serves as a guide in execution of tasks.  Evaluate business data to identify the difference characteristics and locate the similarities to find integration methods for synergies and optimal results.  Design comprehensive data reports and other business tools to assist client's business users in making good business decisions  Carryout statistical analysis of all client's business data, working closely with business partners  Coordinate tools for process management and ensure that data guidelines are adhered to.  Handle data related issues and work with both business managers and supervisors in facilitation solutions.  Interact with company staff and customers to have good knowledge of the business and its processes, as this helps in the data analysis.  Guide and teach business and IT partners in data best practices and its use in business processes and decision making. If you have any questions, please feel free to reach me via email or phone.Thank you,Amrutha Duddula  Lead Talent Acquisition SpecialistSoftware Technology Inc (STI)100 Overlook Center, Suite 200Princeton, NJ 08540Email:amrutha.duddula@stiorg.comPhone : 732-664-8807www.stiorg.comwww.linkedin.com/in/amruthad/"}