{"jobID": "2705929523", "jobLocation": "Union_NJ", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.affiliated.com", "Headquarters": "Union, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Do you want to make an impact? Affiliated Monitoring is a leading technology company focused on life safety security monitoring. We own and operate two of the largest UL listed monitoring centers in the United States. Since our founding in 1977, we have grown by developing innovative services and solving challenging problems for our partners and customers. At Affiliated you’ll have an opportunity to join a work environment that prioritizes learning and collaboration while helping to improve the safety and security of people through technology.  We have an immediate opening for a Data Analyst in our Union, NJ location. This individual will join a team that works with our Data Entry and Sales teams to help onboard new large partners. This team works large complex data sets of critical life safety information. Utilizing tools you will prepare that data for import into our various business systems. At the minimum you should be a pro with Microsoft Excel and database platforms including Microsoft SQL and MySQL. We are looking for a quick learner who is eager to grow their career at a fast growing company that has an important mission protecting the lives and property of its customers. Bachelor’s degree requiredHigh level of MS Excel proficiency, MS Access a plusStrong familiarity with MS SQL, MySQL, and other database platformsExcellent problem solving skills as well as good communication are required.Experience in an office environment Data Extraction and Formatting Extract data from various file formats, including Excel, CSV, PDF, and othersUse Excel functions, formulas, and VBA to manipulate dataFormat data for import into various business systems, including automation and finance systems Data Import and QA Work with Data Entry team to import data into various business systemsPerform QA of data in these systems to ensure integrity of dataMake corrections to data, sometimes in bulk, based on issues or changes using SQL and other tools Sales Support Work with Sales team to gather information about customersSupport Sales team throughout sales processInteract with Sales team as needed throughout the customer onboarding process to ensure customer satisfaction We offer a competitive base salary and employees are entitled to a generous comprehensive benefits package including: MedicalDentalVision"}