{"jobID": "2831433318", "jobLocation": "Dallas_TX", "jobTitle": "Senior Quantitative Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.dtcc.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": "Business Unit: Group Chief Risk Office Department: Model Validation and Control Group Job Family: Oversight and Control Job Title: Senior Quantitative Analyst Corporate Title: Associate Director FLSA Code (US Only): Exempt Business Unit Description: Our Risk Management teams work to protect the safety and soundness of our systems and are responsible for identifying, managing, measuring and mitigating a spectrum of key risk types including credit, market, liquidity, systemic, operational and technology in all existing and new products, activities, processes and systems. Position Summary: The candidate is primarily responsible for performing model performance analysis/monitoring and back testing. Specific Responsibilities:Work closely with modeling group to design the model monitoring process as the new models get approved and enhance the existing monitoring reports.Prepare model performance monitoring reports and KPI to satisfy internal and external audit/regulatory requirements.Perform adhoc model performance analyses as needed and work on automation of reports.Perform back testing and stress testing.Design the benchmark/alternative models for performance monitoring purposes.Leadership Competencies for this level include:Feedback: Seeks feedback from others, provides feedback to others in support of their development, and is open and honest while dealing constructively with criticism.Delegating: Effectively manages tasks and people, taking a practical approach to determine the most effective method of execution while respecting others’ expertise and considering others’ feelings and working styles.Inclusive Leadership: Values individuals and embraces diversity by integrating differences and promoting diversity and inclusion across teams and functions.Team Building: Builds teams by quickly establishing relationships and drives a team identity and shared purpose based on diversity of thought, skills and personalities.Qualifications:3-5 years of relative experience, ideally in risk analytics, model validation or front office quantitative modeling.Excellent communication skills, both oral and written.Must have excellent interpersonal skills and can work in an efficient and organized way and have the ability to work independently and under pressure.Prior experience on quantitative modeling is preferred and should have a general knowledge about the financial market, products, risk metrics and VaR modeling /back testing approaches.Ideally the incumbent should be familiar with the regulatory requirements in terms of model risk management.Good programing skills in database languages such as SQL, R, SAS, Access, VBA, Python etc. Knowing C++ is a plus.A PhD or Master’s degree in a quantitative field, preferably in statistics, computer science, economics, financial engineering or mathematical finance.About DTCC: With over 40 years of experience, DTCC is the premier post-trade market infrastructure for the global financial services industry. From operating facilities and data centers around the world, DTCC automates, centralizes, and standardizes the processing of financial transactions across the trade lifecycle and mitigates risk for thousands of institutions worldwide.  At DTCC we value on our clients' interests and partner to deliver superior results with excellence and innovation and lead with integrity. We proactively develop your potential and invest in your career."}