{"jobID": "2812844604", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.9", "companyInfo": {"Website": "www.quickleft.com", "Headquarters": "Boulder, CO", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Pivotal Labs, Thoughtbot, Bocoup"}, "estimatedSalary": "134000", "jobDescription": "Cognizant Technology Solutions is seeking a Senior Data Scientist specializing in Machine Learning and Image Processing for the Cognizant Accelerator Studio team in Boulder, Colorado. As a Senior Data Scientist, you will be working on an exciting new Insurance product in the property insurance domain. If you’re interested in using cutting-edge technologies like neural net models to modernize insurance underwriting, this is an opportunity for you.The Cognizant Accelerator Studio uses an agile development process, and specializes in lean software methodology. We focus on defining an MVP and iterating quickly thereafter. We value direct and honest communication internally and value pragmatic solutions above all else.You will also work with our sister organization, Studio India as part of your project team. We have a diverse and respectful team. We love making great applications, and we want you to come join us!Given the hands-on, collaborative nature of our practice, we’re only entertaining applicants willing to work full time at our Boulder office. Relocation expenses are covered if you’re moving from out of state.We are looking for the following skills and experience: You have 7 years or more of experience in data analyticsYou are experienced in machine learning and image processingYou have experience using Python, Numpy, and Neural Nets (Tensorflow, Caffe, PyTorch, etc.) specificallyYou have familiarity with data science tool chainsYou have experience with web-based data visualizationYou have a Master’s degree or a PhD in a field relevant to big data, analytics or mathematics or can demonstrate equivalent industry experienceYou enjoy mentoring others just as much as you enjoy solving hard problemsYou want to contribute to the knowledge growth of a world-class engineering team through collaboration, blog posts, and team discussionsSome travel is required.Competitive salary, benefits, and the chance to use some of the latest technologies are all aspects of this opportunity. We know what our values are and give our developers everything they need to get the job done. Benefits include, but aren’t limited to: paid vacation and sick time, 401k match, employee stock purchase plan, medical benefits and chance to participate in exciting new projects.Cognizant (NASDAQ: CTSH) is a leading provider of information technology, consulting, and business process outsourcing services, dedicated to helping the world's leading companies build stronger businesses. Headquartered in Teaneck, New Jersey (U.S.), Cognizant combines a passion for client satisfaction, technology innovation, deep industry and business process expertise, and a global, collaborative workforce that embodies the future of work. With over 100 development and delivery centers worldwide and approximately 217,700 employees as of March 31, 2015, Cognizant is a member of the NASDAQ-100, the S&P; 500, the Forbes Global 2000, and the Fortune 500 and is ranked among the top performing and fastest growing companies in the world.Visit us online at www.cognizant.com or follow us on Twitter: CognizantCognizant is an equal opportunity employer M/F/D/V."}