{"jobID": "2731198727", "jobLocation": "Gaithersburg_MD", "jobTitle": "Principal Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.astrazeneca.com", "Headquarters": "Cambridge, United Kingdom", "Size": "10000+ employees", "Founded": " 1913", "Type": " Company - Public (AZN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Roche, GlaxoSmithKline, Novartis"}, "estimatedSalary": "184000", "jobDescription": "Principal Data ScientistCambridge, Gaithersburg or Gothenburg - competitive salary At AstraZeneca, were not afraid to do things differently. Were demonstrating we are a new kind of organisation, resetting expectations of what a bio-pharmaceutical company can do and following the science. Were continually exploring new ways to work, pioneering cutting edge approaches and bringing diverse teams together to deliver exceptional results which are changing the way diseases are treated.  At AstraZeneca, we don't follow the crowd and we dont expect our people to either. To develop life-changing medicines and make a difference to patients we approach problems in a different way agile and nimble, and focused on what our people need to make ground-breaking discoveries and accelerate the development and launch of new medicines.  The decisions that AstraZeneca makes throughout its value chain are best when informed by data. As part of the Global Medicines Development (GMD) Transformation initiative, AstraZeneca is investing in data science to drive efficiencies, optimize our workflows, and improve our decision making.  GMD started its transformation journey in 2016, launching several programmes which are already achieving significant benefits. GMD will accelerate its transformation along four strategic areas, making us more efficient, faster, and delivering medicines at even higher quality by:  •Innovating the approach to drug development programmes (e.g., automated and digitized patient and investigator data collection, eliminating manual data handling post data capture)  •Laying the foundation for new evidence generation beyond RCTs (e.g. using registry data)  •Automating manual processes by more than 50% to free up time for scientific activities (e.g. automated case handling, auto population of submission relevant materials)  •Making a step change towards higher-quality and more predictive decisions based on integrated data as a foundation (e.g. simulate trials and select sites and patients based on predictive analytics)  The Advanced Analytics Centre (AAC) is a GMD hub of data science experts, partnering with Clinical Operations so that we can all achieve more together. We aim to transform our site and country selection process, making it more effective and efficient by integrating historical data compiled from multiple data sources, with local insights from Marketing Companies, to inform study design planning scenarios, and refine trial execution. We will use advanced predictive techniques and fit-for-purpose decision frameworks. In parallel we will establish real-time in-depth multivariate statistical metrics and visualizations for in-flight clinical trial monitoring  We need your insight, expertise and leadership to help shape a future in which data will exponentially increase in volume, be more accessible and the opportunities for value creation will be endless. That will require state of the art analytical methodologies to optimize decision making. Principal Data Scientist will: • Provide assistance on overall strategy and management of Data Science activities  • Advise on and investigate the feasibility of data science solutions and ideas  • Utilise expertise to establish standards and best data science practices  • Develop, implement and maintain required tools and algorithms in a manner which meets regulatory and evidential requirements  •Constructively collaborate with a diverse set of users (global functions and local marketing companies) and stakeholders, enabling effective consensus, conflict resolution and alignment to project goals  •Drive Change management related to advanced analytics, using methodologies as agreed by change management lead  • Conduct hands-on data mining/machine learning projects based on specific datasets and customer problems  • Frequently interact with customers to adapt approaches to new insights based on data findings  • Clearly and objectively communicate results, as well as their associated uncertainties and limitations  • Develop and pilot analytical tools, algorithms and methods in collaboration with other groups  •Constructively collaborate with a diverse set of users (global functions and local marketing companies) and stakeholders, enabling effective consensus, conflict resolution and alignment to project goals  •Collaborate with the design and planning workstream to agree and deliver mutual goals  Develop, test, implement and refine advanced analytics methods across available clinical study and real-world data to enhance our ability to identify, select and work with the right sites for a specific protocol  Define and establish a decision framework that facilitates transparent decision making, taking into account all relevant data, information and expert knowledge Essential Skills •MSc or PhD statistics, mathematics, informatics, computer science, the physical sciences or related subject  • 3-5+ years Post graduate Degree  •Experience leading machine learning algorithmic development and tools  •Experience Coaching junior scientists  •Broad understanding of life sciences, with a preference for clinical drug development and the pharmaceutical environment  • Experience in data mining; machine learning; statistics and visualization  • Computing skills: scientific computing and scripting (R, Python, Perl, Jupyter, Hadoop, AWS), software development, database design and coding  • Understanding of algorithm design, development, optimization, scaling and application  • Experience in data mining; machine learning; statistics and visualization  •Customer focus - dedicated to meeting the expectations and requirements of internal and external customers  •Integrity and trust -- unwavering commitment to \"doing the right thing\"  •Experience of end-to-end software tool/solution development and lifecycle management ideally including the RFI/RFP process, and experience with SCRUM/agile is desirable  To be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please share this posting with them.  AstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law"}