{"jobID": "2720096210", "jobLocation": "Romulus_MI", "jobTitle": "Driver Training Program - Full Time (Must have a valid Class A): Detroit", "companyRating": null, "companyInfo": {"Website": "www.hollandregional.com", "Headquarters": "Holland, MI", "Size": "5001 to 10000 employees", "Founded": " 1929", "Type": " Subsidiary or Business Segment", "Industry": " Transportation & Logistics", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Con-way Freight, Dayton Freight, Saia LTL Freight"}, "estimatedSalary": null, "jobDescription": " OverviewWith nearly 90 years’ experience, Holland knows how to take care of our customers while providing a solid work environment for our employees. Discipline to its core values of Hard Work, Integrity, Respect, Excellence and Safety has allowed Holland to grow into a company with over 8,000 employees and more than $1 Billion in annual revenue, while being honored as a Quest for Quality award winner for 30 consecutive years! With a track record of long term employees, Holland offers more than a job, we offer the opportunity for a career. Come discover your direction with Holland and join the recognized leader of next-day delivery in the less-than-truckload industry!ResponsibilitiesIf you have your Class A CDL, but may not have the experience and/or the required endorsements to be a Holland driver then you may be interested in our Driver Training Program offered at our Detroit, Michigan terminal. The Driver Training Program allows you to work on the dock while you get your Hazmat/Tanker endorsements or work with a driver mentor to gain the skills necessary to become a full time driver with Holland. We have both Local and Regionals positions available. Local drivers are home daily and Regional drivers are home every week.  This is a great opportunity that offers great pay and benefits for drivers who recently graduated from driving school, who may not have experience driving our type of equipment, who may not have driven recently, or are missing either their Hazmat and/or Tanker endorsements. Responsibilities: To safely and efficiently operate commercial motor vehicles in urban, suburban, and rural areas in all weather conditions to transport freight. Load, unload, and move materials at customer location. Comply with company policies and federal, state and local regulationsFollow company procedures for safely loading and unloading freightTake and verify dispatch instructionsOperate a tractor-trailer combination (vans)Load and unload freight in varying weather conditions at the company and customer facilitiesSafe operation of equipment and on-time movement of shipmentsConduct pre-trip and post-trip inspectionsMaintain truck log according to state and federal regulationsFull- time driver benefits include:Company paid Health InsuranceVacation, Holiday and Sick payOver Time by the day (over 8 hrs)Pension BenefitsDirect Deposit5% Wage Increase after 1 year, 2 years, and 3 yearsCost of living increases are included in contract QualificationsDrivers Training Candidates should have: Valid Class A CDLNo major accidents in the last 3 yearsNo DUI/DWI in the last 3 years Qualified applicants will be required to take a pre-employment drug screen with true negative results and required to take additional pre-employment testing/assessments  Holland, a part of YRC Worldwide, is an Equal Opportunity/Affirmative Action Employer Minorities/Females/Persons with Disabilities/Protected Veterans.  #CB#"}