{"jobID": "2824705652", "jobLocation": "Arlington_VA", "jobTitle": "INNOVATION AND DATA INTERN", "companyRating": null, "companyInfo": {"Website": "www.qedgroupllc.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The QED Group, LLC, is a full-service international consulting firm committed to solving complex global challenges through innovative solutions. We are determined to provide all our clients with best-value services so they increase their efficiency, learning capacity, and accountability to the public in an ever more complex and interconnected world. Through Monitoring, Evaluation, and Learning and Knowledge Management practice areas, QED is working to maximize our clients' return on investment through accountability, continuous learning, and sound management.  QED’s internship program is designed to provide students engaged in a field experience with an opportunity to share their insights, develop and improve business skills in communication, technology, quantitative reasoning, and teamwork. Our interns will be able to observe and participate in business operations and decision-making, meet professional role models and potential mentors who can provide guidance, feedback, and support.  Internships are individualized and tailored to the needs and interests of each student in the program as well as the organization. QED’s experience is valuable to students as a means of allowing them to experience how their studies are applied in the \"real world\", and as work experience that can be highly attractive to potential employers on a candidate's CV.  The intern will be part of the innovation team, working in a fast-paced environment, multi-tasking between various projects and will support the Senior Technology and Innovations Advisor and the general tasks that fall under the QED Innovation Team. The general responsibilities include but are not limited to: Supporting colleagues on appropriate use of data and data methodology.Completing observatory tasks on projects managed by themselves as well as those managed by others.Assisting in the launch of a data visualization platform and mobile technology applications for international developmentManagement of university partnershipsResearch on international development topics and data visualization tools and softwarePlanning, management and delivery of small projects, delivering the agreed result including meeting of all deadlines and financial targets.Other activities as agreed with the line manager.A minimum of a Bachelor’s degree is required. Focus on international development, economics, or social science that emphasizes quantitative research methods is preferred but not mandatory.Ability to carry out research (both qualitative and quantitative) and summarize findings effectively.Experience in Tableau or data visualization preferred but not requiredStrong oral and written communication skills are required.Ability to work independently as well as in a team environmentWillingness to learn and adapt to new systems and technologies.Demonstrated interest and experience in international development. To apply for this position please follow the following steps: Complete the online application. Attach your resume. Click on the link: Biodata AID1420-17, fill out the form, sign it, and attach/upload it to your application. You may also include other documents such as cover letter and/or a work sample. Submit your application, resume, completed biodata, and any additional documents. Please note that applications submitted by other means; or without resume and/or biodata will not be considered.  Only finalists will be contacted. No phone calls please.  Reasonable accommodation requests will be considered on a case-by-case basis. The QED Group, LLC is an Equal Opportunity Employer. Women and Minorities are encouraged to apply. AA//V/D."}