{"jobID": "1543020773", "jobLocation": "Sunnyvale_CA", "jobTitle": "Security Scientist", "companyRating": null, "companyInfo": {"Website": "www.baidu.com", "Headquarters": "Beijing, China", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (BIDU) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Baidu USA, headquartered in Silicon Valley, is looking for talented security researchers with the passion and experience necessary to solve security challenges across multiple platforms including both mobile and cloud. Our mission is to develop next-generation protection methodologies and solutions for the Internet users and devices. The candidate will work for Baidu USAs security lab, which is a group of top-notch security researchers specializing in areas from mobile security to big data analysis. Here's what you will do:Perform leading edge security research from mobile to cloudContribute to breakthrough innovations in technologies from reverse engineering, malware prevention, vulnerability mitigation to security-oriented big data analysis.Enhance Baidus security infrastructure, process workflow, and threat intelligenceDevelopment of experimental framework that fundamentally changes mobile/cloud security.Learn about and experiment with emerging technologies and integrate them into research systems.Work closely with a fast moving team of researchers to create technologies that 100 million people will use.Here's what we'd like to see in you: Very strong technical skills:3+ years of hands on experience in cyber security researches.Be an expert in malware/exploit analysis, reverse engineering, or big data analysis. Technical publications or security conference presentations are a big plus.Must have solid understanding of two of Windows, Linux, Android or iOS, the more the better.Deep working knowledge of networking protocols such as TCP/IP, HTTP, SSL, DNS etc.Must be able to program in Python, C++ and Java. Go/Rust/Scala could be a plus.Superior oral and written communication skills. Good analytical and logical skills and eyes of detail, assess risk thoroughly and provide feasible solutions.Demonstrated ability to think \"outside the box\" and come up with technically creative solutions; comfort working independently and thinking dynamically, as well as working with cross-functional teams.Culture Fit:"}