{"jobID": "2750346200", "jobLocation": "Roseville_CA", "jobTitle": "Finance Data & Applications Analyst/Developer - Shared Services/", "companyRating": null, "companyInfo": {"Website": "www.snmf.com", "Headquarters": "Sacramento, CA", "Size": "201 to 500 employees", "Founded": " 1938", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description Manages finance data and databases, and maintains financial transaction systems interfaces. Builds, maintains and standardizes reporting templates across the Finance organization and works closely with Reporting and Audit team to ensure continuous and ad-hoc reports are completed timely and accurately.  As a team member in Sutter Shared Services, establishes and maintains strong, collaborative relationships with customers to identify additional ways to be of service and ensure customer satisfaction. Maintains a positive and professional work relationship with all customers and members of teams across Sutter Shared Services.  Supports the success of a high-performing shared services organization by helping to champion and drive the long-term Sutter Shared Services vision. Helps foster an environment in which continuous improvement in business processes and services is welcomed and recognized. Participates in programs and in using tools in support of building a high performance culture via the standard Sutter Shared Services responsibilities (e.g. performance measurement, people development, customer relationship management, etc.). QualificationsEducationBA/BS degree or equivalent  • CPM preferred.ExperienceExperience in data management, analytics and/or reporting as typically acquired in 3 or more years, preferably in a service delivery environmentExperience in general accounting preferredExperience working with databases (e.g. SQL Server) and large datasetsExperience in the healthcare industry preferredExperience in shared services/internal service delivery role preferredExperience with Microsoft Office - Word, Excel, PowerPoint Access – requiredExperience with Crystal system and technologies requiredExperience with SQL and Lawson systems and technologies preferred KnowledgeIn-depth working knowledge of accounting and/or financeIn-depth working knowledge of financial analysis and reporting methodologiesIn-depth working knowledge of data warehousing and relational database systemsIn-depth working knowledge of Lawson data/tables/structureWorking knowledge of Kronos and AscendKnowledge of Sutter Health Finance policies, practices and procedures a plusFamiliarity with performance metrics and ability to meet identified targets a plusGeneral understanding of Enterprise Resource Planning (ERP) systems and shared services enabling technologies (e.g. contact center technologies) is beneficialSkillsAbility to learn new applications/software systems effectively and efficientlyAbility to translate data analysis into suitable reports for presentationAbility to perform data analysis on complex data setsStrong analytical and problem solving skillsExcellent project management, planning and forecasting skillsAbility to provide constructive feedback to team members to support continuous improvementAbility to process requests consistently with high level of accuracyAbility to work with, train and coach other team membersAbility to prioritize problems and promptly resolve or escalate when necessaryStrong interpersonal skills with the ability to work with and collaborate throughout the Sutter Shared Services organization as neededStrong communication skills and have the ability to train othersStrong time management skills and ability to manage individual assignments and complete duties within tight deadlinesAbility to communicate ideas both verbally and written to influence othersAbility to recognize the appropriate style, level of detail, and message for the audienceRequires the ability to work with and maintain confidential informationPrimary Location: California, Greater Sacramento Area, RosevilleOrganization: Sutter Shared Services Employee Status: Regular Benefits: Yes Position Status: Non-Exempt Union: No Job Shift: Day Shift Hours: 8 Hour Shift Days of the Week Scheduled: Monday-Friday Weekend Requirements: None Schedule: Full Time Hrs Per 2wk Pay Period: 80All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, marital status, sexual orientation, registered domestic partner status, sex, gender, gender identity, or expression, ancestry, national origin, age, medical condition, physical or mental disability, military or protected veteran status, political affiliation, pregnancy, childbirth or related medical condition, genetic information or any other characteristic made unlawful by local, state, or federal law, ordinance or regulation. External hires must pass a background check/drug screen. Qualified applicants with arrest and/or conviction records will be considered for employment in a manner consistent with Federal, state, and local laws, including but not limited to the San Francisco Fair Chance Ordinance."}