{"jobID": "2836917406", "jobLocation": "Montvale_NJ", "jobTitle": "Sr. Research Scientist, OI and Technology, Lysol-Harpic", "companyRating": "3.3", "companyInfo": {"Website": "www.rb.com", "Headquarters": "Slough, United Kingdom", "Size": "10000+ employees", "Founded": " 1823", "Type": " Company - Public (RB) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": ". A fantastic opportunity is available for an R&D; Senior Associate to join our Research&Development; team.  The R&D; Senior Associate will work with technical product development on key projects for the R&D; Outside Innovation&Technologies; team.  Key Responsibilities Develop innovation strategies to leverage technology intelligence, monetize emerging consumer trends and collaborate with start-ups.Lead and advance multiple projects through front-end product development to deliver proof of principle formulations and approachesDeliver new technologies to the Lysol and Harpic development pipelinesWork cross-functionally as R&D; lead on project teams to achieve key milestones and objectivesCollaborate with Marketing, other R&D; teams, and third party networks to define, identify and validate innovation opportunitiesFoster strategic growth and best practices in innovation processes and systems across team and organizationManage partnerships with external technology providers through non-confidential communications and confidential discussions under formal legal agreementsBuild the global external partnership network to provide broader exposure to new and relevant external innovation in surface cleaning&disinfection;Leverage a variety of open innovation techniques to identify and assess external sources of innovation, proactively and against a specific targetProvide trainings to new associates and being an advocate of innovation in the R&D; organization Is this You? Advanced degree preferred (PhD, MS/MA, MBA, etc); BS + 5 years, MS/MA/MBA + 3 years, PhDSuccessful delivery of innovation projects through open innovation and Lean innovation processesExcellent interpersonal and communication skills (oral and written), management consulting experience is highly desiredStrong understanding of the product development process from concept ideation to launch.Extensive knowledge in Design thinking and open innovation methodologiesProven Project Management skills including timeline management and coordination of key stake holders. Able to influence without authority.Understanding of Intellectual Property, Competitive Intelligence and different collaboration formats between companiesEntrepreneurial, self-motivated individual with capability to evaluate and take risksAbility to display a degree of flexibility and adapt effectively to changeProficient with common software, including MSOffice and Patent monitoring softwareUnderstanding of regulated products under regulatory bodies (EPA, FDA, BPR) (preferred)Proactive mindset fitting with RB Core ValuesRelationship Management experience: Understanding of confidentiality and experience executing contracts with 3rd partiesUnderstanding of different sourcing strategies to support the innovation needs of the businessExperience working with early stage companies is optional but preferred Why RB? Fastpaced. Tired of having to jump through endless hoops to get things done? Not here. We move fast and deliver.Growth. Frustrated by the lack of growth opportunities in your current company? Not here! RB takes pride in the development and continued growth of our employees through steady rotations and promotions.Autonomy. RB empowers you to OWN what you do.Iconic Global Brands. http://bit.ly/RBNABrands Take a look. You'll be surprised at how many you already have in your home.Feel good about the company you work for! RB is committed to making the world a better place through betterbusiness. http://bit.ly/rbsustainabilityPassport Stamps. Does working Internationally interest you? Perform well and Global doors can open for you at RB.Work with smart people. We have a talented workforce that believes in sharing ideas to help each other, and the company succeed.Vacation. We offer 4 weeks' vacation, 9 core Holidays and 4 floating days.16 weeks paid Maternity leave.Competitive base salaries and bonuses.Tuition reimbursement. In Return RB offer very competitive salaries with excellent benefits and the chance to progress your career within a truly Global organisation.  Apply Now for a chance to really change the game!  RB is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}