{"jobID": "2684990264", "jobLocation": "Pasadena_CA", "jobTitle": "Research Scientist (NLP)", "companyRating": null, "companyInfo": {"Website": "www.oben.me", "Headquarters": "Pasadena, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DEEP LEARNINGRESEARCH SCIENTIST (NLP)ObEN’s mission is to enable everyone in the world to create their own Personal AI (PAI), intelligent 3D avatars that look, sound, and behave like the individual user. Secured and authenticated on the Project PAI blockchain, ObEN’s technology creates more productive, more personalized digital interactions. ObEN is a K11, Tencent, Softbank Ventures Korea and HTC Vive X portfolio company, and we work with our strategic investors to expand PAI technology across multiple verticals including hospitality, retail, healthcare, and entertainment.  Working at ObEN means taking on extraordinary transformations every day, in an environment that celebrates and encourages innovation. You’ll be working in small, agile teams (including world class researchers in areas of NLP, computer vision, machine learning, speech, and blockchain). We are blazing new trails in AI and blockchain technology, and we encourage and support publications to top conferences and journals. Learn more about working at ObEN in our blog post.Job Description: ObEN is seeking a Research Scientist to join our Full Stack AI/Natural Language and Translation Technologies team in Pasadena, CA. The successful candidate will join a team of researchers and engineers working to apply NLP technology across a wide array of languages andintegrating the technology into the world’s first blockchain based platform for Personal Artificial Intelligence. We are looking for candidates interested in extending the boundaries of NLP technology, building novel solutions, and delivering cross-lingual technologies with the potential to deliver more useful, more personalized artificial intelligence to our users worldwide.  The ideal candidate will have a strong research background in NLP demonstrated by publications in top NLP conferences, a strong knowledge of machine learning and deep learning, and experience working with massive amounts of data. Responsibilities:Conduct research to advance the state-of-the-art technology in NLP and deep learning, like dialogue systemsWork with applied research scientists and engineers to utilize that research to develop and deploy scalable neural network models into production that impacts our usersCollaborate with team members from other research and applied research teams working on a variety of deep learning and NLP problems.Minimum Qualifications:PhD/MS with relevant experience in the fields of Natural Language Processing, Machine Learning or Deep Learning.Strong publication record in top NLP and ML conferences — ACL, NAACL, EMNLP, NIPS, ICML, ICLR, etc.Application Requirements: Please send the following to careers@oben.com Resume/CV or LinkedIn profileNames and contact information of two references who can speak to your qualifications for this positionCover Letter identifying your five favorite apps on your phone Introduction to ObEN: https://goo.gl/gxpxwT Interview Process: STAGE 1: Phone Interview  STAGE 2: Complete a Sample Project  STAGE 3: In-person Interview at Idealab (we cover travel expenses for the day)  STAGE 4: Offer Letter "}