{"jobID": "2791758054", "jobLocation": "Rosemead_CA", "jobTitle": "Business Data and Reporting Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.sce.com", "Headquarters": "Rosemead, CA", "Size": "10000+ employees", "Founded": " 1879", "Type": " Subsidiary or Business Segment", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "ENERGY FOR WHAT’S AHEAD Are you looking to make a difference in your career? We’re working on smarter grids, cleaner energy and tools to help people manage energy more efficiently. Position Overview: This position will contribute to an exciting initiative impacting how employees across Southern California Edison (SCE) view, analyze and leverage financial and operational data. Sound interesting? If so, read on!  The Business Data and Reporting Analyst will be part of the Reporting Team within the Operational Finance organization at SCE. The successful candidate will participate in and lead components of an initiative to transform SCE’s financial and operational data reporting capabilities using the latest technologies. This will involve development of new interactive and visual tools and databases for financial and regulatory reporting, strategic planning, goal tracking, budgeting, and management decision making. Other responsibilities include developing and improving related business processes, advising clients on technical strategies to address issues, and advancing existing reporting methods. Typical Responsibilities:Leads design and implementation of automated reporting solutions that have significant financial or operational impact to the company and/or individual business units.Manages projects to improve business processes and capabilities by gathering requirements, leveraging improved tools and databases, communicating with organization stakeholders, and integrating with existing corporate and Finance business processes.Contributes to the development of the long term strategy and plan for corporate financial reporting tools, systems, data, and related business processesDeploys user-friendly self-service budgeting, forecasting, reporting and analytics toolsStandardizes, simplifies, and governs SAP financial master data.Maximizes the use of technology to implement and visualize solutions for various business financial processes.Organizes and presents data to support strategic and financial issue resolution and decision making.Minimum Qualifications:Bachelor’s Degree.7 years of experience producing reporting and analysis solutions (such as dashboarding, power pivots, data modeling, or leveraging/customizing reporting tools).2 years of experience managing projects with technical components, including scope definition, schedule, design, implementation, testing, and risk management.3 years of experience using SAP and related tools.Experience with programming languages (e.g. VBA, SAS, SQL, or other) and/or database development (e.g. MS Access, other).Desired Qualifications:Experience and expertise utilizing data visualization and analysis reporting tools and databases, such as SAP Business Warehouse, PowerBI, Analysis for Excel, BOBJ, SAP BEx, SAP Business Planning & Consolidation (BPC), Lumira, SQL, SAS, VBA, MS Office, SharePoint, Utilities International Planner, and/or emerging technologies, plus proficiency transacting in the SAP business platform.Master’s Degree.Project Management Professional Certificate.Six Sigma Certification.Knowledge of SAS Enterprise Guide.Familiarity with SAP S4/HANA.Comments:Candidates for this position must be legally authorized to work directly as employees for any employer in the United States without visa sponsorship.Relocation may be available for qualified candidates.There will be two openings for this posting. Southern California Edison, an Edison International (NYSE:EIX) company, serves a population of nearly 15 million via 5 million customer accounts in a 50,000-square-mile service area within Central, Coastal and Southern California. Join the utility leader that is safely delivering reliable, affordable electricity to our customers for over 125 years.  SCE is a proud Equal Opportunity Employer and will not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status or any other protected status. "}