{"jobID": "2810308632", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Data Scientist - Predictive Prescriptive Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "130000", "jobDescription": "Job Description What you'll be doing...  You'll be helping us bring the best possible experiences to our customers by helping us to identify what they like, and create personalized recommendations for them based on what we've learned. Using your analytics expertise, you'll help us figure out how to get the most accurate information and insights from all kinds of data. Supporting day-to-day and tactical analytics needs of the supply chain planning teams such determining the safety stock at a Store-SKU level by utilizing statistics and modeling to ensure we meet the Service Level metrics with a reduction in working capital.Driving strategic efforts across the supply chain organization, leveraging advanced analytics to optimize processes and procedures that lead to improved device life cycle management, working capital optimization and cost reduction.Owns the development and use quantitative models to recommend inventory targets for different stock points in the supply chain (DCs, stores, etc.) at product levelOwns the analytics support and business recommendations for daily disruptions in supply and demand like promotions using dataCross training to support other OEM's as neededTranslate a supply chain challenge into an analytical problem, relaying results in common business language with managerial implications. Partner with Supply Chain operational teams (e.g., supply & replenishment planning, distribution & logistics) and other Verizon organizations (e.g., device marketing, merchandising) to identify supply chain inefficiencies and potential root causes.Design and implement creative approaches to predictive modeling problemsPerform model assessments, validation, and enhancement activitiesTrack and report success metrics for projects and their impact on key supply chain KPIsPartner with IT to effectively migrate analytical models from prototype to productionDrive adoption and application of analytical model results with business partners, ensuring benefits realizedPresent and communicate analytical modeling results to business partners and other internal and external stakeholders in a simplified structure with clear business heuristics which can be implemented in our supply chainMaintain a working knowledge of modeling, data mining and visualization best practicesStay current with day-to-day operational business needs and join daily discussion and meeting What we're looking for...  You are good with numbers and you love to dig into data to find the story. Designing reports and spreadsheets is a fun afternoon for you. You are detail-oriented and know how to focus on what really matters. You understand the importance of accuracy in data analytics and reporting. You are a self-starter and a multitasker who can work independently under tight timelines. You want to make an impact by providing the data that will help improve the experience of our customers. Required:Bachelor's degree or four or more years of work experienceFour or more years of relevant experience1+ years of experience in developing and implementing analytical models in businessSkills and hands-on experience with SQLKnowledge and hands-on experience in statistical software packages (e.g., R, SAS or SPSS)Coding skills in a general-purpose programming language (e.g., C/C++, Java or Python)Preferred:Master's degree in Supply Chain, Operations Research, Industrial Engineering, Statistics, Economics or a related STEM field4+ years of experience in developing and implementing analytical models in businessFamiliarity and hands-on experience in simulation software packages (e.g. ExtendSim)Familiarity and experience with creating analytical data setsFamiliarity and experience with data visualization software like Qlikview, Tableau or ExcelExperience and competency in supply chain management When you join Verizon...  You'll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America's fastest and most reliable network, we're leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we're about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.  Equal Employment Opportunity  We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}