{"jobID": "2335794030", "jobLocation": "San_Antonio_TX", "jobTitle": "Research Scientist Associate II", "companyRating": "4.1", "companyInfo": {"Website": "www.utsa.edu", "Headquarters": "San Antonio, TX", "Size": "1001 to 5000 employees", "Founded": " 1969", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "32000", "jobDescription": " Position Details  Position Information Title of Position Research Scientist Associate II Requisition Number BES20170095P Department Posting Name Biology Location Main Campus Recruitment Type External Position Type This is a Classified, benefits eligible, position. Grant Funded? Yes Hours per week 40 If employee will be working a schedule other than Monday - Friday, 8:00am - 5:00pm, specify hours and days to be worked N/A.If Temporary, Ending Date Recruiting Rate $30,276/Annualized(beginning salary negotiable depending on qualifications) Beginning Salary Flexibility Yes Pay Basis Salary Required Education Master's Degree Do you want to allow additional experience to substitute for required education? No Preferred Education Doctoral Degree Field of Study Requires a Master’s Degree in Biology, Microbiology, Biotechnology, or a related field of study from an accredited institution.MS Office Experience Required Word, Excel, PowerPoint, Outlook Will this position require driving a UT or personally owned vehicle? No Other Computer and Software Skills Required N/A.Experience and Other Skills Required One year of related research experience.Do you want to allow additional education to substitute for required experience? No Other Skills Preferred Advanced courses leading to a Ph.D. in the field of assignment.Two years of related research experience.Experience with BSL-3 laboratory research equipment.Description of Job Duties Maintain inventory on laboratory supplies, stocks, help train, supervise laboratory personnel.Maintain accurate records of research, order supplies and equipment necessary for experimentation.Perform high-containment BSL-3 research, perform animal experiments, maintain records.Designs and performs microbiological procedures for experimentation, records observations and measurements, and compiles data.Perform other duties as assigned.Posting Open Date 03/03/2017 Posting Close Date at midnight on Open Until Filled Yes Special Notes To Applicants Note 1: At the discretion of the hiring department, this position will be classified as a Research Scientist Associate II or III based on the qualifications of the finalist candidate.Note 2: UTSA is a tobacco-free campus.Note 3: UTSA is an Equal Employment Opportunity/Affirmative Action Employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply.Note 4: This is a security sensitive position. Employment is contingent upon a successful background check."}