{"jobID": "2792478082", "jobLocation": "West_Sacramento_CA", "jobTitle": "Biostatistics Scientist", "companyRating": null, "companyInfo": {"Website": "www.karriere.bayer.de/de", "Headquarters": "Leverkusen, Germany", "Size": "10000+ employees", "Founded": " 1863", "Type": " Company - Public (BAYN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Bayer is a global enterprise with core competencies in the Life Science fields of health care and agriculture. Its products and services are designed to benefit people and improve their quality of life. At Bayer you have the opportunity to be part of a culture where we value the passion of our employees to innovate and give them the power to change.Biostatistics ScientistYOUR TASKS AND RESPONSIBILITIES We are seeking a highly motivated scientist to join the Biologics R&D; team as a Biostatistics Scientist I at our West Sacramento, California site. This is a highly interdisciplinary role that requires collaboration with internal and external collaborators in statistics, plant pathology, entomology, fermentation, chemistry and bioinformatics. The candidate will integrate data, make recommendations, produce statistical pipelines, and improve the overall quality and value of our data collection.  The primary responsibilities of this role, Biostatistics Scientist I, are to: Develop and improve statistical tools for discovery and characterization of microbial compounds in vitro, in planta, and/or in field;Support bench scientist teams in the analysis of large data sets by integrating different data types into statistical frameworks;Train research staff on experimental design, basic statistical concepts, and the use of relevant statistical tools;Keep abreast of new statistical techniques, including technological developments in machine learning;Provide guidance to external collaborators regarding experimental design and/or statistical analysis;Be able to work with Data Engineers to translate statistical analyses and experimental designs into standardized pipelines;Be able to communicate effectively through listening, documentation, and presentation, especially using compelling visualization tools to share analysis and the interpretation of data.WHO YOU ARE Your success will be driven by your demonstration of our LIFE values. More specifically related to this position, Bayer seeks an incumbent who possesses the following:  Required Qualifications: Ph.D. in Biology, Statistics or a related field or Master’s degree and two (2) years of experience;Expertise in the statistical analysis software R. Preferred Qualifications: Prior experience in plant breeding, plant pathology, plant biology, entomology, ecology, or evolutionary biology;Prior experience in agriculture and/or an R&D; environment;Knowledge of other programming languages (UNIX, Python, SQL). *Position may offer domestic relocation assistance.YOUR APPLICATIONBayer offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and you have the \"Passion to Innovate\" and the \"Power to Change\", we encourage you to apply now. To all recruitment agencies: Bayer does not accept unsolicited third party resumes.Bayer is an Equal Opportunity Employer/Disabled/Veterans Bayer is committed to providing access and reasonable accommodations in its application process for individuals with disabilities and encourages applicants with disabilities to request any needed accommodation(s) using the contact information below.Location: United States : California : West SacramentoDivision: Crop ScienceReference Code: 17334Contact Us + 1 888-473-1001, option #5"}