{"jobID": "2689179369", "jobLocation": "San_Francisco_CA", "jobTitle": "VP of People", "companyRating": null, "companyInfo": {"Website": "www.imperfectproduce.com", "Headquarters": "San Francisco, CA", "Size": "Unknown", "Founded": " 2015", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Hungry Harvest"}, "estimatedSalary": null, "jobDescription": "About ImperfectImperfect is a produce delivery startup on a mission to reduce food waste and to make fresh produce more affordable, accessible, and convenient. We source produce directly from farms, which would otherwise go to waste, and deliver it to customers' doors for 30-50% less than grocery store prices. Since our start in 2015, our customers have saved millions of pounds of produce from going to waste.Imperfect is more than just a produce box! In everything we do, we bring an appetite, lead with heart, embrace imperfection, and work to grow the movement. By working at Imperfect, youre helping build a more sustainable and effective food system. Youre helping fight food waste. Youre ensuring farmers are rewarded for their full harvest. Youre improving access to healthy food in food deserts. With each curvy cucumber and misshapen potato, youre helping shape our world for the better.We're headquartered in San Francisco with operations in each of our cities: the San Francisco Bay Area, Los Angeles, Portland, Seattle, Chicago, and Indianapolis. Imperfect plans to bring ugly produce to Sacramento, San Diego, Milwaukee, and Minneapolis in 2018.We're looking for folks who are positive, motivated, and ready to change the world. If that sounds like you, drop us a line!About the RoleAs VP of People, you will be responsible for Imperfects most cherished asset: our people. Youll manage the close-knit People and Culture team of HQ and remote employees while maintaining and continuously improving Imperfects reputation as a 'great place to work.' Youll sit on the company leadership team as an advocate for employees and the company culture. There, your teammates will rely on you to bring on high quality new hires and give them an incredible experience from recruitment to orientation to ongoing support and development. Most importantly, you will apply your deep industry expertise to create and continually improve our HR systems as the company continues to scale.ResponsibilitiesCulture and Strategy Serve as co-strategist to the CEO and COO on all things People and CultureCreate proposals and lead the implementation of new systems that scale strong performance and cultureServe as an executive on the companys senior leadership team to help shape all major company policies and strategies, especially as a voice to make sure all major company decisions consider our people and cultureTake ownership for maintaining a strong culture defined and driven by our valuesEnsure People Business Partners in each location are keeping employees engaged by planning team building activities, off-sites, and regular recognition for birthdays, work anniversaries, and other milestones Recruiting Oversee all recruiting. Support and manage in-house and external recruiters to generate a pipeline of high quality candidates for our open positions among all department and locationsPartner with hiring managers to help anticipate new employee headcount Retention and Professional Development Lead the way to making Imperfect a recognized best place to workEnsure every new employee has an amazing orientation experience that makes them feel welcomed, integrates them into the culture and sets them up for successOversee professional development of our employees and implement programs that make our leaders better managers and grow our teams capabilitiesPartner with department heads on succession planning, ensuring all employees are given an opportunity for growth and internal mobilityLead Imperfect University, a monthly professional development series for all employees Performance Management and Compensation Oversee the administration of all compensation and benefits, ensuring that we are offering competitive packages that motivate employees and incentivize high performanceEnsure that every employee from the warehouse floor to our CEO has KPIs and SMART goals and that this data is transparent (unless confidential), easily accessible and integrated into our ongoing performance management Compliance and Employee Relations Guide Imperfect through all employment law and regulatory matters to ensure that we are always in complianceMaintain updated Employee Policy HandbookResolve all HR grievances with professionalism, confidentiality and empathy aimed at making all parties involved feel supported while finding the best resolution for the company and employees About You 8+ years HR experience2+ years leading HR at rapidly growing organizations2+ years experience supporting People and Culture in a warehouse environmentBA degree preferredYou have a successful track record of managing HR departments to achieve results and impact for the companyYoure up to speed on compliance and hiring best practices as well as the best ways to run payroll, benefits, and insurance policiesYoure an expert at zooming out and seeing the big picture, and also dont miss the tiny detailsYou know how to build teamsYoure data data driven and use a quantitative approach to guide-decision making and to define and track your KPIsYou understand people and you understand how to communicate with different personalities and communication stylesGreat organizational skills able to juggle competing deadlines and projectsYou love our mission and are hungry to support the people that drive it Details of Position This position reports to the Chief Operating Officer and is based out of our San Francisco headquarters in BayviewPaid relocation available as neededDomestic travel requiredFull-time exempt positionSalary and employee stock options commensurate with experienceCompetitive benefits package provided including health care, vacation days, and free produce! Physical Requirements Sedentary work; predominantly involves sitting most of the time.Standing desks and / or other ergonomic accommodation is available upon requestWalking, climbing stairs, and standing are required only occasionallyRegular work with computers, including keyboards, mouses, and screens; regular use of mobile devices, including smartphones and tablets also requiredIndividuals seeking employment at Imperfect Produce are considered without regard to race, color, religion, national origin, age, gender, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation."}