{"jobID": "2823084120", "jobLocation": "Midland_MI", "jobTitle": "Surgical Technologist II", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "17", "jobDescription": " Position Information  FTE: 1.000000  Exempt: No  Day Shift: Hours per schedule  Weekend & Holiday Rotation: Per schedule  Pay Grade: 9  Position Summary  This individual fills the role of surgical technologist II in the Operating Room. Surgical Technologist II understands and demonstrates the knowledge of surgical procedures. Assure all supplies and equipment are available for the procedure and in working condition. Confirm and/or assemble sterile instruments for use correctly. Anticipate the needs of the surgeon. They assist in keeping accurate account of medications, sharps, instruments, and sponges. They are responsible for maintaining and monitoring the sterile field.  Responsibilities  (30%) Demonstrates knowledge of surgical procedures and ability to problem solve in relation to the procedure being performed. Verifies items on the physician preference card. Accountable for supplies so that accurate patient charges are billed.  (30%) Demonstrates proper use of equipment, assembling of equipment, disposables as well as cleaning and sterilizing. Assures all equipment, supplies and instruments are assembled correctly and in working condition for the surgical procedure.  (30%) Maintains the sterile environments. Monitors the sterile field and recognizes breaks in technique  (10%) Sets up sterile field with instruments in a timely manner. Keeps accurate account of all medications, sponges, instruments and sharps on the sterile fields per policy.  Qualifications  * High School Diploma or GED Associate's degree in Surgical Technology preferred.Basic Life SupportCert Surgical TechnologistCST certification by the Association of Surgical Technologist completed within two years of hire date and maintained or the date of signature of job description. Initial certification as a Certified Surgical Technologist (CST) is based upon satisfactory performance on the national certifying examination following completion of an accredited program in surgical technology.OTHER DUTIES AND RESPONSIBILITIES Demonstrates a positive, courteous and helpful attitude toward patient, visitors, physicians, and co-workers.  Develops and maintains good working rapport with interdisciplinary personnel to meet the needs of each patient.  Remains calm and efficient when working in stressful situations.  Shares information and reports significant changes and/or abnormal findings to appropriate team members.  Participates in regulatory surveys.  Participates in performance improvement activities.  Assists with orientation and ongoing competencies.  Attends and participates in professional association activities and programs to assure being current on regulations, guidelines, and professional standards of care.  Remains current on new developments by reading professional journals, and attending seminars.  Other duties as assigned.  Fulfills on-call responsibilities and extra shift coverage as needed.  Provides for age specific needs of the population served according to department standards and policies/procedures as evidenced by observation documentation and peer feedback for the following:  Infant - Birth-1 year  Toddler - 1-4 years  Child - 5-12 years  Adolescent - 13-17 years  Adult - 18-64 years  Later Adult - 65 years and older REQUIRED EXPERIENCE, TRAINING AND SKILLS Surgical Technologist II is a certified surgical technologist who has been employed for more than one year or more and takes on greater responsibility in providing patient care. These practitioners demonstrate problem solving skills along with higher level of critical thinking skills may start to do some precepting in a certain specialty. If career ladder implemented at medical center, Surgical Technologist II must complete skills/practice defined for a Surgical Technologist II as stated in the career ladder.  Operating Room Competency checklist must be maintained.  Manual dexterity and mechanical skills needed to properly use and hold surgical instruments.  Interpersonal skills needed to communicate successfully with individuals and groups and interact with people at all levels to communicate ideas and concepts in a clear and understandable manner.  MidMichigan Health is a technology driven organization and employees need to demonstrate competency in Microsoft® Windows. An employee may be required to participate in further learning opportunities offered by MidMichigan Health. PREFERRED EXPERIENCE, TRAINING AND SKILLS One year experience as a surgical technologist.  Physical/Mental Requirements and Working Conditions  Exposure to stressful situations, including those involving public contact, as well as, trauma, grief and death.  Able to wear personal protective equipment that includes latex materials or appropriate substitute if required for your position.  Is able to move freely about the unit and hospital.  Overall vision is necessary; including reading, depth perception, close-up work and must have a peripheral field of vision.  Hearing and speech on the phone as well as in person are necessary.  Must be able to communicate verbally in person, on the phone and in writing.  Frequently required to sit/stand/walk for long periods of time.  Some exposure to blood borne pathogens and other potentially infectious material.  Ability to handle multiple tasks, get along with others, work independently, regular and predictable attendance and ability to stay awake  Is frequently required to physically aide patients, including lifting.  Must be able to lift minimum of 50 lbs.  Overall dexterity is required including handling, reaching, grasping, fingering, and feeling.  Must follow MidMichigan Health bloodborne pathogen and TB testing as required.Apply!"}