{"jobID": "2750087128", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Engineer, Content Data Engineering", "companyRating": "3.8", "companyInfo": {"Website": "www.netflix.com", "Headquarters": "Los Gatos, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (NFLX) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "219000", "jobDescription": "Senior Data Engineer, Content Data Engineering Los Angeles, CaliforniaData Engineering and InfrastructureWho are we? Netflix is the world's leading internet streaming service with over 100 million members in 190 countries. Our members enjoy more than 125 million hours of streamed video per day, using over 1000 different types of devices, generating more than a third of downstream Internet traffic in North America. The Content Data Engineering team is based in the entertainment capital of the world, focused on providing our colleagues rich data so that we can make decisions on what series and films will bring the most joy to our subscribers. We are part of a larger team that supports Netflix’s data-driven culture across marketing, streaming, product, and finance functions. As Netflix deepens its global reach and develops more and more amazing Originals content, the scope and impact of our team’s work in the content space is exploding.Who are you? You are lazy in a productive way (find tedious work boring and would rather automate it).You are charismatic, tenacious, curious, and industrious, and not just talented.You thrive in a fast paced environment, and see yourself as a partner with the business with the shared goal of moving the business forward.You have strong beliefs that are weakly held: you can argue, and hear, all sides of a debate and adapt to new perspectives that emerge from it.You create code that is understandable, simple, and clean, and take pride in its beauty.You love freedom and hate being micromanaged. Given context, you're capable of self-direction.You have a high tolerance for ambiguity and fast-changing contexts.You are motivated to explore new technologies and learn, and can do so without taking formal education.What will you do? Fully own critical portions of Netflix' Content data model. Collaborate with stakeholders to understand needs, model tables using data warehouse best practices, and develop data pipelines to ensure the timely delivery of high quality data.Continually acquire new data sources to develop an increasingly rich dataset that characterizes content. This dataset will be the foundation for many strategic uses cases from multiple teams.Creatively explore how to use data to continually add value to Netflix. Translate data questions into flexible methodologies that scale to answer broad problems across the organization.Be a bridge between data engineering and the business, enabling insight that can empower better decision-making.Be comfortable outside of your comfort zone - explore new tech, make your own tool, or find a new way to address an old problem.What do you know? (not a rigid litmus test) Data warehouse data modeling and data transformation.How to write complex SQL in your sleep.\"Big Data\" tech - Hadoop, Spark, Pig, Hive, etc. Significant experience with other ETL tech (Informatica, SSIS, etc) is very valuable, but expect to work in a \"Big Data\" environment.MPP data warehouse solutions (Redshift, Vertica, Teradata, Greenplum, etc).Python for scripting and automation.Education: Surprise us.A few more things to know: Netflix offers amazing co-workers, new technology, fascinating analytical and technical challenges, and a Freedom & Responsibility Culture that's truly unique. It’s worth learning more: http://jobs.netflix.com/culture"}