{"jobID": "2820098123", "jobLocation": "Washington_DC", "jobTitle": "Transportation Planner II/Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.mwcog.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1957", "Type": " Nonprofit Organization", "Industry": " Government", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Summary:The Council of Governments' Department of Transportation Planning is seeking a Transportation Planner for the Planning Data and Research Team. The candidate will perform mid-level professional planning activities related to the development and analysis of regional transportation plans and other planning products for the National Capital Region Transportation Planning Board (TPB). The work is performed under the general supervision of a higher-level Planner or Program Manager in accordance with procedures and policies established by the Department Director. The TPB, which is staffed by the Metropolitan Washington Council of Governments (MWCOG), is the federally mandated metropolitan planning organization (MPO) for the Washington, D.C. region.Job ID/Number:DTP-1705Posted Date:6/1/2018Job Location:WASHINGTON, DCPosition Type:Full-timeDivision:Department of Transportation PlanningDescription:The successful candidate for this position will play a key role in the collection, processing, analysis, and visualization of travel survey, travel volume trend, demographic, and transportation infrastructure data used in regional policy studies, forecasting, and performance based planning and programming. EXAMPLES OF WORKThe processing and analysis of travel survey, traffic, and transportation infrastructure data (e.g., bridge and pavement conditions);the application of quality assurance and quality control measures to these data; the synthesis of land use and demographic data to inform regional forecasting; the display of these data using Geographic Information System (GIS) software;the development of improved methods to more reliably measure and report on year-to-year changes in regional travel trends;and the writing and presentation of technical reports and policy-orientedSUPERVISORY RESPONSIBILITIES No direct staff supervisory responsibilities but may be involved in supervising interns. Such responsibilities may include interviewing, hiring, and training interns; planning, assigning, and directing work; appraising performance; rewarding and disciplining; addressing complaints and resolving problems. REQUIRED KNOWLEDGE, SKILLS, AND ABILITIES The ideal candidate will possess excellent communication skills and demonstrated skill in critical thinking, judgment, and data analysis. This candidate will also have a strong academic background in statistical analysis, land use and transportation planning, and research methods. Experience with computer software packages used for database development, statistical analysis, and reporting (specifically SAS) is required as is experience with GIS software (ArcGIS). Knowledge of the use of survey and other data in regional transportation planning activities is also highly desirable. EDUCATION AND EXPERIENCE This position requires possession of a bachelor's degree in statistics, urban or regional planning, transportation planning, or an appropriately related field (Master’s degree preferred), and 0-3 years of directly applicable work experience. Any equivalent combination of experience and training which provides the required knowledge, analytical and writing skills and abilities will be considered. COMPUTER KNOWLEDGE AND SKILLS Experience with Microsoft Office programs (Word, Excel, PowerPoint), ArcGIS, Adobe Creative Suite (Illustrator, InDesign, Photoshop), Microsoft Access or other database software. COMMUNICATION SKILLS Ability to read, analyze, and interpret common scientific and technical journals, financial reports, and legal documents. Ability to respond to common inquiries or complaints from members, regulatory agencies, community leaders and citizens. Ability to effectively present information to top management, public groups, and/or boards of directors. MATHEMATICAL SKILLS Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals. Ability to compute percentages, rates, and ratios and to draw and interpret numeric charts and graphs. REASONING ABILITY Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of instructions furnished in written, oral, diagram, or schedule form and deal with a variety of abstract and concrete variables in situations where only limited standardization may exist. CERTIFICATES, LICENSES, REGISTRATIONS No Requirements PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee is regularly required to talk and hear. The employee frequently is required to stand; sit; and use hands to finger, handle, or feel. The employee is occasionally required to walk; reach with hands and arms; and stoop, kneel, crouch, or crawl. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus. Starting Salary $55,561 - $80,731EEO EMPLOYER To apply for this position, please submit your cover letter, salary history, and resume to:  The Metropolitan Washington Council of Governments  777 North Capitol Street, NE  Suite 300 - Attention: OHRM  Washington, DC 20002-4239  Or visit our website at: www.mwcog.org  Fax: 202-962-3715"}