{"jobID": "2794315225", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Platform Engineer", "companyRating": null, "companyInfo": {"Website": "www.harrison-clarke.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Harrison Clarke has teamed up with a EdTech company based in Oakland who are searching for an experienced Software Engineer. This is a great opportunity to make a real difference to help people’s lives as you can be a part of facilitating learning and improving an individual’s performance.The company in question have received numerous rounds of funding and are backed by some notable Venture Capitalists.The team are in search of an individual to join the Platform Team who has a background focused on Software Engineering with a passion for writing code. ResponsibilitiesImprove reliability, performance, scalability and all other parts of an infrastructureHave strong, hands on experience building resilient, scalable architecture and troubleshooting various back-end challengesRequirements8+ years software development Experience working with cloud platformsExcellent written communication, problem solvingDesire to work in a fast paced, evolving, growing, dynamic environmentTechnologyStrong scripting experience in one of (Python, Go, PHP, Ruby or Bash)Configuration management experience in (Chef, Puppet or Ansible)Significant experience with Unix or LinuxExperience with continuous integration tools (Jenkins)Experience with Cloud Computing platforms (Amazon Web Services, Google Cloud or Microsoft Azure)Experience with containers such as Kubernetes will also be a big plusIncentivesGreat benefits including but not limited to 401KPTOCompetitive salaryEquityNo Visa sponsorship available for this position.By applying and submitting your resume, contact details and any other personal information, we will process your personal data in accordance with our Privacy Policy. For more information on our Privacy Policy, please click here: https://www.harrison-clarke.com/privacy-policy/"}