{"jobID": "2779793681", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.heartflow.com", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": " HeartFlow is a Software as a Service (SaaS) medical device company that is revolutionizing the treatment of coronary artery disease. Come and join our Data team to build a scalable and robust platform to extract value out of our data.  As a Senior Data Engineer you will bring software engineering expertise in expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross-functional teams. You will support our software engineers, process engineers, data analysts and data scientists on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects.  This is a fulltime position with salary, benefits, and pre-IPO stock options. This position will work from our Redwood City, CA offices. Job Responsibilities: Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL, NoSQL and AWS ‘big data’ technologies.Create and maintain optimal data pipeline architecture and data lakes.Assemble large, complex data sets that meet functional / non-functional business requirements.Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics.Work with all stakeholders to assist with data-related technical issues and support their data infrastructure needs.Create data tools for analytics and data scientist team members to assist them in building and optimizing our product.Skills Needed: Experience with AWS cloud services: EC2, EMR, RDS, Lambda, RedshiftExperience with NoSQL databases, such as HBase, Cassandra, MongoDB, or DynamoDBExperience with relational SQL databases such as MySQL, or PostgresExperience with various messaging systems, such as AWS SQS, AWS Kinesis, Kafka, or RabbitMQExperience with big data tools and stream-processing systems: Hadoop, Spark, Storm, Spark-StreamingExperience with data pipeline and workflow management tools: Azkaban, Luigi, Airflow, etc.Experience with Python.Experience building,optimizing and maintaining ‘big data’ data pipelines, architectures, data sets, data lakes, etc.Strong analytic skills related to working with unstructured datasets.Build processes supporting data transformation, data structures, metadata, dependency and workload management.A successful history of manipulating, processing and extracting value from large disconnected datasetsThe following skills are preferred, but not required: The following skills are preferred, but not required: Experience with Elasticsearch and ELK pipelineExperience building dashboards using Kibana or GrafanaEducational Requirements & Work Experience:5+ years of experience in a Software Engineering or Data Engineering role,Master’s degree in Computer Science, Statistics, Informatics, Information Systems or equivalent experience About HeartFlow, Inc.  HeartFlow, Inc. is a medical technology company redefining the way heart disease is diagnosed and treated. Our non-invasive HeartFlow FFRct Analysis leverages deep learning to create a personalized 3D model of the heart. By using this model, clinicians can better evaluate the impact a blockage has on blood flow and determine the best treatment for patients. Our technology is reflective of our Silicon Valley roots and incorporates decades of scientific evidence with the latest advances in artificial intelligence. The HeartFlow FFRct Analysis is commercially available in the United States, Canada, Europe and Japan. For more information, visit www.heartflow.com.  HeartFlow, Inc. is an Equal Opportunity Employer. This company does not and will not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.  Positions posted for HeartFlow are not intended for or open to third party recruiters / agencies. Submission of any unsolicited resumes for these positions will be considered to be free referrals."}