{"jobID": "2651078209", "jobLocation": "Burbank_CA", "jobTitle": "Senior Video Data Engineer (VDE)", "companyRating": "3.6", "companyInfo": {"Website": "www.cbs.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": " Senior Video Data Engineer (VDE) REF#: 30269 CBS BUSINESS UNIT: CBS Interactive  JOB TYPE: Full-Time Staff JOB SCHEDULE: JOB LOCATION: Burbank, CA ABOUT US: CBS Interactive is the premier online content network for information and online operations of CBS Corporation as well as some of the top native digital brands in the entertainment industry. Our brands dive deep into the things people care about across entertainment, technology, news, games, business and sports. With over 1 billion users visiting our properties every quarter, we are a global top 10 web property and one of the largest premium content networks online.  Check us out on [1] The Muse, [2] Instagram and [3] YouTube for an inside look into 'Life At CBSi' through employee testimonials, office photos and company updates.  References  Visible links https://www.themuse.com/companies/cbsinteractivehttps://www.instagram.com/cbsinteractive/?hl=enhttps://www.youtube.com/channel/UCAvGapyifCtUlmNTagAl_sQDESCRIPTION:Division Overview: The Video Technology team develops industry leading online and mobile video delivery systems  and IP for CBS.com, CBSSports.com, CBS News, CNET, GameSpot.com, and the entire suite  of CBS Interactive sites. Our team is responsible for the delivery of premium content to millions  of people every day. We set company-wide video standards and help internal business units  integrate the video delivery stack into their specific online products. Additionally, the team  serves as the company's information resource on current and future trends in digital video. This  is a great opportunity for someone who is interested in doing high-visibility, mission-critical work.  The Video Delivery, Experience & Optimization group is a new team working within the Central  Video Tech team that is focused on using a data-driven approach to understanding, improving  and monitoring the end-user video experience. The group will work across the video  ecosystem/stack to allow data to drive decisions and actions made in Encoding, Players,  Content Delivery Networks(CDNs), and many other areas. Exposing these valuable insights to  all businesses at CBSi will allow them to provide the best experiences for their users and assist  in maximizing user engagement and revenues. Role Details: You'll be an integral part of the Video Delivery, Experience & Optimization team, working on  building new pipelines/workflows for collection, processing of data from internal and external  services. You will be involved with the Central Video Tech team to discover actionable insights  and monitor the impact of experiments and changes made across the Video ecosystem. The  ideal candidate will be very familiar with the current state of data engineering/processing and  data warehouse/data lake systems operating in modern Cloud environments. Your Day-to-Day: Design and implementation of Data Warehouse/Data Lake systems  Configuration of systems to collect/import logs, metrics and other data points from disparate  internal and external data sources into a centralized system.  Working with members of the Central Video Tech team and businesses across CBSi to  understand and collect available data sources as they relate to end-user Video Experience  Setup of systems for creation of real-time dashboards and recurring reports  Work with other internal teams and external vendors to ensure that all of the required beacons  and data are being collected from front-end clients and back-end services/systems to produce  the required reports. Key Projects:Setup of a new data warehouse and configure import of data from a number of sourcesAssist in build reports and dashboard of critical video experience metrics for key businessesthat can be distributed on a regular basisConfigure alerting systems to help understand anomalies, outages and performance issues invideo operations across CBSiQUALIFICATIONS:What you bring to the team:You have:5 years proven experience developing data processing workflows/systemsFamiliarity with Big Data tools/products from Google Cloud and/or Amazon Web Services.This may include Google BigQuery, Data Lab, Data Studio, AWS Kinesis & RedShiftExperience with transformation of log data and other data formats into metrics that can beused in real-time dashboardsSQL skills and experience with developing complex queries across a number of data differentsetsExperience with business intelligence and reporting tools and workflows to build reports anddashboardsExperience with technical writing and design documentationBachelor's Degree in Computer Science or EquivalentYou might also have :Experience with setup/configuration of Artificial Intelligence/Machine Learning approaches toprocessing data.Knowledge of Content Delivery Networks (CDNs) and Multi-CDN deliveryExperience working with Video Quality of Experience Measurement vendors such asConviva, Nice People at Work or MuxExperience with Audience/User Tracking and metrics including Adobe Omniture, GoogleAnalytics, comScore and NielsenEEO STATEMENT: Equal Opportunity Employer Minorities/Women/Veterans/DisabledSDL2017"}