{"jobID": "2837071629", "jobLocation": "El_Paso_TX", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.ideapublicschools.org", "Headquarters": "Weslaco, TX", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " School / School District", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Data Analyst: Research and Analysis Location: Upper Valley Role Mission: The mission for the Research and Analysis Research Data Analyst is to support all organization stakeholders with the highest quality, timely, and actionable information to meet all organization goals. Accountabilities:1. IDEA Public Schools Meets the College Career and Military Readiness Accountabilities in both Texas and Louisiana * Work on ad-hoc internal and external school and student impact projects throughout the school year. MOY PTG – IDEA Public Schools is projected to be on track to meet CCMR in both Texas and Louisiana * Partner with state accountability expert to analyze district, region, campus, other CMOs, and neighboring districts to give recommendations throughout the school year to meet the College Career and Military Readiness Domain. EOY PTG – IDEA Public Schools meets the CCMR Domain in accountability both in Texas and Louisiana2. 100% of assigned ad hoc research and evaluation requests are completed and approved by the Managing Director of Research and Analysis * Work with Executive and VP stakeholders to determine the best way to answer the requested deliverable MOY PTG – 90% of stakeholders rate the partnership with R&A; as productiveEOY PTG – 90% of stakeholders rate the partnership with R&A; as productive3. 100% of R&A; managed surveys are designed and executed on time * Partner with AST lead team members and designees to ensure survey questions address the proper questions  * 100% of analytics are available 24 hours after the survey closes 4. By the end of SY '18-19, 100% of advancement team and Grant'ED Team requests from PowerSchool or student achievement systems are fulfilled by the Data Analyst. * All student achievement data is obtained from the SD Data Warehouse  * All Power School information is accessed by the Data Analyst with support from the PEIMS Team Attend PowerSchool UniversityMOY PTG – 100% of data requests from Powerschool are pulled by the Data Analyst and verified by the SIS teamEOY PTG – 100% of data requests are pulled by the Data Analyst5. Live values of IDEA * Believes and is committed to our mission: that all students are capable of getting to and through college  * Is driven by outcomes and results, and wants to be held accountable for them  * Has a propensity for action, willing to make mistakes by doing in order to learn and improve quickly  * Thrives in an entrepreneurial, high-growth environment; is comfortable with ambiguity and change  * Seeks and responds well to feedback, which is shared often and freely across all levels of the organization Competencies: - Possess the core characteristics required of every Research and Analysis team member – mission‐driven, innovative, disciplined thinker, collaborative, and personally responsible  - Passion for problem solving, data analysis, and data systems  - Strong communication and decision‐making skills  - Ability to collaborate effectively with various stakeholders, including executives, school leaders, teachers, vendors, and external entities  - Ability to manage multiple critical deadlines and adapt in a fast‐paced environment  - Experience with project management preferred  - Experience in education/nonprofit field is a plus Qualifications: * Education: Bachelor’s degree required, with a degree in computer science, economics, engineering, or mathematics  * Experience: One to three years of experience required, analyst position preferred  * Licenses or Certifications (if applicable): None required Knowledge and Skills: - Advanced knowledge of and in-depth ability to create data visualizations using multiple commercial toolsets and scripting languages.  - Knowledge of and ability to write queries using Structured Query Language (SQL)  - Knowledge of common database, spreadsheet, word processing, and Student Information System (SIS) programs.  - Advanced knowledge of statistical software (Stata, SPSS, R, etc.)  - Ability to translate end-user functional needs strategically into clear problem definitions and solutions that would meet the needs of varied end-user groups.  - Ability to validate data visualization accuracy and refine tools based on feedback to increase usefulness to end users.  - Ability to write clear, accurate, and concise reports, documentation, user instructions, correspondence, and other written materials.  - Ability to contribute to the efficiency and effectiveness of the department’s service to organization staff by offering suggestions and directing or participating as an active member of a project team.  - Ability to make effective verbal, written, analytical, technical, and persuasive presentations to individuals/large groups.  - Ability to maintain current knowledge of technology and new computer user applications.  - Ability to ascertain data content is accurate, correct, and verifiable to the greatest degree possible.  - Ability to work on teams with other coordinators, analysts, database administrators, and other organization personnel.  - Ability to learn and apply the policies, procedures, laws, and regulations pertaining to assigned programs and functions.  - Ability to plan and organize work to meet schedules and deadlines.  - Ability to communicate clearly and concisely, both orally and in writing. Selection Process: After submitting your online application, IDEA will review your materials. Candidates with a track record of success who pass the initial application screening will be invited to a phone or video interview. Candidates who are successful with this second interview will move into final consideration by the hiring manager. Application Instructions: Please select \"Apply Now\" in the upper-left hand corner of this page. You will then be taking to the application portal entrance. After you create a new profile, you will be able to apply directly for this role. If you have already created a profile, you may simply login to begin your application. IDEA Public Schools does not discriminate on the basis of race, color, national origin, age, sex or disability, in admission or access to, or treatment of employment in its programs and activities. Any person having inquiries concerning the organization's compliance with the regulations implementing Title VI of Civil Rights Act of 1964 (Title VI), Section 504 of the Rehabilitation Act of 1973 (Section 504), or Title II of the Americans with Disabilities Act of 1990 (ADA), may contact IDEA Human Resources at (956) 377-8000."}