{"jobID": "2787894778", "jobLocation": "Detroit_MI", "jobTitle": "System Supervisor I (System Operator)", "companyRating": "3.8", "companyInfo": {"Website": "www.dteenergy.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (DTE) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": "Job Summary:Direct and coordinate the operation of the electrical system, and ensures power system security by implementing real-time actions, independent of further approvals from leadership, to ensure the stable and reliable operation of the electrical system. This includes switching, protective tagging, and service restoration. Provide work direction and supervision to all personnel involved in the process of operating and maintaining the distribution system, including a periodic rotation of performing in the role of Dispatch Supervisor.During storm conditions, activate emergency assignments and assist with coordinating the storm operation.Make recommendations for scheduling work, managing workflow, setting goals, developing productivity measures and identify process improvements. Build customer loyalty by providing superior service and solutions to meet or exceed all process goals and the expectations of all internal and external customers. System Supervisor I and System Supervisor II are recognized as a Job Family Progression.Key Accountabilities:In normal or emergency conditions, take or direct those actions necessary to ensure the stable and reliable operation of the electric system at one of three primary positions in DTE SOC, (accountabilities include the interruption or restoration of service to customers). Primary system supervisor positions include 1) Distribution 2) Subtransmission and 3) Bulk Electric System Power Switcher (BPS).Maintain a certification at one or more primary certification positions after initial training period. (When operating at the BPS position, accountabilities also include independently interrupting firm load as necessary to maintain the reliability of the Bulk Electric System, and maintaining a valid NERC System Operator Certification).Periodic rotation of performing in the role of Dispatch Supervisor.Responsible for complying with all NERC cyber and reliability standards.Conduct network security studies to assess the impact of network and generation changes on system security.Interact with various internal, private and governmental organizations to develop procedures and coordinate the activities of a multi-skilled work force engaged in the restoration of customer service.Responsible for inspections, approvals and commissioning/decommissioning of all system equipment.Direct switching and protective tagging on equipment in power plants, interconnections, transmission and distribution stations/substations, industrial substations, primary customers, overhead and underground circuits.Monitor power system security and take action to maintain secure electrical networks at all voltage levels.Prevent and correct voltage and security violations by re-dispatching generation, controlling loads and other system resources.Develop, evaluate and implement strategy to restore internal or inter-company transmission/sub transmission/distribution paths in a safe manner, which also maintains service to as many customers as possible.Analyze requests for shutdowns and coordinate with requests from various work groups taking primary customer production schedules, equipment load ability, and costs into consideration.Coordinate various work groups to manage goals, measures, targets and budgets. Including setting work priorities for field groups and authorizing/requiring over-time with independent judgment.Administer union contracts and coordinate work rules and practices of the different local unions in the maintenance and operation of the electrical system.  - Must have a High School Diploma or equivalent, 4 years job-relevant operating experience and completion of a basic electricity courseORAssociate's degree in Electrical, Industrial, Technology or Computer Engineering or an equivalent discipline, 3 years of job-relevant operating experience and completion of a basic electricity coursePreferred: Bachelor's degree in a technical engineering discipline and 1 year of job-relevant operating experience. Note: Job-relevant operating experience would consist of operating engineer, electric control room operator, power plant operator, air traffic controller or similar operating experience with life critical operating tasks.Must complete a Certification Program for a primary DTE SOC System Supervisor position within the initial training period, including red tag qualification as a part of the certification program.Supervisory Profile Record test results will be considered in final selection.System Operator/Power Dispatcher test (\"Acceptable\" grade).Working knowledge of Corporate Policies/Procedures to include Absence and Pay practices."}