{"jobID": "2828434928", "jobLocation": "Pleasanton_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.accuratecorrosion.com", "Headquarters": "Glendale, AZ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Summary: The Data Processor/Analyst will turn data into information, information into insight and insight into business decisions.  Data processors spend the majority of their day inputting various data into computers. This data can originate on paper forms, or it could be electronic, such as email. The data processor will perform initial checks on the data contained in the form (spreadsheet, report, data sheet) to make sure it's complete and that required information isn't missing. Then enters this data into a system. Experience using the Microsoft Office suite is essential. Essential Duties and Responsibilities: Gathers, proofreads, and organizes information, which is entered in the company database.  Analyzes the information and examines the documents for accuracy. Errors are fixed or deleted first before being entered into the database.  Works with various data processing software programs including Microsoft Suite (Excel, Word, and Access).  Interprets data, analyze results using statistical techniques and provide ongoing reports  Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality  Acquire data from primary or secondary data sources and maintain databases/data systems  Identify, analyze, and interpret trends or patterns in complex data sets  Filter and clean data by reviewing computer reports, printouts, and performance indicators to locate and correct problems  Locate and define new process improvement opportunities  Office administrative tasks as needed for the office.  Other duties may be assigned Supervisory Responsibilities: This position does not have supervisory responsibilities. Education / Experience / Registrations: Two years of proven working experience as a data processor/analyst required  Technical experience regarding data models, database development, data mining and segmentation  Bachelors Degree in Engineering, Mathematics, Economics, Computer Science, Information Management or Statistics desired, but not required  Knowledge of the Corrosion, Cathodic Protection, Pipeline, or Utility industries desired, but not required  Valid driver's license with no prior DUI within 5yrs, acceptable driving record, and evidence of insurability for travel purposes  Upon employment, this position is subject to random drug testing in compliance with federal, state and company guidelines Knowledge/ Skills /Abilities: Proficient in and working experience with Microsoft Office Suite  Must possess strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy  Adept at queries, report writing and presenting findings  Exceptional computer skills and be very familiar with software programs  Ability to focus practically on working with computer programs and database input  Ability to understand instructions quickly and master the required software  Motivated and comfortable with repetition  Attention to detail is a very important trait because data processors typically enter a huge amount of data Physical Demands & Work Environment: Approximately 95% of the work may be performed in an office environment. While performing the duties of this job, the employee is regularly required to use hands to finger, handle, or feel and talk or hear. The employee frequently is required to stand, walk, and sit. The employee must frequently lift and/or move up to 25 pounds unassisted. Specific vision abilities required by this job include close vision, and ability to adjust focus.  The noise level in the work environment is usually moderate. Company Description Accurate Corrosion Control, Inc. ACCI is a full service Corrosion Control Mitigation Company specializing in providing corrosion control materials, construction and Cathodic Protection services working mainly in AZ and surrounding states as a cathodic protection utility contractor."}