{"jobID": "2361312330", "jobLocation": "San_Francisco_CA", "jobTitle": "Product Scientist", "companyRating": null, "companyInfo": {"Website": "www.medium.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Product ScientistAt Medium, we’re building a place for people to read, write, and react to stories that matter. Millions of people already use our platform, but to keep growing we always need to get smarter about learning from our data. This is the critical role that product scientists serve at Medium.What is “Product Science”?Depending on what company you talk to, a “data” group could mean many different things. At Medium, Product Science is the central team responsible for every step of translating data into insights that improve the product.Sound broad? It is! We build the data pipelines and infrastructure, create tools to query and visualize it, analyze experiments and trends, and develop algorithms that feed back into the product. We have one foot in engineering and the other in product development, which gives us the breadth to directly impact the product.While most of our work isn’t public, we can share a few examples of what we’ve been up to:Total Time Reading, a metric we designed and built internally to guide product decisionsCharted, an open-source tool for making quick chartsOptimal Post Length, an example of the kinds of questions product scientists help answerYou can find more examples in our Data Lab publicationThis focus on data is baked into Medium’s culture, and our thoughtfulness about analytics extends to the top of the company.What is the Product Scientist role?Broadly, product scientists focus on analysis — interpreting data, sharing insights, and developing models that improve the product. We work together to analyze patterns at a macro level, answering questions the rest of the company hasn’t thought to ask yet. On a day-to-day basis, you’ll spend half of your time with product teams: a group of engineers, designers, a product manager, and you, the product scientist, all working together in a small group to build new features. You’ll extract key data and findings, define metrics, evaluate A|B tests, identify opportunities based on the data, and share new insights no one considered before. You’ll be right there, brainstorming with the team, thinking ahead, ensuring we make the best data-informed decisions.The other half of your time will be spent with us, the Product Science team, enhancing our general analytics. You’ll keep us ahead of the needs for those product efforts, making sure we instrument the data correctly. You’ll also build tools and algorithms (like reading recommendations, or total time reading) to expand the team’s capabilities. And — always important — you’ll simply explore Medium’s rich dataset.What kind of people are hired for this role?We need the essentials: strong attention to detail, excellent written and oral communication skills to articulate insights, and great problem solving with thoughtful approaches. Product scientists should also have technical depth; data analysis experience (ideally with consumer web products) is necessary for this role. It’d be great if you understand the intuition behind the statistical methods used to evaluate AB-tests, pinpoint the underlying factors contributing to a metric’s growth and regularly use a few of these languages: SQL, JavaScript, Python and/or Scala (it’d be a bonus if you’ve hacked together a tool or interactive visualization yourself).We work from the Medium offices in San Francisco and we’d love to hear from you; please send us your resume here."}