{"jobID": "2836078067", "jobLocation": "San_Francisco_CA", "jobTitle": "Analytic Consultant 5 - Business Data Analyst (Wholesale Division)", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": "Job DescriptionAt Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you. Wells Fargos Chief Administrative Office (CAO) consists of enterprise functions that work together to promote and protect the Wells Fargo culture and brand, and support our team members. Groups within CAO work to protect our reputation, tell our story, bolster team member engagement, connect with our customers, and bring new and innovative solutions to life. CAO functions include Commitment to Customer, Corporate Responsibility & Community Relations, Data Management & Insights, Human Resources, Marketing, Stakeholder Relations, and the CAO Integration and Planning Office. The Wholesale Data Office team delivers trusted, reliable data which drives strategic decisions, enables business growth, and facilitates a strong risk discipline. We enable usage of common data that is complete, trusted, understood, and aligned with our financial reporting.  This position will be supporting our iHub service with the Business Data services team. Ihub is an authorized provision point which standardizes common foundational data and distributes to downstream applications and reporting services. KEY RESPONSIBILITIES INCLUDE:Support a number of iHub work streams tied to risk, regulatory and internal business line initiatives primarily focusing on loan and leasing dataPerform complex analysis of datasets, build data mapping, and conduct data validationInteract with business and technology partners across Wholesale such as Risk, Finance, Lines of Business, and Systems of Record ownersLocations: Charlotte, NC; Minneapolis, MN; San Francisco, CA; Phoenix, AZ; Dallas, TX .Other Wells Fargo locations may be considered.Required Qualifications8+ years of experience in one or a combination of the following: reporting, analytics, or modeling; or a Masters degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 5+ years of experience in one or a combination of the following: reporting, analytics, or modeling2+ years of SQL experienceDesired QualificationsExtensive knowledge and understanding of research and analysisStrong analytical skills with high attention to detail and accuracyExcellent verbal, written, and interpersonal communication skillsLeadership skills including the ability to influence effectively in a matrix environmentOther Desired QualificationsAbility to work and influence successfully within a matrix environment and build effective business partnerships with all levels of team membersKnowledge and understanding of data governance challenges and approaches: metadata, data quality, and data stewardshipTechno-functional skills with exposure to various banking productsAbility to manipulate data from non-normalized or disparate data sourcesClear understanding of data warehousing principles, dimensional data and data modelingExperience with requirement gathering and documentation; Ability to create and document complex business and functional requirementsExperience driving multiple complex data initiatives through the development, testing and implementation life cycle so will be able to successfully navigate the complex technical iHub environment and provide guidance to othersExperience with Oracle Financial Services Data Foundation(FSDF) implementationExperience with system or data mart integrationExperience with risk analysis and reportingKnowledge and understanding of wholesale banking: products, platforms, policies, processes, and proceduresStreet AddressAZ-PHX-Northwest Phoenix: 2222 W Rose Garden Ln - Phoenix, AZ MN-Minneapolis: 550 South 4th St - Minneapolis, MN MN-Minneapolis: 255 2nd Ave S - Minneapolis, MN NC-Charlotte: 401 S Tryon St - Charlotte, NC CA-SF-Financial District: 333 Market St - San Francisco, CA CA-SF-Financial District: 550 California St - San Francisco, CADisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}