{"jobID": "2811139310", "jobLocation": "Washington_DC", "jobTitle": "Jr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.tripointsolutions.com", "Headquarters": "Arlington, VA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Tripoint Solutions (TPS) is looking for a Jr. Data Analyst to join our Arlington, VA team. This individual needs to be a highly proactive individual that is seeking to gain experience within the government contracting industry. This Data Analyst will support one of TPS’s Department of Defense (DoD) clients. This individual will assist with analysis and validation of data originating from a student information system (SIS) as well as supporting the general project related tasks and assignments.  ***Position is located in Washington, D.C.*** Responsibilities and Duties Include:Data analysis and reporting using Excel and Access.Working with clients to elicit, refine, and document requirementsParticipating in client data calls, working with clients to determine reporting requirements, and writing technical documentation.Creating innovative solutions for client challenges. Verify data quality to ensure accurate analysis and reporting.Gathering requirements for reporting purposesStrong written and verbal communication on complex subject matters is a must.Documentation of processes and methodologiesPlanning, prioritizing and executing in a rapidly changing, fast-paced environmentExperience and Education Requirements:Strong background in Microsoft Excel and Microsoft Access. Experience in SQL query development and general database principles is a must.Excellent written and verbal skills. Able to rapidly respond to changing requirements and priorities.Bachelor's degree in CS, Statistics, Mathematics, Business Management / Administration or related field.Due to the nature of the work and contract requirements, US Citizenship is requiredMust have the ability to obtain a Government Security ClearanceExcellent interpersonal and organizational skillsStrong leadership, verbal, and written communication skillsAbility to adapt quickly to a rapidly changing dynamic environmentAbility to prioritize and multi-task across numerous work streamsDetail oriented with excellent follow throughAbility to deal with and resolve the ambiguityAbility to anticipate problems and take decisive action Tripoint Solutions (TPS) is a minority-owned, SBA-certified 8(a) small business specializing in business and IT consulting, delivering tailored solutions to our customers based on their unique organizational requirements, industry best practices, and a recognition of state of the art technologies. TPS focuses on software engineering, process improvement, and software development lifecycle support. We provide a broad range of Federal customers with solutions for enterprise, cloud-based, and mobile environments.  Tripoint Solutions is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer (M/F/D/V), making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.  All resumes are held in confidence. No recruiters or agencies without a previously signed contract. Only candidates whose profiles closely match requirements will be contacted during this search.  Tripoint Solutions participates in E-Verify."}