{"jobID": "2493222925", "jobLocation": "Palo_Alto_CA", "jobTitle": "Principal Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.noodle.ai", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "AI technology will reshape the way decisions are made in businesses around the world. We have an opportunity to shape that future... and we're looking for talented, passionate leaders in Data Science to join us. As a Principal Data Scientist at Noodle.ai, you will collaborate with our Client Services team, Engineering team, Design Technology team, and industry-specific experts from our client companies to build a deep understanding of our clients business context and then develop, test, and deploy advanced AI models. You will take on a leadership role in client engagements and product development providing vision and direction for the data science solution and managing a team of data scientists. There are many opportunities for Data Scientists What makes Noodle.ai unique?You can move the needle here. Were a nimble start-up where there is a true opportunity to make an impact on the company and unlike many startups, we have a leadership team whose experience and reputations have opened doors with Fortune 100 clients. Were already making an impact on the global stage. We have the tools (and data) to truly do interesting work in Data Science. Many companies say they do Data Science, but they dont really have the resources to back it up. At Noodle.ai, we have the computing power needed to support deep learning and ML, and we have access to interesting real-world data. Were tackling the problems that drive global business. We're applying ML and deep learning to tackle some of the most enduring challenges in business: pricing optimization, demand projection, logistic & supply chain optimization, manufacturing operations, and many many more. For example: How do you transform operations for a client in a 150-year-old energy-intensive industry to support their journey toward becoming a LEED-certified global leader in energy efficiency? How do you quantify the cognitive bias that has shaped past pricing decisions to support ongoing sales effort optimization? There is an exciting journey ahead, and were going to have fun along the way. Were kind of nerdy We geek out about new technology. We love music. Were into soccer. We dance through life (sometimes literally). Were foodies. Essentiallywe love noodling on new ideas and our love of learning extends beyond our fields of study. And we like to share that. About you:Your experience:8+ years of experience applying advanced AI techniques (machine learning, predictive analytics, optimization, semantic analysis, time-series analysis, advanced visualization) to real-world problems.You have a demonstrated ability to iteratively conceptualize, design and build data-driven analytical models, and have taken a project leadership role in shaping these solutions.Strong capabilities in modern analytics languages/tools.Balancing breadth, you also bring a particular depth in at least one of the following areas: Deep Learning, Optimization or Operations Research, NLP, Image Processing, or Machine Learning. Given the problems we are tackling, there is a place at Noodle for experts in various fields.You have an advanced degree in a relevant field (Computer Science, Operations Research, Statistics, Applied Math, Electrical Engineering, or other Computational Science)You have experience manipulating and preparing large, heterogeneous data sets (Big Data) to support advanced analytics.Your working style:Collaborative, open, and respectful working styleIntellectual curiosity and the hunger and humility to always keep learning and to share that learning. You enjoy mentoring other intellectually curious data scientists.Experience with (and excitement for) interdisciplinary collaborationDemonstrated energy and passion that extends beyond your field of study Are you a computer scientist who writes poetry? A mathematician who loves psychology? An engineer passionate about public policy? We want to build something with you.Want to help shape the future of Enterprise Artificial Intelligence?Lets noodle."}