{"jobID": "2769129458", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Seller", "companyRating": "4.1", "companyInfo": {"Website": "www.squareup.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Public (SQ) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": " Company DescriptionWe believe everyone should be able to participate and thrive in the economy. So we’re building tools that make commerce easier and more accessible to all. We started with a little white credit card reader but haven’t stopped there. Our new reader helps our sellers accept chip cards and NFC payments, and our Cash app lets people pay each other back instantly. We’re empowering the independent electrician to send invoices, setting up the favorite food truck with a delivery option, helping the ice cream shop pay its employees, and giving the burgeoning coffee chain capital for a second, third, and fourth location. Let’s shorten the distance between having an idea and making a living from it. We’re here to help sellers of all sizes start, run, and grow their business—and helping them grow their business is good business for everyone.Job DescriptionProduct Analysts at Square are embedded within product teams and leverage engineering, analytics, and machine learning to empower data-driven decision making in the full lifecycle of product development. As a member of the team, you will lead experimentation and growth initiatives, develop automation solutions to personalize product experiences, provide insights to our sellers about their business, and drive strategic decisions with data. Square’s mission is economic empowerment, and our team supports this by using data to understand and empathize with our customers, thereby enabling us to build a remarkable product experience. For more insight into what we do, check out this blog post https://medium.com/square-corner-blog/product-analytics-at-square-8796766a14e3 You will:Partner with product stakeholders to make data-driven decisions across the organization by leveraging descriptive and predictive analytics where it will have material impactApply a diverse set of tactics including statistics, quantitative reasoning, and machine learning, to solve problems as well as independently research and produce actionable insightsOwn, coordinate, and solve complex, cross-functional problems that extend beyond the traditional boundaries of product domains, analytics, and data scienceCommunicate analysis and decisions to high-level stakeholders and executives in verbal, visual, and written mediaLead the data strategy of embedded product engineering, influencing them to make well-informed architecture and design decisions that affect data at SquareProvide comprehensive day-to-day analytics support to partner teams, develop tools and resources to empower data access and self-service so your expertise can be leveraged where it is most impactfulLead and mentor others in Product Analytics on medium and long-term initiatives that span across product domains. QualificationsYou have:7+ years of analytics experience or equivalentExtremely strong written and verbal communication skills and ability to build strong relationships and influence with product partnersProven ability to lead cross-functional projects that depend on the contributions of others in a variety of disciplinesFluency with data, analytics and visualization technologies (We primarily use SQL, Looker, and Python)Experience in applying both data-backed heuristics and machine-learning techniques to solve practical product problems such as predicting churn, cross selling, clustering user archetypes, and moreFamiliarity with data warehouse design, development and best practices I'm interested"}