{"jobID": "2767881383", "jobLocation": "Bethesda_MD", "jobTitle": "NIH Chief Data Strategist and Director, Office of Data Science Strategy, DPCPSI, NIH", "companyRating": "4.1", "companyInfo": {"Website": "www.nih.gov", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1887", "Type": " Government", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " US Department of Health and Human Services, Centers for Disease Control and Prevention, FDA"}, "estimatedSalary": "181000", "jobDescription": " Vacancy Announcement  Chief Data Strategist and Director,  Office of Data Science Strategy  NIH Director  PositionThe National Institutes of Health (NIH) is seeking exceptional executive candidates for the newly established position of Chief Data Strategist (CDS). The CDS will report directly to the NIH Director; s/he will serve as the principal advisor to the NIH Director and other NIH leadership in the broad domain of the large-scale platforms and technology/tools ecosystems that facilitate data science. The CDS will also serve as the Director of the newly formed Office of Data Science Strategy in the Division of Program Coordination, Planning, and Strategic Initiatives, Office of the Director (DPCPSI), NIH. In complementing existing NIH expertise and investments in computational biology, bioinformatics, biostatistics, information science, medical informatics, and quantitative biology, the CDS will: 1) provide leadership for a broad range of initiatives and projects that align with NIH’s strategic plans; 2) catalyze the use of new platforms and methods to gain deeper insights from NIH’s vast data resources; and 3) help mature competencies and capabilities of the biomedical research workforce—amongst NIH as well as our greater research ecosystem—to capitalize on new large-scale biomedical data and analytic tools.Strategy & InnovationAs Director of the new Office of Data Science Strategy, the Chief Data Strategist will be responsible for supervising its staff and planning and managing use of its resources. In concert with, and as a member of, the trans-NIH Scientific Data Council (SDC), the CDS will play a seminal role orchestrating the development and implementation of cutting edge approaches and platforms for initiatives that support the vision expressed in the NIH’s Strategic Plan for Data Science. This leadership position must also develop the strategic planning processes (and an ongoing strategic plan) that keep NIH and its awardees at the forefront of biomedical data science and new data types that will scale up in the near future (omics, imaging, biosensing, consumer devices, etc.).Platform LeadershipThe Chief Data Strategist will lead the cross-NIH effort to deliver a next-generation technology platform that can accelerate scientific discovery and weave existing data science efforts into a highly innovative data ecosystem to maximize the utilization and extraction of knowledge from the data generated by, and relevant to, NIH research. This will entail engaging with exciting data intensive research programs such as the All of Us Program, BRAIN Initiative, Cancer Moonshot, and Opioid Initiative as well as the NIH intramural research program to promote the coordination and harmonization of data, methods, and technologies being sensitive to the unique programs and goals of the individual NIH Institutes and Centers. The incumbent should position NIH as a cutting-edge leader within the biomedical data science field and in advanced computing environments, ensuring that the NIH benefits from and contributes to effective and proper use of data for discovery, innovation, care and commerce.External & Internal AdvocacyThe Chief Data Strategist will serve as the NIH’s advocate and representative in national and global data strategy matters, including other Federal agencies, the Congress, industry, academic and scientific societies, the biomedical research community, international partners, the media, and the public. This will include extensive interactions with external advisors and stakeholders in the research community and experts in the private sector.Growing Workforce CompetencyThe Chief Data Strategist will be responsible for creating and implementing innovative new approaches to increase the capabilities and knowledge of NIH staff and researchers and the broader research community in data science and state-of-the-art technology platforms and tools. In collaboration with the Principal Deputy Director of NIH, the CDS will be responsible for guiding a new NIH Data and Technology Advancement (DATA) Fellowship to attract leading data scientists who are early in their career to tackle large-scale, data-intensive projects designed to overcome a current obstacle or create a new capability that will yield transformational changes to biomedical research.LocationBethesda, MD (NIH Main Campus)About NIHAs the world's largest medical research facility, NIH consists of 27 Institutes/ Centers, including the Clinical Center (an on-site research hospital), the Fogarty International Center, and the National Library of Medicine. NIH's national program of health research and research training is currently funded at more than $29 billion annually. NIH has over 18,000 employees. NIH supports the generation and analysis of substantial quantities of biomedical research data, including genomics, text and images. The Agency is also responsible for a myriad of disparate data sets emanating from fundamental research using model organisms (such as mice, fruit flies, and zebrafish), clinical trials including medical images and data extracted from electronic medical records), the ever-growing world’s literature on biomedical research.Qualifications RequiredThe Chief Data Strategist will be a recognized leader who is able to perform the duties and responsibilities of this position within the framework of agency policies, mission, objectives, and resources. S/he is required to have expert knowledge of scientific data management and analysis, in addition to established abilities to negotiate complex and sensitive data-management issues, to formulate policies, and to present and defend polices, programs, and activities. Successful candidates will have extensive experience in data science platforms and data management disciplines and demonstrated success in full life cycle development processes from planning to delivery and management of enterprise-level data and service platforms and solutions – i.e., a proven track record of delivering large-scale data science platforms and services. Outstanding executive leadership skills and the ability to maintain excellent working relationships with all stakeholders are required. Must have excellent communication and speaking skills appropriate for diverse audiences and ability to work across diverse groups and develop solutions to challenges in a highly partnered and matrixed environment. Strong program management and relationship building skills are essential to deliver multiple, interdependent initiatives that span many stakeholders.  It is envisioned that s/he will have sufficient knowledge to secure the key expertise that NIH requires to develop the data ecosystem required to accelerate discovery. Candidates with industry experience are welcome. Women and members of underrepresented groups are particularly encouraged to apply.Summary of Key Requirements Demonstrated success in inventing, developing, and/or deploying advanced data platforms, systems, and tools that come from—or could be applied to—biomedical researchDeep expertise on “Big Data” technologies, systems, and trends, including cloud-based computing, Platform as a Service (PaaS) and Software as a Service (SaaS) architectures, distributed analytics, privacy-enhancing technologies, etc.Ability to carefully identify and prioritize information/reporting/analysis needs and translate/summarize key findings to provide strategy recommendations.Ability to apply advanced analytics to help NIH gain insights into patterns, trends, and other metrics, to accomplish NIH’s biomedical objectives and goals.Ability to expertly negotiate complex and sensitive data-management issues, formulate policies, and to present and defend polices, programs, and activities.Outstanding ability to execute complex plans and programs, meeting interim milestones and long-term objectives.Ability to build consensus among complex groups of stakeholders.Ability to handle confidential information with the upmost care and integrity.Demonstrated success in leading a diverse team of experts, managing multiple deadlines, providing exceptional customer service and interpersonal skills.Excellent communication skills appropriate for diverse audiences and the ability to maintain excellent working relationships with all stakeholders.Exceptional preparation for this complex position, based on a combination of education and demonstrated experience in engineering/computer science. Salary/BenefitsThe CDS will be appointed at a salary commensurate with his/her qualifications. Full Federal benefits will be provided, including leave, health and life insurance, long-term care insurance, retirement, and savings plan (401k equivalent).How to ApplyApplicants must submit either a current resume or curriculum vitae. In addition, it is optional for applicants to prepare two statements, a vision statement and a statement that addresses the specific qualification requirements (please limit both statements to 2 pages each). Completed application packages must be submitted to: Brenda Fogel atSeniorRe@od.Nih.gov (301-451-7338). All information provided by applicants will remain confidential and will be reviewed only by authorized officials of NIH.  Information about the National Institutes of Health is located at its website.Foreign EducationApplicants who have completed part or all of their education outside of the U.S. must have their foreign education evaluated by an accredited organization to ensure that the foreign education is equivalent to education received in accredited educational institutions in the U.S. We will only accept the completed foreign education evaluation. For more information on Foreign Education verification, visit the National Association of Credential Evaluation Services (NACES) website. Verification must be received prior to the effective date of the appointment. The NIH encourages the application and nomination of qualified women, minorities, and individuals with disabilities.Standards of Conduct/Financial DisclosureThe National Institutes of Health inspires public confidence in our science by maintaining high ethical principles. NIH employees are subject to Federal government-wide regulations and statutes as well as agency-specific regulations described at the NIHEthics website . We encourage you to review this information. The position requires the incumbent to complete a public financial disclosure report prior to the effective date of the appointment.Equal Opportunity EmploymentSelection for this position will be based solely on merit, with no discrimination for non-merit reasons such as race, color, religion, gender, sexual orientation, national origin, political affiliation, marital status, disability, age, or membership or non-membership in an employee organization.Reasonable AccommodationNIH provides reasonable accommodations to applicants with disabilities. If you require reasonable accommodation during any part of the application and hiring process, please notify us. The decision on granting reasonable accommodation will be made on a case-by-case basis. Applications will be reviewed starting July 9, 2018 and will be accepted until the position is filled.DHHS and NIH ARE EQUAL OPPORTUNITY EMPLOYERS"}