{"jobID": "2810838128", "jobLocation": "McLean_VA", "jobTitle": "Sr. Big Data Engineer –", "companyRating": "4.3", "companyInfo": {"Website": "www.gcitsolutions.com", "Headquarters": "Milford, CT", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": "Title Sr. Big Data EngineerSalary DOELocation McLean, VAJob Information The Senior Software Engineer will lead a software engineering team that is responsible for leveraging the content and capabilities of our growing Hadoop based platform to address unmet business needs.  This is a hands-on position that leverages Web and Big Data technologies in our Cloud-based architectures as well as in-house datacenters.  The Senior Software Engineer provides engineering leadership for one or more concurrent software development projects executed by small software development teams (about 5-10 people), from the conception of the project up to the deployment of the solutions.  The key activities for this position include: - Lead a team of software engineers. - Develop self-contained micro-analytics on a Hadoop based platform.  - Develop product features and fixes following an Agile methodology.  - Participate on bi-weekly sprint planning meetings, daily scrum meetings, and bi-weekly sprint close up meetings.  Required experience:  - Minimum of 3 years of professional software engineering experience developing enterprise grade applications that take advantage of Big Data related technologies.  - Minimum of 3 years of professional software engineering experience architecting and developing cloud based solutions. - Minimum of 3 years leading a team of software engineers. - Proficiency in LINUX, UNIX and Windows operating systems and related scripting languages – Ruby, Python, Shell scripting.  - Proficiency in Agile, phased delivery and evolutionary prototyping software development processes and related tools – Jira, git.  - Proficiency in Java Web Development and related tools – Eclipse/IntelliJ IDEA, Maven, JBoss Application Server, Apache Web Server.  - Familiarity with database design and basic proficiency in T-SQL or PL/SQL or MySQL - Proficiency with implementing software solutions that leverage cloud services – like AWS, S3, EC2, Puppet, Cloud Formation, SWF, etc.- Proficiency with modern technologies related to Big Data processing (Hadoop, HIVE, Accumulo, Zookeeper, Lucene, Scoop, etc.). - Demonstrated ability to clearly communicate technical and non-technical information verbally and in writing.  - Demonstrated ability to work with a diverse group of professionals globally.  - Demonstrated ability to balance multiple competing projects and needs.Apply Here"}