{"jobID": "2837798608", "jobLocation": "Austin_TX", "jobTitle": "Engineering Scientist Associate", "companyRating": null, "companyInfo": {"Website": "www.utexas.edu", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1883", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Engineering Scientist Associate Hiring department TACC Monthly salary $4,583+ depending on qualifications Hours per week 40.00 Standard from 800AM to 500PM Posting number 18-06-14-02-4205 Job Status Open FLSA status Exempt Earliest Start Date Immediately Position Duration Funding expected to continue Position open to all applicants Location Austin - J. J. Pickle Research Campus (North Austin) Number of vacancies 1 General NotesNone provided  Required Application Materials A Resume is required in order to apply A Letter of Interest is required in order to apply. A List of 3 References is required in order to apply. Additional Information PurposeThis position joins the Data Management and Collections group at the Texas Advanced Computing Center (TACC) of the University of Texas at Austin (UT). Position is responsible for deploying and providing operational support for digital repository services for research data at TACC.Essential FunctionsSupport UT research activities utilizing large-scale data repositories hosted at TACC, through the development and deployment of a variety of software and hardware technologies. Coordinate with project partners at various institutions throughout the United States. Oversee daily operation of a suite of systems and software providing data storage and access services to hundreds or thousands of geographically distributed users. Work with project management and coordination staff to identify goals, construct timelines for completion of important tasks, and accomplish designated tasks in a timely fashion. Work with user support staff to identify and resolve technical problems with the system. Assist research groups and individuals in deploying applications for managing, sharing, and preserving data, making use of TACC data resources. Assist training and documentation staff to develop written documentation and other educational materials. Work with other staff members, users or user representatives to identify needed tools and providing initial implementations of scripts or other automated mechanisms to simplify administration and use of data repositories.Marginal/Incidental functionsOther related functions as assigned.Required qualificationsBachelor's degree in engineering, computer and information science or other applied sciences. Ability to operate and administer computing systems using diverse operating systems and software including Linux, Windows, and MacOS. Ability to develop simple applications or scripts using Unix shell, Ruby, Python or other scripting tools. Familiarity with structured and semi-structured data storage systems such as Postgres, MySQL, and MongoDB. Familiarity with digital repository systems such as Fedora, Duraspace/Duracloud, and iRODS. Familiarity with common web protocols and related standards including XML, XHTML, Javascript, and RESTful interfaces. Equivalent combination of relevant education and experience may be substituted as appropriate.Preferred QualificationsMastero's or PhD degree in a related field such as Computer or Information Science. Experience working with large teams in distributed projects and/or direct experience with project management. Experience using or administering high-performance parallel file systems including Lustre or IBM GPFS/Spectrum Scale. Familiarity with advanced repository database and search methodologies utilizing RDF or other backend database technologies. Familiarity with metadata and related technologies for the description and identification of data, and familiarity with standards processes for such technologies. Familiarity with Cloudo technologies such as Openstack, Amazon AWS or Microsoft Azure, experience with composing web infrastructure using multiple distributed services and/or functions.Working conditionsMay work in extreme temperatures May work around standard office conditions May work around electrical and mechanical hazards Repetitive use of a keyboard at a workstation  A criminal history background check will be required for finalist(s) under consideration for this position.  The retirement plan for this position is Teacher Retirement System of Texas (TRS), subject to the position being at least 20 hours per week and at least 135 days in length.  The University of Texas at Austin, as an equal opportunity/affirmative action employer, complies with all applicable federal and state laws regarding nondiscrimination and affirmative action. The University is committed to a policy of equal opportunity for all persons and does not discriminate on the basis of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, or veteran status in employment, educational programs and activities, and admissions.  If hired, you will be required to complete the federal Employment Eligibility Verification form, I-9. You will be required to present acceptable, original documents to prove your identity and authorization to work in the United States. Information from the documents will be submitted to the federal E-Verify system for verification. Documents must be presented no later than the third day of employment. Failure to do so will result in dismissal.  UT Austin is a Tobacco-free Campus"}