{"jobID": "2798189873", "jobLocation": "Washington_DC", "jobTitle": "Senior Accountant, Accounts Receivable & General Ledger (AR&GL;)", "companyRating": "3.8", "companyInfo": {"Website": "www.agu.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1919", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "24", "jobDescription": " Requisition Number 18-0021 Post Date 6/1/2018 Title Senior Accountant, Accounts Receivable & General Ledger (AR&GL;) City Washington State DC Description Title: Senior Accountant, Accounts Receivable & General Ledger  Position Type: Full-Time  Location: Washington, DC  What we do and offer our team  AGU is home to more than 60,000 scientists from 139 countries. As the Senior Accountant, Accounts Receivable & General Ledger, you will be part of a dynamic association of Earth and space scientists who advance research, collaborate across disciplines, and  communicate the importance and impact of science to society. AGU offers our employees exciting opportunities through top-ranked scientific journals, scientific meetings and conferences, and other educational and scientific programs, to present and publish  research, gain leadership experience, mentor, and freely exchange knowledge.  AGU’s Workplace Values  We believe in accountability and ownership of work, by taking responsibility for decisions and results. We believe in member and customer service, and that they come first through providing high quality service.  We believe in excellence and giving it our all, through striving to be outstanding. We believe in integrity by doing the right thing, we achieve this by being honest and fair.  Our teams believe that with teamwork together we achieve more, we achieve this through collaboration. We believe in respect, that you earn it and give it, by open communication and collaboration.  What the Senior Accountant, Accounts Receivable & General Ledger does:  The Senior Accountant, AR & GL position is key in assisting AGU to promote discovery in Earth and Space science for the benefit of humanity by being operational and strategic in focus.  The primary purpose of this role is to oversee Accounts Receivable function of the Finance and Accounting department. This includes billing, collections, adjustments, and write-offs; interaction with external customer accounts to understand deterioration of  accounts or process inefficiencies/ineffectiveness and to provide recommendations for solutions. In addition, the Senior Accountant, AR & GL ensures accounts receivable compliance with industry rules and regulations; prepares and reviews month-end revenue  reports and understands how they impact revenue accounting transactions; prepares and analyzes AR aging reports and account balances.  This position reports to the Accounting Manager, General Ledger & Payroll and works closely with other members of the Finance and Accounting team.  Accounts Receivable (AR) Prepares and analyzes AR reports and disseminates AR information. Ensures timely collection of cash receipts from customers.Assists with cash application information and reconciles accounts receivable ledger accounts when required.Ensures that accounts receivable policies and procedures are followed; ensures external and internal controls and policies are adhered to.Recommends process changes when necessary and establishes best practices to improve current AR processes and practices.Oversees potential problem accounts and sends follow-up correspondence. Analyzes AR reserve reports to ensure reserve compliance and prepares analyses and reconciliations of accounts as required. Reviews and monitors credit sources and credit files.Minimizes bad debt write offs and develops knowledge of customer base to safeguard timeliness of payment as well as overall payment risk.Assists AGU Managers and other colleagues with resolving of invoice discrepancies and provides guidance for any credit & rebill requirements.Assists with maintaining integrity of invoicing entered in AR system and submitted to customers.Obtains required information from credit organizations, banks and loan associations when necessary.Manages the relationship with 3rd party vendors for which we outsource our revenue.Manages the integration of information into our subledger and general ledger (e.g. Corcoran for exhibits and Experient for registrations).Reconciles 3rd party data to cash received and general ledger transactions. These reconciliations are required for audit compliance.Develops, documents, and maintains accounts receivable policies and procedures.Partners with Accounting, Operations, and the Revenue Cycle Management functions to continually improve and streamline operating procedures and processes.Assists with other special projects, as needed. General Ledger (GL) Reconciles accounts monthly/quarterly and escalates outstanding issues to the Director, Finance.Assists in the month end, quarter-end and year-end closing processes ensuring transactions are in accordance with policies and that procedures are followed.Identifies inefficiencies and problems in accounting processes and recommends and assists in implementing improved procedures.Participates in other department duties, special projects and/or special reports.Assists in financial analysis and ad hoc reports as requested.Other duties as assigned. What the Senior Accountant, Accounts Receivable & General Ledger brings to the team: Bachelor’s degree in finance, accounting, business or related field with 5+ years of related professional experience in non-profits, associations and/or for-profit organizations, or equivalent combination of education and experience.At least 3-4 years or more of experience working with or in accounts receivable processes.Experience in Membership Databases and familiar with Association Management Systems.Experience in a scientific, knowledge-based or technical setting is a plus, but not required.Hands-on professional with proven track record and solid experience with senior accountant level duties.Possess an excellent facility with numbers.Thorough understanding of Generally Accepted Accounting Principles (GAAP).Ability to exercise independent judgment and to meet deadlines; accomplish work in order of priority; professionally maintain composure and effectiveness under pressure and changing conditions.Ability to work independently and as part of a team and take on new tasks with high level of difficulty.Excellent organizational skills and interpersonal skills, including ability to resolve disputes and observe confidentiality.Strong attention to detail.Ability to present information concisely and effectively.Ability to demonstrate accuracy and quality of work in a fast-paced work environment.Excellent communication skills (with a high degree of diplomacy) are essential, as is excellent follow-through on tasks.Ability to project a professional demeanor while interacting with others.Proficiency with Microsoft suite of products, with focus on Excel.Ability to travel.To Apply: For consideration, please submit your cover letter and resume to  https://rew12.ultipro.com/AME1056/jobboard/NewCandidateExt.aspx?__JobID=322  The successful candidate for this position will be subject to a pre-employment background check.  AGU proudly offers a casual work environment, excellent compensation, generous work-life opportunities, and an outstanding benefits package.  AGU is an Equal Opportunity/Affirmative Action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities.Please view Equal Employment Opportunity Posters provided by OFCCP  here.The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access  to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure  is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41  CFR 60-1.35(c)"}