{"jobID": "2625833242", "jobLocation": "Bethesda_MD", "jobTitle": "Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Updated: October 30, 2017Job ID: 213348Status: Full-TimeRegular/Temporary: RegularLocation: Bethesda, MD, United StatesCome Work at HJF! HJF is searching for a Contract Scientist to lead scientific and programmatic roles for a novel study in defining genetic etiology of inflammatory vasculopathies. The fellow will support the Collaborative Health Initiative Research Program (CHIRP) within The American Genome Center at the Uniformed Services University (USU) in the Department of Anatomy Physiology & Genetics (APG) and The Translational Autoinflammatory Disease Studies (TADS) Unit at the National Institute of Allergy and Infectious Diseases (NIAID). HJF provides scientific, technical, and programmatic support services to CHIRP & USU. This opportunity offers interaction at the CHIRP in advancement of the NIFI's National Institute of Health's Precision Medicine Initiative (PMI) through exploring studies of relevance to genomic medicine within U.S. Department of Defense. The fellow will conduct research using cellular and patient iPSC cell derived models to advance research projects that assist in understanding innate immune dysregulation and organ specific damage in patients with rare autoinflammatory diseases. TADS conducts translational studies in predominantly pediatric patients with autoinflammatory diseases with the goal to understand the disease pathogenesis, to identify and characterize the disease causing immune dys-regulated pathways, biomarkers and to identify molecular targets for better treatment. Responsibilities: Supervision of post-dots and pre-IRTAs and assistance in the management of the day-to-day activities of the laboratory. Conduct patient oriented research, which requires the flexibility to adjust to clinical questions and the work with human samples in close coordination with the clinical group that evaluates the patients. Conduct molecular biology tasks such as DNA/RNA purification and quantitation. QC real- time PCR, sequencing, ELISAs, Co-IP and immune blotting, flow cytometry and corresponding analysis. Conduct cellular biology tasks such as plasmid design/preparation, cellular transfections/transductions and corresponding quantification; cell culture and organoid generation; generation of single cell suspensions from various tissues; immunohistochemistry and microscopy. Help with maintaining and organizing inventory of samples and metadata, and with managing inventory of laboratory supplies and reagents. Use or learn how to use bioinformatic tools, statistical methods and computer programs to collect, organize, and analyze data for optimal retrieval, and presentation of results in a clear and concise manner. Responsible for the containment, security and monitoring of biologic and pharmacologic agents used in studies. Write abstracts, contribute to manuscript writing and generate presentations (poster and power point).Required Knowledge, Skills, and Abilities: The successful applicant is required to have a strong background in molecular biology and immunology. Excellent writing skills, a strong prior publication record and ability to work independently are required. Experience with iPSCs derived cellular models with the assessment of innate immune cells and with various \"-omit\" technologies are a plus but not a requirement. Minimum Education/Training Requirements: PhD, MD, MD/PhD or equivalent in related scientific discipline. Minimum Experience: 0-2 years related research experience. Physical Capabilities: Work involves long periods of standing and handling of numerous chemicals. Supervisory Responsibilities/Controls: Supervises technical support staff. Work Environment: Laboratory environment; may require working evenings and weekends; may involve working with biohazardous materials. The Henry M. Jackson Foundation for the Advancement of Military Medicine, Inc. (HJF) is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or other status protected by law.Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Vice President of Human Resources."}