{"jobID": "2655546861", "jobLocation": "Beltsville_MD", "jobTitle": "Data Analyst/Driver Messenger", "companyRating": "3.6", "companyInfo": {"Website": "www.asrcfederal.com", "Headquarters": "Beltsville, MD", "Size": "5001 to 10000 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " \"ASRC Federal DOJ AFPS a subsidiary of ASRC Federal Holding Company, is seeking a Data Analyst/Driver Messenger in anticipation of a favorable award of the upcoming Role/Responsibilities: Data Analyst/Driver Messenger  Some offices require a Data Analyst to occasionally perform driver and messenger  activities specifically related to the Asset Forfeiture Program. These activities consist of Data Analyst tasks and the following:Operation of Government vehicles, Contractor vehicles in performance of contract requirements, and seized conveyances in the custody of the Government Delivery of messages, documents, packages and mail to business concerns or Government offices Delivery of seized assets (including high value and confidential) in accordance with approved Government requirements Maintain a log of items received and delivered A Data Analyst/Driver Messenger must meet the qualifications for a Data have a safe driving record. EducationHigh School diploma or equivalent, and/or 1 year work experience in a related field required.1 year work experience in related field required. ASRC Federal and its subsidiaries offers a stimulating and challenging work environment, competitive compensation packages, career advancement opportunities, and educational benefits to enhance professional skills.  ASRC Federal and its Subsidiaries are Equal Opportunity / Affirmative Action employers. All qualified applicants will receive consideration for employment without regard to race, gender, color, age, sexual orientation, gender identification, national origin, religion, marital status, ancestry, citizenship, disability, protected veteran status, or any other factor prohibited by applicable law.\""}