{"jobID": "2613041812", "jobLocation": "Weston_MI", "jobTitle": "Applied Technology Scientist", "companyRating": null, "companyInfo": {"Website": "www.evonik.com", "Headquarters": "Essen, Germany", "Size": "10000+ employees", "Founded": " 2007", "Type": " Company - Public", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Bayer, LANXESS Global"}, "estimatedSalary": null, "jobDescription": " Search by Keyword / Location More Options Loading... CountryAll Job FamilyAll ×Send me alerts every days  alert frequency in every certain days Create Alert ×Send me alerts every days  alert frequency in every certain daysShare this Job Addthis  Email  Facebook  Twitter  LinkedIn  Pinterest  Google+ Applied Technology Scientist  Apply now »Date: Jun 10, 2018 Location: Weston, MI, US#job-location.job-location-inline {  display: inline;  }Company: Evonik Industries AGDiscover a world of opportunities. #HumanChemistry See what chemistry can do for your career: careers.evonik.comExploring opportunities. Growing together.VACANCY REFERENCE NUMBER 100228Applied Technology ScientistLocation: United States : Weston, MI Function: Production & Technology Career Level: Experienced professionals (2-5 years) Legal Entity: Evonik Corporation Business Line: SilanesWhat we offer You will work on exciting and challenging topics together with a team in an ultra-modern, innovative and creative environment. Intensive on-the-job training with expert colleagues guarantees you will quickly become familiar with your duties and perform them independently. Performance related pay and the opportunity for personal and professional development are of course part of the package. Since 2009 Evonik Industries AG has been certified as a family-friendly company by the German Hertie Foundation. MEET THE TEAM - Learn more about Evonik from our employees  Evonik is one of the world leaders in specialty chemicals. Profitable growth and a sustained increase in the value of the company form the heart of Evonik’s corporate strategy. Our innovative spirit and integrate technology platforms support our strategic focus on high-growth megatrends in health, nutrition, resource efficiency and globalization. Evonik is active in over 100 countries around the world. And that means a world of opportunities for you. There’s no better time than right now to build your future with us and be a part of our  international team.  The purpose of this position is to promote the use of Evonik products by planning and performing applied research and customer-driven projects in the lab, providing technical service to customers and by providing technical support to sales, marketing and manufacturing. This position will focus on the Dynasylan® product line of functional silanes business line.RESPONSIBILITIESProvide Technical Service, product and application information/support in the respective areas to help solve customer problems.Plan, perform, evaluate and manage applied research projects and Tech Service projects. Performance oriented optimization of formulations and formulation development. Ability to handle multiple tasks and work in a highly matrixed environment.Provide clear written and verbal communication of testing and development activities. Communicate with project managers and team members, sales representatives, customers and distributors via email, phone, visits, conferences and fairs. Prepare technical presentations for internal and external partners, and pursue opportunities to present at scientific conferences and trade shows.Provide expertise to segment teams, Identify new technical needs in the industry to support product development programs, support Marketing and Sales. Develop project plans that are aligned with project goals. Strengthens core technology and help develop new technologies.Organize and maintain lab area in safe professional manner, optimize lab capabilities. Comply with EHS&Q; guidelines and Laboratory practices. Properly documents experiments, observations, data, and results. Reviews the work of less experienced scientists or engineers, as appropriate.Serve as the key technical contact point/responsible for application technology and technical customer support, and work closely with different functions across the different regions globally to develop market segment further.Provide technical support to plant personnel in scale up operations.Provide Technical Service, product and application information/support in the respective areas to help solve customer problems.Plan, perform, evaluate and manage applied research projects and Tech Service projects. Performance oriented optimization of formulations and formulation development. Ability to handle multiple tasks and work in a highly matrixed environment.Provide clear written and verbal communication of testing and development activities. Communicate with project managers and team members, sales representatives, customers and distributors via email, phone, visits, conferences and fairs. Prepare technical presentations for internal and external partners, and pursue opportunities to present at scientific conferences and trade shows.Provide expertise to segment teams, Identify new technical needs in the industry to support product development programs, support Marketing and Sales. Develop project plans that are aligned with project goals. Strengthens core technology and help develop new technologies.Organize and maintain lab area in safe professional manner, optimize lab capabilities. Comply with EHS&Q; guidelines and Laboratory practices. Properly documents experiments, observations, data, and results. Reviews the work of less experienced scientists or engineers, as appropriate.Serve as the key technical contact point/responsible for application technology and technical customer support, and work closely with different functions across the different regions globally to develop market segment further.Provide technical support to plant personnel in scale up operations.REQUIREMENTSBachelor’s Degree in Chemistry, Chemical Engineering, Material Science or other scientific discipline with strong chemistry content and >5 years of relevant technical customer service experience; or Master’s Degree in Chemistry, Chemical Engineering, Material Science or other scientific discipline with strong chemistry content and 3-4 years of relevant technical customer service experience; or PhD in Chemistry, Chemical Engineering, Material Science or other scientific discipline with strong chemistry content and 1-2 year of relevant technical customer service experienceExcellent laboratory bench skills, including organic synthesis and standard purification and isolation techniques.Strong background in Silicon chemistry is preferred.Superb communication skills: Ability to communicate effectively with scientists and non-scientists alike, ability to give presentations in large forums, excellent scientific writing skills for project reporting.Ability to drive projects to completion, and work together with other team member to enhance productivity. Ability to apply relevant scientific principles, theories, procedures, or techniques and good analytical thinking. Experience in DoE is a plus.Proficient in Microsoft Office and ChemDraw software.Up to 30-40% travel – primarily domesticYour Application To ensure the fastest process of your application and to protect the environment, please apply online via our careers portal at https://careers.evonik.com. VACANCY REFERENCE NUMBER 100228Evonik Corporation is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, gender, sexual orientation, national origin, disability status, protected veteran status or any other legally protected status.Please note that Evonik will not accept any unsolicited application documents sent by staffing firms. Evonik works in conjunction with preferred service providers and will not pay any fee to staffing firms in the absence of an appropriate framework agreement. Should Evonik receive a candidate profile from a staffing firm with which it has no framework agreement, and should this candidate subsequently be considered in the recruitment process or offered employment, no claims from the staffing firm will be entertained in this regard.Nearest Major Market: Adrian Nearest Secondary Market: Ann Arbor Apply now »Find similar jobs: View all Job Opportunities,  View all Job Opportunities,  Engineering Jobs,  Engineering Jobs,  Alle aktuellen Stellenangebote auf einen Blick"}