{"jobID": "2810324614", "jobLocation": "Ne_Jersey", "jobTitle": "Senior Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.rbc.com", "Headquarters": "Toronto, Canada", "Size": "10000+ employees", "Founded": " 1869", "Type": " Company - Public (RY) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Barclays, Morgan Stanley, TD"}, "estimatedSalary": null, "jobDescription": "Job Description What is the opportunity?  This is an exciting opportunity for someone to lead Data Engineering at RBC Capital Markets within the Big Data Technology Team. This role interfaces with a variety of key, strategic project partners to ensure overall direction is in line with the Big Data and Analytics strategies. The candidate in this role must also have strong working experience on Big Data platforms to manufacture and engineer data processes.  This role interfaces with the internal IT teams, Data Scientist, Enterprise Architecture, Line Architects and the broader RBC Capital Markets and RBC subsidiaries. The ideal candidate will work to manage data ingest and data distribution using various Big Data technologies but primarily Hadoop.  This is a hands on role and may have few direct reports. As a data engineer, the candidate will be working to build core internal data processing capabilities and help deliver data driven insights to our internal technology and trading teams. He/She will also help build critical infrastructure used in preparing data sets for business insights. While this role is data focused, it is also technology heavy. The candidate should have strong expertise in log ingestion, ETL and data analytics using various modern technologies, including Apache Spark, ElasticSearch, SQL, etc.  What will you do? This candidate will write code for data manufacturing, data ingest into the Data Lake, and data orchestration within the Data Lake. This candidate will also write code to process the data inside and outside of the Data Lake and work with stakeholders to serve up data in various technical constructs.Strong Python, Scala and Java experienceSelf-management: candidate should be a self-starter, with an ambition to work autonomously, passion to learn, ability to grasp new skills and technologiesThe ideal candidate should have excellent communications kills and be able to articulate their point of view.Must have experience with scalable SQL/Hive queries and data transformation jobsMust have experience with 'big-data' frameworks such as Hadoop, HBase, Hive, Oozie, Cassandra, ArangoDB, Spark, MongoDB, etc. What do you need to succeed?  Must-have Serve as a Data Engineer for Capital markets data products.Participate in, and execute a product roadmap with input from the delivery team, stakeholders, and leadershipDevelop and code the data management services that will core to new products, working with the leadership from Architecture7+ years of demonstrated experience as a software development, with hand on technical leadership, and mentorshipExperience building and supporting mission critical applications, running in a highly distributed manner.Experience with multi-tier system development for large enterprisesStrong interpersonal communication and organizational skills required to operate as a leading member of global distributed technical teams that deliver world class services Nice-to-have Experience in financial services, across both front and back officeBS/MS or PhD in Statistics, Math, Computer Science/Engineering, or related quantitative disciplineKnowledge of contemporary technologies What's in it for you?  We thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual. A comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock where applicable.Leaders who support your development through coaching and managing opportunitiesAbility to make a difference and lasting impactWork in a dynamic, collaborative, progressive, and high-performing teamA world-class training program in financial services About RBC  Royal Bank of Canada is Canada's largest bank, and one of the largest banks in the world, based on market capitalization. We are one of North America's leading diversified financial services companies, and provide personal and commercial banking, wealth management, insurance, investor services and capital markets products and services on a global basis. We have over 80,000 full- and part-time employees who serve more than 16 million personal, business, public sector and institutional clients through offices in Canada, the U.S. and 37 other countries. For more information, please visit .  Join our Talent Community  Stay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.  Expand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at .  Inclusion and Equal Opportunity Employment  RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally-protected factors. Disability-related accommodations during the application process are available upon request. JOB SUMMARYCity: Jersey City Address: 30 Hudson Street Work Hours/Week:40Work Environment: Office Employment Type: Permanent Career Level: Experienced Hire/Professional Pay Type: Salaried Required Travel (%):0-25Exempt/Non-Exempt: Exempt People Manager: No Application Deadline:2018-07-02Req ID:***** Posting Notes: [[mfield1]]  RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status or any other legally-protected factors."}