{"jobID": "2776163411", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.underarmour.com", "Headquarters": "Baltimore, MD", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (UA) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": " Do you geek out at the intersection of statistics and storytelling? Are you passionate about finding the story the data is telling, and using it to help drive key decisions? Are you interested in helping shape the direction of the worlds best fitness brand?  Lets talk.  The Under Armour team not only makes the best performance apparel and shoes on the planet, we also offer the worlds most integrated digital health suite of apps, devices, and apparel. And we need a cutting-edge digital marketing data engineer to help bring that story together. You are the lead Senior Data Engineer who will partner with our data science, mobile app/desktop engineering teams and the marketing team to define and subsequently ELT the worlds largest digital health platform (foods, workouts, ecomm and social) and consumer data to build a smart data warehouse that balances scale, performance and applicability. Tasks will include: Data architecture design and roadmap to support digital marketing use casesMulti-tenancyGDPR/PII compliantAddresses horizontal scaling, concurrency etc.Perform, supervise or lead ELT of data including but not limited toS3 log files (event logs, semi-structured)Data warehouses (Merkle, Hana)Various Social/Mkt SaaSEcomm SaaS w/ Omniture loggingDFP/DCM log filesStreaming (kafka)Operate a smart data warehouse forPerformance metrics, algorithm development and automationReporting and visualizationIntegration with other application and data engineering teamsSpecify data requirements for use in analytics via PRDs/FSFlow optimization with development engineersOther data analysis tasksData anomaly detection and correction modeling working with data scientistsTransformation and manipulation scriptingConversion of data into streamlined data sets for internal consumptionHands-on- cross-team functional data ingestion, curation and persistenceQUALIFICATIONS:BS/MS degree in an CS or analytical field (CS, math, statistics, hard or social sciences) and 3+ years in data analytics, or BA in like field with 5+ years experience in data engineering tasksUsing data to solve complex business questionsCommunicating data stories in written and verbal form to wide audiences of varying levels of sophisticationAdvanced SQL skillsAdvanced programming in a scripting environment (e.g. Python) or ETL development experienceDexterity with an advanced statistical package (e.g. R, SciPy, NumPy, Panda.)Confidence operating in a AWS environmentJavaScript D3 libraries or Tableau visualization (bonus points)"}