{"jobID": "2831668284", "jobLocation": "Menlo_Park_CA", "jobTitle": "Senior Scientist- Food Microbiology", "companyRating": null, "companyInfo": {"Website": "www.clearlabs.com", "Headquarters": "Menlo Park, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are seeking a talented and driven Senior Scientist to join our dynamic interdisciplinary start-up. The successful candidate will be involved in experimental design, performing R&D;, Regulatory affairs and development of new molecular assays for molecular detection of food borne pathogens. Tasks & Responsibilities: Developing methods for enrichment of food borne pathogens, RNA/DNA extraction and detecting of food borne pathogens from food samples.Expert on traditional microbiological methods.Be familiar with AOAC, AFNOR, etc submission process.Take a leadership role in projects and guide technical areas independently. Make decisions involving designing, performing, troubleshooting, analyzing and reporting results for development and verification and validation studies.Design, implement, analyze and present experiments to demonstrate feasibility of new methods and efficiently move products through pipeline up to and including transfer to manufacturing and scale up.Lead and perform risk analyses, QC/QA, procedures and reports.Be both a strong individual contributor as well as a collaborative team member.Conduct clear and concise communication with colleagues (cross-functional) and supervisors through oral updates, written reports and technical meetings.Be organized with ability to document procedures and resultsCommunicate effectively and to work independently and collaboratively is essential.RequirementsPhD in microbiology, Food Microbiology, genomics or related field5 or more years experience in commercial product development or industrial settingStrong background in food microbiology, biochemistry and a solid understanding of DNA/RNA based assay development and conventional microbiology required.Experience sequencing and library preparation is a plus.Demonstrated ability to plan experiments, analyze data sets, interprets results, trouble-shoot experiments, prepare reports, and present results.Motivated, enthusiastic, detail-oriented, organized individual with a strong desire to innovate/develop new products. Desire to be part of a fast-paced dynamic research and development environment.Good written and verbal communication skillsBenefits401K4 hot meals/week"}