{"jobID": "2768106857", "jobLocation": "San_Francisco_CA", "jobTitle": "Curtainwall Project Manager - Benson Industries, Inc.", "companyRating": "3.8", "companyInfo": {"Website": "www.mii.com", "Headquarters": "Chesterfield, MO", "Size": "5001 to 10000 employees", "Founded": " 1955", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Simpson Strong-Tie"}, "estimatedSalary": "121000", "jobDescription": " The project manager is responsible for overall project performance, coordinating with the other members of the project team and the company at large for the timely and optimal utilization of resources assigned to the project. Works to ensure that project is completed within the established time frame and maximize budgetary parameters.  Assists in planning and coordinating system for design and implementation of projects. Such projects may involve the development of new data processing applications systems or the substantial modification of existing systems. Projects may also involve basic changes in methods and techniques employed. This position provides technical coordination and review with the project teams, but not direct administrative supervision. Duties and Responsibilities:Reviews project contract to determine most appropriate procedures, prepares budget projections and requirements.Establishes schedule for implementation for project team.Maintains close liaison with engineering team so the concepts and goals of the project are achieved, providing good technical guidance as needed.Monitors activities to ensure compliance with any government regulations that may apply.Responsible for activities and the results of those activities specifically assigned and agreed upon.Completes assigned projects in a timely manner, within project resources.Ensures good coordination and effective project integration with existing systems.Secures approvals on specifications and project completion as appropriate.Keeps management informed of project progress and problems, particularly as to needed changes in schedule, resources, production, or installation.Prepares periodic progress reports, estimates, and re-estimates, including productivity analysis for the President, Operations and Accounting.Responds to problems in a timely, effective manner.Maintains appropriate expertise to ensure effective, solution-oriented service level.Attendance in the office during normal business hours.Required SkillsCompany commitments often demand timely, innovative thinking and actions. Contract variations require discerning analysis and specially formulated plans.Experienced with MS Office programs. Knowledge of Vista by Viewpoint preferred.A self-motivated career professional that enjoys detailed project work, strong analytical skills, organizational skills, and works well under pressure.Position demands maturity, confidentiality, and the ability to interface with various departments and individuals. Must be flexible and able to work independently or as part of a team, as workflows dictate.Ability to develop procedures and training tools for increased efficiency.Required ExperienceCollege graduate or equivalent; construction management or engineering background preferable.Minimum 5+ year’s project coordinator or construction management experience.Office Hours & Travel: Full Time in office or onsite, Monday-Friday.  Benson is an E-Verify and Drug and Tobacco-Free Workplace  We are an Equal Opportunity, M/F Veterans, People with Disabilities, Affirmative Action, and E-Verify employer. .Qualified applicants are considered for employment without regard to race, color, religion, creed, age, sex, sexual orientation, sexual identity, gender identity, national origin or ancestry, tribal affiliation, marital status, veteran status, political affiliation, disability status, medical condition, genetics, pregnancy, or any other considerations under federal, state, or local law.Job Location  San Francisco, US-CA "}