{"jobID": "2778406324", "jobLocation": "Novi_MI", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.nitssolutions.com", "Headquarters": "Novi, MI", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": "Company Background:NITS is a boutique technology and marketing firm that specializes in developing and executing automotive dealership parts and service marketing programs for automotive OEMS. We have several proprietary platforms and tools to facilitate the management and execution of marketing programs, leveraging our proprietary business intelligence platforms. Our clients include fortune 500 companies. NITS Solutions offers paid vacation and holidays, 401(k) and health care benefits.Position Overview:The role of the Data Analyst will provide expertise to acquire, manage, manipulate, and analyze data and report results. He or she will automate regular performance reports and produce tables, graphs, and analysis that communicate findings to internal and external audiences. This is a direct client-contact position, therefore the candidate must possess solid business acumen, a strong quantitative/technical background, natural curiosity, and the ability to effectively shift between communications styles based on the audience. The role has immense high-visibility and growth oriented with a very high level of exposure to senior management.Job Responsibilities:Analyze reports of data duplicates or other errors to provide ongoing, appropriate inter-departmental communication and monthly or daily data reports.Identify, analyze, and interpret trends or patterns in complex, large data sets using a range of tools (Excel, SQL, Python, R or equivalent).  Utilize data visualization tools such as Tableau, Birst, or Qlikview.Identify problematic areas and conduct research to determine the best course of action to correct the data and develop recommendations.  Monitor for timely and accurate completion of select data elements.In collaboration with others, develop and maintain databases and data systems necessary for projects.Acquire and abstract primary or secondary data from existing internal or external data sources.Develop graphs, reports, and presentations of project results.Perform basic statistical analyses for projects and reports.Be very proactive in client discussions and displaying superior customer service skills. Qualifications:BS in Mathematics, Computer Science, Information Management, Economics, Statistics or similar required. MS preferred.2 - 7+ years of experience as a data analyst or business data analyst.Proficiency in Excel and SQL required.Excellent written, verbal, and interpersonal communications skills required.Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.Adept at queries, report writing and presenting findings.Experience working with data visualization tools such as Tableau, Birst or Qlikview.Proficiency in programming languages such as R and Python is a plus.  - provided by DiceData Analytics, Analytics, Management, Automotive, Big Data, VW, SQL, Excel, Python, R, Math, Statistics"}