{"jobID": "2825637416", "jobLocation": "Chicago_IL", "jobTitle": "Bioinformatics Analyst / Computational Biologist in hot field", "companyRating": "4.3", "companyInfo": {"Website": "www.northwestern.edu", "Headquarters": "Evanston, IL", "Size": "5001 to 10000 employees", "Founded": " 1851", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Princeton University, Stanford University, Yale University"}, "estimatedSalary": "60000", "jobDescription": "About Us The lab of Dr. Kyle Eagen at Northwestern University focuses on elucidating how DNA folds within cells and how DNA misfolding relates to human disease, including cancer. Northwestern is one of the top ranked universities in the country, and the Feinberg School of Medicine is well known for its exceptional and innovative research and clinical achievements. The Department of Biochemistry and Molecular Genetics has been provided substantial resources by the School of Medicine towards expanding interdisciplinary research in the computational, genomic, molecular, biochemical, structural, and enzymological bases of human disease, with the additional advantage of using multiple computational and model systems in the process. Dr. Eagen's lab is dedicated to applying state-of-the-art computational strategies to tackle big problems in biomedicine, to make important scientific contributions, and to educate and train the next generation of computational biologists. The lab is located at the downtown Chicago campus in the vibrant Streeterville neighborhood along the shores of Lake Michigan. About the Job A Bioinformatics Analyst/Computational Biologist position is available in the laboratory of Dr. Kyle Eagen in the Department of Biochemistry and Molecular Genetics at Northwestern University. The individual will identify and implement computational solutions to research problems related to DNA folding in both health and disease. S/he will be responsible for taking on highly interdisciplinary projects and key functions in this endeavor, including applying state-of-the-art open source software for basic and advanced analysis of next-generation sequencing Hi-C data. S/he will work closely with Dr. Eagen to develop cutting-edge computational tools and pipelines as the lab expands into new research areas.  The ideal candidate should be highly motivated, well organized, manage time effectively, and have the ability to work independently as well as part of a team. S/he will have a background in bioinformatics, computational biology, and/or biostatistics and have software development experience, at least to the level of developing scripts for processing data in languages such as Java, Python, Perl, and/or R. The candidate must be comfortable working in a Linux/Unix environment and with high performance computing (HPC) workload managers and job schedulers. The most common datasets s/he will encounter are extremely large and complex chromosome conformation capture (Hi-C) datasets, but will likely also include ChIP-seq, total RNA-seq, and PRO-seq data.  Appointment will be commensurate with experience and credentials. General ResponsibilitiesManages and plans for data/analysis requests and projects, building collaborative pipelines as neededConsults with lab members on appropriate data management, methodological issues and statistical analysisCommunicates with lab members and technical staff to monitor/shape the growth and maintenance of computational resourcesSpecific ResponsibilitiesStrategic Planning and Development Maintain and expand upon existing computational pipelines for Hi-C, ChIP-seq, and RNA-seqInterpret results using a variety of techniques by applying and/or developing appropriate statistical analysis for Hi-C, ChIP-seq, and RNA-seqCollaborate with lab members to interpret and refine Hi-C, ChIP-seq, and RNA-seq analysisDevelop novel computational and visualization tools as well as other resources to further the analysis and interpretation of Hi-C dataCollaborate with local IT to implement new technologiesDetermine data structure for local datasetsAdministrative Prepare reports, charts, and graphs for presentations and publications ensuring high quality and accuracyDefine, develop, and communicate new computational standards and best practicesDevelop and maintain documentation of computational processes for quality assurance and reportingManage related next-generation DNA sequencing dataSearch and evaluate scientific literature in support of research projectsWrite portions of grant applications, manuscripts, and publicationsCo-author scientific papersEffectively interact with team members to make important contributions on big problems while ensuring a high standard of scientific rigorComplete other duties as assigned.Minimum Qualifications:Successful completion of a full 4-year course of study in an accredited college or university leading to a bachelor's or higher degree; OR appropriate combination of education and experience4 years data analysis/report writing or similar experience requiredMinimum Competencies (Skills, knowledge, and abilities):Experience in the following: Infrastructure: Linux Operating SystemProgramming Languages: Java, Python, Perl, Shell Scripting, RAnalytical: critical thinking, data mining, data modeling, judgement, metadata creation and management, problem solving, troubleshootingDemonstrated ability to learn about new technologiesDemonstrated ability working with open-source bioinformatics software and publically available databasesOutstanding interpersonal and communication skills and the ability to work independently and in a team environmentWillingness and capability to share knowledge with other members of the teamA record of taking initiative to solve problems and working to high-quality standardsAttention to detail and accurate record keepingAbility to multitask, work and learn independently, and be self-motivatedPreferred QualificationsPhD or Master's degree in Bioinformatics, Biostatistics or Computer Science with biology backgroundPreferred Competencies (Skills, knowledge, and abilities):Proficient with Linux/UnixExperience in Java, Python, Perl, R and/or shell scriptingBackground in statisticsExperience working in an academic or health care computing environmentAbility to solve complex bioinformatics problemsFamiliarity with software versioning tools (e.g. GitHub)Knowledge of linear algebra and/or Fourier analysisNorthwestern University is an Equal Opportunity, Affirmative Action Employer of all protected classes, including veterans and individuals with disabilities. Women, racial and ethnic minorities, individuals with disabilities, and veterans are encouraged to apply. Hiring is contingent upon eligibility to work in the United States."}