{"jobID": "2831367441", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst II", "companyRating": "2.8", "companyInfo": {"Website": "www.sunshinestatehealth.com", "Headquarters": "Tampa, FL", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " The Data Analyst IIis responsible for generating monthly billing reports for one or more solutionsin the CAQH portfolio of healthcare industry utilities. In addition, she/he will leverage data andother resources to identify actionable trends and patterns that support business,technology and operations decision-making. Through a combination of deep domainexpertise, expert product knowledge and strong data skills, the Data Analystwill turn data into information, information into insight, and insight intobusiness decisions. The Data Analystreports to Senior Product Manager. This position is full time, exempt. RESPONSIBILITIES:Import, clean, transform, validate or model complexdata sets from multiple sources to understand and answer business questionssurrounding:DataqualityOperationalimprovement opportunitiesStrategicplanningMarketinsightsCustomer-facingbusiness queriesUsagemetrics for CAQH utilitiesIdentifyroot causes for problems related to adoption, usage, operations and quality,and identify improvements by pinpointing trends, correlations and patterns incomplicated data sets.Design and present data and conclusions incharts, graphs and tables. Maintain ongoing reports.Develop and maintain data quality assurancemeasures and processes.Build out and automate CAQH internal andexternal reporting and analytics capabilities.Recommend data migration approaches forproduct upgrades.Develop and implement data collectionsystems and other strategies that optimize statistical efficiency and dataquality.Design and develop relational databases forcollecting data; write Data Definition Language or Data Manipulation LanguageSQL commands.KNOWLEDGE, SKILLS AND ABILITIES:Demonstrated self-starter and creativethinker who can handle a considerable amount of unstructured, real world dataand be comfortable thinking about solving problems using new and novelapproaches.Experience using one or more businessintelligence software tools (Tableau, Cognos, Business Objects, etc.).Knowledge of statistics and experience usingstatistical packages for analyzing large datasets (SPSS, SAS, Excel, etc.).Knowledge of aquerying language such as SQL and the ability to write code without dependingon an intermediary, guided interface (drag and drop tool).Abilityto identify, analyze and interpret trends or patterns in complex data sets and present data in a way that is intuitive totechnical as well as nontechnical users.Excellent time management skills and theability to prioritize a full plate.Ability to work collaboratively andeffectively across matrix organizations in a fast-paced, schedule-driven andentrepreneurial environment.EXPERIENCE:Minimum of four years of hands-on experiencein a data analyst role.2+ years of performing data analysis insupport of a product organization.Healthcare experience preferred (payer orrevenue cycle management).EDUCATION:Bachelor's degree required; Mathematics,Economics, Computer Science, Information Management or Statistics disciplinespreferred.WHO WE ARE Named one of ModernHealthcare's Best Places to Work in 2016, 2017 and 2018 CAQH, a non-profitalliance, is the leader in creating shared initiatives to streamline thebusiness of healthcare. Through collaboration and innovation, CAQH acceleratesthe transformation of business processes, delivering value to providers,patients and health plans. COB Smart® quickly and accuratelydirects coordination of benefits processes.EnrollHub® reduces costly paper checkswith enrollment for electronic payments and electronic remittance advice.CAQH ProView® eases the burden ofprovider data collection, maintenance and distribution.DirectAssure® increases theaccuracy of health plan provider directories.VeriFideTM® streamlines credentialing byconsolidating and standardizing primary source verification.SanctionsTrack® delivers comprehensive,multi-state information on healthcare provider licensure disciplinary actions.CAQH CORE® maximizes business efficiencyand savings by developing and implementing national operating rules.CAQH Index® benchmarks progress andhelps optimize operations by tracking industry adoption of electronicadministrative transactions.WHAT YOU GET CAQH recognizes that its mostimportant asset is its growing team of smart, creative, collaborative,forward-thinking and passionate professionals and that a comprehensiveemployee benefits package is an important factor for them in choosing where towork. CAQH offers competitive compensation along with an extensive benefitspackage for all full-time employees, including medical, dental and visioncoverage, tuition assistance and a 401k. Our location in downtown Washington,DC is metro-accessible, has an onsite fitness center and is centrally locatedto allow our team to take advantage of professional networking opportunities,cultural offerings and a thriving social scene.SDL2017"}