{"jobID": "2695524279", "jobLocation": "Irving_TX", "jobTitle": "Systems Data Analyst - Junior", "companyRating": null, "companyInfo": {"Website": "www.connectionsitservices.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " TEKsystems, Robert Half"}, "estimatedSalary": null, "jobDescription": " Our client is now seeking a junior level Data Systems Analyst capable of driving user data collections and reporting. The Junior Data Systems Analyst must be innovative, energetic, and driven to provide super customer experiences. This role is customer facing and will require the ideal candidate to work closely with users at all levels of the company. Must have strong soft skills, interpersonal, and problem-solving skills. Strong Communication Skills and ability to serve in a consultative role is required.  You will leverage your combination of consulting skills, analytical ability, knowledge of data collection, and reporting to complete project-based deliverables. This role requires coordination with internal customers in a corporate environment which includes Developers, QA, Operations, Managers and C suite leadership across the enterprise. Position ID: cITs0568 Location: Irving, TX Term: CTH Title: Systems Data Analyst - Junior Description and Skills:Data/Systems Business Analyst will be responsible for Collecting, Verifying, and Updating Phone and Email data from each Enterprise VOIP User (approximately 5800 Users) via Enterprise User Survey and CensusProvide Data Collection and Reporting of pertinent user data from enterprise voice and data users.Compiling data into client reports based on Census Data collection.Data analyst will poll users face to face and on a one on one basis.Collected data will be cross referenced with existing Enterprise VOIP user data and carrier database to ensure accuracy and continuity of user data across databases and systems.Identify any erroneous, outdated, or changes to user data leveraging data analysis tools and software.Newly collected, cleansed, and verified data will be used to identify how the data is routed and translated in internal Project Database and Servers.All cleansed data will be updated and provided via reports on an ongoing basis in the format identified by the client with a complete report of updated and cleansed data being the final deliverable.Participate in project meetings including daily stand-up meetings as well as iteration planning meetings, iteration reviews, and iteration retrospectives.At a minimum, Resource(s) will attend the release planning meetings, release interim meetings, and release retrospectives.Project status reporting delivered weekly, reports will consist of:  i) Number of users polled, ii) number of end users left to poll, iii) newly collected user data, iv) overall project status, v) forecast for completion, and vi) risk assessment updates.Day to Day ResponsibilityData Analysis and Data CollectionIdentify and collect “As Is” enterprise user data (existing phone and email information, employee locations/seat maps, target cutover/go live date for user or group of usersPoll users on current email, phone, location, and user informationCompile newly collected Enterprise Voice User DataReconcile Collected User Data Against Existing User Data to ensure accuracy of existing user dataCleanse, Update, and Compile user data based on newly collected user dataIdentify erroneous data and update with accurate dataWeekly reports of newly collected user dataReportingProvide Reporting that identifies changes to existing user data based on newly collected dataProvide a report of overall project status regarding number of users polled, number of users left to poll, and any roadblocks that have encountered during the data collection processProvide a fully updated and cleansed report of user data based on user poll/survey"}