{"jobID": "2820106731", "jobLocation": "San_Diego_CA", "jobTitle": "Finance & Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.ecoatm.com", "Headquarters": "San Diego, CA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " The Finance & Data Analyst will be responsible for delivering reports and recommendations gathered from data derived from the ecoATM network and mined from other sources. ecoATM is the first and only company to create an automated self-serve kiosk system that uses patented, advanced machine vision, electronic diagnostics, and artificial intelligence to evaluate and buy-back used electronics directly from consumers for cash or store credit. The ecoATM network generates a broad range of data on transactions, locations, devices, demographics, pricing, etc. This data combined with data from external sources will be used by the Finance and Data Analyst to generate reports and ad hoc analysis across all of ecoATM’s functional areas. In addition, the position will be responsible for coordinating the work of other analysts and data scientists to produce other standard finance functions such as ROI, product and business forecasting and other strategic and tactical analysis. This role resides onsite at our Corporate Office in Sorrento Valley, San Diego; no remote work available. Key ResponsibilitiesDevelop complex automated and ad-hoc financial and decision models in support of financial analysis and forecasting for various groups within the company and to senior managementProvide standardized reporting for the businessTrack and improve quality throughout the organizationMake recommendations based upon data driven analysisProvides interpretation of financial policies, governmental legislation, accounting theory, or customer financial regulationsAnalyzes financial and other information to determine present and future financial performanceIdentify trends and recommendations for improvements to financial performanceEstablish databases of pertinent information for use in analyzing future plans and forecastsMake recommendations to management regarding cost saving or profit generating opportunities and profitability improvement strategiesWill be responsible for developing presentation for senior managementEducation & ExperienceBachelor’s Degree in Accounting, Finance, Economics or related field required; MBA strongly preferred3+ years of financial, business, and/or strategy analyst experience with working knowledge of P&L; requiredProven analytics experience directly supporting Senior Management requiredKnowledge, Skills & AbilitiesExpert in Microsoft Excel and PowerPoint requiredSQL query development experience requiredMust have the ability to translate detailed and complex financial and data outcome models into company established goals and forecastsProven analytic and quantitative decision-making skills when solving problemsAble to synthesize complex and diverse data in order to draw logical conclusionsCollaborative working style when partnering with customers and team membersStrong organizational and multi-tasking skillsHighly motivated to solve challenging business problems having a direct impact on top and bottom lineIndependent thinker with ability to move a project forward, draw key insights, and plan next stepsExcellent verbal and written skills and the ability to interface effectively with all levels of managementTableau report writing and Alteryx experience are preferredThis job description is not intended to be all-inclusive. Employee may perform other related duties as assigned to meet the ongoing needs of the organization. *This position is not accepting third-party recruiter or agency inquiries, principal only.*"}