{"jobID": "2803509983", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Science Manager - Search and Places", "companyRating": null, "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Role The location services team creates the technologies that allow users to specify pickup and destination locations in Uber’s map. For example, riders can use map search to search for a hotel, a type of restaurant, or an address. We also provide a set of destination options to riders, which are created by a destination prediction engine. Drivers who want to relocate to an area of higher demand can specify a neighborhood to which they want to navigate. We leverage predictive modeling, machine learning, search, and optimization methods to create a magical experience with these products.  You’ll be the data science technical lead or manager for the team, working closely with software engineers and product managers to create and execute the direction of the product development. This includes crafting a machine learning or data science solution to achieve a business goal, guiding the team’s direction through data-driven insights and algorithmic thinking, and providing team members with feedback on their work. The role can also include full management responsibilities, such as growing the team, if you have management experience.  The team currently has two data scientists, and we’re looking to grow to 4+ over the next year. There’s also a sister team that creates the points of interest data (such as hotel or restaurant data with address information) leveraged by the location services; if you have extensive management experience then the role can be expanded to manage data science for both teams. What You’ll DoProvide analysis using mathematical modeling tools to improve business processes and decisions.Define creative solutions to business problems using advanced mathematical algorithms.Embed with engineering and partner closely with operations, business, and infrastructure groups.Communicate with senior management and cross-functional teams.Build and validate prototypes to demonstrate the benefits from proposed changes to decision systems and operational processes.What You’ll NeedM.S. or Ph.D. degree in Statistics, Computer Science, Operations Research, Economics, or other quantitative discipline strongly preferred.Data analytics and experimentation skills.Predictive modeling and machine learning/statistical modeling.Ability to drive clarity on the best modeling or analytic solution for a business objective.Experience driving research and development.Experience communicating with both technical and business people. Ability to speak at a level appropriate for the audience.Ability to develop statistical analysis and machine learning software in a language like Python or Java.About the Team The Maps team builds the systems and services that provide the geospatial backbone of Uber's functionality. Our group's systems mediate our users' digital connection to their physical world through traffic modeling, travel time estimation, geospatial search, hotspot computation, and map display and navigation."}