{"jobID": "2823104452", "jobLocation": "Chicago_IL", "jobTitle": "Senior Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.alpinehomeair.com", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "You have unique abilities. Apply them at our high-growth company.About YouAre you analytical and innovative?Do you drive for change while taking calculated risks?Do you enjoy analysis and applying personal creativity to solve complex problems?Do you hold yourself to the highest possible standard of excellence?Are you thorough and disciplined while also being fast and efficient?Alpine Home Air Products is looking for you!Job Description Alpine is seeking a highly-motivated Senior Business Intelligence Analyst to join our team working hand-in-hand with our developers, data administrators and senior management. The position reports directly to the company COO. Within the Business Intelligence Analyst role, you will work on the highest level analysis performed in the company which will impact all facets of our growing ecommerce business. You will supervise the work of our data administrators and ensure accuracy and integrity of the data being used for analysis and reporting. The role will handle a mix of data analysis from most departments of the company. Responsibilities:Conceptualizing and executing analyses that support all departments and primary functionsBig data mining, manipulation and analysisProcessing, cleansing, and verifying the integrity of data used for analysisAd-hoc reporting and analysis, as well as ability to present results in a clear mannerIdentifying data-related opportunitiesBeing vigilant about ways to increase business efficiency and productivity through data driven insightsAssist with development of protocols for systematizing processes for collecting, monitoring, analyzing and reporting dataSupporting report building, KPIs and dashboards for internal business teamsRequirementsBachelor's degree required in either math, statistics, computer science or data scienceAt least 5+ years of experience in a data-related roleExperience using SQL to query big dataFamiliarity with data visualization tools such as PowerBI or TableauApplied statistics skills, such as statistical testing, regressionConcise and organized scripting and programming skillsComfortable working in teamsOutstanding written and verbal communication skillsAbility to work independently under minimal supervision and strong track record of setting and meeting delivery commitmentsBenefitsGroup Healthcare, Health Savings Account401k retirement planPaid vacation and paid holidaysCommuter benefitsChallenging and fulfilling work in a positive, optimistic results-oriented work environmentCompetitive wages and a monthly gain-sharing bonus based on revenue growthPaid educational and professional development trainingAttractive and comfortable loft office with large windows and lots of natural lightCoffee and snacks for energyOpen beer tap in the afternoonsA nap room to revitalizeABOUT US Started in 2002, we are the first ecommerce company to sell HVAC equipment to homeowners online and by phone. We sell and ship HVAC equipment directly to homeowners in the US, and have served hundreds of thousands of happy customers. We are quickly growing, and are hiring new team members to keep up with the exciting growth.  Our objective is to create great experiences for our customers, vendors and employees. At Alpine, everyone wins. Our employees love our positive and supportive culture, beautiful sunny office, great benefits and friendly team. We help our employees develop their careers and do the work that best suits their talents and interests.  We are innovative! Check out a list of industry first pioneered here at Alpine: 2002 - first ever ecommerce HVAC store2003 - first HVAC online shopping configurator2004 - first national HVAC referral network of installing contractors2005 - first of its kind automated performance based pay system for phone sales2011 - first and only online HVAC operating cost calculator2013 - first and only HVAC photo-to-quote app2014 - filed patent for better way to assist customers with sales & service needs2015 - first eCommerce bundling of local services + products: EasyHVAC.comLearn more about working with us and view all open positions at: www.alpinehomeair.com/careers/"}