{"jobID": "2783104660", "jobLocation": "Falls_Church_VA", "jobTitle": "Financial Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.northropgrumman.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (NOC) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Northrop Grumman's Corporate Internal Audit is conducting a search for a talented Financial Data Analyst to join our Data Analytics team. This individual, reporting to the Director, Information Assurance, will be responsible for performing various activities related to the development of data analytics in support of the Internal Audit staff. This position provides the opportunity to lead complex projects, using creative problem solving skills, in an interesting and fast-paced environment. The ideal candidate has an action-oriented attitude and independent thinking.  Responsibilities will include, but are not limited to: Collaborating with audit teams to identify the requirements for the data analytics required to turn data into critical information and knowledge.Identifying data sources and building models to discover insights and opportunities.Supporting and collaborating with key partners outside the organization on special projects.Leading development efforts to create continuous analytics to report on risks, exposures and internal controls across various areas of the company.Basic Qualifications:Bachelor's degree with 10 years of related experience or 8 years of related experience with a master's degree.Experience working with SAP data.Proficient in Structured Query Language (SQL), HANA, and other SAP tools such as Business Warehouse.Knowledge of SAP data structures, including the ability to program customized queries.Preferred Qualifications:Master's degree in relevant technical field.Active Secret security clearance.Audit or other related certifications (CPA, CIA, CFE).Experience in auditing, forensic accounting and/or fraud investigations.Highly proficient in Audit Command Language (ACL).Proficiency in analytical modeling tools such as R, Matlab, SAS.Proficiency in programming languages such as Java, Python, or C++.Experience with business systems databases such as PeopleSoft, Concur. Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}