{"jobID": "2788311117", "jobLocation": "Washington_DC", "jobTitle": "Customer Insights Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Role As a member of the External Insights team, the Data Analyst will deliver customer support driven insights to product, operations, marketing, and leadership teams. Your will identify opportunities and help prioritize work for cross-functional teams in order to improve the customer experience. For this role you will need excellent analytical communication skills and strong business acumen in order to clearly present your data analysis to stakeholders at all levels of the business. You will need to be self-directed with excellent time-management, organizational skills, and interpersonal skills. What You'll DoOwn data analysis and visualization, and communicate recommendations and insights to stakeholders across the organizationCoordinate with other members of the Community Operations Team to measure the impact and efficiency of new products and business processesDevelop analytical frameworks to support decision making in the US and CanadaPartner closely with specific Lines of Businesses to provide insights that drive decisions around process, policy and productBuild, maintain, and communicate detailed reporting & modelsWhat You'll NeedMinimum 2 years of professional experience in data science, business intelligence, investment banking, consulting, or related experienceBA, BS, or MS degree in Economics, Business, Engineering, Operations Research, or other quantitative focusSQL fluencyExperience in reporting-based software, such as Shiny, Looker, TableauExceptional Excel & data management skillsStrong communication and organization skillsBonus Points IfHigh-growth analytics or operations experienceOperations, marketing, product experienceExperience working in a support environment (contact management analytics, Zendesk API familiarity, etc.)Programming languages such as R and/or PythonAbout the Team The NorthAm Community Operations team ensures that we are providing high-quality support at scale. The Analytics & Insights team is tasked with providing critical business insights to help identify opportunities and implement operational improvements across our entire organization."}