{"jobID": "2796244073", "jobLocation": "Midland_MI", "jobTitle": "Medical Office Nurse II RN", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "27", "jobDescription": "Position InformationFTE: 1.000000Exempt: NoAny Shift: 40 Hrs/Wk; 80 Hrs/PayWeekend & Holiday Rotation: Per schedulePay Grade: 13Position SummaryMIDMICHIGAN PHYSICIANS GROUPHEART FAILURE TVARMIDMICHIGAN MEDICAL CENTER – MIDLAND OUTSTANDING OPPORTUNITY FOR A REGISTERED NURSE [RN] IN A PREMIER CARDIOLOGY PRACTICEThe heart failure RN will function as the liaison between clinic staff, midlevel providers and for heart failure patients. The RN will work directly with the midlevel providers to assess, plan, implement and evaluate programs, education and community resources for the HF patients and support persons. He/she will provide individualized assistance to patients, families and support persons to overcome health system barriers and facilitate timely access to medical and psychosocial care to prevent avoidable readmissions into the acute care setting. He/she will work within protocols and the RN scope of practice for telemanagement appointments with patients to provide continuing management of patients in their home environment. ResponsibilitiesESSENTIAL:(40%) Assist providers with direct patient care via telemanagement appointments and nurse visits. Assess patient for signs or symptoms of complications and make adjustments in the patient’s treatment regimen following approved telemanagement protocols and guidelines per the HFC. Reviews clinic schedules to establish a plan and telemanagement schedule for each patient based on the recommendations generated from their clinic visit. (20%) Provides initial new patient education for both inpatient referrals and outpatient new clinic visits. Schedule initial TM appointments and clinic appointments for patients prior to hospital discharge. Follows the HF inpatient list to monitor for pending discharges to ensure clinic follow up.(20%) Interacts positively with patients and families in an ongoing way. Provides information to patients so they may fully utilize and benefit from MPG services and the services of MidMichigan Health. (20%) Promotes continuity of patient care through information sharing and communication with other departments and health professionals to optimize coordination of care.QualificationsEDUCATION:Essential:* Associates Degree* Nursing CREDENTIALS:Essential:* Basic Life Support* Registered Nurse * State of Michigan LicensureCREDENTIAL EQUIVALENT EXPERIENCE: Essential:* BLS required within one month of hire or transfer date. PREFERRED EDUCATION, TRAINING AND SKILLS: * Working knowledge of the organization’s Lawson, Epic and Kronos computer programs preferred or knowledge of similar software.* Heart Failure Nurse Certification preferred.* Preferred experience with developing spreadsheets and quality/data tracking.* Effective verbal and written communication skills and ability facilitate meetings/teams. * Ability to assess learning needs of others and demonstrates ability to teach.* Knowledge of medical office policies, practices and procedures as normally acquired through three to five years working in the healthcare system or similar setting.OTHER DUTIES AND RESPONSIBILITIES:Provide support to other clinical staff/MAs on clinic days by helping with direct patient care as needed.Maintain current knowledge of HF treatment and best practices.Participates in the development of standardized orders, nursing care plans, policies and procedures related to HFDesigns, implements, and executes a standardized follow-up schedule or plan with cardiology offices, home health care agencies and subacute rehabilitation facilities.Monitors and maintains an inpatient Heart Failure list to track patient progress for appropriate follow up at discharge. Utilizes clinical expertise to assess, conduct, coordinate and evaluate education initiatives for patients, families, the community and caregivers.Actively participates in the Heart Failure Program meetings and assists with tracking outcomes of follow-up appointments and results of any interventions.Follows HF hospital readmission rates and develops and implements strategies to reduce preventable HF readmissions.Acts as a first point of contact for patients and other community resources for health care questions or concerns post-discharge and directs patients to appropriate resources as indicated.Teaches patients about the HF disease process, alterations in lifestyle and self-care concepts to achieve/maintain their optimal health and emphasize patient empowerment through education and support by phone and during regular HFC office visits in coordination with the providers.Works collaboratively and takes direction from the HFC medical director and Advance Practice Providers.Coordinate patient care with ancillary services during HFC visits including Pharmacy, Case Management, Social Work, Palliative Care/Hospice etc. as appropriateOther duties as assigned.Physical/Mental Requirements and Working ConditionsExposure to stressful situations, including those involving public contact, as well as, trauma, grief and death. Able to wear personal protective equipment that includes latex materials or appropriate substitute if required for your position.Is able to move freely about the unit and hospital.Overall vision is necessary; including reading, depth perception, close-up work and must have a peripheral field of vision.Hearing and speech on the phone as well as in person are necessary. Must be able to communicate verbally in person, on the phone and in writing. Frequently required to sit/stand/walk for long periods of time.Some exposure to blood borne pathogens and other potentially infectious material.Ability to handle multiple tasks, get along with others, work independently, regular and predictable attendance and ability to stay awake.Must follow MidMichigan Health bloodborne pathogen and TB testing as required.Apply!"}