{"jobID": "2837190867", "jobLocation": "Summit_NJ", "jobTitle": "Senior Scientist, Upstream Biologics Manufacturing", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.Senior Scientist, Upstream Biologics ManufacturingSummit, NJDepartment:Biologics Position Description: We are currently looking for a Subject Matter Expert (SME) to join our Manufacturing Sciences team within the Employers Biologics Development & Manufacturing Group in Summit, New Jersey.  As a member of the Biologics Development & Manufacturing group, the Sr. Scientist/Engineer will provide technical and operational expertise to late stage clinical and commercial manufacturing campaigns for external programs. The focus of this position will be on cell culture upstream operations, but the ideal candidate should have adaptability to lead purification projects as needed. Purification experts with the desire to learn cell culture will also be considered. As appropriate, responsibilities include:Lead technology transfers from Biologics Development and external partners to the Employers network of external CMOs. Technology transfer will include providing decisions for manufacturing implementation of processes and communicating the decisions to the technology transfer team.Technical lead for manufacturing issues during processing, which includes leading manufacturing technical investigations toward process impact assessments and ensuring timely completion and communications.Responsible for routine data trending of manufacturing data to fulfill regulatory/compliance requirements. This includes authoring quarterly trend reports and annual product reviews.Responsible for authoring various technical protocols and reports and regulatory documents.Actively pursue technical improvement projects and implement the changes through the global change control process. QualificationsAbility to work independently and lead a large cross-functional group.Good communication and project management skills appropriate for leadership of technology transfer projects.Comfortable analyzing scientific datasets/strong analytical skills with excellent written skills.Ability to work well in both individual and leadership capacities  • Knowledge of cGMP, FDA/EMA regulations, Process Validation Education Biochemistry, Bioengineering, Biochemical, Chemical Engineering or related discipline: Preferred - BA/BS + 4-6 yrs or MS and 3-5 in relevant experience in the Biotech / Biopharm industry.Employer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}