{"jobID": "2800364380", "jobLocation": "San_Diego_CA", "jobTitle": "BI Data Analyst", "companyRating": "4.9", "companyInfo": {"Website": "www.sweetlabs.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "Do you have a passion for digging into large datasets and discovering insights that drive material business results? Are you a detail-oriented and inquisitive self-starter? Do you have the technical chops, creativity, and hustle to remain focused, productive, and surpass expectations in a fast-moving start-up environment? Do you want to make a big impact at a growing and profitable tech company as the principal data person? Read on.What you’ll do:Develop, own, and monitor reporting for our core products and revenue streams using data from multiple sourcesDevelop a deep understanding of our data and user engagement life-cycle to drive insights and answer key questions from stakeholdersManage, understand and analyze data for trends, patterns, and failure points, and communicate analysis to stakeholdersWork with stakeholders to build rich dashboards and reports in Tableau for company-wide consumptionWhat you’ll bring:Experience analyzing complex, high volume data to produce meaningful insights and practical recommendationsStrong hands-on SQL experience with complex queries against large datasetsComfortable manipulating, transforming and combining large, disparate datasetsExperience using tools like Tableau for creating dashboards, reports and data visualizationsExperience using analytics packages in languages like Python or RExcellent communication skills with both technical and non-technical peopleStrong technical background in math, engineering, or statisticsPreferred experience: Creating data models, predictions, and forecasts to support executive business decision makingPreferred experience: Driving decisions that had a significant impact on business outcomes and/or revenueOur Sweet Benefits:Discretionary employee bonus planExcellent medical, dental, and vision benefits (low employee premiums too!)Generous 401(k) plan with 100% match up to 5% base salary and immediate vestingPTO Flex policy (aka unlimited time off) plus paid holidays and one week for winter vacationWellness program that includes a quarterly stipend, reimbursed athletic events, and on-site gymCovered downtown parking or public transportationStocked kitchen and catered Friday lunches (healthy & not-so healthy options)Growth opportunities like individualized professional coaching and company sponsored conferences and classesSweetLabs is an Equal Opportunity Employer focused on creating an inclusive workplace for all."}