{"jobID": "2622494729", "jobLocation": "Rancho_Cucamonga_CA", "jobTitle": "Marketing Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.co-opfs.org", "Headquarters": "Rancho Cucamonga, CA", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Overview  CO-OP Financial Services provides technically superior products and services to financial institutions across the nation. We are seeking a talented Marketing Data Analyst to be responsible for working closely with the Marketing & Experience team to expand, execute, and implement digital strategies to improve the visibility and revenue of the organization. The candidate will measure and benchmark campaign and content performance across the different digital channels that include; websites, blog, webinars social media, etc. The Marketing Data Analyst interfaces with key business stakeholders at all levels to understand complex business problems and present creative, engaging, customer-centric digital solutions to be delivered in a digital environment. Reviews and analyzes web traffic, emerging trends, and the competitive landscape and communicates the current capabilities and opportunities to project teams and business stakeholders. RESPONSIBILITIES:Monitor the quality of all data at both the project and output level for the MX team.Responsible for transforming raw data into actionable insights that ensure cross-departmental marketing efforts are effectively driving incremental engagement and conversion.Analyze data on traffic sources and patterns in the impression to monetization funnel.Provide actionable insights to the MX team on campaign analysis, customer segmentation and profiling.Expand real-time analytics practice for high profile campaigns and new product/ content launches.Support the integration of new data sources and analyze and confirm overall quality and integrity of source data.Work in collaboration with the Digital Marketing Analyst to define and continue to improve on our KPIs, goals and recommendations across our different channels and campaigns.Generate database extracts from the MarTec stack to perform continuous and ad-hoc reporting.Build BI, reports and dashboards using software like Klipfolio, Tableau or Microsoft Excel.Take complex data and turn it into real-time visual digestible dashboards.Identify business opportunities or potential risks based on data analysis.Own campaign tagging and goal tracking levering Google Tag Manager and Google Analytics across our digital properties.Monitor and audit first and third-party tracking solutions for accuracy.Document all marketing data standards and processes as appropriate and audit when necessary.Work with Digital Marketing Analyst to develop A/B and multivariate testing. strategies to understand the online customer experience; develop and implement processes and procedures to regularly test, measure and improve online creative and content.Monitor web traffic for trends associated with SEM campaigns and work closely with leadership to adjust spend accordingly.Assist in the administration and management of the web site infrastructure.Collaborate with agencies and other vendor partners when applicable.Evaluate emerging technologies; provide thought leadership and perspective for adoption where appropriate.Assist in the enhanced visibility of the brand within the digital ecosystem.Develop and execute digital marketing strategies that align with the organizational goals.Develop and maintain an understanding of financial services, key goals and audiences, media genres and techniques, and applications.Analyze performance metrics and use insights to optimize campaigns and drive growth in profit.Communicate performance, projects, test results and learnings to the team.Work under tight deadlines within a fast-paced and flexible environment.QualificationsIn-depth knowledge of Digital, Online and Media as well as SEO, SEM, paid search, Google AdWords and/or Analytics, or other campaign management tools and CRM tools such as Salesforce, WordPress, and Marketo.Extensive experience and comfort with Excel, Google Analytics, Big Query, SQL and databases.A strong understanding of how to connect and analyze data across multiple data sources (Marketo, Salesforce, Uberflip, Google Analytics, SurveyMonkey etc.)Demonstrated expertise problem-solving and presenting findings that are clear, digestible and actionable.Ability to build data visualizations levering tools like Klipfolio, Excel, Tableau.Strong understanding of digital techniques and terminology.Advanced proficiency in MS Excel (pivot-tables, V-lookups, graphics).Strong understanding and knowledge of Google Analytics and Google Tag Manager (Bonus Points for Google AdWords and ability to extract and analyze data from core social media platforms such as Facebook, Twitter, LinkedIn).Ability to conduct critical analysis and identify key insights.Strong written, verbal and visual communication skills.Strong organizational and analytical skills with a keen attention to detail.Ability to think creatively and implement ideas.Desire to learn and keep up with an industry that is always changing.Team player willing to collaborate with team members as well as work individually.Outstanding written & verbal communications skills.Self-motivated and manage your own time and use down time to be proactive.Comfortable collaborating with all levels of management.Bachelor’s degree with focus in Marketing, Business, or related field.3-5 years of work experience in digital marketing/media in an analytical function. if you are highly motivated, team oriented, and would enjoy the diversity of chalenges and opportunities, please submit your resume and cover letter.  About Us CO-OP Financial Services is the technology engine that provides access and convenience for credit unions. With over 35 years of credit union service, CO-OP connects credit union members to their accounts through Debit, Credit, ATM, Shared Branching, Member Interaction Services, Mobile, Virtual, and Bill Pay services. CO-OP serves a total of 3,500 member credit unions, 50 million cardholders, 30,000 surcharge-free ATMs, and more than 5,500 shared branches. Handling three billion-plus annual transactions, CO-OP is the nation’s largest credit union service organization—offering resources that enable deeper member engagement to help credit unions prosper."}