{"jobID": "2804508329", "jobLocation": "Dallas_TX", "jobTitle": "Digital Analytics Manager", "companyRating": "4.4", "companyInfo": {"Website": "www.omnihotels.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " White Lodging"}, "estimatedSalary": "79000", "jobDescription": " OverviewOmni Hotels and Resorts creates genuine, authentic guest experiences at 60 distinctive luxury hotels and resorts in leading business gateways and leisure destinations across North America. Omni Hotels is known for its exemplary culture, authenticity to the markets in which we operate, innovation and exceptional service. Our commitment to career development has created tenure and loyalty that enables us to perpetuate our family atmosphere.Job DescriptionThe Manager, Digital Analytics will be a primary player in Omni’s digital evolution, serving as the go-to person for insight into customer behavior on Omni’s website. This role is responsible for mining and analyzing datasets and then articulating actionable insights around customer behavior and digital business trends. The Manager, Digital Analytics works to establish and enhance the company’s digital KPIs and acts as a key customer insights leader for the organization. Additionally, the Manager will be a member of Omni’s Digital Commerce Team and reports to the Vice President, Digital Commerce and Corporate Strategy.Responsibilities Develops an in-depth knowledge of Omni’s digital and customer databases, partnering with other teams to integrate data to create a holistic customer picture.Generates actionable insights to enhance customer engagement and value by analyzing and reporting on behavior of customers on Omni’s website.Informs product management, customer acquisition, and corporate strategy teams with insights and analysis, potential implications for the business, and recommendations for consideration.Partners with Business Intelligence team to establish a holistic set of KPIs for the digital business and leads the overall performance management system of the digital team.Conducts and presents analyses around customer lifetime value of various customer groups.Collaborates with cross-discipline teams to leverage customer and website behavioral data to improve the performance of company strategies and tactics.Stays up-to-date on new developments and technologies in analytics and data visualization.Qualifications3+ years of relevant work experience, ideally in finance, analytics, operations research, or predictive modeling.Work experience and/or coursework in analytics platforms, statistical methods, and data visualization.Technical expertise (preferred but not required upon entry) include knowledge of Google Analytics/GA 360, Adobe Digital Analytics, SQL, Tableau, Excel, SAS or R, and Microsoft Powerpoint.Bachelor’s degree in a related field with strong coursework in quantitative disciplines including computer science, mathematics, operations research, or statistics.Graduate degree in a related field (MS or MBA) is a plus.Strategy experience is a plus."}