{"jobID": "2830266588", "jobLocation": "San_Jose_CA", "jobTitle": "Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.ntechsol.com", "Headquarters": "Columbia, MD", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": "Share PrintJob DescriptionProject DurationContract, 4 MonthsRequired SkillsMS in Computer Science or equivalent with statistics covered in the discipline with a focus on Machine Learning/AI learning or related areas with at least 3 years of experienceConnect disparate data sets across the client to analyze and understand every customer interaction to develop insights and associated actions to improve top/bottom lineUnderstanding of technology & data schemas in Oracle, SFDC and other new data sourcesStrong background in two or more of the following areas: machine learning/AI algorithms, computations/statistical learning theory, scalable systems (e.g. Spark, Hadoop), large scale data analysis, optimization, functional analysis and deep learning.A demonstrable track record of developing novel algorithms, solutions and delivered/deployed projects in the area preferred.Experience in deep learning frameworks (e.g., Tensorflow, MxNet, Caffe, Torch, Theano, Keras, etc.), and Large-scale optimization preferred.Hands on coding experience in Python, Java & RA sense of ambition and passion to change the world using AI and machine LearningExperience in creating insights by combining large disparate data sets, such as Telemetry, customer transactions, customer sentiments etc. and application of AI/Machine learning in the context of these domainsThe ability to understand and accelerate the use of new data formatsThe ability to proactively build upon / identify new business use cases using data analysisbusiness analytics and impact of data genealogy on analyticsnTech is an equal opportunity employer. All offers of employment are contingent upon pre-employment drug and background screenings. Only candidates who meet all of the above client requirements will be contacted by a recruiter."}