{"jobID": "2826655345", "jobLocation": "Jersey_City_NJ", "jobTitle": "data scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.tcs.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Cognizant Technology Solutions, Accenture, IBM"}, "estimatedSalary": "101000", "jobDescription": " Job Description§ 5+ years of machine learning/ Data Science experience in developing and  implementing large scale algorithms impacting business revenues and customer  experience  §  Degree  (MS or PhD) in either Maths / Statistics / Computer science / Other  quantitative field  §  Preferred  Certification: Certified Analytics Professional Strong problem solving skills  with an emphasis on product development.Experience working with and  creating data architecturesGreat  communication skills for storytelling, data visualization and presentation  across stakeholders and functional teams.Strong  experience in th e data mining / data analysis methods  o  Predictive modeling and running  simulations to increase and  optimize business outcomes.  o  Analysis and processing of large complex  data sets for product and process optimization.  o  Advance statistical techniques and  concepts  o  Machine learning algorithms like Decision  trees, Regression, Support vector Machines, Kernel methods, Neural networks, K-Means  Clustering  Experience in working with  following Software / tools  § Statistical Languages: R, Python, SAS, Matlab, SQL  § Frameworks/ Libraries: Keras, Caffe, Theano  · Visualizing tools : Periscope, Business Objects, D3,  ggplot, etc  · Distributed data/computing tools: Haddop, Map/Reduce, Hive, Spark, MySQL,  etc. ·NoSQL  databases-: MongoDB, Cassandra, HBaseJob FunctionTECHNOLOGYRoleFunctional ConsultantJob Id124699Desired SkillsData scientist"}