{"jobID": "2725633013", "jobLocation": "Washington_DC", "jobTitle": "FISMA/FedRAMP Senior Consultant", "companyRating": null, "companyInfo": {"Website": "www.a-lign.com", "Headquarters": "Tampa, FL", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT THE ROLEA-LIGN employs a business model that builds on the best of what the largest security firms have to offer, such as the ability to offer high quality professionals a variety of project experience with high profile clients. What sets us apart is that we have eliminated time reporting, chargeability goals, and sales pressure.As a FISMA/FedRAMP Senior Consultant, your primary responsibilities will include standard project execution and client service activities. Senior consultants must have a high level of understanding of the NIST 800 controls and lifecycles of both FISMA and FedRAMP assessments.REPORTS TO: Managing ConsultantPAY CLASSIFICATION: Full-Time, ExemptRESPONSIBILITIESPlan and execute FISMA and FedRAMP engagements, under the direction of a member of the management teamCommunicate effectively to the client, prior to, during, and post on-site visitLead assessments and onsite testingLead scoping calls about system boundariesGather evidence on site, and reviewProvide draft reports to management, within defined timelinesProvide detailed project status reports, weekly to managementOrganize client information on A-LIGN’s driveMINIMUM QUALIFICATIONSEDUCATIONMaster’s or bachelor’s degree in cybersecurity, management information systems, computer science, or relevant disciplineEXPERIENCEExperience conducting audits against standardsWork experience in an IT security or audit firm, related to NIST 800-53, NIST 800-171, and/or FedRMAMPCERTIFICATIONCurrently holds at least one of the following: CCSK, CISA, CISSP, or other relevant certificationSKILLSAbility to meet deadlines with a high degree of motivationThrives in a fast-paced environmentExcellent communication skillsAbility to work individually as well as collaborativelyWHAT WE CAN OFFER YOUUp to 50% out of town travelUnlimited paid time off planTechnology allowanceVirtual employmentVacation bonus401(k) plan with employer matchingEmployer paid life insurance and disability insuranceEmployer paid health, vision and dentalPaid Office closure December 24-January 1Generous paid holiday scheduleCertification reimbursementCompetitive bonus structureABOUT A-LIGNA-LIGN is a global cybersecurity and compliance firm that assists organizations of all sizes with the ever-changing cyber threat landscape, headquartered in Tampa, Florida. A-LIGN leverages our industry expertise to guide organizations towards security, compliance and privacy services that will enhance their information security to prevent cyber threats, and reduce risk, turning their security into a competitive edge. We are a licensed CPA firm, Qualified Security Assessor Company, HITRUST CSF assessor, accredited ISO 27001 certification body, and accredited FedRAMP 3PAO offering SOC 1: SSAE 18 Examinations, SOC 2: AT 101 Services, PCI DSS Assessment Services, FISMA Security Assessments, ISO 27001 Certifications, FedRAMP Security Assessments, HIPAA and HITECH Services and Penetration Testing and Vulnerability Assessments.COME WORK FOR A-LIGN!Email your resume and contact information to careers@a-lign.com!"}