{"jobID": "2685562921", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.americancentury.com", "Headquarters": "Kansas City, MO", "Size": "1001 to 5000 employees", "Founded": " 1958", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "132000", "jobDescription": " The Disciplined Equity Research Group at American Century Investments is looking for a savvy data scientist with a passion for the data-driven underpinnings of quantitative investing. The applicant will be part of a nimble and talented fintech team, working together towards innovation and investment success. The work you do will directly contribute to enhancing the team’s research capabilities and stock-picking algorithms, which underlie over $14 billion in assets under management.  In this role, you will contribute to a variety of research initiatives, which include information retrieval, text mining, and machine learning. You will also design complex data processes and build analytics tools impacting all levels of the quantitative investment process.  The position is based out of Mountain View, CA. ResponsibilitiesResearch and develop information retrieval techniques that add structure to unstructured dataImplement machine learning algorithms that extract meaningful economic insight from large data setsAnalyze stock-selection algorithms and portfolio construction methodologiesQualificationsB.S. or M.S. in Computer Science, Statistics, Applied Mathematics, Economics, Business, or other computationally intensive field5 years of hands on experience with unstructured data, web-scraping, machine learning, or natural language processingExperience with big data processing and cloud infrastructureAbility to aggregate, manipulate, and visualize complex dataQuantitative finance experience, including time-series analysis, financial databases for equities, and portfolio analysis/construction conceptsExperience with R, Python, SQL is preferred.Ability to communicate technical findings and work within a team environment We look forward to hearing from you! EOE Policy Statement: American Century Investments believes all individuals are entitled to equal employment opportunity and advancement opportunities without regard to race, religious creed, color, sex, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, gender, gender identity, gender expression, age for individuals forty years of age and older, military and veteran status, sexual orientation, and any other basis protected by applicable federal, state and local laws. ACI does not discriminate or adopt any policy that discriminates against an individual or any group of individuals on any of these bases."}