{"jobID": "2804509886", "jobLocation": "Parsippany_NJ", "jobTitle": "Environmental Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.rdkengineers.com", "Headquarters": "Andover, MA", "Size": "51 to 200 employees", "Founded": " 1897", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " OverviewNV5 (NASDAQ: NVEE) is a provider of professional and technical engineering and consulting solutions to public and private sector clients in the infrastructure, energy, construction, program management and environmental markets. NV5 is an ENR Top 500 firm; we offer a full range of professional services in offices throughout the U.S.  NV5 is a multidiscipline firm with Environmental Scientists, Geologists, Engineers, Planners and Architects dedicated to quality of life projects. This position provides excellent growth opportunity for candidates to work with a team of diverse professionals on variety of projects in the public and private sector. The candidate should have 2-3 years of experience. The candidate will initially be assigned to a specific project conducting field sampling and oversight activities located in the Central Jersey area. It is anticipated that the project will last for 10 months. After fieldwork is complete, the individual will be re-assigned to the Parsippany Office with the opportunity to work with different individuals on multiple projects.Responsibilities Familiar with the N.J.A.C. 7:26E, “Technical Requirements for Site Remediation (TRSR), N.J.A.C. 7:26C “Administrative Requirements for the Remediation of Contaminated Sites’ (ARRCS), NJDEP Field Sampling Procedures Manual (August 2005), and numerous NJDEP Guidance DocumentsSupport LSRP in the preparation of Site Investigation Reports, Remedial Investigation Workplans, Remedial Investigation Reports, Remedial Action Workplans, and Remedial Action ReportsPerform Phase I and II Environmental Site Assessments (ESA)Field investigations of contaminated soil and groundwaterOversight and assessment of drilling operations and classification of soilsPreparation of geological logs and groundwater contour mapsSub slab and indoor air vapor intrusion sampling and data interpretationQualificationsBacehor's Degree in Geology, Hydrogeology, Environmental Science or related disciplineStrong analytical and math skillsStrong written/verbal communication and organization/analytical skills40-hour OSHA HAZWOPER training and recent 8-Hour RefresherMust have a valid driver licenseLimited travel requiredLifting up to 50 poundsAdditional Experience:New York field sampling experience and knowledge of NYSDEC and NYC OER protocolsFamiliar with NYC E-Designation investigations and NYSDEC Cleanup StandardsNV5 offers a complete and competitive benefits package.NV5 provides equal employment opportunities (EEO) to all applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. NV5 complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training."}