{"jobID": "2725500686", "jobLocation": "Ann_Arbor_MI", "jobTitle": "AI Data Science Engineer II", "companyRating": "3.6", "companyInfo": {"Website": "www.tdameritrade.com", "Headquarters": "Omaha, NE", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (AMTD) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Fidelity Investments, E*TRADE Financial, Charles Schwab"}, "estimatedSalary": "76000", "jobDescription": "To all recruitment agencies: TD Ameritrade does not accept agency resumes. Please do not forward resumes to our job alias, TD Ameritrade employees or any other company location. TD Ameritrade is not responsible for any fees related to unsolicited resumes.  This position is responsible for prototyping and developing data science approaches that improve analytic capabilities. This individual will work with the Advanced Analytics team to identify opportunities where data science models can help produce better decision-making and outcomes for business and technology teams. The goal of this position is to identify and gain adoption of new concepts and technology in the areas of conversational AI, content analytics, fraud detection, and others. The individual is expected to grow his/her technical skill set by learning and applying new algorithms, especially deep learning approaches, and understanding architectural frameworks needed to bring solutions into production. Develop prototypes and approaches that leverage advanced statistical and machine learning algorithms, including neural networks and deep learning.Perform feature engineering from large, complex datasets.Work with the data development and architecture teams to design solutions for launching successful analytics prototypes into production.Work closely with different stakeholders and business functions (e.g., Marketing and Client Education) within TD Ameritrade to derive important business insights and decide how data science can help achieve objectives.Present to TDA stakeholders to demonstrate capabilities, value proposition, alignment to strategy, and how data science solutions can be deployed within the firm.Collaborate with application development, universities, and Advanced Technology Group to identify and develop new analytical capabilities for the firm.Document technical design and data engineering approaches.Help develop a communication strategy for the launch and adoption of new capabilities.Participate in Think-Offs and Hackathons to demonstrate disruptive capabilities.Attend and present in data science conferences and meetups, and contribute to industry trends as it relates to advanced analytics and data science.Work in an agile and iterative manner to foster innovation.Graduate degree in a quantitative field (e.g., Statistics, Engineering, Math, Physics, Chemistry, etc.)Proficient programming capability in Python and unix/shell scripting2+ years related work experienceStrong experience with advanced analytics, data science, and/or mathematical modelingExperience with deep learning and natural language processingKnowledge in data engineering, databases (e.g., SQL, MongoDB), and platform architectureExcellent communication and collaboration skills to work across multiple groups within the organizationExperience working on an Agile team"}