{"jobID": "2707893772", "jobLocation": "Whitehouse_TX", "jobTitle": "Research Scientist, Trace Organics", "companyRating": "2.6", "companyInfo": {"Website": "www.intertek.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (ITRK) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " UL"}, "estimatedSalary": "59000", "jobDescription": "Title Research Scientist, Trace Organics  28-Mar-2018 Job DescriptionIntertek is a leading provider of quality and safety solutions serving a wide range of industries around the world. From auditing and inspection, to testing, quality assurance and certification, Intertek people are dedicated to adding value to customers' products and processes, supporting their success in the global marketplace. Intertek has the expertise, resources and global reach to support its customers through its network of more than 1,000 laboratories and offices and over 42,000 people in more than 100 countries around the world.  An opportunity has arisen for a Research Scientist to join this global organization within the Trace Organics work team of Intertek Whitehouse located in Whitehouse, New Jersey. The team utilizes state of the art Orbitrap instrumentation to support and solve complex analytical problems primarily focused on extractables and leachables. If you are a looking for an opportunity to work with and lead an expert team of accomplished scientists focused on solving difficult technical challenges, we want to talk with you. Job Description Performance at the Research Scientist level requires independent execution of non-routine projects with advanced laboratory equipment. The requirements for our Research Scientist level contributors fall into three segments – Technical, Leadership, and Customer. A brief outline of the responsibilities for this role is shown below.  Leadership  · Actively participates in planning the strategic direction of the team  · Leads and directs the work of others  · Handles Performance Management for junior and senior staff members  · Is responsible for completing performance reviews of staff  Technical  · Functions independently as a Research Scientist in the direction and execution of studies in compliance applicable regulations and industry best practices (cGMP, CFR, USP, PQRI, BPOG, etc.)  · Primary job functions require a wide degree of creativity and judgement  · Relies on extensive experience and judgement to plan and accomplish goals  · Is a recognized expert in the field of Trace Organics (Extractables and Leachables) and is a Subject Matter Expert  · Demonstrates expertise with a variety of concepts, practices, procedures and regulations  · Considerable experience with LC/MS, GC/MS analyses  · Extensive experience with advanced sample preparation techniques  · Knowledgeable with existing regulations (FDA, Food Contact, etc.)  · Provides consultation on complex projects and is the top-level contributor/specialist  · Consistently demonstrates technical innovation to solve customer problems  · Is a focal point for complex customer problem-solving teams.  · Publishes industry articles, creates services literature and/or presentations to drive business growth  · Leads selection of instrumentation and software solutions  Customer  · Engages in communication with customers to solve complex, multi-lab projects  · Leads teams to solve complex, multi-lab projects  · Contributes to sales team activities by developing quotation content  · Engages in customer communication at both strategic and tactical levels  · Seeks to build larger, more collaborative relationships with customers to enable long term growth  · Acts as the single point of contact (SPOC) for designated customers with the responsibility to focus on project management and building the relationship.  · Visits and/or hosts customer visits to develop opportunities Job Requirements · Knowledge of analytical chemistry, demonstrated through earning a Master’s or PhD Degree in chemistry or related field, or having 5-10 years of related industry experience in an analytical laboratory  · Knowledge of laboratory safety precautions and protocols for safe handling and the disposal of hazardous agents/reagents, chemicals and materials  · Ability to understand and effectively communicate technical and business information, both oral and written to others, including co-workers, supervisors, clients, and vendors  · Excellent organization skills/multitasking, project management, and communication skills.  · Excellent teamwork ability to contribute to multi-technique solutions to complex problems  · Ability to define problems, collect data, establish facts, and draw conclusions.  · Strong problem-solving abilities and analytical skills, including data interpretation/analysis.  · Advanced mathematical skills may include: algebraic functions, calculus, statistics, and modeling.  · Strong computer skills (Windows, MS Office, data acquisition software)  · Ability to troubleshoot major instrument problems  · Ability to work varied and extended hours/days, as business dictates ABOUT INTERTEK A career with Intertek means joining a global network of professionals dedicated to bringing quality and safety to life. Our vision is to become the world’s most trusted partner for Quality Assurance and we offer our employees the chance to make an impact with attractive growth opportunities in this industry on a global scale.  We offer a salary and benefit package competitively placed within the local market, including medical, dental, vision, life, disability, 401(k) with company match, tuition reimbursement and more.  We are an Equal Opportunity Employer and do not discriminate against applicants due to veterans status or on the basis of disability. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex or national origin.Auto req ID14555BRCountry United States State or Province New Jersey City Whitehouse "}