{"jobID": "2606090249", "jobLocation": "San_Francisco_CA", "jobTitle": "MANAGING CONSULTANT- DATA SCIENCE", "companyRating": "4.2", "companyInfo": {"Website": "www.opiniondynamics.com", "Headquarters": "Waltham, MA", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " MANAGING CONSULTANT- DATA SCIENCEOpinion Dynamics seeks a Managing Consultant to join our Data Science group. In this role, you will work with the Opinion Dynamics’ Data Science group and staff around the country to solve complex research and energy policy questions such as how to effectively measure the impact of energy efficiency or demand response programs on the electricity grid.ResponsibilitiesTechnical ResponsibilitiesThe successful candidate for this position has three to five years’ experience working as a statistician, including developing sample designs and regression models in a work project context. He or she has demonstrated expertise in cleaning, processing, and managing large datasets using statistical packages such as Stata or R. The successful candidate has the ability to serve as a project manager, including training and mentoring junior staff, developing project scopes, and developing and managing to project budgets. He or she is comfortable drawing appropriate and actionable inferences from data, developing compelling visual presentation of the data, and presenting it to clients. Desirable but non-required qualifications include industry knowledge about the energy efficiency and program evaluation field, building energy modeling experience, and knowledge of building and mechanical systems.  The Managing Consultant hired for this position will become an essential part of multiple project teams at Opinion Dynamics, helping to deliver high-quality, transparent analysis and associated reporting across an array of analytical contexts and challenges in the energy field.QualificationsWe are looking for candidates with strong critical thinking skills, impeccable detail-orientation, and a commitment to conducting their work with the highest level of integrity. Specific requirements for the position include: Required:Master’s degree, or Ph.D. in statistics, quantitative methods in social science, or a related fieldThree to five years’ work experience, ideally evaluating energy efficiency programs and/or performing other forms of longitudinal statistical analysisExperience cleaning and manipulating large datasets (100,000+ records) using one or more statistical packages (Stata, R, SPSS, SAS, SQL) and drawing well-supported conclusionsProfessional experience in sampling methods and design, including weighting methods based on sample design (SRS, multi-stage, etc.) and objective (disproportionate sampling, non-response correction, etc.)Professional experience in causal data analysis using multivariate modeling techniques preferably using Stata or RStrong persuasive and analytical writing skillsStrong verbal communication skillsAbility to juggle and prioritize multiple tasks and deadlines simultaneously and flexiblyBeneficial:Experience calculating demand response load/quantitative impacts using Advanced Metering Infrastructure (AMI) data or log data and regression modelsExperience using Bayesian statistical methods, Non-parametric methods, Multi-level modelingFamiliarity with machine learning techniques for pattern recognition and predictive analyticsExposure to building energy modeling and/or building and mechanical systemsUnderstanding of data streams resulting from logger equipmentStrong programming skills in one or more programming languages (e.g., R, python, JAVA, SQL, go, Scala)Software development experienceExperience with databases (Relational: e.g., MS SQL Server, PostgreSQL, MySQL; Non-relational data stores: e.g., HBASE, NoSQL, Riak)Knowledge of types of data file formats and how to import and process themExperience with model validation techniquesNetworking skills for making new client contacts at conferences and eventsAbout Opinion Dynamics: Opinion Dynamics advances knowledge to address emerging energy and social issues through sound and insightful research. Our inter-disciplinary team of consultants provides actionable research to support the needs of our clients, which include electric and gas utilities, regulators, and stakeholders. Our research and consulting services inform program planning and design, performance assessment, and optimization of energy efficiency, demand response, and renewable energy programs. Our company fosters innovative thought, collegiality and growth opportunities for our employees. The Data Science Group within Opinion Dynamics is especially focused on technical, quantitative aspects of our analysis services. How To Apply: To be considered for this position, please submit your cover letter (required) and resume with “Data Science — Managing Consultant” in the subject line. If contacted, please be prepared to provide data analysis and writing samples that clearly demonstrate your experience and aptitude in these areas, as well as two or more references who can speak to your experience, work orientation, and work ethic.  To be considered for this position, please send your cover letter and resume to: Careers: Managing Consultant- Data Science  careersCA@opiniondynamics.comNo phone calls, please. Only those resumes accompanied by a cover letter will be considered. Opinion Dynamics will not provide sponsorship for work authorization for this position. Opinion Dynamics is an affirmative action-equal opportunity employer."}