{"jobID": "2802056720", "jobLocation": "Lodi_CA", "jobTitle": "Maintenance Engineer (Lodi, CA)", "companyRating": "3.9", "companyInfo": {"Website": "www.ssi-schaefer.us", "Headquarters": "Charlotte, NC", "Size": "201 to 500 employees", "Founded": " 1937", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Dematic, Daifuku, Orbis"}, "estimatedSalary": "56000", "jobDescription": " OverviewGet your logistics together. Evolve here. Schaefer Systems International provides storage, materials handling, logistics and waste technology solutions to businesses throughout North America. We design and manufacture state-of-the-art intralogistic storage and picking solutions for all types of industries as well as plastic containers, pallets, and waste and recycling carts. Headquartered in Charlotte, North Carolina, Schaefer Systems International is part of the SSI SCHAEFER Group, a global leader in logistics and materials handling founded in 1937 with offices and plants in over 50 different countries. For more information, visit http://www.ssi-schaefer.com.  The Maintenance Engineer is responsible for maximizing production efficiency with effective preventative maintenance programs and handling repairs to injection molding machines and auxiliary equipment. Perform general facility maintenance as required.Responsibilities Diagnose and repair issues related to injection molding machines and other facility equipment.Proper use of a wide variety of powered and non-powered hand tools including electrical diagnostic equipment.As required, be forklift and aerial lift trained/certified.Use the overhead crane according to OSHA requirements.Assist with set-up and mold changes of injection molding machines.Perform preventive maintenance on equipment according to prescribed schedules and complete assigned work orders as directed, utilizing CMMS system for record accuracy.Perform duties in compliance with prescribed safety and housekeeping standards.Perform additional duties as assigned by management.Identify and communicate the need for spare or replacement parts.Follow safe job procedures, including, but not limited to:Lock out/tag outFall protectionElectrical safe work practicesPersonal protective equipmentQualificationsA minimum of 2 years industrial maintenance experience. 2 year degree in an electrical/engineering field or equivalent combination of education and experience.Experience in Injection Molding / plastics processing equipment preferred but not an absolute requirement.Must possess the technical skills to troubleshoot and repair complex manufacturing equipment with control circuitry, high and low voltages, hydraulic, pneumatic, and mechanical systems. Must be able to interpret related schematics and blueprints.Must be able to be on your feet all day and safely lift 50 pounds. Must possess good balance and agility related to climbing ladders, platforms, etc.Successful candidate must possess good interpersonal and communication skills and be well suited to work in a team environment.Requires above average reasoning and math skills along with computer skills.Must possess excellent mechanical comprehension and mechanical aptitude.Must be capable of completing projects with minimal supervision."}