{"jobID": "2824451193", "jobLocation": "Chicago_IL", "jobTitle": "Senior Analyst/Data Scientist, Retail Analytics", "companyRating": "2.4", "companyInfo": {"Website": "www.catalina.com", "Headquarters": "Saint Petersburg, FL", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Google, Datalogix, Coupons.com"}, "estimatedSalary": "127000", "jobDescription": "WHY CATALINA Catalina’s personalized digital media connects shoppers to the brands we know they want. We do this by delivering only the most relevant ads and offers from their home to the aisle. And only Catalina knows the evolving purchase history and individual needs of more than three-quarters of (280 million) American shoppers. With the world’s largest shopper purchase history database driving all personalized media across our networks, Catalina drives lift and loyalty for the world’s leading CPG brands and retailers. We target consumers with the right behavior-based message when it’s most impactful via the channel that’s most likely to reach them — digital or in the store. OUR TEAM The Retail Analytics team is responsible for providing analyses, insights, solutions and recommendations that address the business needs of the Catalina retail sales team or the retail client, in support of internal strategic projects and external retailers. These analyses, insights and recommendations—whether based on standard reports or custom analyses—should serve as the basis for discussions with the retail sales team and client, provide actionable insights and recommendations that address client strategies, initiatives, and objectives.  The position reports to the Senior Director of Retail Analytics. WHAT YOU WILL BE DOINGSupport current business by enhancing existing machine learning algorithm.Driving new business by developing deep learning techniques to create solutions.Apply strong programing and data engineering skills to implement machine learning algorithm in production to accelerate new capabilities.WHAT YOU BRING TO THE TEAM1-3 years of experience with the following: Advanced programming languages skills in R and python, Scala and Apache spark required.Experience in building databricksAdvanced ANSI SQL and SparkSql skills.Experience in building machine learning algorithms and implementation in production environment using Scala/Spark.Familiar with various machine learning and deep learning techniques including supervised machine learning model e.g GBM, Neuron net, Collaborative filtering, Word2Vec;Experience in Tensor Flow and KerasFamiliar with cloud computing and usage.Java programming preferred but not requiredPossessing mindset of data engineer as well as business acumen; ability to translate business concept into ML/AI requirements.ADDITIONAL PREFERRED SKILLSPhD Degree in Computer Science, Statistics, Math, Economics, Marketing Research or other quantitative oriented fields (Decision Sciences, etc.) preferredExperience in a CPG, retail or data-driven environment helpfulGood communication and presentation skills a plusCATALINA CORE VALUESBe a trusted partner: Act with integrity and positive intent  Focus on the customer: Keep the needs of both internal and external customers as well as  consumers front and center Act like an owner: Think holistically about how your role helps fulfill our Mission Be innovative: Share and scale the best ideas regardless of origin Strive for simplicity: Add meaning and eliminate complexity  Value personal and professional growth: Contribute to an environment that enables  individual, team and organizational success  The intent of this job description is to describe the major duties and responsibilities performed by incumbents of this job. Incumbents may be required to perform other job-related tasks other than those specifically presented in this description.  All duties and responsibilities are essential job functions and requirements and are subject to possible modification to reasonably accommodate individuals with disabilities.  We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace. Note to Recruiters and Placement Agencies: We do not accept unsolicited resumes from outside recruiters /placement agencies. Catalina will not pay fees associated with resumes presented through unsolicited means."}