{"jobID": "2812118821", "jobLocation": "Austin_TX", "jobTitle": "Senior Scientist, Data Science Architect", "companyRating": "3.0", "companyInfo": {"Website": "www.asuragen.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Luminex, Natera"}, "estimatedSalary": "112000", "jobDescription": " Asuragen is seeking an exceptionally talented individual with strong software development and data science abilities to join its Bioinformatics team. This role provides the opportunity to champion the development of computational infrastructures that underlie data science and machine learning algorithm development within R&D; in support of Asuragen assay analysis modules. The role will directly shape, design, and implement R&D; facing software interfaces that couple molecular assay development with algorithm development. The role will also engage in the development of new machine learning algorithms and paradigms in support of new assays and platform expansion. The position is embedded within a highly cross-functional R&D; environment, interacting with other scientists and both internal stakeholders and external clients to deliver impactful molecular diagnostics solutions in the areas of oncology and genetic disease. Key Requirements and Duties: Conceives, designs, develops, and documents novel end-to-end computational solutions in support of Asuragen’s R&D; initiatives and products.  Defines, organizes, and champions new computational research directions and process improvement initiatives in an engaging, transparent, and accountable manner.  Leads the authorship of successful grants, patents, technical reports, and publications from concept to conclusion.  Maintains expert status in machine learning and data science while seeking to achieve expertise in other industry-relevant areas of specialization. Routinely demonstrates ability to share expertise that helps the personal and professional growth of other scientists.  Takes an active role in leading projects. Builds and develops networks of productive, collaborative interactions across functional groups in the company.  Effectively communicates complex scientific topics and project progress through high-impact internal and external presentations; adapts communication style to meet needs of a diverse group of stakeholders. Minimum Education/Experience Requirements: PhD in Bioinformatics, Physics, Mathematics, Statistics, Computer Science or comparable technical and quantitative field or equivalent industry-relevant experience.  Publication, grant, and/or product development record strongly considered.  Full-stack experience developing scalable data science tools and architectures.  Strong working knowledge of data science enabling modules such as (keras, tensorflow, scikit-learn, numpy, scipy), architectures, and design patterns.  Working knowledge of data warehousing and data lake enabling frameworks and data representation paradigms including relational databases, NoSQL databases, and object storage.  Expert working knowledge of Python and strong JavaScript skills.  Excellent written and verbal communication skills. Preferable Skills and Attributes: Experience with Vagrant, Ansible, Docker, Python Flask, and SQLAlchemy.  Deep theoretical and applied understanding of machine learning concepts including unsupervised learning, supervised learning, cross-validation and bootstrapping, Bayesian inference, and deep/representation learning (CNNs, RNNs, autoencoders).  Working knowledge of AWS - EC2, S3, DynamoDB, and Redshift."}