{"jobID": "2692641449", "jobLocation": "Dearborn_MI", "jobTitle": "Data Scientist Modelling", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Title: Data Scientist – Modeling Description: STG is a SEI CMMi Level 5 company with several Fortune 500 and State Government clients. STG has openings for Data Analytics Scientist. This position is based in Dearborn, MI for a Fortune 500 Automotive Manufacturer. This position is expected to be long term. STG will provide immigration and permanent residency sponsorship assistance, if needed. **No 3rd Party vendors – this client does not allow sub-contracting.Skills Required:A data analytics role including running queries, compiling data, and manipulating data from separate sources to form unified sets for analysis.Predictive analytics including machine learning and experience writing algorithms in Python, Scala, or similar languages.Big Data technologies in the Hadoop ecosystem (HDFS, MapReduce, Hive, Spark, Hue, Zeppelin, etc.), and command line experience with loading and manipulating files within HDFS.Optimization techniques. Education Required:PhD in a quantitative field, such as Engineering, Math, Statistics, or Computer SciencePreferred:Handle data flow from High Performance Computing (HPC)/s thru Hadoop,use Hive to process data in Hadoopingest data, store and analyze locally in one or both of the 2 approaches below with one or more of the Software tools listedDynamic i. Spark ii. Scala iii. PysparkStatic i. Matlab ii. Python iii. AlteryxDisplay the results dynamically in QlikView which is developed in parallel with all of the above Resume Submittal: please email a word formatted resume to Shweta Huria at shuria@stgit.com or contact at: 248.918.4720. In the subject line of the email please include: First and Last Name – Data Scientist - Modeling (Dearborn, MI). Corporate Information: Established in 1985, Systems Technology Group (STG) is a fast growing IT consulting and systems integration services firm. STG is a SEI CMMi Level 5 company with expertise in Application Development, Application Management, Web Services (SOA), Data Warehouse, Business Intelligence / Analytics, Wireless Solutions, Legacy migrations and Project Management. STG is proud that clients like Ford Motor Company, Sears Corporation, Chrysler, LLC, Mercedes Benz, United Health, General Motors, State of Texas, State of Michigan, State of Minnesota, State of Georgia, and others trust their IT services needs to STG. STG has offices in North America, Europe and India to service our clients global IT needs. STG offers a competitive compensation and benefits package including health coverage, vision, dental, life insurance, disability insurance, 401K, paid vacations and paid holidays. For more information about STG, please visit us at www.stgit.com.provided by Dice PhD required, Hadoop, Hive, Spark, Qlikview"}