{"jobID": "2737240341", "jobLocation": "San_Francisco_CA", "jobTitle": "Business Intelligence / Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.juul.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "THE COMPANY: JUUL's mission is to improve the lives of the worlds one billion adult smokers by driving innovation to eliminate cigarettes. JUUL is the number one US-based independent e-cigarette, selling over four million JUULpods per month. Headquartered in San Francisco and backed by leading technology investors including Tiger Global, Fidelity Investments and Tao Invest LLC, JUUL Labs is disrupting one of the worlds largest and oldest industries.  Were an exceptional team with backgrounds in technology, healthcare and biotech, and were growing rapidly to deliver on our mission. Were actively looking to hire the worlds best scientists, engineers, designers, product managers, supply chain experts, customer service and business professionals. ROLE AND RESPONSIBILITIES: The Business Intelligence / Data Analyst will be responsible for performing complex financial and operational analysis to support the Supply Chain Organization in meeting strategic business objectives. This position will report to the Director of Strategic Sourcing within the Supply Chain Organization. Identify cost reduction opportunities primarily focused on product cost but also other areas of the company.Build and maintain a cost database for all products.Establish should-cost models and provide recommended cost positions to support supplier negotiations.Track and evaluate cost reduction goals and metrics.Develop capital investment models and perform ROI analysis.Develop cost review presentations and present to Supply Chain team members and Executive Management.Participate in cost reviews with management, internal teams, and supplier representatives.During NPI phase, the Business Intelligence / Data Analyst will work with Engineering and Marketing teams to model cost feature/trade-offs and estimate fully loaded COGS.General strategic planning support for the Supply Chain Organization.PERSONAL AND PROFESSIONAL QUALIFICATIONS:BS degree in financial or technical field.5+ years of experience in analytical role at a top tier organization including: strategy consulting (eg - McKinsey, BCG, Bain) , investment banking (Goldman Sachs) or hardware manufacturing (eg - Cisco, Apple, Amazon).Previous experience in Cost Modeling.Excellent oral and written communication skills.Strong analytical skills.Strong attention to detail.Mastery of Microsoft Office products (Word, Excel, PowerPoint) and/or corresponding Google Docs.Ability to develop compelling presentations, including data synthesis.Ability to work in a fast paced environment.Ability to work with all levels of the organization.JUUL LABS PERKS & BENEFITS:A place to grow your career. Well help you set big goals - and exceed themPeople. Work with talented, committed and supportive teammatesEquity and performance bonuses. Every employee is a stakeholder in our successBoundless snacks and drinksCell phone subsidy, commuter benefits and discounts on JUUL productsExcellent medical, dental and vision benefitsLocation. Work in the heart of San Francisco, one of the worlds greatest cities Vapor, JUUL, Work Culture, Fast Paced, Start-up, Growth, Vape, Technology, Software, Hardware, Consumer Electronics, Manufacturing, Design, Product, Disruptive, Revolutionary, Cutting Edge, App, Android, eCommerce, B2C, San Francisco, Bay Area, IoT, San Jose, Los Angeles"}