{"jobID": "2835218692", "jobLocation": "Pasadena_CA", "jobTitle": "Machine Learning Scientist with Audio DSP background", "companyRating": null, "companyInfo": {"Website": "www.idealab.com", "Headquarters": "Pasadena, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position at ObenMachine Learning Scientist with Audio DSP background Collaborate with senior machine learning researchers, engineers and speech processing researchers. Provide technical expertise to address supervised and unsupervised learning problems in an applied research and development environment. Develop & deploys modern machine learning and statistical methods (CART and Random Forests, clustering and classification algorithms, Bayesian models, neural nets, SVM etc.) for finding patterns/models from audio signals. Familiarity with large data sets, cloud based development and deployment, open source practices and frameworks and experience in putting an application into production is desirable. In this role you will:Provide technical expertise and execution know-how to the design of machine learning algorithms/solutions to solve ultra-challenging problemsDetermine methodologies needed; apply such methodologies (e.g. neural nets, CART, Bayesian methods, etc.) on speech processing and related research domains.Define data needs, evaluate data quality, perform and critique appropriate statistical analyses using software such as R, Python, SAS, MATLAB, and/or Splus. Explore, determine & develop technical approaches to be used and apply them on major challengesInterface closely with Oben Business counterparts to understand/define requirements, domain knowledge/models, and data needs.Effectively communicate technical analyses and results.Work with offshore and in-house technical and business teamsDesired Skills and Experience:Doctorate (Preferred) or Master’s degree in Computer Science, Mathematics, Applied Physics, Applied Statistics or in EngineeringFoundation in theories underlying machine learning techniquesAdvanced knowledge in audio digital signal processing and speech processingAbility to apply theoretical or experiential knowledge on machine learning to solve problemsExperience in developing machine learning packages with programming languages such as Java, Python, C++Experience with PhP/MySqlExperience in coding for Operating Systems such as Android, iOS, Mac, Linux and WindowsMust be willing to work out of an office located in Pasadena, CADesired Characteristics:Experience with designing and prototyping algorithms on different kinds of dataExperience in applying machine learning to different kinds of problemsKnowledgeable with relational databases & SQL concepts and Compute platforms like MatlabInterest/Experience in large data sets, cloud based architectures and deployment frameworks for machine learning algorithmsOpen source efforts in machine learningStrong analytical skills, with demonstrated reputation including publications/development/deployment experienceExcellent teamwork and customer focusExcellent written and verbal communication skillsAbility to take initiative and deliver tangible results under deadlineAbility to work independently with minimal directionFlexibility of working across all functions/levels as part of a teamInterest in working for a young companyApplication Requirements:Detailed resume and/or LinkedIn profileLinks to any research/papers you have been an instrumental part of and are proud ofName of instructor/adviser, if any along with link to their profileCover Letter identifying your five favorite apps on your phone"}