{"jobID": "2757396573", "jobLocation": "Washington_DC", "jobTitle": "Staff Scientist, Wildlife Conservation", "companyRating": null, "companyInfo": {"Website": "www.nfwf.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Travel & Tourism", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Staff Scientist - Wildlife Conservation  Summary Working out of the Foundation’s Washington, D.C. office, the Staff Scientist – Wildlife Conservation will be a key member of the Science and Evaluation team and will work to ensure that NFWF’s wildlife conservation efforts have a robust science foundation and are designed to achieve measurable conservation outcomes.  NFWF’s portfolio of terrestrial wildlife programs requires a subject matter expert in wildlife ecology, management and conservation, focusing on both game and non-game species (with an emphasis on mammals and other non-avian species). The ideal candidate will be versed in principles of landscape conservation design, have strong analytical capabilities with deep knowledge of wildlife management issues including population modelling, habitat management (especially forest, grassland and watershed practices), landscape connectivity, endangered species recovery, species assessments, health and disease, and the human dimensions aspect.  The staff scientist will work with the conservation planning and evaluation team to develop monitoring and evaluation approaches that support rigorous assessments of conservation impact. As such, s/he is responsible for ensuring the terrestrial wildlife component to NFWF’s programs is science-based, aligning project portfolios with conservation outcomes, developing wildlife monitoring plans, providing technical assistance to programs and grantees as needed, reviewing reports from grantees and contractors to ensure the quality of information being reported, drafting recommendations for staff and Board action, reviewing request for proposals, contributing to fundraising efforts, and closely coordinating program efforts with the Director for Birds and Wildlife Conservation, with the Science and Evaluation team and other Foundation staff.  ESSENTIAL DUTIES AND RESPONSIBILITIESProvide subject matter expertise for the Foundation on all aspects of terrestrial wildlife conservation, including but not limited to species management and assessments, landscape connectivity, wildlife policy, endangered species recovery, harvest, population modelling, invasive species management, wildlife health and human dimension issues.Work with the science and program staff to ensure rigorous scientific foundation of the design and implementation of terrestrial wildlife conservation strategies for NFWF.Work with science and program staff to develop measures of success/ impacts of NFWF’s conservation programs.Lead collaborative efforts to collect, organize, analyze, and disseminate significant amounts of conservation information with attention to detail and accuracy.Establish terrestrial wildlife science-based program outcomes, including measurable goals and objectives in coordination with the Science and Evaluation team and program leads.Work with the program leads and advisory committees to solicit, review and develop funding recommendations that align with the science based outcomes and strategies of the program.Serve as spokesperson for the Foundation on wildlife issues as needed.Prioritize, establish and maintain networks with the myriad organizations and interests engaged in wildlife science and conservation work.Keep abreast of scientific and policy developments that may impact efforts to promote wildlife conservation.Review and evaluate submissions by grant/contract recipients and applicants assuring that results are aligned with programs’ monitoring and evaluation plans.Track and monitor proposals and active grants/contracts that support NFWF’s science based approach, in coordination with the program leads and project administration team.As needed, coordinate the program’s external technical review of proposals in accordance with Foundation policy.Propose and conduct site visits in accordance with Foundation policy.SECONDARY DUTIES AND RESPONSIBILITIES Support the development of public and private partnerships to secure operational and programmatic funding for NFWF Programs in coordination with the VP Science and Evaluation, Chief Conservation officer, Development and Government Relations Staff, and Partnership Offices.Perform other duties as assigned by the Director for Birds and Wildlife.MINIMUM QUALIFICATIONS (EDUCATION, EXPERIENCE, SKILLS) MSc or equivalent experience with concentration in wildlife management or wildlife ecology preferred.Experience working on wildlife conservation issues across a breadth of terrestrial habitats, on game and non-game wildlife species (preferably large mammal species).Strong data management and analytical skills, including statistics, preferred.Experience in using geographic information systems software (e.g. ArcGIS), preferred.Experience conducting research as part of a multidisciplinary project or team.Experience working with key stakeholders from federal or state wildlife/ natural resource management agencies, academia and not-for-profits.Professionalism and leadership qualities.Driven by a desire to meet and exceed goals.Thrives in a rapidly changing environment.Strong listening and communication skills.Exceptional ability to organize and prioritize work and meet deadlines. COMPENSATIONCommensurate with experience.LOCATIONWashington, DCApplication Notes: Please submit a cover letter describing your interest and qualifications, and resume.  Applicants must be currently authorized to work in the US on a full-time basis.Equal Opportunity Statement - National Fish and Wildlife Foundation complies with all applicable federal, state and local laws in its commitment to being an equal opportunity employer. The Foundation does not discriminate against applicants or employees on the basis of race, color, religion, age, sex, national origin, ancestry, marital status, personal appearance, citizen status, disability, sexual orientation, gender identity or expression, pregnancy, child birth or related medical conditions, family responsibilities, matriculation, genetic information, political or union affiliation, veteran status or any other status protected by applicable law. Disclaimer - The statements contained herein are intended to describe the general nature and level of work to be performed by the employees in these positions. The statements are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of a person in each position. Other responsibilities, duties, and skills may be assigned and management retains the right to add or change the responsibilities, duties, and skills at any time. "}