{"jobID": "2803583887", "jobLocation": "Princeton_NJ", "jobTitle": "Senior Research Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.  This Senior Research Scientist will be conducting a wide range of preclinical in vivo studies of the immunological mechanisms of novel pharmacological agents in the areas of autoimmunity and immuno-oncology drug discovery. Looking for previous extensive hands-on experience with various models of autoimmunity and immunological mechanisms. The qualified candidate will possess the ability to work in a team environment to support preclinical drug discovery programs from target identification/validation through IND enabling activities. Job ResponsibilitiesExtensive and diverse hands-on experience with various preclinical in vivo models of rheumatoid arthritis, inflammatory bowel disease, lupus and immunological pharmacodynamic responses, with excellent skills in rodent dosing and tissue collection.Ability to independently design, coordinate and execute in vivo studies. Excellent communications skills with ability to effectively communicate both oral and written scientific results.Organized and disciplined about record keeping, with proficiency in Microsoft Office. Experience with ex vivo analyses (e.g., primary cell and tissue explant cultures, flow cytometry, ELISA) would also be of value.Willing to split weekend and holiday hours with peers on a rotational basis.Ability to multitask and meet deadlines in a fast-paced drug discovery environmentRequirementsB.Sc. or M.S. in the Biological Sciences or closely related field with a minimum of 10 years experience, preferably within the Pharmaceutical/Biotechnology sector.Strong organizational skills, motivated to excel, attentive to detail. Dedication to working in a team-oriented environment to contribute to shared project and organizational goals."}