{"jobID": "2821610268", "jobLocation": "Santa_Fe_Springs,_Los_Angeles_CA", "jobTitle": "IT - Data Analyst, Entry Level", "companyRating": null, "companyInfo": {"Website": "www.sohnen.com", "Headquarters": "Santa Fe Springs, CA", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Sohnen Enterprises, Inc. is considered by many to be the pioneer in the field of Consumer Products Returns Management, Product Refurbishment and Sales of Refurbished products. Founded in 1971 Sohnen Enterprises has achieved sustained growth throughout the years due to its dedicated team members and by embracing the culture of creativity and out of the box thinking. We value our employees as our greatest asset! As a result, Sohnen is the largest independent company in North America involved in the refurbishment and reprocessing of consumer products. Our Corporate Headquarters operates out of 175,000 sq ft building located in an industrial park in Santa Fe Springs CA. Sohnen de Mexico, our maquiladora, occupies three buildings, one of which is a recently built highly automated LEED certified 180,000 sq ft facility. This combination of approximately 1,000,000 sq feet of state-of-the-art facilities allows us to receive, refurbish, warehouse, ship, and provide fulfillment services for our suppliers and customers. Position Summary Function as a Business Analyst with users throughout the organization to help define user needs as well as develop data processing and dataflow solutions. Assist with workflow streamlining and efficiency improvement efforts. Analyze and troubleshoot ERP system issues reported by IT system administrators and end users. Gain a thorough understanding of business practices and procedures in order to design and develop reports. ESSENTIAL KNOWLEDGE, SKILLS, AND ABILITIES: Necessary skills include: organization, strong oral & written communication, strong interpersonal (team player), mathematics, problem solving, analytical  Proficiency with industry-standard productivity tools such as Microsoft Word, Excel, and PowerPoint.  Proficiency with industry-standard database platforms, such as Microsoft SQL or Oracle SQL.  Knowledge of the drill-down reporting tools, SQL Reporting Services, etc.  Knowledge of report development and modification (also requires an understanding of business requirements and priorities)  Ability to manage multiple tasks with confidence  Accountable and a self-starter Benefits Competitive Salary  401K Match  Health, Life, Dental and Vision Insurance  PTO/Vacation Benefits  Employee Owned Company (ESOP)  Apply to this posting today with your resume for immediate consideration for this position."}