{"jobID": "2791238518", "jobLocation": "Round_Rock_TX", "jobTitle": "Sr. Data Informatics Analyst", "companyRating": null, "companyInfo": {"Website": "www.gomedigap.com", "Headquarters": "Round Rock, TX", "Size": "1 to 50 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Sr Data Informatics Analyst As the GoMedigap Sr Data Informatics Analyst, you will work with the assistance of a talented technical team and help our leaders analyze the critical drivers of the business in their areas of responsibility producing reports/dashboards to help guide them in their decision-making. Critical to this role is having the ability to move complex data frameworks to simple and easy to understand visualizations so consumers of these reports can interpret and make smart decisions quickly and confidently. Strategic FunctionsPartner with Development team to enable access to strategic datasets for automated, ad hoc, and strategic reporting purposesSupport Business Intelligence Analysts (BIAs) to facilitate reporting and analysis requirements of businessTroubleshoot technical issues associated with application/reporting requirements eg, technical escalation point for BIAsLead strategic initiatives to optimize reporting support across business functions (sales, enrollment, corporate)Critical Technical Functions: This is a technical and hands-on position that requires excellent knowledge of MySQL Relational Database Management Systems (RDBMS).  This person is responsible for maintaining the database for our primary CRM, Mediapp, including managing day-to-day operations which may include: Responding to trouble tickets,Working with development staff to optimize existing queries,Providing data sets to internal corporate clients on request, researching and resolving issues with metrics, data and compensation,Researching and resolving issues with insurance quotes,Partnering with the software development team to enable access to strategic datasets for automated, ad hoc, and strategic reporting purposes,Supporting Business Intelligence Analysts (BIAs) to facilitate reporting and analysis requirements,Troubleshooting technical issues associated with application/reporting requirements (e.g. technical escalation point for BIAs), lAssisting with lead vendor integration setup & issues, optimizing existing data sets through the addition of indexes or other means,Managing backup and recovery plans for databases,Provide after hours on-call support. Minimum Requirements: 4+ years of experience as a MySQL DBA.4+ years of experience authoring and optimizing complex SQL queries.2+ years of business analytics experienceExperience maintaining security in an enterprise environment by ensuring compliance to corporate standards, policies, and procedures.Excellent troubleshooting, research and problem-solving skills.Self-motivator with the ability to work independently.Ability to multitask in a fast-paced environment.A positive attitude and excellent customer service, communication and organizational skills.Experience with creating documentation for both internal IT and end-users. Preferred Requirements: Experience with HA environments.Experience with Amazon AWS.Experience with PCI/HIPAA regulations.About GoMedigap GoMedigap, an eHealth company, is one the largest and fastest growing Medicare supplement agency call centers in the country, a winner of the 2018 Best Places to Work in Central Texas, and a 2017 recipient of the Better Business Bureaus exclusive Torch Award for ethics in business.  Our clients love us because we help them understand and feel comfortable with the Medicare supplement shopping process. We do this by taking a consultative and educational approach and offering the best options for our clients from over 30 companies we represent.  You can get a great idea of what its like to work at GoMedigap by viewing the video on our Careers page: http://www.gomedigap.com/careers/. This company, its people and our mission are awesome and getting awesomer by the day. Yes, thats a word in our world.  Our mission is to treat our clients as if they were our own parents as we walk them through the process of buying a Medicare supplement plan and that approach reflects in our reviews:  5-star Rating and Top-Rated Company in the Insurance category on TrustPilot: https://www.trustpilot.com/review/www.gomedigap.com  A+ Rating with BBB: http://www.bbb.org/central-texas/business-reviews/insurance-companies/wealth-health-and-life-advisors-llc-in-round-rock-tx-90047504/ Why Do Our Employees Love Working at GoMedigap? Our employees get to work in a mission-oriented and highly positive work environment with meaningful values. They understand that their position matters to the company and their peers, but most importantly to our clients. You can sleep well at night knowing you contributed each day to making life better for others. Management not only treats employees with a high level of respect but enjoys developing team members to be prepared for future opportunities for advancement.  Employees are not only paid well, but have access to some pretty incredible benefits, including: Competitive base compensation + variable bonus based on performance of the company;Medical/Dental/Vision/FSA BenefitsLife InsuranceShort and Long-Term Disability InsuranceRetirement plan with company matchPaid Time Off9 paid holidays and birthday offGood work/life balanceAwards & recognitionFitness club reimbursementFrequent and fun company eventsThe privilege to just work with some awesome people on a mission! So, if you made it this far, and love what you just read, please submit your resume and a cover letter to be considered for this position. Please include your expected compensation range and when youd be available to start.  eHealth is an Equal Employment Opportunity employer. It is our policy to provide equal opportunity to all employees and applicants and to prohibit any discrimination because of race, color, religion, sex, national origin, age, marital status, sexual orientation, genetic information, disability, protected veteran status, or any other consideration made unlawful by applicable federal, state or local laws. The foundation of these policies is our commitment to treat everyone fairly and equally and to have a bias-free work environment."}