{"jobID": "2220873086", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.uptake.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "109000", "jobDescription": "What We DoUptake is a Chicago-based predictive analytics SaaS platform provider that empowers major industry leaders to optimize performance, reduce asset failures and enhance safety. At Uptake, we combine our strengthsmachine learning, analytics, data visualization and software developmentwith the expertise of our industrial partners. The result is enormous savings in development time and resources for Uptakes partners and a proven industrial grade software platform that delivers value to partners and their end customers.What You'll DoCollaborate with a team to analyze problemsWrite functions/scripts to build databaseModel building and testingWriting informal reports for internal useWorking with developers and implementation engineers to spec out database models and determine implementation of algorithms QualificationsRequired: Advanced knowledge of R, Matlab, or PythonKnowledge of building time series, spatial, or financial forecasting models for predictionFamiliarity with any or all of the following: Dirichlet Latent ProcessLasso,SpAM/Ridge regularizationEnsemble methodsTime series analysis (GARCH, auto-regressive or moving average, etc.)Bayesian inferenceRandom forest and decision tree modelsBachelor's Degree in Computer Science, Operations Research, Statistics, or related fieldMust also have authority to work permanently in the U.S.Applicants who are interested in this position may also apply online at jobpostingtoday.com, Reference: 35475Preferred:Knowledge of one or more of C++, C, Java, ScalaPrevious published academic research in artificial intelligence, machine learning, or operations researchOpen source contributions in areas such as machine learning, distributed systems, and databasesTop 5% finishes in Kaggle competitionsWhy Work HereWe build and deliver, then explore to build more. Curiosity and flexibility enable everything we do, and we get stronger as we make each new industry smarter. As a team, we bring our diverse backgrounds, beliefs and experiences to solve problems no one has yet to solve, at a speed no one has yet to experience. We support and challenge one another to bring out a new best in each of us, and we might have a little fun along the way."}