{"jobID": "2812125656", "jobLocation": "San_Diego_CA", "jobTitle": "Senior Data Management Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.dexcom.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Public (DXCM) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Medtronic, Abbott Diabetes Care, Roche"}, "estimatedSalary": "77000", "jobDescription": "About DexCom: Founded in 1999, DexCom, Inc. provides continuous glucose monitoring technology to help patients and their clinicians better manage diabetes. Since our inception, we have focused on better outcomes for patients, caregivers, and clinicians by delivering solutions for people with diabetes - while empowering our community to take control of diabetes.Summary: As a SeniorData Management Analyst at DexCom, you are a key contributor to the data platform driving the operations manufacturing, test, and reporting processes. By tapping into your data management expertise, you are responsible for design and development of the manufacturing test cases and test data that support the software development and verification process, reports that support production operations, pilot plant labs, and a variety of qualification systems, data workflow that support manufacturing data integration between various systems. You are a strong communicator, independent thinker and team player. You will work with cross-functional teams to define the requirement, lead the data development while ensuring record compliance at every step: bringing to light the data-driven insight of a multi-site manufacturing floor. Essential Duties and Responsibilities:Develop test case and test data using mathematical methods for manufacturing production process needs.Work with database engineers to design databases using MS SQL Server.Production support, document and troubleshoot the data issues in an FDA-compliant manner.Follow software development process and qualification systems, develop qualification materials, including SRS, software validation and verification protocol and software validation report.Managing QA database environments.Gather requirement for Manufacturing dashboard.Design and develop reports using SSRS or Tableau.Architect data integration with the existing infrastructure and continuous improvement.Act as data liaison between cross-functional teams, closely collaborate with R&D;, Operations, Quality Assurance, Contract Manufacturers, and other stakeholders to facilitate data access in terms of reporting, system analysis, and data integration.Required Qualifications:3+ years' experience as database developer.Experience with SQL Server 2012+.Proficient with database modeling and T-SQL programming.Familiar with waterfall and agile development approach.Exposure to test-driven development and experience with all test phases.Working knowledge with data management and data processing flowcharting techniques, and other tools, such as Jira, Jama and confluence.Good understanding of the organizations goals and objectives.Creative problem solver with attention to detail.Experience working in a team-oriented, collaborative environmentStrong English written and oral communication skillsPreferred Qualifications:Working knowledge and other data platforms such as AWS, Google cloud or Microsoft Azure.Education Requirements:Bachelor's Degree in Computer Science, MIS, Systems Analysis or related experience.Travel Required: No An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact Talent Acquisition at talentacquisition@dexcom.com.To all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Dexcom. Only authorized staffing and recruiting agencies may use this site or to submit profiles, applications or resumes on specific requisitions. Dexcom does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to the Talent Acquisition team, Dexcom employees or any other company location. Dexcom is not responsible for any fees related to unsolicited resumes/applications."}