{"jobID": "2832449818", "jobLocation": "Rancho_Cordova_CA", "jobTitle": "Geologist/Environmental Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.geiconsultants.com", "Headquarters": "Woburn, MA", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "GEI Consultants, Inc. is a leading consulting engineering and environmental firm ranked #102 in the ENR top 500 (2017). We serve hundreds of government, energy, industry and institutional clients, and have completed 50,000 project engagements throughout the United States, Canada, and more than 20 other countries.  GEI, a privately held employee owned company, was founded nearly 50 years ago by five engineering pioneers. GEI now consists of over 800 employees in multiple offices throughout the U.S. and Canada. Our technical experts are involved in dozens of specialty services emanating from our core solutions in water, energy, buildings, infrastructure and industrial. Our technical experts are some of the most innovative and leading subject matter experts in their respective fields. We continue to grow and expand in our solutions, expertise and geography to ensure we can continue providing valuable solutions to our clients.  Our culture is one where we encourage employees to respectfully and thoughtfully challenge current practices for continual improvement. We believe this constructive engagement helps us evolve in an ever-changing business environment and will strengthen our organization in the future. Our practices reflect our commitment to a collaborative teaming approach, encouraging diverse perspectives which lead to innovation and value added solutions that fuel our success. Our committed employees work hard for our clients and in support of one another. In return we invest in a culture with engaging learning and career development opportunities, a competitive total rewards package, recognition, and the opportunity for some fun along the way.  Job Description  An entry-level position with a focus on hydrogeology and water resources planning. Under the supervision of senior scientists, support production of Groundwater Sustainability Plans, planning and analysis of recharge and recovery projects and development of grants for public and private sector clients. Work will be directed by various project managers with one of the goals being attainment of registration as a Professional Geologist and Certified Hydrogeologist in California.  Essential Responsibilities & Duties  Responsibilities will include developing spreadsheets and databases storing digitized data, documentation and geo-referenced data, conduct technical analysis and prepare associated written technical memoranda, and perform field work as needed to support projects.  Minimum Qualifications 1-2 years of experienceM.S. in Hydrogeology or related fieldAbility and willingness to obtain California Professional Geologist and Certified Hydrogeologist licensesAbility to successfully formulate and execute technical assignments with minimal oversight and direction; desire to acquire and apply new skills and techniques with application to project assignments.Excellent computer skills with technical analysis software: ArcGIS, MS Office, MS Project, and other computer analysis applications.Good verbal and written communication skills, team-oriented and highly self-motivated, good problem-solving skills with an aptitude for client service.Valid Driver's license Benefits Market-Competitive CompensationComprehensive Benefits Program, including Medical, Dental, Vision and MoreContinuing Education Assistance and Tuition ReimbursementProfessional Development and Opportunities for AdvancementPaid Holidays and Paid Time OffRewards and RecognitionGEI-Funded Profit Sharing and 401(k)And More…Physical Job RequirementsSedentary  X  Light  Medium  OtherActivity Level Throughout WorkdayPhysical Activity Requirements Occasional (0-35% of day) Frequent (33-66% of day) Continuous (67-100% of day) Not ApplicableSitting  XStanding  XWalking  XClimbing  XLifting (floor to waist level) (in pounds) XLifting (waist level and above) (in pounds) XCarrying objects  XPush/pull  XTwisting  XBending  XReaching forward  XReaching overhead  XSquat/kneel/crawl  XWrist position deviation  XPinching/fine motor skills  XKeyboard use/repetitive motion  XTaste or smell (taste=never)  XTalk or hear  X Accurate 20/40 Very Accurate 20/20Not ApplicableNear Vision  XFar Vision  XYesNoNot ApplicableColor Vision (ability to identify and distinguish colors)  XSensory RequirementsMinimalModerateAccurateNot ApplicableDepth perception  XHearing  XEnvironmental RequirementsOccupational Exposure Risk PotentialReasonably AnticipatedNot AnticipatedBlood borne pathogens  XChemical  XAirborne communicable diseases  XExtreme temperatures  XRadiation  XUneven surfaces or elevations  XExtreme noise levels  XDust/particular matter  XOther (exposure risks):Usual workday hours:  8  X  10  12  Other work hoursGEI is an EEO/AA/M/F/Vet/Disability employer"}