{"jobID": "2833806374", "jobLocation": "Detroit_MI", "jobTitle": "Electronics Research Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.toyota.com", "Headquarters": "Plano, TX", "Size": "10000+ employees", "Founded": " 1937", "Type": " Company - Public (TM) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "Who we areCollaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world’s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We’re looking for diverse, talented team members who want to grow and start their impossible with us.Who we’re looking forToyota’s Electronics Research Department is looking for a passionate and highly-motivated Electronics Research Scientist.The primary responsibility of this role is to develop methodologies that will enable application of computer design, system simulation, and numerical optimization techniques to novel electronics research and development.Reporting to the Electronics Research Senior Manager, the person in this role will support the department's objective to develop system modeling and numerical optimization for research and development.What you’ll be doingConduct research activity to meet key performance indicators (e.g. internal reports, invention disclosures, and external publications) and contribute to Toyota's safety culture; the position required staying abreast of the expanding field of numerical optimization, performing original research, and publishing/presenting resultsDesign, scope and drive innovate implementation of multi-scale (system, elemental technology, and material) models that incorporate numerical multiphysics optimization techniques to enhance the design of electronics components including power electronics, sensors, battery systems and fuel cellsPerform one-dimensional and three-dimensional modeling and optimization of systems and components to support in-house and collaborative activities; monitor and adapt optimization models to meet the needs of various projectsCommunicate effectively with a diverse group of scientists and management team within the organization; interface with research stakeholders (with possibility of overseas travel and/or training) and fellow team members to reach consensus on projects milestones, targets, hand/over criteriaWhat you bringPhD in Mechanical Engineering, Applied Mathematics, or related technical fieldProfessional experience working in numerical optimizationKnowledge of strength with adjoint sensitivity analysis and multiphysics simulationUnderstanding of coupling between multi-scale one-dimensional and three-dimensional modelsFluency in programming languages (e.g. C )Hands-on experience with commercial and coding in-house finite element analysis softwareSophisticated in scientific writing and/or history of technical presentations at conferencesProject Management experienceWilling to travel domestic an as well as internationally Added bonus if you have: Comprehensive understanding of proposal writing and developmentSolid background in state-of-the-art (e.g. additive) manufacturing techniquesBackground in extended finite element methods (XFEM)What we’ll bringDuring your interview process, our team can fill you in on all the details of our industry-leading benefits and career development opportunities. A few highlights include:A work environment built on teamwork, flexibility and respectProfessional growth and development programs to help advance your career, as well as tuition reimbursementVehicle purchase & lease programsComprehensive health care and wellness plans for your entire familyFlexible work options based on business needsToyota 401(k) Savings Plan featuring a company match, as well as an annual retirement contribution from Toyota regardless of whether you contributePaid holidays and paid time offReferral services related to prenatal services, adoption, child care, schools and moreFlexible spending accountsRelocation assistance (if applicable)What you should knowOur success begins and ends with our people. We embrace diverse perspectives and value unique human experiences. We are proud to be an equal opportunity employer that celebrates the diversity of the communities where we live and do business. Applicants for our positions are considered without regard to race, ethnicity, national origin, sex, sexual orientation, gender identity or expression, age, disability, religion, military or veteran status, or any other characteristics protected by law.Have a question or need assistance with your application? Check out the How to Apply section of our careers page on Toyota.com!To save time applying, Toyota does not offer sponsorship of job applicants for employment-based visas or any other work authorization for this position at this time."}