{"jobID": "2810081993", "jobLocation": "Houston_TX", "jobTitle": "Senior Research Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.cyberonics.com", "Headquarters": "Houston, TX", "Size": "501 to 1000 employees", "Founded": " 1987", "Type": " Company - Public (CYBX) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Medtronic, St. Jude Medical, Boston Scientific"}, "estimatedSalary": "124000", "jobDescription": " As a Sr. Research Scientist, you will apply your board knowledge as a bio medical engineer or electrical engineer to model, design, validate and build strong technical documentation to show the conformance of our Implantable products to all required MRI product and regulatory needs.  The qualified candidate will have strong positive leadership skills and incorporate quality based approaches into the development process. This employee will be an expert in the interpretation and usage of standards to develop and execute internal test methods. They will likely have a background in the medical field and or experience in a regulated environment. It is preferable that the candidate will have experience with the ISO/TS 10974 test methods and knowledge of Electrical and Magnetic fields used in wide variety of commercial MRI scanners.  In addition, this person will be expected to: Work closely with the design team to understand requirements, architecture and specifications of the product and ensure that products are compliant.Provide novel and practical solutions to achieve MRI and EMI conformanceDocument results in reports used by internal customer to support regulatory submissions.Define and support the activities related to product safety (e.g ISO 10974) This person will need to be excellent in collaborating with other internal departments and external consultants and physicists. In this role they are working with teams from HW & SW design, automated test, quality engineering, project management, and regulatory affairs to create and implement the strategy for new products.  This person will also need to possess: Knowledge of statistical methods and data analytics techniques to analyze test results and resolve technical issues. and resolve technical issuesKnowledge of high frequency (GHz) design principles and measurement techniques.Knowledge of test method qualification techniques and measurement systems analysis..Demonstrated hands-on experience in the use and automation of laboratory measurement / test instruments including data acquisition systems, signal analyzers, spectrum analyzers, network analyzers, oscilloscopes and various signal / waveform generators. With great responsibilities comes great reward, join us in our mission to bettering the quality of lives for people around the world!  Please note that we do not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Services Agreement, we will not consider, or agree, to a payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, we explicitly reserve the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency.SDL2017"}