{"jobID": "2750575922", "jobLocation": "Duarte_CA", "jobTitle": "Senior Research Data & Report Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.cityofhope.org", "Headquarters": "Duarte, CA", "Size": "5001 to 10000 employees", "Founded": " 1913", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " MD Anderson Cancer Center, Memorial Sloan Kettering, UCLA Health"}, "estimatedSalary": "92000", "jobDescription": "About City of Hope City of Hope, an innovative biomedical research, treatment and educational institution with over 5,000 employees, is dedicated to the prevention and cure of cancer and other life-threatening diseases and guided by a compassionate, patient-centered philosophy.  Founded in 1913 and headquartered in Duarte, California, City of Hope is a remarkable non-profit institution, where compassion and advanced care go hand-in-hand with excellence in clinical and scientific research. City of Hope is a National Cancer Institute designated Comprehensive Cancer Center and a founding member of the National Comprehensive Cancer Network, an alliance of the nations 20 leading cancer centers that develops and institutes standards of care for cancer treatment. Requisition 13479Senior Research Data & Report AnalystPosition Summary: Working under the direction of a faculty statistician, and in coordination with protocol-specific research teams, the Senior Research Data & Report Analyst reads clinical protocols to understand data requirements for scientific aims, writes and runs computer programs to monitor data quality and timely data collection, sends data queries to clinical research coordinators and other clinical trials personnel, produces reports of data consistency and timeliness, and coordinates and schedules reports. Reviews data quality errors and identifies problems with eCRF and database design and works with the statisticians and research informatics to improve the eCRF design to help reduce data collection errors. Essential Functions:Collaborates with statisticians to determine endpoints for review for data inconsistencies or lagging data in the clinical trials database.Programs queries listing important data inconsistencies and lagging data.Writes reports to send to clinical research coordinators that present the data inconsistencies and lagging data.Works with the clinic research coordinators to get the data queries resolved.Develops, establishes schedules, and monitors status of the clinical trials protocol endpoints on an ongoing basis.Will, over time, assume responsibility for monitoring data quality in a portfolio of protocols.Collaborates with Biostatistics Core staff in the development and improvement of computer programs and oversees implementation of data entry, data quality, and reporting facilities.Collaborates with statisticians and research informatics on eCRF and database design and management.Maintains Division records, reports, and files as required.Documents computer programs and electronic databases.Enhances professional growth and development through participation in educational programs, reviewing current literature, attending meetings, and workshops.Attends meetings as required. Follows established City of Hope and department policies, procedures, objectives, performance improvement, attendance, safety, environmental, and infection control guidelines, includingadherence to theworkplaceCode of Conduct and Compliance Plan. Practices a high level of integrity and honesty in maintaining confidentiality.  Performs other related duties as assigned or requested. The following non-essential functions may be reassigned:Provides staff relief as required to meet the needs of the department.The following shared, organization-wide competencies describe the desired behaviors that will facilitate success at City of Hope:Communication - Expresses ideas clearly and constructively (written and spoken, upward and downward, one-on-one and with groups).Customer Service - Seeks to understand customer needs and works to exceed customer expectations (internal and external).Initiative - Looks for opportunities to improve performance; manages time, work, and relationships effectively and efficiently.Professionalism - Treats others with respect; abides by the institutional values; displays a positive and cooperative attitude; adheres to the workplace Code of Conduct and compliance policies.Stewardship - Identifies efficiencies to reduce redundancy and/or elimination of tasks resulting in savings of cost, resources, and or/time.Teamwork - Works proactively and collaboratively with others to streamline work and achieve mutual goals.Position Qualifications:Minimum Education:Bachelors DegreeMinimum Experience:5 or more years clinical trials experienceRequired Courses/Training:Req. Certification/Licensure:Preferred Education:Bachelors degree in computer science, health information systems, statistics or a closely related field.Preferred Courses/Training:Minimal programming skills in SQL, R or SAS would be helpful, but on the job training is an option.Pref. Certification/Licensure:SOCRA or ACRP certificationPreferred Experience:Skills/Abilities:Ability to use computer peripheral equipmentAbility to use a personal computerAbility to foster and promote a positive image and professional appearanceAccess data in computer data basesCompile dataCompose letters/memorandaPrepare reportsTroubleshoot problemsDocuments activities and programsInstruct/train othersAbility to work in multidisciplinary teamsExcellent oral/written communication and organizational skills.Excellent reading comprehension.Software:Facile with at least one data-oriented programming languageMachines/Equipment:Computer peripheral equipmentFaxPersonal computerPhotocopierWorking / Environmental Conditions:Atmosphere and environment associated with an office settingOccasionally subjected to irregular hoursSubject to regularly changing priorities and work assignmentsOccasional pressure due to deadline requirementsExposure to protected healthcare information (PHI) as defined by HIPAAOccasional pressure due to multiple calls and inquiriesPhysical Demands:Moderate physical effort (lift/carry up to 10 lb.)Mostly sedentary workOccasional standing/walkingOccasionally lifts supplies/equipment City of Hope is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with disability."}