{"jobID": "2633024598", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.savesoftinc.com", "Headquarters": "Ashburn, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Scientist: As Data Scientist, you will be analyzing a wide range of unstructured data (text, audio, image) to address problems for our customers through attentive listening, astute planning, and out of the box thinking to develop solutions and reporting results in an engaging manner. The role will involve working with Senior Data Scientists and mentoring Associate Data Scientists in analyzing complex data, generating insights, and creating solutions as needed across a variety of tools and platforms. The ideal candidate for this position will possess ability to perform both independent and team based research and generate insights from large data sets with a hands- on/can do attitude of servicing/managing day today data requests and analysis.  The Responsibilities  Implement and validate predictive models based on statistical/NLP insights  Prepare, transform and annotate client datasets  Create compelling visualizations for client reporting  Manage client communications in conjunction with senior team members  The Skill Set  Approx. 3-4 years' experience working with data & analytics  Have 1+ years' experience working with NLP, text analytics  Basic knowledge of embedding models (word2vec, GloVe)  Solid statistics knowledge (hypothesis testing, ANOVA, chisquare ests, etc )  Command of data science principles (regression, Bayes, time series, clustering, P/R, AUROC, etc )  Excellent verbal and written skills  Proven collaborator, thriving on teamwork  Demonstrated proficiency in R and/or Matlab  Familiarity with SQL and noSQL databases (mysql, postgresql, mongodb, elasticsearch,  Familiarity with Hadoop (hdfs, mapReduce, Cloudera, MapR, Hortonworks)  Good relationship building"}