{"jobID": "2835915769", "jobLocation": "Munster_IN", "jobTitle": "Programmer/Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.landofrost.com", "Headquarters": "Munster, IN", "Size": "501 to 1000 employees", "Founded": " 1958", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": "CompanyAt Land O’Frost, our brands of lunchmeat and specialty sausage products are recognized as one of the nation’s best- selling and trusted brands. We have accomplished this through our incredible team of employees who are customer focused, motivated, achievers, developers, and purpose driven. We are seeking more passionate people to join our innovative team. Join our team and let your ambition flourish.Summary The Programmer/Data Analyst is part of the Land O'Frost Information Technology Team providing programming, analysis, reporting and system implementation services to support key system stakeholders and users. Longer term, this position's responsibilities will expand to include integrating existing applications, developing custom applications and deliver knowledge sharing and collaboration solutions using SharePoint and other Microsoft software tools.ResponsibilitiesWorking with application stakeholders to identify user requirements, software automation needs, identifying potential solutions and building or implementing appropriate software systems.Working with the enterprise application team to aide in the development of necessary reporting, application interface design, application building in SharePoint.Understanding and advising the desktop support team on end-user technical requirements.Creating scripts for system testing following generally accepted testing methodologies.Works collaboratively with other Information Technology team members to ensure a wholististic approach to solution design and development.Qualifications:Bachelor's degree in related field required.Experience in programming languages and building small-scale programs for interfacing systems.Experience in using software development best practices, tools and techniques.Familiarity with operating protocols for desktops, laptops, tablets, mobile smart phones, and other mobile handheld devices.At least (2) years of experience in an information systems environment with exposure to large-scale systems implementation, network administration and client-server functions.Experience with Microsoft Office applications including: Word, Excel and Outlook.Available to work flexible schedule, including nights, weekends, holidays, and on-call schedules as needed."}