{"jobID": "2803468941", "jobLocation": "Holland_MI", "jobTitle": "Sr Buyer - Logistice", "companyRating": "2.8", "companyInfo": {"Website": "www.yfai.com", "Headquarters": "Shanghai, China", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " As a Sr. Buyer for Logistics you will be responsible for managing budgets, SG&A;, department financials and managing key cross functional projects supporting Several NA new projects are launching, logistics supplier sourcing for new line-haul transportation and shuttle delivery are pending.  You will also be responsible for the following: Manage the after math of the Mexico Go Live with QAD. Verifying all the Mexico suppliers’ data, banking info for the data migration. Need to prevent the invoice and payment process from failing which may impact the daily logistics service.Working with the Mexico plants to figure out all the budget POs value for each carriers, and helping them create purchase requisitions, and then approve plus release POs to the suppliers. Still to avoid daily operational service stop.Negotiating the spot rates of premium freight for urgent transportation requirements, work closely with SCM to support the daily plant operation.Driving corrective action with the logistics supplier on performance issues.Dealing with freight bill discrepancy issues in TI’s e-return system.Coordinating the Payment disputes.Driving ground transportation rate agreements rate review.Sourcing freight Logistics service providerDrive logistics program rate negotiation and contractingFreight rate negotiations for all modes – benchmarking and global collaboration are two critical elements within this buying role.Deliver Best landed cost at sourcing for all purchased goods and servicesDevelop stable logistics service chain to insure the daily operational runningReview & optimize logistics service program with operational departmentSupport the organization in targeting, winning, developing, launching and manufacturing profitable programsContract management and carrier developmentFreight payment managementModel managementCarrier dispute resolution/claims managementFuel surcharge management4 year degree in Purchasing, Supply Chain Management or Business Administration with a Master Degree desired8 Plus year of experience within the automotive or related industry with management experienceSupply Chain Management (SCM), operational and/or strategic role experienceStrong costing knowledgeStrong negotiation and presentation skills"}