{"jobID": "2828225864", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Project Manager - Construction Commercial Interiors", "companyRating": "4.3", "companyInfo": {"Website": "www.skylineconstruction.build", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " NOVO Construction, BCCI, GCI General Contractors"}, "estimatedSalary": "125000", "jobDescription": " Senior Project Manager As a leader of the company, you will build, train and manage a highly engaged team of construction professionals. You will be held accountable to sell, estimate, schedule, manage and oversee all aspects of your own construction projects, and those of your project team. You will bring an established book of business to the firm, and will maintain existing relationships while forging new ones with clients, architects, construction managers, brokers, property managers and subcontractors. You must have strong communication and presentation skills to present at client interviews. You will be involved in strategic corporate decisions and will be asked to attend networking events and industry functions as a representative of the firm. Responsibilities: Prepare bids, budgets and respond to formal RFPs for clients including bid leveling and technical writing capabilities  Lead interviews to secure new work  Lead pricing, value engineering, site selection investigations and building assessments  Develop site logistics plans  Create detailed project schedules in conjunction with superintendents  Serve as the client point of contact, establishing and maintaining relationships  Identify high risk contract provisions and implement practices to mitigate risk  Oversee procurement, cost and change management during project  Lead weekly project meetings with client and subcontractors  Manage punch list and oversee project closeout  Manage all aspects of project accounting, financial projections and reporting, and AR collections Qualifications 7-10 yrs of construction experience including 5 years as a Project Manager in GC Commercial Interiors  5-10 years experience supervising and managing personnel including superintendents and project support staff  Proven leadership skills  Experience managing large, complex and/or multiple jobs at one time  Graduation from an accredited four-year college with major coursework in Construction Management, Engineering, Architecture or a related field preferred  LEED accreditation preferred  Proficient in Microsoft Project, Procore, Timberline, PlanGrid, BlueBeam and PlanGrid  Extensive project estimating and scheduling experience  Strong understanding of building site work, structures, finishes, envelope and mechanical and electrical systems acquired through a diversified portfolio of projects  Substantial knowledge of prime contract terms and conditions, and the ability to read and write subcontract agreements  Development of client relationships, sales/business development for new opportunities with the expectation to both sell and deliver work  Excellent communication skills and ability to present ideas effectively during client interviews and meetings"}