{"jobID": "2831978364", "jobLocation": "Chicago_IL", "jobTitle": "Senior Audit Analyst - Data and Reporting", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " An Award-Winning Technology Company is looking to hire a Senior Audit Analyst to focus on Data Analytics and Reporting. This is a newly created role that can be created and molded into what this person sees fit. Things to get excited about: This company is known for two things, growing fast and treating their people like royalty. They have surpassed over $1B in revenue despite not even existing 15 years ago. They are expanding both organically and through global acquisitions. They have been able to command such success by taking a technology-first approach and disrupting their industry. They now count a huge swath of the Fortune 500 as clients.  Their physical office space is second to none and located right in Chicago's Loop on the river. They have a great host of benefits and offer great work-life balance including flexible hours. ResponsibilitiesDevelop and maintain Internal Audit’s Data Analytics Methodology, and develop the framework and procedures of the department’s data analytics.Write complex programs and ad hoc queries by utilizing enterprise data to fulfill audit data analysis requirements.Ensure that all code is developed in a well-structured manner, functions as required, is validated, includes sufficient comments, and is easy to maintain and reuse.Bring structure to each data analytic request and translate requirements into an investigative approach to probe for hidden questions and trends within the data.Maintain and execute the inventory of data analytics routines for continuous monitoring of other defined activities, including the development and ongoing management of data models as needed.Participate in the planning of audits and provide support to Internal Auditors in the execution of audits requiring data analytics.Provide support model risk management and validation review activitiesAssessments and associated reconciliation(s). Prepare clear and concise work papers documenting the data analytics supporting audit procedures.Stay abreast of new trends and developments in data analytics by leading and/or attending seminars, training sessions, and workshops, as necessary to develop and ensure the department’s data analytics program.Keeps abreast of regulations, industry, and information technology changes, and ensures adherence to professional audit standards.Serve in a consultative capacity (subject matter expert) to business units on data analytics techniques, tools, and other technical matters.Ensure department team members are aware of the data analytics framework and its application and relevance to their audit projects.Acts as the liaison between the Internal Audit and IT Departments.Knowledge of data analytics practices and concepts (for CAAT, trend analysis, data visualization, reasonability analysis, and regression analysis).Work with the Internal Audit Management on special projects as assigned. RequirementsBachelor’s Degree in Accounting, Business Administration, IS/IT or related field.Preferred professional designations, including CIA, CPA, CISA or similar.2+ years of related experience in a data analytics role.Experience developing data analysis routines and documenting data extraction, transformation, and loading processes.Strong working knowledge of data analytics and programming tools (ACL, Excel, Access, Tableau, SQL Developer, etc.)."}