{"jobID": "2832768261", "jobLocation": "Itasca_IL", "jobTitle": "Marketing Data Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "solutions.canon.com", "Headquarters": "Melville, NY", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview  Canon Solutions America is a Canon U.S.A. Company providing integrated systems technology that comprise one of the strongest solutions portfolios in the document management industry.  The Marketing Data Intelligence Analyst will be responsible for providing strategic and tactical support to the organization by analyzing, maintaining and cleansing data from various databases, including Oracle, Dunn&Bradstreet; and Salesforce.com.  Canon Solutions America offers a competitive compensation package including medical, dental, vision, 401(k) Savings Plan, profit sharing, opportunity to earn incentive trips, success sharing, tuition reimbursement, vacation, and much more! ResponsibilitiesProvide overall SFDC administration support to 100 plus users including:Maintaining territory assignments.Developing and maintaining Dashboards, Reports, Views, and picklists.Participating in the development of new functionality.Conducting user training&developing; training material.Working closely with SFDC Help desk to troubleshoot and resolve application issues.Upload of data to SFDC via Data Wizard tool.Participate in the development and integration of Marketo marketing CRM with SFDC.Provide technical support to marketing campaign initiatives.Participate in various marketing special projects.QualificationsBS in Computer Science, Statistics, Mathematics, Economics or equivalent work experience.Minimum of 5+ years' experience in similar role.Must have a high level of proficiency in SFDC administration (SFDC Administrator Certification a plus).Must be proficient in Microsoft Excel and Access (SQL querying skills a plus).Working knowledge of ETL data processes.Working knowledge of Marketo CRM a plus. Canon Solutions America, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristics protected by law.  EOE Minorities/Females/Individuals with Disabilities/Protected Veterans #LI-JT1"}