{"jobID": "2832018098", "jobLocation": "Plano_TX", "jobTitle": "Sr Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.fedex.com", "Headquarters": "Memphis, TN", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (FDX) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " Company: FedEx Services  Job Title: Sr Data Analyst  Job Requisition Number: RC59433  Category: Marketing Locations: Plano, Texas 75024  United States  Under moderate supervision, designs and implements processes and solutions associated with a wide variety of data sets used for data/text mining, and analysis to enable informed business decisions. Gains insight into key business problems and deliverables by applying statistical analysis techniques to examine structured and unstructured data from multiple disparate sources. With moderate direction, creates solutions from initial concept to production. Communicates results to a broad range of audiences. Effectively uses current and emerging technologies to evaluate trends and develop actionable insights and recommendations to management, via understanding of the business model and the information available for analysis. Typically uses data, statistical and quantitative analysis, limited modeling, and fact-based management to drive decision making. Mentors less senior staff. Works in cross functional projects and programs. Routinely presents to management. Job Specific Responsibilities:Prepares analyses, reports, dashboards and presentations to senior management in a format relevant for the audience. Additionally, conveys complex analytics in an understandable way to non-executive and executive levelsBe knowledgeable of developments in the field of digital analytics for the e-commerce space and recommend changes in tools, platforms or methodologies.Define testing and optimization roadmap and lead experimental design and implementation of tests needed to improve marketing funnel performanceBuild strategies and programs to optimize efficiencies while improving the customer experience.Work closely with our Product and Data Management teams to develop a 360-degree view of our customersUnderstand various site tagging models and advise management on the best approachEnsures data accuracy, ongoing data validation and resolve any data integrity issuesCoordinate the work of vendors and consultants who support the digital business.Assist with developing and providing regular training on analytics best practices, metrics, and business application of analytics and the tools used tools to a broad range of basic to intermediate web analytics usersAssist with the management of web analytics IT load cycles and works closely with the Interactive Marketing IT team to develop, test, and execute improvements/fixes to continually strengthen the analytics platformSkills / Knowledge Considered a Plus:Hands on working knowledge of web analytics tools such as Adobe Analytics, Omniture, Google Analytics, WebTrends and/or Core metrics.Experience developing interactive marketing and user experience test plans, monitoring, measuring, adjusting, and ultimately making recommendations resulting from the execution of the tests.Strong quantitative aptitude and expertise in application of applied statistics / quantitative methods for solving business problems.Multi-channel marketing/analytics a plusStrong communication and presentation skills, both written and verbalAbility to convey analytics in a understandable way to non-executive and executive levelsAbility to multi-task, operate effectively under changing conditions and rigorously prioritize initiatives based on business objectivesKnowledge of Microsoft Office, including Word, PowerPoint, VISIO, Access, and Excel (intermediate mastery of Excel required, advanced mastery of Excel).Degree in a quantitative and/or technology focused is a plusProfessional experience in analytics industry is a plusDomicile / Relocation information:This position will be located in Dallas/Plano, Texas. Relocation assistance is available.Minimum Qualifications:Bachelor's degree in information systems, computer science, or a quantitative discipline such as mathematics, engineering, operations research, economics or Finance.Five (5) years work experience in measurement and analysis, quantitative business problem solving, operations analysis, marketing analysis, simulation development and/or predictive analytics.Proficient in analytics software and applications. Good interpersonal skills.Good written and oral communication skills.Application Criteria / Deadline:To be considered for this opening, upload current copy of Resume and answer job screening questionnaire to submit application by close of business (5:00 PM CST) on July 6, 2018. Want a career where you are empowered to make a difference? Want to work for a company that is environmentally responsible? Want to grow and develop on the job? If so, FedEx is the place for you! Every day FedEx delivers for its customers with transportation and business solutions. FedEx serves more than 220 countries and territories around the globe. We can serve this global network due to our outstanding team of FedEx employees. FedEx has over 400,000 talented employees who are tasked with making every FedEx experience outstanding. FedEx has been recognized on many different lists both for business success and for being a great employer.  Here are some of the recognitions FedEx has received from the past couple of years: FORTUNE \"World's Most Admired Companies\" 2016Corporate Responsibility Magazine \"100 Best Corporate Citizens\" 2016InformationWeek \"Elite 100\" 2016Women's Business Enterprise National Council \"America's Top Corporations for Women's Business Enterprises\" - 2016Reputation Institute \"World's Most Reputable Companies\" 2015Black Enterprise \"40 Best Companies For Diversity\" 2015 When 400,000 employees around the globe are all working together it is amazing what we can achieve! FedEx connects people and ideas. If you would like to make a difference on a global scale while receiving top notch benefits, competitive pay, and plenty of opportunities to develop, click 'Apply' and tell us more about yourself.  EEO Statement - FedEx is an equal opportunity/affirmative action employer (minorities/females/disability/veterans) that is committed to diversifying its workforce."}