{"jobID": "2705095865", "jobLocation": "Los_Angeles_CA", "jobTitle": "BI/Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.platinumesol.com", "Headquarters": "Torrance, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " TEKsystems, Modis, Adecco USA"}, "estimatedSalary": null, "jobDescription": "Location - 11925, Wilshire Blvd, Los Angeles, CA 90049Duration - 6 months, extension 12-18 monthsStart Date - ASAP The Advanced Ad Product Business Intelligence Analyst provides reporting and will help maintain reporting solutions which distill complex data sets into readily accessible reports for senior executives. This person possesses an in-depth understanding of digital analytics, reporting, advertising platforms and databases. They will be part of a team responsible for delivering reporting, analysis, and forecasting of key sales and audience delivery of non-linear TV.  Responsibilities: Support Finance, Sales and other key business areas by providing timely reporting, relevant analysis and insightsWork with multiple data sets to provide regular KPI reports to various cross functional teamsMaintain a high-quality output and exceptional customer service: effectively communicate at all levels, ensure that work gets done well and on timeEfficiently prioritize work to supplement weekly and monthly reporting and insights with ad-hoc analysis, automated reports generation and dashboardsCollate and distributing weekly / monthly performance reportsCreate and/or maintaining recurring digital advertising and media reportsPerform Quality Control tests of data and reports as needed Qualifications: Detail-oriented with superior organizational skills. Able to navigate between multiple projects, meet deadlines, and process ad hoc requests.Excellent communication skillsFluency in data analysis, including experimentation, data visualization and defining KPIs and communication around data to inform the success of the business and its features.Experience in the areas of marketing analytics, marketing data science, business intelligence, and data visualization at a TV network or agency, research or digital media services firmA deep understanding or and experience in non-linear TV and/or digital media metrics Skills and Knowledge: 1.5+ years of reporting and analysis experience in the advertising or Media and Entertainment industry requiredExperience working one or more of media analytic platforms: FreeWheel, DFP, Hulu, Rentrak, comScore for building reports is requiredAdvanced in MS Excel with the ability to do V-lookups, pivot tables, MATCH, IF, and other formulasExperience with Adobe Analytics a major plusExperience producing data visualizations with Excel, Tableau, or MicroStrategy is a plusExperience working with BI Tools Alteryx or Knime is a plusExperience working with Amazon Web Services Redshift, S3 is a plusBachelor’s degree (B.A., B.S.) from an accredited college or university in Marketing, Computer Science, Mathematics, Statistics, Communications, Media or related field Applicants must be authorized to work in the U.S.  Please apply directly to by clicking 'Click Here to Apply' with your Word resume!  Looking forward to receiving your resume and going over the position in more detail with you.  The Platinum Team!  Platinum is proud to be an Equal Opportunity Employer!  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.  Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  Copyright © 2006 - 2018. Platinum ESOL, Inc. All rights reserved."}