{"jobID": "2796557212", "jobLocation": "San_Francisco_CA", "jobTitle": "Research Data Analyst II", "companyRating": "3.9", "companyInfo": {"Website": "www.ucsf.edu", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1864", "Type": " College / University", "Industry": " Unknown", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " Research Data Analyst II  31-May-2018 Job Code and Payroll Title 6256 Research Data Analyst II Job SummaryJOB OVERVIEW The Data Coordinator position is for the mental health programs in the Division of Trauma Recovery Services at Zuckerberg San Francisco General Hospital (ZSFG). The Data Coordinator will collaborate with Division programs to track and assess qualitative and quantitative quality improvement data and to conduct program evaluation and research projects. Tasks include developing and maintaining relational databases, overseeing data entry, data cleaning, and data collection; designing and implementing data collection and management procedures, conducting basic statistical analyses, producing data summaries and reports, and serving as information technology liaison. PSYCHIATRY / DTRS The Division of Trauma Recovery Services (DTRS) in the ZSFG Department of Psychiatry is dedicated to providing integrative and multidisciplinary behavioral health care for the patients of the San Francisco Health Network (SFHN). Our mission is to provide high quality behavioral health services for victims of trauma and violence through our partnerships with other departments such as the emergency medicine, family medicine, San Francisco Police Department (SFPD) and San Francisco District Attorney's office, and the local Victim Witness office. ABOUT UCSF The University of California, San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It is the only campus in the 10-campus UC system dedicated exclusively to the health sciences. Organization Campus Req Number49650BRLocation 2727 Mariposa Street Job Title Data Coordinator Appointment Type Career Percentage100%Shift Length 8 Hours Shift Days Work Days Monday - Friday, 8:00 am - 5:00 pm Required QualificationsBachelor's degree in related area and / or equivalent experience / trainingOne to three years of relevant work experienceProficiency in relational database design and managementProficiency in the use of Microsoft Access, Redcap and Qualtrics for database development, design and reportingExpertise in implementing quality control procedures and reportingKnowledge and experience with basic research measurementPrevious experience successfully creating and/or modifying processesFamiliarity and comfort with Public Sector clientsAbility to interact with faculty staff (at all levels) in a fast paced environment, sometimes under pressure, remaining flexible, proactive, resourceful and efficient, with a high level of professionalism and confidentialityProficiency in written and verbal communication skills, strong decision making ability and attention to detailAbility to manage multiple tasks simultaneously, set deadlines, prioritize, organize and follow-through on assignmentsExcellent analytical and problem solving skillsAbility to work independently and take initiative; strong time management skills and ability to work in a deadline-driven environmentExcellent customer service skillsDemonstrated excellent attendance and reliabilityPreferred QualificationsAvatar training and experienceExperience with a mental health and/or clinical settingFamiliarity with psychiatric service and/or research settingsPrior experience in research, outcomes evaluation, or quality improvementWorking knowledge of research functionWorking skills in analysis and consultationLicense/Certification n/a Position Type Full Time Department Name Psychiatry / Trauma Recovery Center Equal Employment Opportunity The University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. "}