{"jobID": "2835262659", "jobLocation": "Herndon_VA", "jobTitle": "Machine Learning/Data Scientist with AWS", "companyRating": null, "companyInfo": {"Website": "www.askstaffing.com", "Headquarters": "Alpharetta, GA", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Machine Learning/Data Scientist with AWSContract: 6+ Months Contract.Location: Herndon, VA, 20170.About our Client : Our client serves the people who house America. We are a leading source of financing for mortgage lenders, providing access to affordable mortgage financing in all markets at all times. Our financing makes sustainable homeownership and workforce rental housing a reality for millions of Americans. We also help make possible the popular 30-year, fixed-rate mortgage, which provides homeowners with stable, predictable mortgage payments over the life of the loan. Our tools and resources help homebuyers, homeowners, and renters understand their housing options. Job Description: AI/Machine Learning Developer  Strong Java or AWS development experience is required  Natural Language Processing a must  Strong experience with machine learning tools and libraries such as AWS ML, AWS Sagemaker, AWS Comprehend, TensorFlow  NLP experience, mining of structured, semi-structured, and unstructured data  Strong AWS DevOps experience a plus including some of AWS CodeBuild, AWS CodeCommit, AWS CodePipeline, AWS Lambda, API Gateway, AWS CLI/Yaml/CloudFormation, Serverless Deployment,Lex,Transcribe all giant pluses About ASK: ASK Staffing is an award-winning technology and professional services recruiting firm servicing Fortune 500 organizations nationally. With 5 nationwide offices, two global delivery centers, and employees in 42 states-ASK Staffing connects people with amazing opportunities Contact:  Edgar @ Edgars@askstaffing.com ; 703-520-9655- provided by Dice  AWS ML, AWS Sagemaker, AWS Comprehend, TensorFlow"}