{"jobID": "2829131322", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "2.5", "companyInfo": {"Website": "www.fitch.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " Dual-headquartered in New York and London, Fitch Ratings is a leading provider of credit ratings, commentary and research. Dedicated to providing value beyond the rating through independent and prospective credit opinions, Fitch Ratings offers global perspectives shaped by strong local market experience and credit market expertise. The additional context, perspective and insights we provide help investors to make important credit judgments with confidence.  Fitch Solutions delivers credit market data, analytical tools and risk services to the global financial community. In addition to offering proprietary market-based content, Fitch Solutions distributes the ratings, research and financial data of Fitch Ratings through a variety of flexible platforms. With innovation and experience behind every solution, Fitch Solutions helps financial professionals meet the diverse and evolving needs of today’s global markets.  Fitch Ratings and Fitch Solutions, along with Fitch Learning and BMI Research, are part of the Fitch Group, a global leader in financial information services with operations in more than 30 countries. Fitch Group is majority-owned by Hearst.  Fitch Ratings and Fitch Solutions are an equal opportunity / affirmative action employer, complying with all laws governing employment in each jurisdiction in which operating, and provide equal opportunity to all applicants and employees. All qualified applicants will be considered without regard to race, color, religion, gender, national origin, age, disability, marital or protected veteran status, sexual orientation, gender identity and other status protected by applicable laws.  Fitch is seeking an Analyst or Associate Director (title will be commensurate with experience) to join the Global Corporates group as a member of the Data & Analytics team. The Global Corporates group provides ratings, research, and data on thousands of debt-issuing corporations to market participants around the world. Data & Analytics is an entrepreneurial team of hybrid analysts within the broader Global Corporates group that operates at the intersection of traditional research and technology. We are a highly visible team and play an integral role in building solutions to support the rating and research efforts of over 300 analysts globally. We also harness the data and insights generated by the analysts using our tools to develop our own data-driven research and products. These products can be internal or external and can range from traditional research reports to interactive visualizations. We are seeking a new team member that can help us further build out our data infrastructure while also becoming knowledgeable about corporate credit research from an operational and analytical perspective.  The key responsibilities of the position will include but are not limited to: Develop, support and maintain the applications used in the rating and research processIntegrate and mine large data sets, connecting data from disparate sources to identify critical insights and pragmatic data solutionsCollaborate with functional experts and organizational leaders in the implementation of new products and process improvementsProduce data-driven reports and presentations for internal and external usePosition Requirements * Bachelor’s degree in a technical/quantitative field.  * Programming knowledge required (VBA, SQL, R, Python or JavaScript). Experience in software/web development a plus.  * Basic knowledge of database concepts required.  * Have a keen interest in finance and business. Knowledge/experience in finance/accounting, economics or capital markets a plus but not required.  * Strong attention to detail and problem-solving ability  * Good written and verbal communication skills  #LI-AG1Fitch is committed to providing global securities markets with objective, timely, independent and forward-looking credit opinions. To protect Fitch’s credibility and reputation, our employees must take every precaution to avoid conflicts of interests or any appearance of a conflict of interest. Should you be successful in the recruitment process at Fitch Ratings you will asked to declare any securities holdings and other potential conflicts prior to commencing employment. If you, or your immediate family, have any holdings that may conflict with your work responsibilities, you may be asked to divest yourself of them before beginning work.  For more information about this policy, please visit the code of ethics and conduct page - http://www.fitchratings.com/web/en/dynamic/about-us/code-of-ethics-and-conduct.jsp"}