{"jobID": "2832351565", "jobLocation": "Playa_Vista_CA", "jobTitle": "Sr. Data Engineer", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "OVERVIEW OF THE COMPANY FoxNext  FoxNext is driving immersive, next generation entertainment experiences in the areas of augmented and virtual reality, mobile, console/PC games and location-based entertainment across Twentieth Century Fox Film and Fox Networks Group. The division consists of FoxNext Games, FoxNext VR Studio and FoxNext Destinations. JOB DESCRIPTION We are looking for a dedicated Senior Data Engineer to help grow business intelligence services at Aftershock Studios/FoxNext Games for our premier mobile game titles including James Cameron's Avatar and MARVEL Strike Force. ResponsibilitiesDesign, implement, debug, document, test, and maintain code and systems for ingestion, transformation, storage, and consumption of data from multiple games and millions of playersCollaborate with game teams, product managers, data analysts and technical stakeholders to craft the best solutions for our data driven businessEstimate engineering effort to contribute to sprint planning and keep our delivery on trackEnsure data quality is delivered timely and consistently with active alerting and notifications for escalationQualificationsBachelors in Computer Science or related field or equivalent work experienceStrong Python or Node.js/JavaScript programming skillsSQL databases skillsExcellent communication skillsTwo or more of the following:Experience with relevant stream processing, scheduling, and batch frameworks (e.g. Apache Spark, Kafka, Airflow, etc.)Docker container deployment on KubernetesExperience with relevant managed services (e.g. AWS Kinesis, AWS Lambda, Google Cloud Pub/Sub, etc.)Experience in games industry or a fast-paced company such as growth-phase startupExperience with large data volumes Preferred Qualifications Understanding of functional and object-oriented programmingExperience with data warehouse architecture and data modeling best practicesNoSQL database experience, such as MongoDBExperience with BigQuery, Git, GitHub, Perforce, Jenkins, SplunkInfrastructure management on Amazon Web Services and Google Cloud Platform Division DescriptionAbout Aftershock  Aftershock, a division of FoxNext Games, is on a never-ending mission to create unforgettable games for mobile devices. The studio was built by passionate game makers dedicated to crafting playful, smart, addictively fun experiences. We are a close-knit studio that has steadily grown and brought together some of the most talented and intelligent people in the industry, in a variety of domains. We make cutting-edge mobile games that push the boundaries of what modern devices are capable of. Currently, we are hard at work developing multiple fantastic games, involving some of the biggest intellectual property in the world, such as Marvel Strike Force, an all-new mobile game based on the expansive MARVEL Universe, and a massively multiplayer mobile strategy game for James Cameron's Avatar franchise. We care about the games we make and strive to be able to look back at what we've done with pride. Most of all, we care about our community of players, and when they are happy, we get happy. Many of us have worked together for a long time, and we are always happy to bring in new people that we can learn from, and that will also continue to learn new things while they are here.  About FoxNext  FoxNext is driving immersive, next generation entertainment experiences in the areas of augmented and virtual reality, mobile, console/PC games and location-based entertainment across Twentieth Century Fox Film and Fox Networks Group. The division consists of FoxNext Games, FoxNext VR Studio and FoxNext Destinations.  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law."}