{"jobID": "2824843959", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "A Cloud Guru is the world's leading provider of online IT education. We focus on providing high-quality, affordable and engaging on-demand video courses to hundreds of thousands of professionals. We help our students learn new skills, gain valuable industry certifications, and excel in their careers.A Cloud Guru is the leading provider of cloud computing training for individuals and enterprises. Its an exciting time at A Cloud Guru: we recently eclipsed 600,000 B2C customers; raised an additional $2M of funding in May; and are now focused on building out our B2B feature set and product offering.We have ambitious goals for the year ahead and we need a Senior Data Analyst to join the team to help reach them.What we're looking for:Your mission as a Senior Data Analyst is to deliver amazing dashboards and analysis to the go-to-market team. We are looking for someone that will collaborate with a database engineer to dive into complex datasets to analyse trends, identify opportunities and quantify the potential value of new initiatives.We need a technical, analytical and curious person that really loves what they do and takes pride in their work to support Sales, Marketing and Customer Experience.From the get go - we need you to be able to: Extract, manipulate, and analyze large data sets using SQLOwn reporting and dashboards, with rigorous quality control and timely deliveryImplement standard processes, data infrastructure, operational best practicesDevelop recommendations for changes to investment and marketing strategy, optimize the efficacy of marketing spend based on quantitative analysesBuild well-managed data solutions, tools, and capabilities to enable self-service frameworks for data consumers (read non-technical managers)Foster a shared understanding of our data and metrics by developing and maintaining a data dictionaryEffectively communicate your insights to the rest of the team Our ideal candidate is a Data Analyst with 5+ years experience and the desire to continue to learn. You'll get extra brownie points if you can demonstrate experience with the following: Marketing analytics experienceExperience working with various digital advertising platforms, including but not limited to AdWords, Facebook, Google AnalyticsMasters Degree in Statistics, Marketing Analytics, or other Quantitative fields is highly preferableIf that all sounds a bit daunting, don't let it stop you from applying.As a training provider we strongly believe in giving people the opportunity to learn in fact we encourage it! We know that supporting you and investing in your development so that you can be an effective part of our team...well its just good business sense!Working with usOur people matter to us. We know everyone has family and friends and for that reason our employees receive 5 weeks of leave each year. We understand that time away from work is important and we know well-rested and well-rounded people make better decisions...and ultimately are more productive when at work!We pay commensurate with experience and we make sure youre looked after.Our crewOur team is spread across the globe - mainly the US and Australia. Our engineers and designers work together out of our office in Melbourne, Australia.For this position we will need you to join our team in our offices on Queen Street, Melbourne. We prefer hands on collaboration so this position is not available for remote workers. Unfortunately we're unable to sponsor people into Australia at this time.We are a fast-growing team with big ambitions. We need people who can help us build a solid foundation for the future. If you want to make a difference in a fast-growing team, now is the time to join."}