{"jobID": "2813040587", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Principal Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.realtor.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zillow, Trulia, Redfin"}, "estimatedSalary": "149000", "jobDescription": " At realtor.com data is very important to us and we have lots of it, in motion and at rest. Our goal is to use this data to make the home buying experience a breeze for our consumers. We empower them with most up to date information on properties, and help find their dream homes in the least amount of time and also match them with the most suitable realtor equipped to meet their individual needs.  The Data Engineering team lives and breathes data and has fun doing it. We are not afraid to break and rebuild code to make it better... stronger... faster, to overcome the Big Data challenges of today and tomorrow. We are in the final stages of building out a brand new platform on the AWS cloud using cutting edge technologies. We work on the coolest data projects and products that reports, predicts and affects the outcome - all this using data.  To keep up with our business and data growth, the realtor.com Data Engineering team is expanding. We need Sr. Principal Data Engineers/Architects to join our team.  This impactful role will promote the build-out and usage of the data platform, data-driven decisions and data products for realtor.com, it's customers, partners, and consumers. Additionally, this role will be part of the core team contributing to design and development of realtor.com's new data and analytics platform. Duties and Responsibilities:Define data processing patterns that will be needed in the data platformDefine needed capabilities in the platform and then lead engineering teams to deliver these capabilitiesDesign, develop, and deliver building blocks for products based on data and analyticsDesign, develop and orchestrate data pipelines for real-time and batch data processingDesign optimal storage, data structures, security, and retrieval mechanisms for data at rest in Data lake and Analytics data store or data in motion for real-time processing requirementsDesign and develop reusable components and frameworks for ingestion, cleansing, and data qualityCollaborate with upstream sources and downstream consumers to come up with expandable data contractsDesign and develop Rest APIs/ or web-service consuming clients for data push/pull for both upstream and downstream applicationsHelp guide and grow the technical depth of junior members of the team.Collaborate with data team, product owners, Scrum-master to refine and estimate stories/epicsBe integral part of scrum team to deliver on commitments on time and with good qualityEducation, Skills and Experience:Computer Science/Engineering Bachelors degree or equivalent12+ years of experience or Masters degree in relevant field with 8+ years experience in Data engineering/ Big Data.Solid understanding of distributed programming and experience with EMR or HadoopExpert at SQL and query performance tuningDeep understanding of Cloud technologies (preferably AWS services), and security and how they can be combined to design scalable cloud solutionsExperience with columnar storage and MPP/Analytical DBs (Redshift, Netezza, GreenPlum, Teradata).Expert Python skills. Experience with bash scripting and one or more of Java/Scala/node.jsSolid understanding of software engineering and operationsDetail oriented. Strong prioritization skills and sense of urgencyStrong analytical and problem solving skills. Takes pride in efficient designs and accurate resultsObjectively analyzes the pros, cons, and the tradeoffs of a design path and helps the team to arrive at the most optimal solution, which may not be their ownLoves to learn and experiment with new technologies and shares findings with the teamEffective team player. Honest and respectful of othersAdditional Preferred Skills:AWS CertificationsFunctional programming experienceExperience with Apache Storm (Or any CEP tool) is nice to haveFamiliar with agile development and sprintsExperience with at least one ETL tool (Informatica Cloud, Talend, etc.)Familiarity with machine learning and data analysis packages is nice to have SciPy/NumPy/MatplotLib, R, SAS, SPSS but not requiredFamiliar with how reporting software work (Tableau/MSTR/SSRS etc.)Open source software contribution #LI-JM2"}