{"jobID": "2830526040", "jobLocation": "Grand_Haven_MI", "jobTitle": "Deli/Bakery Clerk (part-time) - 15000 US 31, Grand Haven MI", "companyRating": null, "companyInfo": {"Website": "www.meijer.com", "Headquarters": "Grand Rapids, MI", "Size": "10000+ employees", "Founded": " 1934", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Kroger, Walmart, SpartanNash"}, "estimatedSalary": null, "jobDescription": "At Meijer, it's about our people and their success. Today, we have more than 65,000 employees with the strength to help you grow in any career direction you want, whether in our stores, distribution centers, manufacturing facilities or our Midwest corporate offices. It's your future, maybe it starts with Meijer. What You’ll Be Doing: As a Deli/Bakery Clerk, you will have the opportunity to gain exposure to a variety of retail tasks related to additional services provided by our store, product and customer service. You will create those ‘WOW’ moments that have a positive and lasting impact on our customers. That’s something worth celebrating every day! Assist customers with their orders for a variety of deli and bakery servicesProvide product suggestions and assist customers with special ordersEnsure quality service and products for customers by following safety and sanitation proceduresRespond to customer questions in an effective and efficientWork efficiently in a fast-paced environmentBuild trustful relationships with customers to encourage return visitsStock product and product displays according to merchandising standardsMeijer Rewards:Competitive WagesMedical/Prescription/Dental/Vision Plan CoverageMeijer 401 (k) Retirement PlanPaid Days Off & Holiday PayTeam Member DiscountMeijer Scholarship Opportunities for Team Members and their immediate familiesLeadership Development Training OpportunitiesWhat are we looking forEnjoys interacting with customers one-on-oneHighly-organized with great attention to detailGreat listening and communication skillsMaintain good eye contact and positive body languageComfortable using electronic bakery and deli equipmentAbility to stand for long periods of timeAbility to lift, carry, push, pull, bend, and twist while handling product"}