{"jobID": "2704365052", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst and Visualization Specialist", "companyRating": "3.6", "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": "61000", "jobDescription": " Data Visualization Specialist  Location: DC/VA/MD or Remote  ICF is comprised of experienced professionals with the skills required to unlock the power of governed data discovery. Our staff provides deep technical and business support for data acquisition, data analysis/data science, and interactive data visualizations. Job Description: We're looking for a seasoned Data Analyst and Visualization Specialist who enjoys working directly with clients to design and implement custom data analytic and reporting solutions, including dashboards, in a dynamic and fast-paced environment. This includes working alongside a diverse team of ICF data scientists, data engineers and business analysts to strengthen data integrity, enhance business processes, and improve program design through insightful analysis to government and commercial clients. You will also work closely with project teams to assess, define and implement improved business processes. Over time, you'll be expected to evolve your role to lead clients from simple, pre-existing business intelligence solutions to forward-looking \"what's next\" capabilities using more advanced predictive and prescriptive tools. What you'll be doing:Perform extensive data profiling and analysis of client data.Work with UI teams and/or client to define BI and reporting requirements.Support project delivery on Data Warehouse/BI projects for external and internal clients, technical and non-technical including partnering with ICF subject matter experts on project execution.Provide support to developers by gathering and or clarifying data and reporting requirements from business owners.Explore existing data repositories to understand what data are where so you can leverage those data using BI tools to create reports, dashboards and other analyses.Guide and educate users so they better understand their reporting needs now, and as they evolve over time.Link reporting needs to existing BI tools and help identify solutions that provide best business value to the client.Develop custom reports and data visualization products using large datasets to transform data into actionable insightsMaster's/Bachelor's degree in a technical field (e.g., Mathematics, Statistics, Computer Science, Engineering or related discipline)4 years of experience with data analysis (i.e., statistical and quantitative analyses) and user-focused dashboard design3 years of experience using SQL database technologies (e.g., MS SSRS/SSIS, PostgreSQL) in conjunction with BI tools (e.g., Tableau, PowerBI, QlikView)Preferred Skills/Experience:Prior experience in healthcare or health insurance analytics a plusUnderstand ETL basic concepts of data flow, data enrichment, data consolidation, change data capture and transformationDemonstrated experience showing strong critical thinking and problem solving skills paired with a desire to take initiativeAbility to obtain a Public Trust ClearanceSolid understanding of the software development cycle paired with an ability to define/document business processes and software requirements for technology initiativesProfessional Skills:Excellent listening, written, and oral communication skills paired with an excellent sense of humorAbility to exercise independent judgment while effectively prioritizing and executing tasks while under pressureTeam player with the ability to work on multiple projects in a fast-paced environment ICF is an equal opportunity employer that values diversity at all levels. (EOE Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)  Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf  Working at ICF  Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICFtogether for tomorrowSDL2017"}