{"jobID": "2837215386", "jobLocation": "San_Diego_CA", "jobTitle": "Clinical Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture. General Summary: The Clinical Research Scientist will be expected to take a leadership role in designing the I & I study protocols and overseeing the implementation and conduct of I and I clinical trials to ensure the quality and integrity of data and safe and proper management of line functions deliverables, in coordination with clinical operations and clinical study team members. The Clinical Research Scientist will also compile and summarize data for inclusion in clinical study reports, summary documents for global health authority submissions and responses to assessment questions for submitted dossier. Limited travel required as needed to support clinical programs. Major Responsibilities:Design and develop study protocols and informed consents. Generate/review of other related study documents such as IB, FDA briefing documents and forms (e.g. unique project specific CRFs, diaries, etc.), as neededProvides scientific expertise to other departments and line functionsInterface with project team members, e.g. Clinical Operations, Data Management, Statistics, Drug Safety, Regulatory and Project ManagementAssist the Clinical Research Physician (CRP) to make recommendations, take action and provide clinical research expertise related to projectsAssist in writing and providing scientific input, review, and edits of clinical study reports, Investigator Brochures, INDs, NDA annual reports, integrated medical reports, and other regulatory submissionsReview scientific literature related to assigned programsContribute to the Clinical Development Plan (CDP) and protocols for assigned compoundsAssist with review of ongoing summary data including: safety, primary efficacy variables, laboratory data, etc.May lead clinical development teamActively participates and contributes to study/project team meetings; may represent CRP at study team meetingsServe as a liaison with internal/external scientific and medical experts to ensure protocol execution is consistent with intent. Coordinate and oversee medical or end-point specific training for study protocolsOrganizes and provides training assistance to departments/vendors (scientific/development improvements)Prepare DMC and/or adjudication charters. Prepare deliverables for periodic review meetings and participate, e.g. Study Management TeamParticipate in and assist with advisory/scientific boards. Prepare and present clinical data at external scientific/board meetings as neededProvides Clinical Management with regular study updates/status reports on study dataAssist with budget projections for clinical activities (such as consultants, advisory board meetings, etc.) for assigned clinical programsPerform other tasks as assigned by supervisorKnowledge, Skills and Abilities Required:Experience with medical or technical writing preferredExtensive medical/scientific and clinical research knowledgeAdvanced analytical and influencing skillsKnowledge of early and late phase clinical program developmentProficient at data interpretationExpert understanding of global clinical study design and drug development processes Knowledge of GCP and ICH GuidelinesExperienced in presenting at Investigator MeetingsDetail-oriented, well-organizedAbility to multi-taskAble to work independently; exercise sound judgment, and escalate issues when necessaryAbility to assimilate technical information quicklyProficient in Microsoft Word, Excel, PowerPoint; proficiency in Microsoft Project, Visio, and electronic document repository system a plusDemonstrated ability to work as part of a teamHigh level of interpersonal and communication skills (written and verbal) #LI-POSTEmployer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}