{"jobID": "2811728089", "jobLocation": "Princeton_NJ", "jobTitle": "Computer Scientist, Vision Systems Group", "companyRating": "3.5", "companyInfo": {"Website": "www.sri.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " SAIC, Leidos, Battelle"}, "estimatedSalary": "118000", "jobDescription": "Title Computer Scientist, Vision Systems Group  06-Jun-2018 Job Description SRI International’s Center for Vision Technologies offers end-to-end machine learning solutions that translate into real-world applications. Our scientists have pioneered real-time, real-world systems in multimodal (text, audio, and vision) analytics, 3D scene understanding, object recognition, and activity recognition. We continue today with fundamental research in Explainable AI and Lifelong Learning. We are building scalable and adaptive cognitive systems to enable analysis with unprecedented speed and precision.  We are looking for a creative and energetic research scientist with a strong academic and practical background in machine learning. A successful candidate needs to demonstrate the ability to conduct state-of-the-art research, preferably in the area of lifelong learning, meta-learning, and continual learning. You will develop end-to-end systems in applications for imaging, vision and other sensing domains. The right candidate will possess a strong technical background and software development, understanding methods for working across different program teams. You must be able to thrive and succeed in a fast-paced research environment. Maturity, innovation, design judgment and the ability to be a team player are essential to succeed in this role. Responsibilities include:Support structured algorithm and system research in machine learning. Support operational prototype developments and investigate their deployment in real world operations.Support the development of exploring novel solutions for autonomous and cognitive systems in the area of computer vision, computational sensing, computing, and related areas.Support development of software for PC, smartphones, FPGAs, and GPUs.Develop software under robust and agile methods, including design, documentation and revision control practices.Support development of new IP within government, commercial, and internally funded programs.Auto req ID1793BRLocation(s) Princeton, NJ Other Requirements-There are no additional requirements for this position.Employment Status Full Time QualificationsMasters or PhD in Computer Science, machine learning or related field.One or more years of relevant work experience is desired.Must possess strong Software Engineering skills and communication skills.Solid programming skills, including experience with Python or C++.Experience with machine learning software packages (e.g., scikit-learn, TensorFlow, Caffe, Theano, Torch/PyTorch).Experience with one or more of the following: deep learning, Bayesian reasoning, learning for search, learning from semi-structured data, reinforcement or active learning, energy-based learning, deep complex networks, strategy game AI, and large-scale ML software systems.Publications in top-tier conferences or journals in your field.Desired Qualifications:US Citizenship/Permanent Residency is preferred, clearances are a plus. Exceptional candidates in non-immigrant status will be consideredEOE/AA SRI is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Background Check Candidates who receive a conditional offer of employment will be subject to a background check. "}