{"jobID": "2764485766", "jobLocation": "Detroit_MI", "jobTitle": "Customer Success Manager (Virtual)", "companyRating": "4.1", "companyInfo": {"Website": "www.dynatrace.com", "Headquarters": "Waltham, MA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": "The Customer Success Manager (CSM) is responsible for managing success, preserving renewals and identifying growth opportunities for assigned accounts in their territory by setting goals, driving adoption, demonstrating value and focusing on growing relationships with key account personnel. The CSM will drive renewals and account growth, navigate enterprise organizations, and collaborate with our Champions and Dynatrace account team alike to ensure on-time renewals.Position Description & Responsibilities Accelerate customer adoption of Dynatrace SaaS/Managed product portfolio through technical enablement, usage training, project planning, and basic onboardingOwn renewal strategy and subsequent on time renewal of subscription(s)Build Dynatrace brand awareness and loyalty in assigned accountsDefend against competition in assigned accountsConduct regular proactive calls and account review meetings; maintain an accurate record of discussion and action items via Salesforce.com and GainsightEnsure that critical issues are documented and escalated in an expeditious manner for resolutionCoordinate account activities with sales teams for assigned accounts within territoryIdentify strategic, new business growth opportunitiesHelp customers understand our product roadmap and promote migrations as necessaryLeverage relationships to aid in the building of reference accounts/contactsAct as customer advocate and liaison to become a Trusted AdvisorTravel as requiredQualificationsA strong business acumen and commercial outlook with a good conceptual understanding of IT operations processes and best practicesBasic technical understanding of cloud, new stack, and application performance technologyProven expertise working with the executive level in client environments, as well as with procurement and business ownersExcellent verbal, written and interpersonal communication skillsAwareness of the APM marketplace with an understanding of where Dynatrace is positioned and their key strengths above the competition.Highly motivated, energetic and committed to getting resultsAbility to develop strong relationships with the user/customer/internal communitiesUnderstanding of Internet, web and mobile applications; knowledge of HTTP, HTML, JavaScript etc.Dynatrace has redefined how you monitor todays digital ecosystems. AI-powered, full stack and completely automated, its the only solution that provides answers, not just data, based on deep insight into every user, every transaction, across every application. The worlds leading brands, including, 72 of the Fortune 100, trust Dynatrace to optimize customer experiences, innovate faster and modernize IT operations with absolute confidence.We offer competitive compensation, company-sponsored premium benefits, medical, dental, vacation/holidays, company matching 401(k) Plan, etc. Dynatrace is an equal opportunity employer and VEVRAA Federal Contractor. We consider all qualified applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law. If your disability makes it difficult for you to use this site, please contact recruiting@dynatrace.com. Dynatrace participates in E-Verify, participant information in English and Spanish. Right to work information in English and Spanish. EEO is the Law/EEO is the Law Supplement.Note to Recruiters and Placement Agencies: Dynatrace LLC (Dynatrace) does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Dynatrace employee. Dynatrace will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Dynatrace."}