{"jobID": "2787350850", "jobLocation": "Irving_TX", "jobTitle": "Senior Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "83000", "jobDescription": "What you’ll be doing... Our Digital IT team is looking for a Senior Data Engineer/Data Analyst to help us develop our next generation digital real time analytics platform. Loading data from multiple disparate sources.Writing and optimizing complex queries.Performing exploratory data analysis (EDA) using the latest visualization and analytical tools.Presenting findings and explaining results to management.Filtering, aggregating and transforming data based on direction from SME's and data scientists.What we’re looking for... You are a strong developer who is agile enough to take on any project, regardless of platform or framework. You not only understand coding but also love analyzing data to generate insights and ideas. You have a strong sense of architecture, deployment and operational skills.  You'll need to have: Bachelor’s degree or four or more years of work experience.Six or more years of relevant work experience.Experience with Linux/Unix operating systems.Experience on the Hadoop platform including Big Data tools.Experience developing shell scripts and running cron/oozie/spark jobs on Hadoop platform.Experience with Kafka, Hive, HQL.Experience with analytical and visualization tools like ELK, Splunk, Tableau.Experience writing Transformers and Estimators in SPARK and creating machine learning pipelines and models. Even better if you have: Master's degree.Experience in SPARK using Python/Scala to transform data and create quality data sets for machine learning.Experience and understanding of common machine learning algorithms including classification and regression algorithms.Working experience with Cloud platforms.Experience in building reports using Tableau.Knowledge of business intelligence and analytics software and best practices.Experience using statistical techniques and quantitative methodologies that are used in decision making applications.Ability to work independently, and multi-task under short deadlines.Effective verbal and written communication skills.When you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}