{"jobID": "2814003375", "jobLocation": "Sterling_Heights_MI", "jobTitle": "HR Data Analyst", "companyRating": "4.9", "companyInfo": {"Website": "www.moseleytechnical.com", "Headquarters": "Huntsville, AL", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": " Be a part of a fortune 500 Combat Systems group and a global leader in the design, development, production, support and enhancement of tracked and wheeled military vehicles. Our client has a 70 year defense heritage of providing a full spectrum of high quality, technically superior, high value products and services to the United States and its Allies. Their employees are dedicated to making the Company the World’s preferred supplier of land vehicles and weapons systems.  If you take pride in your work, want a challenge that inspires your best ideas, and enjoy being part of a winning team, this is the place for you. HR Data Analyst (U.S. Citizenship Required*)Sterling Heights, MI2018-6192 Under the direction of the Manager of HRIS and Human Capital Analytics, the HR Data Analyst will be responsible for cross-functional mining of data to be used to create a data analytics scorecard and dashboard. This data will be used to provide analysis, metrics, executive reporting, and predictive analysis for Human Resources. Help respond to the business requirements for People Analytics and help to create an appropriate dashboard to provide on demand reporting on same.Responsible for data validation and for creating technology to support dashboards & reports.Experience working requirements with report writing tools for complex databases required. Human Resources background preferred. Financial or business analyst required.Experience with web services and web reporting (PHP or ASP) required. Experience creating and transmitting interfaces required.Advanced proficiency with reporting and analysis applications.Excellent proficiency in data analysis and reporting using BI tools with databases and data warehouses directly.Must be able to work with databases and large data sets and ensure accuracy.Able to look at the big picture, speculate and conceptualize outcomes used to help identify trends.Must be able to complete assigned tasks effectively, efficiently, accurately, with high quality and on time.Strong verbal and written communication/documentation skills. Proficient at developing highly informative and visual presentations for senior leaders.Proficient with other Microsoft Office products (Word, Access, PowerPoint, Excel).Highly detail-oriented, analytic, energetic and self-motivated individual. *U.S. Citizenship is required by law, regulation, executive order, or government contract. Education and Experience:Bachelor’s degree and a minimum of 6 years of related experience preferredConditions of Employment: Applicants selected for employment will be required to pass a pre-employment drug screening and background investigation which may include education, criminal and work history verifications. About Our Company: Moseley Technical Services, Inc. is dedicated to providing our clients with a high standard of quality products and services. For two decades, our reputation has been built on this dedication and the long-term relationships developed with some of the most prestigious companies in the aerospace and defense industries. These business relationships give you the opportunities to not only find a job but to find one you can value and enjoy. We will be dedicated to you and to making your career a success.  Accepted applicants will have the opportunity to be eligible for benefits, including medical and supplemental insurance and a 401K. Appreciation and gratitude for employees is a hallmark of organizations with low turnover.  Moseley Technical Services, Inc. is an AA/EEO/Veterans/Disabled Employer.  Join a team that values your experience!"}