{"jobID": "2796623691", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist, Machine learning and Predictive Analytics, Big Data Platform, Insurance", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist, Machine learning and Predictive Analytics, Big Data Platform, Insurance DATE 14 May LOCATION Chicago COMPENSATION $200,000.00 KEY SKILLS DESCRIPTION  One of the largest personal lines insurance firms globally, is looking for exceptional data science talent, to build a new advanced analytics team. The plan is to build a new big data, and machine learning platform to greatly assist consumer insight, pricing, and marketing, while still utilizing predictive modeling and statistical techniques. Currently using mainly Python, and R, they are looking to upgrade to a big data technology platform and utilize Hadoop and Hive.  FURTHER DETAILSJOB DESCRIPTION  Take part in an exciting opportunity with our one of highly reputable clients based in Chicago. Our client is looking to expand their analytics team with highly skilled and motivated individuals to advance their business. As a data scientist, you will conduct cutting edge analyses that drive strategy and operations. You will use claims, business, consumer and other data sources to develop innovative solutions to meet the client’s needs. The ability to communicate technical information via verbal discussion, reports or presentations also is essential.  You will report to the VP.  Desired Skills and Experience  • Experience as a data science/analytics expert, ideally with demonstrated big data and machine learning innovation  • Expert statistical and mathematical skill set, with advanced techniques such as random forest, regressions, GLM etc.  • Experience with machine learning – text mining, NLP, neural networks, Hadoop, Python, etc.  • Understanding of SQL, R, SAS  • Strong academic background, ideally with a PhD in an a field associated with data science/ predictive analytics i.e. Computer Science, Electrical Engineering, Statistics, Operations Research, Machine Learning CONTACTAPPLY | insurance.americas@gqrgm.com  VISIT US | www.gqrgm.com  While a resume is preferable we also welcome tentative enquiries from well-qualified persons. Utmost confidentiality and discretion is assured.  LOS ANGELES | 1.310.807.5030  10877 Wilshire Boulevard, Los Angeles, CA 90024 | Office Hours: 7.00-20.00 PDT  NEW YORK | 1.212.763.8333  340 Madison Avenue, New York, NY 10173 | Office Hours: 8.00-20.00 EDT  LONDON | 0203.141.8000  Westminster Tower, London SE1 7SP| Office Hours: 8.00-20.00 GMT  HONG KONG | 852.3678.6738  2 Exchange Square, 8 Connaught Place, Central | Office Hours: 9.00-21.00 HKT  GQR Global Markets  We are committed to protecting and respecting your privacy. Information on our privacy policy, together with our terms of business are available at www.gqrgm.com.  For the latest vacancies, please join our group on Linkedin: http://www.linkedin.com/groups?gid=1615777&trk;=myg_ugrp_ovrWhile a resume is preferable we also welcome tentative enquiries from well-qualified persons. To speak with an  agent please contact one of our regional offices. Utmost confidentiality and discretion is assured."}