{"jobID": "2829539562", "jobLocation": "Irvine_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.sunrisesys.com", "Headquarters": "Edison, NJ", "Size": "501 to 1000 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Sunrise System Inc. is currently looking for Data Analyst in Irvine, CA with one of our top client.  Job Title: Data Analyst  Job Id: 18-09503  Location: Irvine, CA 92612  Duration: 6 months  Position Type: Hourly contract Position (W2 only)  Description  The Reporting Analyst (Data Analyst III) is responsible for designing, creating and verifying data reports, metrics and visualizations of post market surveillance and sales data.  The workflow is largely Business Objects reporting, followed by post processing in Excel.  The work product supports management reviews and regulatory submissions, as well as other diverse areas of the business.  The Analyst is responsible for project management of the reports, including defining and negotiating reporting requirements with various clients.  A skilled analyst works in a highly collaborative manner, often educating clients on ways to address their data oriented problems.  They document workflow, status, appropriate verification and approvals of reports.  They also ensuring work product meets the requirements of clients, incorporating learning into future continuous improvement.  The Analyst supports creation of aggregate safety reports, signal detection reports and presentations for various management reviews, including investigating safety signals, including use of statistical technique.  The Analyst uses a wide variety of tools, especially Business Objects family of applications,  advanced spreadsheet work and statistical packages.  Support key business initiatives as required, providing statistical analysis, application design and interactive visualizations of data.  Most Important is Business Objects experience and advanced Excel skills as listed below.  Other platforms (listed below) instead of BO would be considered if we do not get BO experience.  Education and Experience  Combination of Education and Experience to Satisfy one of the following three options:  Master's degree in Computer Science (or equivalent) with 1+ years of experiences or  Bachelor's degree in Computer Science (or equivalent) with 1+ years of experience or  Bachelor's degree in sciences or engineering plus 1+ years of experience in report and query creation using database query or report tools.  2+ years of experience in the Device or Pharmaceutical industry highly preferred  Essential Skills and Abilities  Experience in Business Object (BO is most preferred.  Will consider candidates with other similar query and report tools such as DOMO, Tableau, Spot fire, MS Power BI, etc.)  Ability to design and create Business Object (or equivalent... BO preferred), queries and reports.  Advanced ability with Excel spreadsheets such as Pivots, nested functions in formulas, v lookups.  Ability to work collaboratively with clients to generate reporting requirements.  Ability to translate user needs (requirements) into business solutions.  Ability to document user requirements.  Extensive computer proficiency.  Other skills as listed in the job description.  Contact  Vishal Tejaswi  Desk:732-3725-0312 | Email: vishal.t@sunrisesys.com  Or  Sourabh Agrawal | Lead - Talent Acquisition  Direct: (732) 272 0301| Email: sourabh@sunrisesys.com"}