{"jobID": "2807729256", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "163000", "jobDescription": "Requisition ID: 178833 Work Area: Information Technology Expected Travel: 0 - 10% Career Status: Professional Employment Type: Regular Full Time    COMPANY DESCRIPTION As market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably.    ROLE DESCRIPTION: As a Senior Data Scientist, you will be working with a small team of passionate Product Managers, Software Engineers and QA members to develop cutting edge, state-of-the-art SaaS applications. The ideal candidate is a self-starter who has strong hands-on data science experience from problem discovery and data exploration to conceptualization, prototyping, implementation and delivery. Proven ability to learn and use new technologies to build innovative data driven applications is a must. If you are excited about using data to drive business insights that significantly improve people’s work lives, this is the team for you.    EXPECTATIONS AND TASKS: * Design, develop and maintain software applications using state-of-the-art machine learning and predictive analysis tools Research, recommend and implement new data science approaches, algorithms and technologies that can help enhance product capabilities, improve product quality and deliver business insights.Follow standard application development standards and best practices as well as those tailored to our internal development environmentActively participate in contributing to the internal knowledgebase through Wikis, Forums and other collaboration mechanisms    WORK EXPERIENCE: * Expertise in data science tools: R, Apache Mahout, Spark MLlib, Python scikit-learn, SPSS, SASVery good understanding of data structures and algorithms preferably dealing with big datasetsVery good understanding of SQL and related database technologies, preferably with SAP HANA.Good understanding of MVC architecture based SaaS application stackWorking knowledge of UML, design patterns and software development life cycleWorking knowledge of software development tools like Git/Subversion, Eclipse/JetBrains, JIRA/Bugzilla, etcExperience of working in an Agile development environment, preferably SCRUMWillingness and ability to learn new data science methods and tools with little guidance    EDUCATION AND QUALIFICATION / SKILLS AND COMPETENCIES: * M.S. in Computer Science or equivalent required    SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.     SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability. Additional Locations:"}