{"jobID": "2726222061", "jobLocation": "Montclair_NJ", "jobTitle": "Research Scientist (Multiple Postions)", "companyRating": "3.8", "companyInfo": {"Website": "www.montclair.edu", "Headquarters": "Montclair, NJ", "Size": "1001 to 5000 employees", "Founded": " 1908", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Posting Date  April 6, 2018 Position Title  Research Scientist (Multiple Postions) Vacancy #  V-1458 Department  Family Science and Human Development Division  Academic Affairs Job Description The Research on Youth Thriving & Evaluation Institute (RYTE) explores questions related to developmental science and program evaluation and planning from a systems science perspective. Post-doctoral Researcher/Research Scientist in RYTE come from a variety of departments and disciplines including education, health and nutrition sciences, family and child studies, and psychology.  The Research Scientist will conduct independent research as a member of the Institute for Research on Youth Thriving and Evaluation (RYTE) at Montclair State University in Montclair, NJ, under the supervision of co-Directors Dr. Jennifer Urban & Dr. Miriam Linver (http://www.montclair.edu/ryte-institute/). The Research Scientist will work primarily on the Boy Scouts of America (BSA) National Character Initiative Project (examining the training of adult volunteers, and the character outcomes for youth) and the existing Inspiring Purpose Grant. PRINCIPAL DUTIES AND RESPONSIBILITIES:The Research Scientist will take a lead in both the quantitative and qualitative research of the projects.Specific responsibilities include, but are not limited to:Lead an effort to develop quantitative and qualitative measures for assessing youth characterManage a team of phone interviewers conducting interviews with youth and adultsDirect coding and analysis of participant interviewsAssist with quantitative survey analysis, with multiple waves of youth and adult dataIndependently manage data and analysis of mixed-methods datasetPresent research findings at national meetingsPublish research findings in peer-reviewed journalsConduct grant writing and report writing for funders and other external audiences Qualifications & RequirementsThe successful candidate will be a highly motivated individual able to work efficiently and productively in a fast-paced research environment. Candidates must have a Ph.D. or Ed.D. (or have ABD status and a scheduled date for their dissertation defense) in a social science field with a focus on human development, evaluation, or a related field (e.g., psychology, education, sociology, family science), as determined by the Principal Investigators. Candidates should be able to work independently on project goals, and lead the work of doctoral assistants and graduate assistants. Candidates should also have knowledge of research methods, qualitative data analysis, and quantitative data analysis. Candidates must also demonstrate enthusiasm for intellectual rigor and engagement; excellent writing ability and publication record; experience working in a team environment; an ability to work both independently and collaboratively; and excellent interpersonal skills. Salary RangeCommensurate with experience. Anticipated Start Date  Open until position is filled.Send cover letter and resume to  (include vacancy # if above)*When creating your profile, you will need to combine your resume and cover letter into one single document (PDF or MS Word).* Apply here Apply By  Review will begin immediately and continues until position is filled. Organizational Marketing Statement: Montclair State University With a proud history and a vibrant future, Montclair State University is one of New Jersey’s most diverse and dynamic institutions of higher education. One of four public research institutions in the state, Montclair State is designated a Research Doctoral 3 University by the Carnegie Classification of Institutions of Higher Education.  Located 12 miles west of New York City on a 252-acre suburban campus which boasts modern, state-of-the-art facilities complemented by green spaces, public plazas and striking Spanish Mission architecture, the University offers a comprehensive undergraduate curriculum with a global focus; a broad variety of superior graduate programs through the doctoral level; and a highly productive, dedicated and diverse faculty and student body.  The University’s 10 colleges and schools offer more than 300 undergraduate and graduate majors, minors, concentrations and certificate programs, and with more than 120 student organizations and 18 NCAA Division III athletic teams for men and women, Montclair State offers its students a comprehensive college experience. EEO/AA Statement: Montclair State University is an Equal Opportunity/Affirmative Action institution with a strong commitment to diversity.  Additional information can be found on the website at www.montclair.edu/human-resources/about-us/eo-aa-and-diversity/"}