{"jobID": "2837661502", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data and Reporting Analyst", "companyRating": null, "companyInfo": {"Website": "www.akraya.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Palo Alto Staffing, Artech Information Systems, TEKsystems"}, "estimatedSalary": null, "jobDescription": " Data and Reporting Analyst : 18-02536  Ref No.: 18-02536  Location: Sunnyvale, California  Akraya is looking for a  Data and Reporting Analyst for one of our clients. If the job description below is a fit, please apply directly or call  Ruhana Shaikh at ************.  If this position is not quite what you're looking for, visit ********** and submit a copy of your resume. Our recruiters will get to work finding you a job that is a better match at one of our many clients.  Primary Skills: Javascript, Apps Script, SQL and/or BigQuery, coding, reporting,  Duration: 0-12 Months  Location: Sunnyvale, CA  Contract Type: W2 Only  Role Description Gather business requirements and determine most effective and efficient reporting platformDesign and develop metrics and reports, dashboards and analyses to drive key business decisionsConduct large scale data analysis and modeling to derive actionable insightsReview outputs for trendsWork with team to conduct root cause analyses and communicate improvement recommendations Profile requirements Required Coding experience with Javascript, Apps Script, SQL and/or BigQueryStrong background in KPI Dashboards development and automation and information systems managementStrong visualization experience - charts, bars, images, dynamic reports etc.Some exposure to Procurement, Planning and Product Lifecycle Management functionsExcellent Oral/Written Communication and Stakeholder management SkillsExcellent analytical and problem solving skillsSelf-driven, ability to work in an unstructured environment with minimal supervision Preferred Degree in Information Management Please apply directly with your update resume or call Ruhana at ************  About Akraya  Akraya, Inc. is an award-winning staffing firm that works with many of the leading, technology-based companies around the world. We have been ranked as one of the Best Staffing Firms to Temp for by Staffing Industry Analysts on multiple occasions and are a preferred staffing vendor within numerous staffing programs. Please visit ********** to search through all of our current openings or to submit your resume to our recruiting team."}