{"jobID": "2827557003", "jobLocation": "Branchburg_NJ", "jobTitle": "Scientist-Technical Service Mfg Sciences Laboratory-Upstream", "companyRating": "3.8", "companyInfo": {"Website": "www.lilly.com", "Headquarters": "Indianapolis, IN", "Size": "10000+ employees", "Founded": " 1876", "Type": " Company - Public (LLY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": " Req ID 41731 Title Scientist-Technical Service Mfg Sciences Laboratory-Upstream City Branchburg Park State / Province New Jersey Country United States Region North America Company Overview At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We're looking for people who are determined to make life better for people around the world. Responsibilities The Technical Services/Manufacturing Science (TS/MS) Laboratory in Branchburg supports commercial and late stage clinical manufacturing of recombinant mammalian therapeutics through the development and use of comprehensive small scale models, both upstream and downstream. Our vision is to support the smooth, timely and efficient transfer of new molecules in and out of the site with facility fit and cGMP compliance in mind, as well as to support commercially manufactured products. We are committed to streamlining manufacturing through creative experimental design and an in-depth knowledge of the relevant molecules and processes. The position requires strong technical knowlege of cell culture, includingexperimental design, planning, hands-on laboratory work, data analysis and report preparation, as well as ability to mentor upstream associates.  We are looking for a talented senior upstream scientist/engineer to join the TS/MS lab, who will be responsible for designing, planning, executing and troubleshooting of laboratory experiments in support of manufacturing operations, continuous improvement, process validation and technology transfer. The candidate should have a strong background in upstream cell culture, bioreactor experimental design/operation, and can mentor others in this area. The candidate will be expected to develop and lead upstream projects and have a solid understanding of how upstream process parameters can affect monoclonal antibody critical quality attributes. Prior experience in analytical methods is preferred, and would be cross-trained to understand and perform such methods related to TS/MS projects. Key Objectives/Deliverables: Process Support, Process Improvement, and Technology Transfer Provide expertise in the area of recombinant biologic production process, bioreactor engineering, and scale-up principles; have an in-depth knowledge of the science (including analytical) behind the molecule and the process.Lead the transfer and qualification of cell culture/bioreactor laboratory models from R&D; for late stage clinical and commercial manufacturing processes.Design and perform laboratory experiments in scale-down models designed to further understand and improve the process. Work with Manufacturing to resolve technical issues / deviations and implement corrective / preventative actions in the plant.Collaborate with R&D; and Manufacturing to develop, transfer and implement well-understood, robust and fit-for-purpose process control strategies.Use comprehensive business and technical knowledge/experience to drive solutions for products and processes across sites and biologics portfolio.Author/review technical reports, presentations and manuscripts. Communicate results across functions, sites and scientific meetings.Authors manuscripts and presentsUnderstand, and perform all job responsibilities in compliance with, safety and regulatory expectations. 41731BR Basic Qualifications Have attained a BS degree in Bio/Chemical Engineering, Biology, Bio/chemistry, or related science  And  Min 7yrs experience post degree scientific, academic or industry experience  Qualified candidates must be legally authorized to be employed in the United States. Lilly does not anticipate providing sponsorship for employment visa status (e.g., H-1B or TN status) for this employment position.  Additional Skills/Preferences Experienced in cell culture techniques used in the manufacturing of recombinantly expressed therapeutics. Experienced in statistical data analysis and knowledge of design of experiment (DoE) principles.Experience with bioreactor setup/operation/troubleshooting and scale-up/scale-down engineering principles.The ideal candidate would gain the process understanding to later rotate into a front-line TS/MS process support role in the manufacturing plant.Have prior understanding of cGMP and regulatory requirements. Additional Information This position is located in Branchburg, NJ.  Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status."}