{"jobID": "2831762542", "jobLocation": "Dallas_TX", "jobTitle": "Associate Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.cbre.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1906", "Type": " Company - Public (CBRE) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": "JOB SUMMARY Responsible for ensuring the business makes better decisions through collection and usage of data. Ensures business data and analysis requirements are met by properly applying data concepts, including data structures, collection and cleansing, and structured and unstructured data analysis and reporting. Ability to collect, analyze, manipulate, and report on CBRE data. ESSENTIAL DUTIES AND RESPONSIBILITIES Uses Big Data tools (Hadoop, Spark, H2O, AWS, Azure) to conduct the analysis of structured and unstructured data across multiple data sources, reflecting global real estate markets and the operations of real estate assets.  Writes software to clean and investigate large, messy data sets of numerical and textual data.  Integrates with external data sources and APIs to discover interesting trends.  Builds machine learning models from development through testing and validation to our millions of customers in production.  Designs rich data visualizations to communicate complex ideas to customers or company leaders.  Investigates the impact of new technologies on the future of digital banking and the financial world of tomorrow  Other Duties as Assigned SUPERVISORY RESPONSIBILITIES No formal supervisory responsibilities in this position. May provide informal assistance such as technical guidance, and/or training to coworkers. May coordinate and assign tasks to co-workers within a work unit and/or project. QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  EDUCATION and EXPERIENCE  Bachelor's Degree in Computer Science or Data Analytics with typically 0-3 years of experience in either open source programming languages such as, Python, Scala or R, machine learning, Amazon Web Services or Azure; equivalent combination of education and/or experience.  Master's Degree is preferred. COMMUNICATION SKILLS Excellent written and verbal communication skills. Strong organizational and analytical skills. Ability to provide efficient, timely, reliable and courteous service to customers. Ability to effectively present information. FINANCIAL KNOWLEDGE Requires knowledge of financial terms and principles. Ability to calculate intermediate figures such as percentages, discounts, and/or commissions. Conducts basic financial analysis. REASONING ABILITY Ability to comprehend, analyze, and interpret documents. Ability to solve problems involving several options in situations. Requires intermediate analytical and quantitative skills.  OTHER SKILLS and/or ABILITIESUnderstanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.  Experience with common data science toolkits, such as R, Weka, NumPy, MatLab, juypter etc  Experience with data visualization tools, such as D3.js, GGplot, etc. SCOPE OF RESPONSIBILITY Decisions made with understanding of procedures and company policies to achieve set results and deadlines. Responsible for setting own project deadlines. Errors in judgment may cause short-term impact to co-workers and supervisorSDL2017"}