{"jobID": "2770211214", "jobLocation": "San_Francisco_CA", "jobTitle": "Research Data Analyst IV", "companyRating": "3.9", "companyInfo": {"Website": "www.ucsf.edu", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1864", "Type": " College / University", "Industry": " Unknown", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": "Research Data Analyst IV11-May-2018Job Code and Payroll Title6610 Research Data Analyst IV Job SummaryJOB OVERVIEWThe Department of Epidemiology and Biostatistics at UCSF is seeking a highly motivated candidate with advanced statistical programming and data management skills to support the work of the Cardiovascular Disease Policy Model research group. The Statistician will apply extensive knowledge as a research professional with an in-depth understanding of statistical techniques designed to support a broad range of research projects. The Statistician will take the lead in planning and conducting analyses using large and complex databases, including but not limited to cross-sectional and longitudinal data from national surveys, epidemiologic studies, and hospital and health system databases. The individual will interface with the team’s researchers and computer programmers to establish systems allowing for seamless integration between estimates generated from this range of sources and our mathematical model of chronic disease. As new projects arise, the Statistician will work with researchers to brainstorm data sources and methodologic approaches and will plan, troubleshoot, execute, and describe results and caveats to the research team. DEPARTMENT OF EPIDEMIOLOGY & BIOSTATISTICSThe Department of Epidemiology and Biostatistics is a department in the School of Medicine (SOM) with a vision to advance discoveries and insights into the distribution, determinants and outcomes of disease that will drive improvements in population health worldwide. Its educational mission is to train students in epidemiologic and biostatistical methods for studying disease etiology and prevention, for evaluating tests and treatments, and for using evidence-based approaches in clinical practice and population health; scientific mission is to perform outstanding basic, clinical and population health research along a spectrum from molecules to society and to develop tools for the translation of knowledge that will improve clinical practice and population health and ensure optimal use of resources; its clinical mission is to support the practice of public health and preventative medicine in local, state, national and international health agencies.ABOUT UCSF The University of California, San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It is the only campus in the 10-campus UC system dedicated exclusively to the health sciences.OrganizationCampusReq Number49513BRLocationMission Hall - Mission BayJob TitleStatisticianPercentage100%Shift Length8 Hours ShiftDaysWork DaysMonday - Friday, 8:00 am. - 5:00 pm.Required Qualifications• Bachelor's degree in statistics, biostatistics, data analytics or related field and 5-10 years of related experience• In-depth knowledge of statistical theory and methods• Advanced statistical background and programming skill at a level to evaluate alternate solutions and develop recommendations• Advanced skills associated with statistical analysis, database management and systems programming• Advanced skills in analysis and consultation• Advanced ability to communicate complex information in a clear and concise manner both verbally and in writing to technical and non-technical audiences• Advanced ability to think creatively to strategize solutions relative to research needs• Ability to juggle multiple projects at the same time and adjust workflow along with changing priorities of the team• Ability to work with minimal supervision as well as part of a teamNote: Fingerprinting and background check required.Preferred Qualifications• Master’s or PhD degree in statistics, biostatistics, data analytics or related field• Advanced project management skills. Ability to lead and influence within and external to project team.• Experience working with large, complex longitudinal datasets including health systems data• Experience working in multidisciplinary groups and consulting with trainees and researchers without formal statistical trainingLicense/Certificationn/aPosition TypeFull TimeDepartment NameEpidemiology & BiostatisticsEqual Employment OpportunityThe University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information."}