{"jobID": "2820065974", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Operations Analyst", "companyRating": "4.9", "companyInfo": {"Website": "www.orbitalinsight.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Orbital Insight is a product company, and each of our products is unique and rooted in a different domain. We combine multiple different types of data to provide our customers with unprecedented insights. However, that only works if the data is actually good. Whether the data comes from external sources, or we generate it ourselves, Data Operations is charged to ensure its quality. At Orbital Insight the Data Operations team is responsible for three things: (1) Finding and creating labeled (training/testing/IP) datasets for the computer vision, data science and product teams. (2) Product and prototype domain research. (3) Managing all content across the organization, including its quality and its organization. Our quickly growing team is made up of data, research and operations specialists each with a passion for excellence and a willingness to be there for the team. And we all have a tattoo of data! (Not really)We need you to own the data quality for a product. Whether its finding, scraping and cleaning open source data, evaluating and parsing proprietary data, running annotation campaigns, or building and executing on quality-monitoring processes, you will need to scope the effort, organize it, manage it and doing all of it in close collaboration with other analysts, product managers, data scientists, computer vision engineers and so on. Its a big job and it requires an intrepid professional with a keen eye for detail and who is an indefatigable defender of quality.The world is a very big place. With a single photograph of Earth, like the famous \"Blue Marble\" from Apollo 17, the entire world can fit on a computer screen. However, with this image you would not be able to see much detail. To see the Earth and all of its rich features, you would need a lot more images. In fact it would take over 500 million images just to observe the land area of Earth at 1 meter pixel resolution.In order to see detail and work at scale, we use computer vision and machine learning. Using convolutional neural networks, we have counted over 3 billion cars across global roads and parking lots, analyzing commercial patterns as well as city growth and development. Our global energy product uses computer vision to map floating roof oil tanks and measure the global volumes of crude oil. With this product, we were able to show that China has 200 million barrels of oil storage capacity that was unknown even to the trading community. Other projects include tracking rates of deforestation, measuring poverty levels around the globe, monitoring construction rates of new roads and buildings, and predicting crop yields. This is still the beginning of our mission to understand the Earth.This position is based in Mountain View until we move to our Palo Alto office this summer.Job Duties Own internal data quality for a productInform the creation of tools that help monitor and maintain data qualityBe proactive to find issues and identify new problems in the productManage and conduct research for industry-specific insights and dataCommunicate with industry experts from a variety of fieldsWork closely with data science, computer vision, and product to create and manage data ops processes for scraping, munging, annotating and monitoringSupport product managers on data acquisition, processing, and cleansing tasksWork relentlessly to improve all of the above existing processes Skills & Qualifications Bachelors Degree in analysis and research-heavy field (e.g. International Affairs, Economics, Political Sciences, Physical Sciences, etc.) Masters degree preferred2+ years of industry experience in a data-rich environmentExperience in handling large amounts of data of disparate typesProficient in SQL, UNIX, Python, and scriptingPassion for clean dataAble to scope, prioritize and execute on multiple projects simultaneously at high quality and in a timely mannerAble to take ownership of processes and tools and have excellent follow throughSelf-starter who thinks strategically and analytically; is able to break problems down step by stepSuperb organizational skills; incredible attention to detail; understands the value of documentation and organization of processes as they are built from the ground upWorks well under pressure and tight deadlinesExcellent verbal and written communication skillsAble to work both independently and as part of a team Additional Skills Preferred 2 - 4 years experience in a technology company or startup; comfortable in fast-paced, fast-changing environmentExperience with, domain knowledge of US retail as an industry and associated dataExperience with, domain knowledge of the Oil and Gas industry and associated dataProficiency to read news articles and conduct research in Chinese, Hindi, Russian, or Arabic is a major assetFamiliar with geospatial tools such as Google Earth Pro and QGISWe are backed by marquee investors such as Sequoia Capital, Google Ventures, In-Q-Tel, and Bloomberg Beta, Orbital Insight is rapidly expanding its commercial and public sector capabilities. Come join us if you are unafraid to try new approaches and relentlessly seek to push the state of the art, taking projects all the way from prototype to production-ready.Perks:Stock OptionsCompetitive SalariesPaid time offMedical, dental, and vision insuranceLife & disability coverage401kFlexible Spending AccountsApple equipmentTwice a week catered lunchesMonthly happy hour in officeStocked kitchen with healthy snacks, coffee, tea, etc.Easy commute via Caltrain, with company sponsored Go PassNote to Recruiters and Placement Agencies: Orbital Insight does not accept unsolicited agency resumes. Please do not forward resumes to any person or email address at Orbital Insight prior to obtaining a signed agreement from Recruiting/HR. Orbital Insight is not liable for and will not pay placement fees for candidates submitted by any agency other than its approved recruitment partners. Furthermore, any resumes sent without an agreement in place will be considered your company's gift to Orbital Insight and may be forwarded to our recruiters for their attention."}