{"jobID": "2767949511", "jobLocation": "San_Francisco_CA", "jobTitle": "Growth Analytics Manager", "companyRating": "4.1", "companyInfo": {"Website": "www.tophatter.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": "The Growth Analytics team partners with acquisition managers, engineers and business leads to help identify and explore the most impactful drivers of conversion, retention and monetization. We are not just analysts, but also designers, product managers, consultants and thought leaders.As a growth analytics manger, you will be responsible for a certain growth area/driver. You will conduct analysis, form hypothesis, and design & run experiments in cooperation with other teams.This is a great opportunity to learn and grow your analytics, business and product-design skillsets while having a substantial impact at a fast-growing company.Responsibilities Ownership of a key growth driverDesign, implement and analyze a variety of innovative experiments in an effort to achieve growth objectivesConduct regular and ad-hoc analyses for tactical daily operations, as well as for key initiatives and strategiesDevelop and maintain reports, dashboards and scorecards that track key business metrics within your domainBe a thought leader on how Tophatter should formulate and scale its ecommerce presenceRequirementsAt least 5 years of experience in customer analytics, consulting or product managementExperience in defining a business problem, collating the required information, analyzing the results and synthesizing a compelling argumentProven history of providing actionable and impactful insights from a complex datasetExperience in designing user-facing featuresComfortable working in a small, dynamic, and fast-paced teamResourceful, flexible & adaptable; no task is too big or too smallAdvanced skills in Excel and SQLBS degree in a technical fieldMBA degree is a plusDon't have Tophatter? Download it now: https://tophatter.com/sign_upCheck us out on The Muse to learn about our culture and cool work environment!Like what you see? Subscribe to our channel and follow us!Facebook: https://www.facebook.com/tophatter/Instagram: https://www.instagram.com/tophattr/Pinterest: https://www.pinterest.com/tophatter/Twitter: https://twitter.com/tophatterTophatter is re-imagining discovery commerce in a world increasingly connected by smartphones. We are the world's fastest, most entertaining marketplace for mobile shoppers.We connect buyers and sellers around the world in real-time auctions that are both fast and effective. Leveraging our ever-expanding data for merchandising and personalization, nearly every item sells, and sells within an average of 90 seconds.Tophatter is funded by leading Silicon Valley venture capital firms, including August Capital, Charles River Ventures, Sequoia Capital, and SV Angel. We are based in Palo Alto, with offices in San Francisco and Shanghai.We are actively expanding our team. In exchange for your precious time and energy, we offer incredible freedom and responsibility. If you're looking for a challenge, look no further. Let's grow together.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Any unsolicited resumes/candidate profiles submitted through our website or to personal email accounts of employees of Tophatter are considered the property of Tophatter and are not subject to payment of agency fees."}