{"jobID": "2797601464", "jobLocation": "Fort_Worth_TX", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.catholiccharitiesfortworth.org", "Headquarters": "Fort Worth, TX", "Size": "201 to 500 employees", "Founded": " 1910", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": "Data Analyst | Catholic Charities Fort Worth Are you efficient, detailed, and organized? Are you a technical minded critical thinker who is proactive and data driven? Are you passionate about ending poverty? If this sounds like you, keep reading.Catholic Charities Fort Worth is looking for an efficient and organized Data Analyst to join our Data Services Team. The ideal candidate will have strong and varied technical propensity and be well versed in statistical theory and presentation. What is the overall purpose of the Data Services team? The Data Team at Catholic Charities of Fort Worth serves to support the organization’s mission by providing for and facilitating all its data needs in an accurate, efficient, timely and forward-looking manner. We promote and foster a paradigm of increasingly effective and holistic service to clients in their journey out of poverty using data and analytics. What will you be doing? Develop You will develop efficient, supportable, scalable processes and tools that will address the organizations data related needs. Integrate You will integrate information from various systems to form a basis for effective and comprehensive reporting.  Analyze You will analyze data to identify trends and provide insight into the effectiveness of the organization and its practices. QUALIFICATIONSBachelor’s degree in a relevant field (Statistics, Economics, Data Analytics, Information Technology, etc.) AND 1-2 years of experience in an academic, office OR a combination of education and experienceExperience in collecting, interpreting, and analyzing data requiredExperience using query functions in a relational database requiredDemonstrated analytical skills with the ability to apply creative solutions to complex problems requiredProficiency in MS Excel and Power Query requiredExperience with data visualization software (e.g., Power BI) preferredExperience with data warehouse concepts preferredExperience with data analytic software (e.g., SPSS, Stata) preferredExperience with ETL tools and concepts preferredExperience with machine-learning principles and concepts preferredPrior work experience in areas related to social services, education, and/or poverty preferred   WORK HOURS AND LOCATION   Regular office hours are 8:00 am to 5:00 pm, Monday through Friday. This position may require flexibility to work various hours and possibly weekends, depending on current program needs. Location: 249 Thornhill Dr, Fort Worth, TX 76115COMPENSATION AND BENEFITS   Catholic Charities Fort Worth offers a variety of benefits to our staff including medical, dental, vision, and life insurance. Our employees can participate in a retirement plan with a generous match. A progressive paid leave plan allows you to earn more time off the longer you are employed and we provide paid time off for designated holidays. We also offer flexible work schedules and a friendly, supportive environment. This is a full-time, exempt position with a salary range of $50,000 - $55,000 based on skills and experience. TO APPLY  For consideration, all applicants must apply and submit their resume and cover letter through the employment page on our website: www.catholiccharitiesfortworth.org. Click on “Employment” to visit our career page. Select the job posting and click the \"Apply\" button at the top right of the posting. Please complete all fields with relevant information requested. ***Internet Explorer versions 9 & 10 are not compatible with our system. In order to apply, please use Internet Explorer 11, Microsoft Edge, Firefox 52 and higher, Chrome 60.0 and higher, Safari 9.x, or Safari 10.0. Applicants must also complete a work traits survey via this link. Resumes received without being accompanied by a completed survey will not be considered. Due to the volume of responses, only qualified parties will be contacted. No phone calls, please. Catholic Charities Fort Worth is an equal opportunity employer.Please note: Both the application site and work traits survey site require the creation of a user name and password. These are separate sites. ABOUT US  At Catholic Charities Fort Worth, it is our mission to provide service to those in need, to advocate compassion and justice in the structures of society, and to call all people of good will to do the same. We have been entrusted with a 106-year legacy of doing good and we have set forth a bold goal of ending poverty in our community. Become part of this amazing history and mission by joining an innovative group of dedicated professionals who are helping those in need in our community find new hope.  For more information on Catholic Charities Fort Worth, you can visit our website at: http://www.catholiccharitiesfortworth.org. "}