{"jobID": "2822819815", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Big Data Strategist", "companyRating": null, "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": null, "jobDescription": "Job Description What you'll be doing...  As the Big Data Architect for the Technology Incubation Team, you will be the authoritative subject matter expert on technologies and architectures for efficiently storing and processing data at enterprise scale. You will be responsible for understanding the Team's and Verizon's big data objectives, how they contribute to Verizon's success, and then investigating and implementing big data technologies that best support the mission. You will analyze cutting-edge technologies and make recommendations to Verizon executives on the future technologies Verizon should implement.  As part of the Innovation Team, you will be working in a fast-paced environment focused on rapidly identifying, evaluating, and deploying big data solutions for Verizon. You will interact with the data scientists developing new algorithms, the Analytic Ops teams who are productizing the new algorithms, the Verizon teams collecting data, vendors, and open source communities to develop a comprehensive understanding of data engineering techniques and trends so that Verizon big data becomes a competitive advantage in Verizon's mission to deploy the highest-quality, lowest-cost network. Work with data owners inside Verizon to understand what Verizon network and IT data is available and how it is currently stored/processed.Architect, develop, and implement solutions to move network and IT data into the Innovation Team's lab environment.Modify, transform, clean, normalize, and analyze network and IT data so that is usable by the Innovation Team's data scientists.Develop reference big data architectures that optimize cost/performance and can be used across Verizon.Implement security mechanisms to ensure network and IT data is sufficiently protected and only authorized personal have access to the data.Author and collaborate on Technical Requirements, Specifications, Proposals, High Level Designs, and other applicable engineering documents.Conduct detailed technology research on industry and vendor solutions for big data and implement new solutions in the Innovation Team's lab to identify those which are the most promising.Provide thought leadership for the Team and collaborate with cross-functional engineering teams to streamline or improve adoption of analytics into their projects. What we're looking for... You'll need to have:Bachelor's degree or four or more years of work experience.Four or more years of relevant work experience.Even better if you have:Bachelor's degree in Computer Science, Electrical Engineering, or Computer Engineering.1+ years of experience engineering ingestion and storage systems for big data environments.Ability to work in a team and independently on multiple high priority projects. Ability to manage multiple high-visibility, complex technical projects.Extremely strong problem solving skills.Strong written and verbal communication skills.Familiarity and practical experience with modern public cloud environments such as AWS, Azure, and GCP.Familiarity and practical experience with modern big data environments such as Hadoop and Apache Spark.Familiarity and practical experience with modern big data storage technologies such as HDFS and Apache Spark.Familiarity and practical experience with SQL and NoSQL databases.Familiarity and practical experience with modern big data access technologies such as MapReduce, Hive, and Pig.Familiarity and practical experience with modern big data ingest technologies such as Apache NiFi, Kafka, and Apache Flume.Experience with statistical software and scripting languages (R, Python).Experience with machine learning / machine intelligence techniques and methodologies.Demonstrated capabilities and knowledge in machine learning and machine intelligence.Experience using machine learning technology to work efficiently with datasets such as scripting and Unix/Linux experience. When you join Verizon...  You'll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America's fastest and most reliable network, we're leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we're about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.  Equal Employment Opportunity  We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}