{"jobID": "2829039867", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.gumgum.com", "Headquarters": "Santa Monica, CA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Vibrant Media"}, "estimatedSalary": "92000", "jobDescription": " Description Data Engineer  At GumGum our ad server produces over 50 TB of new raw data every day. It amounts to ~100 billion events per day that needs to be processed. Dealing with data at this scale is challenging in a number of ways. We deal with number off-the-shelf frameworks including Spark, Kafka, Cassandra, DynamoDB, RedShift, but often push them past their limits. This team is responsible for providing critical ad reporting data for GumGum’s internal and external customers.  As a Data Engineer, you will be building and maintaining exciting systems, services and data tools. You’ll bring your experience with complex distributed systems, passion for performance and optimization, and ability to write highly scalable and fault tolerant code.  Responsibilities:  ● Refining our data infrastructure technologies such as Kafka, Spark, Druid, Fluentd to support real time analysis of data  ● Own the core data pipelines and scale our data processing flow.  ● Build scalable systems with various AWS & Big Data technologies, lead technical discussions, participate in code reviews, guide the team in engineering best practices. Must be able to write quality code and build secure, highly available systems.  ● Work on GumGum’s proprietary Reporting Server  ● Work on various reports using Groovy, SQL and Java  ● Works on GumGum’s proprietary forecasting system  Requirements:  ● At least a bachelor's degree in computer science or equivalent  ● 3+ years of software engineering experience (Java/Scala/Python)  ● Experience with large scale distributed real-time systems with tools such as AWS, Spark, Kafka, Hadoop  ● Familiar with various AWS services, Serverless architecture and containers  ● Experience with high volume, high availability production systems.  ● Strong problem solving skills, strong verbal and written communications skills  Perks  ● Stock options  ● 401k, great medical/dental plans  ● Unlimited PTO  ● Great co-workers, monthly happy-hours  ● Located in hotbed of tech startups, just blocks from the beach!"}