{"jobID": "2693669782", "jobLocation": "Los_Angeles_CA", "jobTitle": "Marketing Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ithstaffing.com", "Headquarters": "Ontario, CA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Private Practice / Firm", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Marketing Data Analyst We are looking for a dynamic Marketing Data Analyst to join our team. You will take responsibility for managing our master data set, developing reports, and troubleshooting data issues. To do well in this role you need a very fine eye for detail, experience as a data analyst, and deep understanding of the popular data analysis tools, techniques, and databases. You should have an understanding of economics, business, and analytics, and should be able to translate quantitative results into meaningful and actionable recommendations by mining large volume of in-house and syndicated data. Overall:You will help innovate and develop reporting and data analytics for our clientCreate and implement key metric dashboardsDevelop ways to analyze and build insight into our product portfolioEnhance analytics and reporting databases and data toolsManage project streams with technologists and implement analytics into systemsOwn and manage the data integrity as neededKey Responsibilities:Work with large, complex data sets across multiple productsSolve difficult, non-routine analysis problemsConduct end-to-end analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentationsExecutes with limited guidance and proactively takes initiative to kick off work streams and projectsBuild and update product dashboards to track trends over time and understand the underlying causes to inform actionable recommendations for the marketing teamPrototype and build analysis pipelines to provide insights at scaleCreate marketing channel measurement plans, provide weekly reports across channels, and identify trends and insights at scaleDrive analysis and make recommendations on levers to optimize product usage, engagement and retentionInteract cross-functionally with a wide variety of people and teamsWork closely with marketing team, product management, analytics, and engineers to identify opportunities for improvements to productsDeliver effective presentations on findings and business recommendations to multiple levels of stakeholders (senior executives, team members, etc.)Top 3 Daily Responsibilities: Updating dashboards with key metrics, reporting trends and highlightsTrack and report performance of marketing campaigns and impact on product usageConduct multivariate analysis and experiments to guide growth tactics to increase consumer engagement at our retail storesData Analyst Requirements:Bachelors degree from an accredited university or college in statistics, business, or computer scienceAbility to analyze existing tools and databases and provide software solution recommendations.Ability to translate business requirements into non-technical, lay terms.High-level experience in methodologies and processes for managing large-scale databases.Demonstrated experience in handling large data sets and relational databases.Understanding of addressing and metadata standards.High-level written and verbal communication skills."}