{"jobID": "2572532733", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst, Risk & Payments", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "81000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Come join the team responsible for working on any and all things related to risk & payments on Facebook. Our team drives initiatives to improve value provided to payers by maintaining a healthy platform and providing the best client experience possible. We organize a global service operation that delivers proactive and reactive support for all payment products on the Facebook platform across advertising, games, person-to-person payments, donations, and other emerging products.  Who are you? You are someone who is an expert in customer support who thrives knowing you are in a position to help others. You are also someone who loves \"big data.\" If given a vast database, not only would you find useful information in it, but you could organize it into beautiful charts that tell a compelling story. You might have majored in Economics, Math, Computer Science, Finance, and Physicsany field that had you designing experiments and running regressions. You are awesome. So please introduce yourself and tell us why you are the perfect fit for the fastest moving, most impact-driven risk and payments team out there! Responsibilities:"}