{"jobID": "2746928692", "jobLocation": "Chicago_IL", "jobTitle": "Senior US Equities Quantitative Researcher - Designated Market Making and Statistical Arbitrage Division", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is a technologically sophisticated high frequency trading firm and specialises in electronic screen based market making across a wide range of US equities, ETF's and Options. The firm is a grey box trading company and their approach is designed to optimally marry human algorithmic traders with systematic strategies. The firm employs human screen traders (algo traders) who are responsible for observing any autonomous behaviour of trading strategies that don’t show up in simulation, tweaking parameters and over watching algorithms during live trading. The firm is looking to build out a quantitative research team with a mandate to design and test the game theoretic trading logic for automated market making as well as short term price predict strategies for statistical arbitrage across US equities. Responsibilities: As QR, you will work directly with the screen traders to engineer their ideas into systematic equity strategies while also designing your own probabilistic strategies for use in equities market making and high frequency statistical arbitrage, leveraging the firms low latency equities trading network and data feeds while also levering various internal and external information flows. The ideal High Performance Computer Architect will have the following experience and background:PhD in Computer Science, Applied Mathematics or similarExperience designing and implementing high frequency US equity strategies with a Sharpe of 5+An econometric/statistics backgroundThe ability to write code that is efficientAn interest in leading and mentoring a team of researchersExperience working on a US equities trading floor If you would like to be considered for the position of Quantitative Researcher, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team"}