{"jobID": "2801283023", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.villagemd.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Data Analysts at VillageMD are the face to our cutting-edge data enabled products. These products aggregate, process, and make rich data sets available to provide vital insights that allow for informed, contextualized decision-making, driving every aspect of our business. Each day you will be interfacing with various entities including, but not limited to, physicians, site managers, care coordinators, technologists and operations experts. The goal will be to understand data as it pertains to their daily lives to improve outcomes through the enhancement of VillageMD’s data products. We're in a unique position to impact primary care across the continuum from independent, family owned practices to world class health systems.  At VillageMD, we have built our technology by standing on the shoulders of giants in the tech space. We leverage proven open source technologies developed at Airbnb, Amazon, and Facebook. We participate in the open source ecosystem inclusive of the data ontology, OHDSI. As a member of our team, you will perform data analysis, build relationships with various entities across the healthcare industry and find new, innovative ways to drive value for the business and support our growing Technology team. WhatareexamplesofworkthatDataAnalystshavedoneatVillageMD? Data Investigation: work with physician practices to identify the critical information needed for VillageMD’s productsProduct: partner with the engineering team to enhance VillageMD’s products and ensure end-users are loving the experience and valueReadiness assessment: build market launch strategy which would include critical elements such as operational enablement, security validation, and solidified support model(s)What will make you successful here? You are comfortable with traveling to our markets as needed, around 20%You thrive in a fast paced, startup environmentYou are passionate about healthcare and dataYou want to build amazing products to shape the healthcare ecosystemYou understand technology and quickly see how it can solve problems You’re not afraid to challenge the status quo. You seek out opportunities to improve processes or tools then design, advocate and implement improvementsYou value humility and believe in gaining trust by doing what you say you will doWhat you might do in your first year? Collaborate with SMEs to deeply understand EHR systems and map the appropriate fields into ODHSI (common data model)Use data profiling tools to quickly access the validity of data and information gained from various data sourcesCollaborate with physicians, site managers and/or operations to understand the appropriate information to deliver valueInterpret data, analyze results using statistical and non-statistical techniques and provide ongoing analysisDiscover meaningful data both internal and external to VillageMD to create new productsClean “dirty” data by reviewing reports, printouts, and performance indicators to locate and correct code problemsWork with development teams to prioritize technical, operational and data needsThe following experience is relevant to us:2+ years of full-time experienceExpert in SQLExperience with clinical and financial healthcare data Excellent written and verbal communication skills and a proven ability to convey complex technical details in meaningful business contextTrack record of effective communication across various disciplinesExperience with noSQL databases (Elastic search, MongoDB, Hadoop, Cassandra, Redis) is a plusBS or MS in an analytical discipline: management information systems, engineering, science, finance, economicsAt VillageMD, we see diversity and inclusion as a source of strength in transforming healthcare. We believe building trust and innovation are best achieved through diverse perspectives. To us, acceptance and respect are rooted in an understanding that people do not experience things in the same way, including our healthcare system. Individuals seeking employment at VillageMD are considered without regard to race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}