{"jobID": "2795179677", "jobLocation": "Irving_TX", "jobTitle": "Principal, Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.corelogic.co.kr", "Headquarters": "Shenzhen, China", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "132000", "jobDescription": " The Principal, Data Scientist will design, develop, and deliver solutions that will enhance and add value to new and existing data assets for broad industry application, aligned with business and market requirements. Youll develop algorithmic and rule-based models and analytic capabilities based on rules engine, machine learning, mathematical modeling, pattern recognition, and data mining techniques. Perform data analysis and modeling using a variety of analytic techniques, tools, and programming languages to provide business insight and product analytics.  Job Duties:  Create data derivation and linkage through algorithm and/or data rules.  Create and select predictive features from raw data.  Create model reports for stakeholder review and model documentation.  Perform pattern recognition model creation and training using various types of algorithms and machine learning modeling techniques for unknown or less well-defined – an unknown problem, solve new problems (e.g., clustering, logistic regression, neural networks, CART, support vector machines, boosting trees, supervised and unsupervised models).  Develop analytics tool using SQL, R, Python, Spark and other big data tools such as Jaspersoft BI Suite, Talend Open Studio, Skytree Server, Tableau, and Splunk.  Develop analytics solutions using traditional database technology such as SQL and big data technology such as Hadoop, MongoDB, Cassandra, Redis, Riak, CouchDB, and Neo4j, NoSQL databases.  Perform complex data analysis on large volumes of property and consumer data and present model performance to stakeholders.  Provide data science and analytic support for the Enterprise Data Group (EDG), and interact with other EDG teams as well as other business units.  QA and analyze large amounts of data to create appropriate data sets for model building.  Prepare and maintain programs and documentation for analytic models.  Conduct defined quantitative and qualitative research projects independently and communicates research results to internal and external stakeholders.  Act as a consultant to EDG’s data management and data technology teams.  Education, Experience, Knowledge and Skills  Master’s or higher in machine learning, a hard science, math, or an engineering field  Ability to thrive in a team environment and adapt to quickly changing priorities  5-8 years of directly related Data Science, Data Mining and Data Analysis experience  Strong working knowledge in multiple analytic development tools, statistical tools, programming languages, and big data tools  Strong problem solving and analytical ability  Strong communication skills  Ability to quickly and efficiently adapt to new concepts.  Demonstrated knowledge of statistical techniques  Ability to work collaborative with cross-function teams and business units  Demonstrated general business acumen; experience working in a real estate and mortgage related data industry a plus"}