{"jobID": "2729835182", "jobLocation": "Fort_Meade_MD", "jobTitle": "Sr. Cloud System Administrator - Active TS/SCI w/Full Scope Polygraph", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "This position is for a Sr. System Administrator to provide mission applications focused expertise for the IT user. The successful candidate will: Interact effectively, courteously, and directly with the user to resolve technical issues and respond to queries and requests for service that originate by telephone, web-based portals, email, or other methods. Read, write and implement standard operating procedures and technical documentation and assist with installation and configuration of new software applications. Support the implementation, troubleshooting and maintenance of IT systems. The candidate must possess a working knowledge of computer operations, platforms, systems, architectures, functions, and terminology and assist with transition of new technologies into the Enterprise service environment, and be able to work independently to triage issues and prioritize tasks.Minimum Required Skills/Experience:TS/SCI Clearance with polygraphBachelor’s Degree or higher in computer engineering or in a field related to the computer engineering or computer science disciplines10 years System Administration experience. An additional 4+ years of System Administration experience may be substituted for the degree for a total of 14 years.Critical Skills: Experience and knowledge in the following areas:- DNS- Bash scripting- Network protocols- Port management- Firewalls (includes iptables)- Virtual Machine (VM) implementation and management- Yum- SSH, PKI· Experience configuring servers, networks, and storage· Understanding of NIAGARAFILES· Experience operating within the cloud, preferable with Amazon Web Services (AWS) components.· Experience in integrating and troubleshooting distributed systems in a Linux environment.· Experience with log management (syslog, rsyslog, syslog-ng)· Experience with OS performance tuning and Linux security· Background in scalable architectures, data flow management, and Infrastructure as a Service (IaaS)· Strong organizational and time management skills, including the ability to multi-task and work independently with minimum supervision to meet deadlinesDesired Skills: · Proficiency in Python· DevOps experience"}