{"jobID": "2817439544", "jobLocation": "Boise_ID", "jobTitle": "Global Supply Chain Business Intelligence Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.micron.com", "Headquarters": "Boise, ID", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (MU) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Samsung Electronics, Hynix, Toshiba"}, "estimatedSalary": "47000", "jobDescription": " Req. ID: 117914   As a Business Intelligence Analyst (BIA) in the Digital Supply Chain team, you will be part of an Agile project team focused on driving data analytic initiatives in the automation of a digital supply chain. You will analyze and provide insights to our data and information platforms utilizing traditional analytic and predictive techniques to guide the business. In this role, you will facilitate the collection of data analytic requirements and translate them to functional specifications for our technical development team.  You will be a key driver in the creation and delivery of the Supply Chain Control Tower. The control tower will promote demand-driven planning and execution, enable data-driven decisions, and improve organizational efficiencies. The ideal candidate will have experience in supply chain processes and analytics. The role requires the candidate design and deliver dashboards, scorecards & reports to assist stakeholders in identifying trends, anomalies or other points of interest that require further investigation relative to process gaps and redundancies.    Primary Responsibilities    Solution Delivery Conduct in-depth interviews with business stakeholders to collect, analyze, and determine data and analytics requirements for the associated functional areas.Conduct analysis of findings and offer action-driven recommendations and insights to leaders and managers based on results.Document user stories, requirements and acceptance criteria for refinement by development team.Guide development of Business Intelligence solutions to align with the requirements of the business partners.Execute integration testing and facilitate user testing (including communication, training and coordination of defect resolution).Provide timely communication of progress on projects and business-as-usual requests with the GSC organization and other business function areas.    Data Analysis Identify and analyze available reporting data (in source system or data warehouse) and ensure alignment to business process, data quality and requirements.Explore opportunities to drive correlation to business problems through data analysis.Carry out a quality assessment of data, data reports and the accompanying decisions.Generate summary and specified dashboard accounts which represent operational data in brief and intelligible format, suitable for the target audience, which includes stakeholders, management leadership, department managers and directors.Identify internal and external industry benchmarks & trends (related to analytics) and share with business partners & leadership.    Business Partnerships Develop an understanding of business processes, key metrics to manage these processes, and the data behind those metrics that drive the business forward.Build and maintain relationships with key stakeholders to ensure the information requirements are relevant and actionable.   Job Requirements Qualified candidates will have: 3+ years of experience in business analysis with emphasis on business intelligence, data warehousing, control tower platform, and advanced analytics projects.Well-versed T-SQL and with BI tools like Microsoft BI tool stack (SSIS, SSAS, SSRS), Tableau, etc.Experience in project management methodologies (Agile/Waterfall)Analytical, problem-solving and organizational skillsAbility to work well in a dynamic, fast-changing environment that requires a high degree of multi-tasking with minimal supervision.Good oral and written communication, teamwork, and consensus building skills.Ability to successfully coordinate with development teams and meet project deliverables   Desired Skills:Supply Chain Procurement Planning or Manufacturing Systems processes or reporting is highly valued1+ year experience in any of the following Tableau, Microsoft Integration Services, Analysis Services or Reporting Services, Data Science.Experience in SAP ECC, APO, BW and/or Hana.Experience with MDX queries   EducationBA/BS Degree in Supply Chain Information Systems / Information Technology, Computer Science or related field of study   Travel Required? Yes  Travel Details: International  Travel Frequency: Infrequent  Travel Duration: As needed, up to 2 weeks at a time.  Travel Type: International     Environment:  Office  Shift: 8+ hour shift, 5 days a week     We recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices.  Each manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters.  To request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748).  Keywords: Boise || Idaho (US-ID) || United States (US) || Supply Chain || Experienced || Regular || Information Systems and Technology || #LI-JF1 ||"}