{"jobID": "2822628002", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Senior Systems Administrator/Dev Ops", "companyRating": "2.9", "companyInfo": {"Website": "www.logicsolutions.com", "Headquarters": "Ann Arbor, MI", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": " Logic Solutions is a full-service development firm headquartered in Ann Arbor, MI with 4 additional offices around the world. Founded in 1995, Logic offers website design and programming, eCommerce solutions, customized web and mobile applications, and application integration services that span the software development lifecycle.  Logic is seeking a Senior Systems Administrator. Candidates should have at least 5 years of demonstrated hands-on experience. The Senior Systems Administrator should be a leader and doer who constantly delivers great solutions for both clients and internal initiatives. Requirements:Minimum of 3 years supporting Desktop Operating Systems (Win 7, Win 10, Mac OS).Familiarity with various server-side technologies like HAproxy, Nginx, Apache, Postfix, Bind, SSH, etc.Familiarity and ability to maintain tools like Gitlab, Wikimedia, JIRA, Confluence, etc.Experience in designing and maintaining cloud-based solutions with AWS.Experience in network management, DNS management, switches configuration, VLAN, VPN, security and best practices, etc.Experience in setup, configuring, maintaining, and troubleshooting LAMP (Linux, Apache, MySQL, and PHP) based and Windows-based servers are a must.2+ years configuring and supporting Linux and Windows Servers in a production environment.A grasp of industry best practices with regard to backups, network security, patch management, monitoring, documentation, etc.A strong customer service presence, and an unwavering commitment to quality of service and follow-through.An ability, willingness, and desire to learn and embrace new, unfamiliar and/or emerging technologies which may best address changing business needs.Experience with DevOps tools like Ansible, Docker, Gitlab CI, and Jenkins.Desired Experience: Experience in managing Microsoft Active Directory, Exchange, DFS and Windows Server in the domain environment.Excellent knowledge of Linux systems (CentOS/Ubuntu) and have the ability to systematically isolate problems using machine resident tools.Experience with Cisco router, 3-layer switch, wireless AP and Juniper firewall is a plus.Experience with virtualization is a plus.Ability to automate daily system management tasks by writing Python or Shell scripting. This is a full-time position reporting to the Chief Technology Officer. This is a salaried position with compensation based on experience and skill level. Benefits include medical, insurance, 401(k), paid time off (vacation, holidays, and sick days) and a professional work environment. Logic offers equal opportunities to all. We would like to thank all applicants for expressing interest. However, only those selected for interviews will be contacted. Reference checks may be conducted with your permission."}