{"jobID": "2733727187", "jobLocation": "Dallas_TX", "jobTitle": "CCBD Tech - Digital Consumer Tech - Program Office - Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.goldmansachs.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1869", "Type": " Company - Public (GS) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Merrill Lynch, Morgan Stanley"}, "estimatedSalary": "69000", "jobDescription": "What We Do At Goldman Sachs, our Engineers don’t just make things – we make things possible. Change the world by connecting people and capital with ideas. Solve the most challenging and pressing engineering problems for our clients. Join our engineering teams that build massively scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Create new businesses, transform finance, and explore a world of opportunity at the speed of markets. Engineering, which is comprised of our Technology Division and global strategists groups, is at the critical center of our business, and our dynamic environment requires innovative strategic thinking and immediate, real solutions. Want to push the limit of digital possibilities? Start here. Who We Look For Goldman Sachs Engineers are innovators and problem-solvers, building solutions in risk management, big data, mobile and more. We look for creative collaborators who evolve, adapt to change and thrive in a fast-paced global environment.  The Marcus Agile PMO is a group of passionate practitioners, committed not only to the ceremonies and tools of Agile, but to the business value that Agile can drive. The team is responsible for driving the delivery of innovative and working software that will produce value for the rapidly growing Marcus business. Team members coordinate across geographies, technologies, and business areas to ensure close collaboration among teams and the swift removal of obstacles.  The Marcus Agile PMO is seeking an analyst with the ability to navigate an evolving and complex software delivery model and act as a source of truth for the broader Marcus organization. Your role will involve cross-squad or cross-scrum coordination and ongoing optimization of the organization’s throughput, unique culture, and Agile/Lean/Flow practices and tools. The role would include the below responsibilities: Definition of key metrics to assess delivery performance within MarcusAnalysis of data sets and creation of data visualizations to clearly identify trends, the quantification of experienced problems, or impacts of solutionsCommunication of key reports to reinforce culture of collaboration and commitment to delivery to the broader Marcus organization and leadershipIdentification of opportunities to expand and automate existing reporting capabilities; identification of tools, teams, and definition of requirements to support improvementCoordination and detective-work to understand delivery trends -- would require close interactions among scrum masters, product owners, and technical leads to make sense of major daily movements in data and overall team attitudes/health The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.  © The Goldman Sachs Group, Inc., 2018. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet."}