{"jobID": "2686520339", "jobLocation": "Houston_TX", "jobTitle": "Data Engineer Consultant", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "97000", "jobDescription": "Basic QualificationsBachelor's degree in Computer Science, Engineering, Technical Science or 3 years of IT/Programming experience Minimum 1 year of architecting, implementing and successfully operationalizing large scale data solutions in production environments using Hadoop and NoSQL ecosystem on premise or on Cloud (AWS, Google or Azure) using many of the relevant technologies such as Nifi, Spark, Kafka, HBase, Hive, Cassandra, EMR, Kinesis, BigQuery, DataProc, Azure Data Lake etc. Minimum 1 year of architecting data and building performant data models at scale for Hadoop/NoSQL ecosystem of data stores to support different business consumption patterns off a centralized data platform Minimum 1 year of Spark/MR/ETL processing, including Java, Python, Scala, Talend; for data analysis of production Big Data applications Minimum 1 year of architecting and industrializing data lakes or real-time platforms for an enterprise enabling business applications and usage at scale Minimum 2 years designing and implementing relational data models working with RDBMS and understanding of the challenges in these environmentsPreferred SkillsMinimum 1 year of experience implementing SQL on Hadoop solutions using tools like Presto, AtScale and others Minimum 1 year of experience implementing large scale BI/Visualization solutions on Big Data platforms Minimum 1 year of experience implementing large scale secure cloud data solutions using AWS data and analytics services e.g. S3, EMR, Redshift Minimum 1 year of experience implementing large scale secure cloud data solutions using Google data and analytics services e.g. BigQuery, DataProc Minimum 1 year of experience building data management (metadata, lineage, tracking etc.) and governance solutions for modern data platforms that use Hadoop and NoSQL on premise or on AWS, Google and Azure cloud Minimum 1 year of experience securing Hadoop/NoSQL based modern data platforms on-premise or on AWS, Google, Azure cloud Minimum 1 year of Re-architecting and rationalizing traditional data warehouses with Hadoop or NoSQL technologies on premise or transition to AWS, Google clouds Experience implementing data wrangling and data blending solutions for enabling self-service solutions using tools such as Trifacta, Paxata 1 year industry systems development and implementation experience OR Minimum of 2 years of data loading, acquisition, storage, transformation, and analysis Minimum 1 years of using Talend, Informatica like ETL tools within a Big Data environment to perform large scale metadata integrated data transformation Minimum 1 year of building Business Catalogs or Data Marketplaces on top of a Hybrid data platform containing Big Data technologiesOUR COMMITMENT TO YOUYour entrepreneurial spirit and vision will be rewarded, and your success will fuel opportunities for career advancement. You will make a difference for some pretty impressive clients. Accenture serves 94 of the Fortune Global 100 and more than 80 percent of the Fortune Global 500. You will be an integral part of a market-leading analytics organization, including the largest and most diversified group of digital, technology, business process and outsourcing professionals in the world. You can leverage our global team to support analytics innovation workshops, rapid capability development, enablement and managed services. You will have access to Accentures deep industry and functional expertise. We operate across more than 40 industries and have hundreds of offerings addressing key business and technology issues. Through our global network, we bring unparalleled experience and comprehensive capabilities across industries and business functions, and extensive research on the worlds most successful companies. You will also be able to tap into the continuous innovation of our Accenture Technology Labs and Innovation Centers, as well as top universities such as MIT through our academic alliance program. You will have access to distinctive analytics assets that we use to accelerate delivering value to our clients including more than 550 analytics assets underpinned by a strong information management and BI technology foundation. Accenture has earned more than 475 patents and patents pending globally for software assets, data- and analytic-related methodologies and content. As the worlds largest independent technology services provider, we are agnostic about technology but have very clear viewpoints about what is most appropriate for a clients particular challenge. You will have access to our alliances with market-leading technology providers and collaborative relationships with emerging players in the analytics and big data spacethe widest ecosystem in the industry. These alliances bring together Accentures extensive analytics capabilities and alliance providers technology, experience and innovation to power analytics-based solutions. You will have access to the best talent. Accenture has a team of more than 36,000 digital professionals including technical architects, big data engineers, data scientists and business analysts, as well as user digital strategists and experience designers. Along with a competitive salary, Accenture offers a comprehensive package that includes generous paid time off, 401K match and an employee healthcare plan. Learn more about our extensive rewards and benefits here: Benefits.CALL TO ACTION Now is the time to become a digital disrupter. The opportunity is herewhats stopping you from pursuing it?  Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).  Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  Accenture is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.  Equal Employment Opportunity  All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.  Accenture is committed to providing veteran employment opportunities to our service men and women."}