{"jobID": "2802059879", "jobLocation": "San_Francisco_CA", "jobTitle": "Principal, Business Strategy Analyst - Oracle Data Cloud", "companyRating": "3.4", "companyInfo": {"Website": "www.oracle.com", "Headquarters": "Redwood City, CA", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (ORCL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " SAP, Salesforce, Microsoft"}, "estimatedSalary": "111000", "jobDescription": " **Principal, Business Strategy Analyst - Oracle Data Cloud****Preferred Qualifications****Senior Business Strategy Analyst**Supporting the Group Vice President of Digital Media Partnerships for Oracle Data Cloud, one of the fastest growing and most strategic businesses at Oracle, you will be one of the crucial members of the Channel go-to-market team, supporting, and often leading, the GTM team in analyzing, structuring, and executing against key initiatives. Some of these initiatives will be time-bound efforts to capitalize upon particular opportunities or periods of the fiscal year or sales cycle; others will be ongoing efforts to optimize our GTM activities in general. You will work closely with team leadership to understand the overarching goals of the team and front-line colleagues to understand day-to-day challenges in working toward those goals. With that in mind, you will consider all of the data points currently or potentially available, ideate and build models such that valuable insights can be gleaned, analyze those models to discern actionable insights, and curate and deliver data-driven recommendations (as general suggestions or as rigorously detailed plans) to meet particular objectives. You are half analyst, discerning signal from noise to make sound predictions, and half strategist, curating compelling narratives and detailed proposals to achieve particular objectives. In sum, you are far more than the team?s Excel-wiz and numbers guru ? you?re responsible for ensuring that the Channel-focused arm of the Oracle Data Cloud is _truly_ data-driven and rigorously deliberate in all efforts team-wide.**How you?ll be successful at ODC.** **Primary Responsibilities:****Revenue Subject Matter Expertise:** Be the go-to expert in analyzing the many layers of revenue data to support GTM teams focused on digital media partnerships.**Market Analysis** : Pool industry data from various sources, working with Channel GTM Leadership to develop a comprehensive POV on the industry at-large and market sub-sectors.**Product Analysis:** Analyze product adoption, data usage, competitor offerings, and market pricing, working with Product Strategy on recommendations and business plans for new products, features, or commercial models**Strategic Deal Analysis** **:** Work with Channel GTM Leadership to develop strategic partnership structures and analyze their economic impact, including assessing risks and opportunities**GTM Planning:** Work with Channel GTM Leadership to develop sales plans with expectations on target accounts, deal size, win/loss ratios, timeliness to deal wins & rev rec, etc. Develop monthly reporting/dashboards to track execution against said plans that focus on providing actionable insights.**Sales Operations Analysis** **:** Work with Sales Ops to develop reports and BI dashboards for Channel GTM leadership illustrating opportunity analysis, sales productivity evaluations, and other insights for optimizing all sales efforts.**Miscellaneous Support:** Provide ad-hoc finance and operational support for Data Provider teams, Operations teams, and other Sales and Solutions teams.**What you bring to the table. Skills and Qualifications:****Experience:** At least 5 years professional work, proven in partnering with business teams; Bachelors related to finance, economics, or analytics; MBA is highly preferred. Conversant in Excel, PowerPoint, SQL, VBA, and BI platforms, like OBI or Tableau.**Analytical Savvy:** Illustrated ability to work with complex data sets, formulas and scripts to build impactful reports, develop numerous scenarios, and create accurate projections.**Business Acumen:** Ability to build and articulate business plans effectively, thinking strategically and analytically to operate with a focus on revenue, differentiating value, or other meaningful outcomes.**Project Management:** Ability to scope, prioritize, and manage numerous workstreams, creating and maintaining accountability of all involved parties to commit & deliver to specific deliverables & deadlines.**Relational Savvy:** Works well in team efforts, building trust and respecting boundaries. Reads situational dynamics and responds appropriately. Influences rather than directs.**Strategic Approach:** Critical thinking to separate signal from noise. Creative thinking to solve for roadblocks. Methodical, disciplined, and focused in executing toward specific outcomes.**Compelling Communicator:** Ability to distill complexity down to impactful simplicity, bringing disparate points into clear, linear narratives aimed at achieving specific objectives. Captivating storytelling skills & senior-level gravitas.**Mental Virtuosity:** Critical thinking to separate signal from noise. Creative thinking to solve for roadblocks. Incredible ability to absorb, process, and act upon massive amounts of information.**Versatility:** A data & analytics person who thinks like a sales person. Ideates creatively and executes to results. Speaks both marketing & tech.**Humility:** Not above ?rolling-up-the-sleeves? to do the purely tedious legwork necessary for getting to remarkable outcomes. Doesn?t need recognition, but enjoys helping others be the smartest person in the room.**Athleticism:** Excitement & eagerness to pursue new challenges, the drive & ability to learn quickly, embracing of change as an opportunity to evolve, and the versatility to succeed in almost any environment.**Optimistic Tenacity:** Mindset where setbacks can happen on the path to successful outcomes. Persistent and patient, maintaining energy and thriving in high pressure environments.**Honesty & Integrity:** Does not cut corners ethically; earns trust and does the right thing.**Location** : San Francisco or New York City preferred. Also, Westminster, Colorado.**Detailed Description and Job Requirements**Provides programs to improve operational efficiency, consistency, and compliance in support of the organization's financial and tactical business objectives. Provides business practices and processes. Develops, communicates, and trains the organization on business practices and processes.Serve as a liaison with other divisions such as Finance, Contracts, HR, Legal, Shared Services, Accounts Receivable, Purchasing, and Risk Management in an effort to ensure accurate and timely transaction processing. Collect, input, verify, correct, and analyze data to measure key performance indicator actual versus business objectives. Provide updates to management regarding budget to actual, informing them of deviations and opportunities. Provide management with economic impact and compliance issues surrounding key business decisions and/or deals. Communicate Oracle Business Practices to the organization and monitor process and approvals for full compliance. Drive implementation of new processes and procedures.Leading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Ability to collect, organize, and display data in spreadsheet format. Follow-through skills necessary to get information from internal and third parties and have data errors/omissions corrected. For this, relationship management skills strongly desired. Strong written and verbal communication skills. 8 plus years relevant work experience.**Oracle will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco's Fair Chance Ordinance.****Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.****Job:** Business Operations**Location:** US-CA,California-San Francisco**Job Type:** Regular Employee Hire**Organization:** Oracle"}