{"jobID": "2827573049", "jobLocation": "Niles_MI", "jobTitle": "Hyperbaric Technician", "companyRating": null, "companyInfo": {"Website": "www.lakelandhealth.org", "Headquarters": "Saint Joseph, MI", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Responsibilities: · Functions under direct supervision of the wound clinic physician or designee, administers hyperbaric oxygen therapy to patients as prescribed by the hyperbaric physician.  · Responsible for the safe and effective operation of the hyperbaric chamber and related support systems.  · Responsible for day-to-day maintenance of hyperbaric chamber and related support systems.  · Assists in the delivery of patient care appropriate to the level of his/her medical training.  · Prepares patients for treatment by giving explanation of the purpose and procedure of treatment as well as education regarding pre-, post- and intra treatment information/instructions.  · Keeps complete, legible and accurate patient records as they pertain to assessment, treatment, documentation of care, education and discharge instruction. Requirements: · Must be a Certified and/or Registered Respiratory Therapist or have current LPN license.  · Must be licensed in the state of Michigan. Hyperbaric Tech experience and certification required.  · Must successfully complete an approved UHMS Hyperbaric Medicine Introductory Course.  · Must hold current BLS certification and be ACLS certified within one year of employment.  · Minimum of one year clinical hyperbaric system operations experience preferred.  · Must possess good verbal and written communications with the ability to carry out detailed written or verbal instructions independently.  · Must have interpersonal skills sufficient to interact with patients, visitors and other hospital associates and departments.  · Must possess physical ability to move patients with assistance from other personnel and mechanical devices if indicated. "}