{"jobID": "2618958891", "jobLocation": "Cranbury_NJ", "jobTitle": "Sr. Director, Biostatistics and Data Management", "companyRating": "3.6", "companyInfo": {"Website": "www.amicusrx.com", "Headquarters": "Cranbury, NJ", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Public (FOLD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Shire, Actelion Group"}, "estimatedSalary": "149000", "jobDescription": " Senior Director, Biostatistics and Data Management  Position SummaryThe Senior Director for Biostatistics and Data Management will manage the statistical and data management department including statistical regulatory strategies for clinical trials and regulatory submissions. This position requires experience in: applying theoretical statistical methodologies to clinical research datasets; protocol design; writing statistical analysis plans; facile ability with computing software (e.g., SAS, SAS Jump); data management, a general understanding of worldwide regulatory requirements, and clinical trial expertise from all phases of drug development. Experience with preparing regulatory briefing documents and worldwide regulatory submissions are also required. This position involves participation on project teams and interactions with Contract Research Organizations (CROs), Clinical Research, Data Management, Clinical Scientists and Regulatory Affairs staffs to coordinate the statistical activities associated with drug development projects.Roles and Responsibilities Contributing to the development of study protocols, in particular, the statistically-related sections (e.g. sample size calculations, statistical methodology, and statistical analyses).Identifying the most appropriate analytical models/methods for clinical studies, and conducting research on statistical methodology, as needed, to accomplish this.Developing detailed statistical analysis plans; independently determine appropriate statistical methodology for data analysis.Participating in database design meetings to ensure that data are free of bias, contain maximum information (minimum variance), and satisfy analytical requirements.Evaluating the appropriateness of available software for planned analyses and ascertains needs for potential program development of novel statistical methodology.Analyzing data and interpret results from studies to meet objectives of the study protocol; independently apply and implement basic and complex techniques to these analyses.Preparing oral and written reports to effectively communicate results of clinical trials to the project team, senior management, regulatory agencies and/or individual investigators.Communicating effectively with regulatory agencies, in meetings and in written material (e.g. briefing documents) the statistical methodologies, analyses, and results of clinical studies.Contributing to the development of submissions to worldwide regulatory agencies (e.g. NDA, MAA).Providing responses to queries relating to study design, data analysis, and output interpretation posed by clinical monitors, regulatory agencies, and/or investigators. Requirements PhD (preferred; minimum 15 years of experience) in Statistics/Biostatistics in the biopharmaceutical industry, with knowledge of biomedical sciences.Demonstrated expertise in statistical planning, data analysis and reporting of clinical trial data is a must.Detailed knowledge of statistical regulatory requirements/regulations and currently acceptable statistical methodologies also required.Solid, hands-on knowledge of the use of statistical software (e.g., SAS or SAS Jump), including report generation is necessary.Prior work experience in the rare disease space is strongly desired; primary focus is on clinical trials with small sample sizes.Strong MS Office skills (Word, Excel, PowerPoint), and skills in generating graphs and figures.Excellent verbal and written communication and interpersonal skills.Demonstrated ability to work in a team environment.High degree of motivation; results oriented."}