{"jobID": "2838075181", "jobLocation": "Richardson_TX", "jobTitle": "Analytics Consultant", "companyRating": "3.2", "companyInfo": {"Website": "www.hcsc.com/careers/index.html", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1936", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " UnitedHealth Group, Aetna, Humana"}, "estimatedSalary": "92000", "jobDescription": " Job Description:Description: POSITION SUMMARY: As part of our Enterprise Network Solutions team, you will support various analytical and reporting requirements across the Enterprise in order to meet affordability of care goals. The position requires analyzing provider, membership, claims and financial data connecting to various Teradata (EDW, DSL, ECU) and MS Access (Affordability of Care AOC) databases. You will be responsible for querying data using SQL and generating reports using Excel, MS Access and Tableau. The role requires coordinating with multiple teams and gathering data/reporting requirements in order to generate reports. You will also be responsible for report distribution and presenting/conducting demos. This is a high visibility role in the organization with exposure to many other departments and executives. This is a great opportunity for those that enjoy working in a fast paced, dynamic environment. BASIC FUNCTION: The position is responsible for Conducting Data Analysis, Creating Datasets and Generating Enterprise reports for various lines of business using MS Access, VBA, Excel, Tableau, Teradata and SQL. May perform research and assists in analyzing provider, claims and membership data, to determine top medical cost drivers and help achieve affordability of care goals. Analyzes complex business problems and issues using data from internal and external sources to provide insight to decision-makers. Identifies and interprets trends and patterns in datasets to locate influences. Creates specifications for reports and analysis based on business needs and required or available data elements. May provide consultation to users and lead cross-functional teams to address business issues. JOB REQUIREMENTS: *Bachelor Degree OR 1 year experience in data analysis and information reporting relating to healthcare data, including pharmacy. *Requires knowledge and experience in own function; still acquiring higher-level knowledge and skills *Builds own knowledge of HCSC, business processes and customers *Solves a range of problems *Analyzes possible solutions using standard procedures *Receives a moderate level of guidance and direction PREFERRED REQUIREMENTS: *Ability to articulate depth and breadth of expertise in the following: analytical thinking, presentation skills, communication for results, conceptual thinking, information seeking, initiative, openness to learning, results orientation, teamwork, thoroughness, understanding environment. *Experience creating datasets and generating enterprise reports for various lines of business using MS Access, VBA. *Strong SQL experience. Ability to write queries from scratch. This position is based in Richardson, TX. Relocation will not be provided for this position. Sponsorship will not be provided for this position. *CA *CB* Location: TX - Richardson Activation Date: Thursday, June 7, 2018 Expiration Date: Saturday, July 21, 2018"}