{"jobID": "2829164510", "jobLocation": "Austin_TX", "jobTitle": "BI Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.zilkerpartners.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "BI Data AnalystAustin,TX View All Positions Apply Now Apply Now View All Positions Job Summary Our client is seeking a Data Analyst to help build and maintain their data ecosystem and support the fast-growing business with the implementation of a multiple new operational, data warehouse and business intelligence systems. Our ideal candidate must be highly organized, detail-oriented, an amazing communicator, and great at working with cross-functional teams on multiple projects.  The ideal candidate for this position will have a very strong SQL background, deep analytical skills, and experience working with end users. Tableau knowledge is required. The ability to do ad-hoc SQL to research data questions, identify root causes, and interact closely with peers and the business data analysts is essential. Job ResponsibilitiesTroubleshoot ETL and integration system errors, engage in cleanup and reprocessingDesign and support a robust ETL platform in a Pentaho environmentDesign, build and support data warehouse schema; contribute to the design of tactical and strategic data models when necessaryDesign and develop complex analytical reports, including trend and dashboard reportsBuild, manage and support Data Warehouse, ETL middleware and reporting interfaces from multiple internal and external systems; support and maintain data feeds and data quality Work with internal team and vendors on data analysis and troubleshooting issuesAbility to assist in deployment, administration, tuning, monitoring, performance and scalability of database technologies including security, backup, recovery, and archival concepts and proceduresEnable business decision making by analyzing and combining data across channelsWork with internal team and vendors on data analysis and troubleshooting issuesParticipate in meetings with multiple business and IT stakeholders on a regular basis and understand their data needs as it pertains to analyzing business performance and KPI’sPropose and prototype BI reporting solutions that are holistic (span multiple departments or Enterprise wide), simple, creative, scalable and reliableMentor the reporting team on the industry standards, best practices and optimal solutions"}