{"jobID": "2647114457", "jobLocation": "Los_Angeles_CA", "jobTitle": "Research Scientist (Demographer)", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " The Center for Economic and Social Research (CESR) of the University of Southern California is now accepting applications for the position of Research Scientist in the field of Sociology/Demography. CESR is a new interdisciplinary institute in the USC Dornsife College of Letters, Arts and Sciences (cesr.usc.edu/).  The position requires excellent analytical skills, strong written and oral communication skills, significant knowledge of a specialized area of research, experience working on externally funded grants, a willingness to attract external funding, the ability to lead projects and proposals and work as a member of a multi-disciplinary team, and a commitment to affecting change through empirical research. Qualifications: • PhD in Sociology, Demography, Public Health, or related field.  • Demonstrated research skills, preferably in the form of peer reviewed publications.  • Demonstrated success initiating and leading research projects and grant proposals. Application Instructions: Interested candidates must attach/upload a cover letter and a CV.  Reference letters and writing samples will be requested after a preliminary review. Review of applications will begin immediately.  USC strongly values diversity and is committed to equal opportunity in employment. Women and men, and members of all racial and ethnic groups are encouraged to apply.  Job Profile Summary  Minimum Education: Ph.D. or equivalent doctorate  Minimum Experience: 5 years  Minimum Field of Expertise: Directly related education and experience in research specialization with highly advanced knowledge of equipment, procedures, analysis methods, principles, theories and concepts. Demonstrated leadership in developing new ideas and ability to publish in appropriate academic and practitioner outlets. Demonstrated independent thinking and leadership in scholarly writing according to such criteria as: first authored publications, conceptual leadership in the development of publications generated alone or with others, writing of first drafts of publications and/or single authored publications."}