{"jobID": "2787063532", "jobLocation": "Houston_TX", "jobTitle": "Research Scientist (non-lab position) - Institute for Personalized for Cancer Therapy", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " The MD Anderson Cancer Center Sheikh Khalifa Bin Zayed Al Nahyan Institute for Personalized Cancer Therapy was created to support preclinical research and clinical trials in which a patient's tumor biopsy is assayed for abnormal genes and gene products to select therapy with agents targeting the product of those particular abnormal genes. This integrated research and clinical trials program is aimed at implementing personalized cancer therapy and improving patient outcomes. A number of events have converged creating a \"perfect storm\" offering the opportunity to make a bold leap forward in personalizing cancer care.  This Research Scientist position is a non-lab position. The ideal candidate will have an interest in assisting the principal investigator with scientific business on a daily basis, such as, writing and editing manuscripts, abstracts, protocols, grants and reports.  The salary range is: min-$53,200, mid-$66,500 and max-$79,800.  KEY FUNCTIONS  1.Participates in various scientific research projects to transform the approach to cancer therapy through research, integrating germline, molecular and genetic information with disease-specific biology to bring personalized cancer therapy to the clinic. This may include supplying the following: a) specific information as part of a larger project; b) answer questions in a limited field; or, c) develop improved techniques, production methods or procedures.  2.Assists the principal investigator with scientific business on a daily basis to include: write and edit manuscripts, abstracts, protocols (animal and laboratory), and grants; compile, write, and submit reports to the principal; analyze and manipulate research data; prepare and present data for publication or scientific meetings; maintain current and accurate records of research data; and, obtain and distribute pertinent research materials/data.  3.Compiles, writes, and submits reports to superior as directed and assigned.  4.Utilizes research background to review public and private molecular and genomic datasets and relevant literature to compile summary reports on molecular and genomic aberrations and their relevance to clinical treatment.  5.Other duties, assigned.EDUCATION  Required: PhD in one of the natural sciences or related field or Medical degree  EXPERIENCE  Required: With PhD, no experience required. With Medical degree, two years of experience in experimental or scientific work.  Preferred: Interest in a non-lab position. Previous experience with scientific writing and editing skills.  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law.http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}