{"jobID": "2820816821", "jobLocation": "Florham_Park_NJ", "jobTitle": "Data Visualization Engineer", "companyRating": null, "companyInfo": {"Website": "www.lgsinnovations.com", "Headquarters": "Herndon, VA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Do you have a passion for innovation? So do we! At LGS our people are our greatest asset – we make sure your voice is heard and give you the resources to invent solutions to some of the most difficult challenges facing our customers. Our entrepreneurial environment fosters your best ideas and allows you to build your career to fit your creativity. Sound interesting? We’re always looking for the best and brightest to join our ranks and share the fun. LGS is seeking a Data Visualization Engineer, under minimal direction, design, develop and analyze complicated and difficult software programs for computer based systems. Duties and Responsibilities:  • Transform high level user and customer requirements for system functionality into streamlined, architected graphical user interfaces that are tailored to the specific end user’s operational needs • Develop dynamic, vibrant user interfaces to foster smooth operation and user insights.  • Combine data visualization and data science expertise to form powerful user interface solutions • Design and implement custom messaging protocols using appropriate communication tools and libraries • Interface with existing third party software and hardware components and systems such as geospatial mapping and visualization tools and packages • Optimize solutions based on performance, power and unique mission constraints • Write user manuals and test documentation supporting hands-on field-testing of systems • Travel to other LGS Locations or Customer Sites as necessary • Understand and adhere to all LGS Ethical and Compliance policies • Proactively ensure a safe work environment and adhere to LGS EH&S; policies and procedures • Perform other duties as required • Obtain/retain a government security clearance at the level required to perform the duties of the position Skills and Knowledge: • Development and integration of software command and control protocols between Windows GUIs and embedded sensors over Ethernet (TCP/UDP), Serial, and USB and serialization techniques including Google Protobuf, XML, JSON, and proprietary binary. • Experience with configuration and development management tools such as SVN, Bugzilla, JIRA, and Confluence. • Databases such as MySQL, PostgreSQL, and MSSQL. • Working knowledge of C#, Microsoft .NET framework, and Visual Studio development environment is desirable. • Development and test installation packages such as InstallShield and NSIS. • Additional languages such as Java, C/C++, Python, Objective C, Swift and associated development frameworks are highly desirable. • Experience with automated GUI test tools is highly desirable. • Responsive Web Application development experience using HTML/CSS, AJAX, Google Web Tool Kit, Leaflet, OpenLayers, Node.js, React/Angular, JavaScript, and SQL is highly desirable. • Ability to balance requirements and objectives from multiple disparate user bases Additional Duties and Responsibilities: • Travel to other LGS locations or customer sites as necessary• Understand and adhere to all LGS Ethical and Compliance policies• Proactively ensure a safe work environment and adhere to LGS EH&S; policies and procedures• Perform other duties as required• If required, obtain/retain a government security clearance at the level required to perform the duties of the position Working Conditions: Work is typically performed in an office and field environment which requires proper safety precautions. Work may require some physical effort in the handling of light materials, boxes, or equipment.  Minimum Qualifications Minimum Qualifications: A minimum of 4 years of related experienceEducation Qualifications: Bachelor's Degree in Computer Science, Computer Engineering or Electrical Engineering or equivalent combination of education, skills, and experience Preferred Qualifications Master's degree preferred LGS Statement  LGS Innovations delivers mission-critical communications products, R&D;, and supporting services to U.S. defense, intelligence, and civilian agencies and commercial customers around the world. We create advanced solutions in wireless communications, signals processing and analysis, optical networking, photonics, routing and switching, and spectrum management. These solutions drive mission success in Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), cyberspace operations, and network assurance. LGS Innovations is headquartered in Herndon, Virginia, with offices across the U.S. and overseas. We employ over 1,000 associates around the world, including 750 scientists and engineers. LGS Innovations: Listen. Innovate. Deliver. www.lgsinnovations.com. We provide our employees with competitive compensation packages and a full range of benefits, including vacation, medical, dental, life insurance, a 401(k) plan, tuition assistance, Employee Assistance Program (EAP), and paid parental leave. For a listing of all LGS Innovations open positions, please visit our website at http://www.lgsinnovations.com/careers. Equal Opportunity Employer/Veterans/Disabled www.dhs.gov/E-Verify E-Verify® is a registered trademark of the U.S. Department of Homeland Security. This business uses E-Verify in its hiring practices to achieve a lawful workforce.  Axios Statement  EEO Statement  LGS Innovations is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. "}