{"jobID": "2817685561", "jobLocation": "Pleasanton_CA", "jobTitle": "Business Systems Analyst, Master Data", "companyRating": "2.9", "companyInfo": {"Website": "www.safeway.com", "Headquarters": "Pleasanton, CA", "Size": "10000+ employees", "Founded": " 1915", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Kroger, SUPERVALU, Walmart"}, "estimatedSalary": "80000", "jobDescription": " Albertsons-Safeway Company is one of the largest food and drug retailers with 2,300+ stores. The Albertsons-Safeway family of brands includes some of the most prominent brands in food retailing, with a growing base of loyal shoppers. Thanks to the professionalism, diversity, spirit and friendliness of our people, we have locations across the U.S.  The Information Technology Department has an opening for a Business Systems Analyst, Master Data. This position is located in Pleasanton, California.  Key Responsibilities include, but are not limited to:  Proven ability to develop and execute a Requirements Management plan  Shape solutions to fit business objectives in the Supply Chain domain in the capacity of a business systems analyst.  Consult with the business clients to understand and assess business process under review.  Analyze business processes, conduct fit-gap analysis, and identify inefficiencies and/or risks to determine appropriate process and system design.  Optimize and streamline business process and technical solutions.  Identify gaps between current and future state of business processes and prioritize opportunities to improving processes.  Lead and facilitate business user meetings to gather process information. Assist others in understanding the flow of information/processes and data through systems.  Capability to estimate work and provide meaningful input to project planning process.  Demonstrated capability to author quality documentation that can be used to capture relevant information and be meaningful input to dependent roles.  Facilitates and encourages communication and information flow between end users and the project teams to refine requirements, define the project vision, and develop project goals and roadmaps.  Collaborate and provide inputs to the development team during development phase to meet the business needs.  Knowledge of major tasks, deliverables, formal methodologies and disciplines for delivering new or enhanced applications.  Knowledge of formal methodologies for planning and executing application development, enhancement or support.  Manage and prioritize requirements through the development lifecycle.  Guides the project team towards the incremental delivery of project releases.  Identify, analyze and document system requirements (functional and non-functional).  Oversee the planning and execution of User Acceptance Testing. This includes support for test plans, test scenarios/cases, and compiling test data.  Identify requirements and contribute to end user training materials and procedures when required.  Perform Data Analysis and Mapping for system conversion and integration efforts.  Knowledge and ability to use and administer the organization's technology practices, standards and procedures.  Knowledge of organization's total Information Technology (IT) environment.  Knowledge and understanding of marketplace experience, developments and trends related to the Information Technology (IT) function. Qualifications: 4-year degree (Information Systems, Computer Science, Business Administration or relational functional field) and/or equivalent combination of education or work experience.  6+ years of business analysis and/or functional experience in Retail domain required. MBA a plus.  Significant experience with Data Analysis is preferred. Demonstrated hands-on knowledge of SQL against any RDMS is a requirement. Oracle, DB2 and Teradata are preferred.  Strong working knowledge of MS WORD, EXCEL, and VISIO is a requirement.  Demonstrated use of Requirements gathering Tools like Requisite PRO, HP suite and wireframes is desired.  Ability to successfully partner with vendors/agencies and internal stakeholders; ability to work within a cross-functional team environment where teams are sometimes located remotely.  Strong ability to prioritize and resolve technical issues within the broader project team.  Strong technical skills in analyzing functional business processes, process modeling, business modeling tools, developing system solutions and documentation standards.  Strong collaboration skills while working with SME's, senior leaders, IT PMO and business users/ stakeholders to drive business analysis/user requirements.  Strong negotiation skills when working with business users to develop requirements and defend systems capabilities.  Ability to multitask and work effectively in a matrix management environment.  Strong customer service skills and ability to follow through to resolve customer issues.  Ability to understand client expectations and recognize and resolve issues that may affect delivery.  Ability to share knowledge and coach and train other business systems analysts.  How to : Interested candidates are encouraged to submit a resume by visiting ********************  Diversity is fundamental at Albertsons-Safeway. We foster an inclusive working environment where the different strengths and perspectives of each employee is both recognized and valued. We believe that building successful relationships with our customers and our communities is only possible through the diversity of our people. A diverse workforce leads to better teamwork and creative thinking, as well as mutual understanding and respect.  The Albertsons-Safeway policy is to provide employment, training, compensation, promotion and other conditions of employment without regard to race, color, religion, sexual orientation, gender identity, national origin, sex, age, disability, veteran status, medical condition, marital status or any other legally protected status.  We support a drug-free workplace all applicants offered a position are required to pass a pre-employment drug test before they are hired. AN EQUAL OPPORTUNITY EMPLOYER"}