{"jobID": "2826814640", "jobLocation": "Chicago_IL", "jobTitle": "Master Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.discover.com", "Headquarters": "Riverwoods, IL", "Size": "10000+ employees", "Founded": " 1986", "Type": " Company - Public (DFS) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "Job DescriptionAs a Master Data Engineer you will provide engineering leadership to create and enhance data solutions enabling seamless integration and flow of data across our data ecosystem which includes AWS. Additionally you will provide senior level technical consulting to peer data engineers during design and development for highly complex and critical data projects. Some of these projects will include designing and developing data ingestion and processing/transformation frameworks leveraging open source tools such as NiFi, Lambda, Step Functions, Java, Python, Spark, etc. Additionally, you will work on real time processing solutions using tools such as Flink, Storm, Kafka, and Kinesis. You will deploy application code using CI/CD tools and techniques and provide support for deployed data applications and analytical models.  This role will sit in our state of the art, downtown Chicago location at 350 N. Orleans. Responsibilities:Develop data driven solutions utilizing current and next generation technologies to meet evolving business needs.Ability to quickly identify an opportunity and recommend possible technical solutions.Utilize multiple development languages/tools such as Python, SPARK, HBase, Hive, Microsoft R, Java to build prototypes and evaluate results for effectiveness and feasibility.Work heavily within the AWS ecosystem, using AWS servicesOperationalize open source data-analytic tools for enterprise use.Develop real-time data ingestion and stream-analytic solutions leveraging technologies such as Kafka, Apache Spark, NIFI, Python, HBase, Kinesis, and EMR.Custom Data pipeline development (Cloud and locally hosted)Work heavily within the Hadoop ecosystem and migrate data from Teradata to Hadoop.Provide support for deployed data applications and analytical models by being a trusted advisor to Data Scientists and other data consumers by identifying data problems and guiding issue resolution with partner Data Engineers and source data providers.Provide subject matter expertise in the analysis, preparation of specifications and plans for the development of data processes.Ensure proper data governance policies are followed by implementing or validating Data Lineage, Quality checks, classification, etc.Promote a risk-aware culture, ensure efficient and effective risk and compliance management practices by adhering to required standards and processes. Skills Skills Required:AWS data services (Lambda,Glue, EMR, Kinesis, Step Functions, Data Pipeline)Deep understanding of the Hadoop technology stackBuilding custom NiFI processorsData pipeline developmentExperience in developing Python / R applicationsSpark application coding in Scala / Python (pySpark)Deep knowledge and very strong in SQL, and Relational DatabasesStrong in Unix / Shell scriptingExperience in creating very efficient HiveQL and SparkQL queries and can educate peers on the topicBachelors degree in Computer Science, related field, or equivalent work experienceLeadership Skills:7+ years of experience of being a lead engineer and able to coach/provide guidance to peer and junior engineers.Excellent written and verbal communication, presentation and professional speaking skillsCollaborative individual who excels in working within a team and with business partners to identify, develop and deliver innovative data solutionsInfluencing skills/ability. Must be able to work with effectively with different levels of management and all business areas.Ability to demonstrate leadership to managers, and peer level staff.Ability to build and leverage external relationships.Decision making abilities while gathering information and then put your decisions into action.Passionate learner who enjoys education through class room training and self-discovery on a variety of emerging technologies #LI-KE  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}