{"jobID": "2761623669", "jobLocation": "Chicago_IL", "jobTitle": "Business Intelligence Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.chubb.com", "Headquarters": "Zurich, Switzerland", "Size": "10000+ employees", "Founded": " 1882", "Type": " Company - Public (CB) ", "Industry": " Insurance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Combined Insurance, is seeking a Business Intelligence Analyst to join our fast-paced, high energy, growing company. For nearly 100 years in the insurance industry, our company has been passionate about serving our customers and providing them peace of mind and protection when they need it the most. Come build your career here, along with other positive, hard-working, talented professionals—just like you! JOB SUMMARY: This position will be responsible for the development of new Business Intelligence dashboards using Power BI that will be accessible on the iPad using cloud-based data. He/she will work closely with the reporting manager to deliver on the design/development, programming, maintenance, and publication of operational reports that play a key role in driving business decisions. RESPONSIBILITIES:Develop and prepare weekly and monthly reports to address the business needs of the Finance departmentCreate data visualizations and transform data into innovative dashboard designsMaintain large sets of data that require validation, cleansing and troubleshootingCreate and maintain online automated reports using SSRS; update and maintain Access and SQL databases to ensure data qualityDebug technical issues when they ariseRespond to ad hoc requests for analysis and reports from internal stakeholders including Sales, Marketing, Underwriting, Legal, Actuarial, Training, and ITDevelop skills and leverage Business Intelligence tools such as power BI to drive efficiency and deliver high quality information solutionsAnalyze and integrate data from multiple sourcesSKILLS/EXPERIENCE:One to three years business experience, knowledge of insurance industry a plusExcellent technical skills including advanced knowledge of Excel and AccessKnowledge of SQL programming languageExperience creating online automated reports using SSRSBusiness Intelligence and/or dashboard experience, Power BI a plusExperience working with large databasesStrong analytical, problem-solving and multi-tasking skillsAbility to work independently to complete assignments in a timely mannerEDUCATION:BA required, preferably in IT, Computer Science, Data Analytics, Business Intelligence or FinanceOUR BENEFITS As a Combined corporate employee, you have access to one of the most comprehensive benefit plans in the business, designed to meet your needs and help you reach your financial goals. Our Company is committed to supporting its employees with a comprehensive compensation package that is appropriate in the market where they work. Below are several of the many benefits we offer our employees: Health insuranceDental insuranceTuition reimbursementA company-match 401(k) planDisability insuranceLife insuranceEmployee referral bonusesABOUT COMBINED INSURANCE Combined Insurance is a leading provider of individual supplemental accident, disability, health and life insurance products. With a field sales force and corporate staff in excess of 5,000 people worldwide, Combined Insurance meets the growing coverage needs of policyholders around the globe. We pride ourselves on being customer-centric, people-driven, accountable, performance-minded, and ethical. We invest in our employees and take the time to focus on their development, needs and career aspirations.  Our parent company is one of the world’s largest multiline property and casualty insurers. With operations in 54 countries, the Company provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance and life insurance to a diverse group of clients.  Connect with us on Twitter, Facebook, LinkedIn, and Google  At Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religion, age, sex, sexual orientation, transgender, national origin, disability, genetic information, veteran or marital status, or any other characteristic protected by law."}