{"jobID": "2618610050", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Field Service Technician", "companyRating": "3.3", "companyInfo": {"Website": "www.crown.com", "Headquarters": "New Bremen, OH", "Size": "10000+ employees", "Founded": " 1945", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Raymond, Toyota North America"}, "estimatedSalary": "20", "jobDescription": "Company Description: Crown Equipment Corporation, one of the world's largest lift truck manufacturers, offers local support on a global scale with more than 15 manufacturing facilities worldwide and more than 500 retail locations in over 80 countries. Our global sales and service network provides our customers with a local resource for a wide variety of quality material handling equipment, fleet management solutions, warehouse products and support services to meet their needs anytime, anywhere. Want to Learn More? Watch A Day in the Life of a Crown Field Service Technician!click hereJob Responsibilities:Troubleshoot, diagnose and repair Crown and all other makes of lift trucks.Perform all assigned planned maintenance on customer lift trucks.Maintain a service van and its inventory.Process paperwork after completion of each job.Qualifications:High school diploma or equivalent.Good mechanical and electrical aptitudes, knowledge of electrical/electronic systems and hydraulics and internal combustion engines, and the ability to read and understand electrical and hydraulic schematics.Good written/verbal communication and customer care skills.Valid driver's license, good driving record, and ability to safely operate lift trucks.Technical degree, previous lift truck repair, welding experience, and knowledge of various types of testing equipment preferred.Compensation and Benefits: Crown offers an excellent wage and benefits package for full-time employees including Health/Dental/Vision/Prescription Drug Plan, Flexible Benefits Plan, 401K Retirement Savings Plan, Life and Disability Benefits, Paid Holidays, Paid Vacation, Tuition Reimbursement, and much more.  Crown also offers Service Technicians: Award-Winning Service TrainingCompany Vehicle for Field Service TechniciansTool InsuranceNo Flat Rate40 Hours Per Week plus OvertimeUniformsSpecialty ToolsPrimarily 1st ShiftSolid Support NetworkCareer Advancement Opportunities EO/AA Employer Minorities/Females/Protected Veterans/Disabled  #Crown"}