{"jobID": "2803348441", "jobLocation": "Dallas_TX", "jobTitle": "Computational Biologist II - Obstetrics and Gynecology Green Center", "companyRating": "3.8", "companyInfo": {"Website": "jobs.utsouthwestern.edu", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1943", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Baylor Scott & White Health, HCA Healthcare, Parkland Health & Hospital System"}, "estimatedSalary": "64000", "jobDescription": "SecurityThis position is security-sensitive and subject to Texas Education Code 51.215, which authorizes UT Southwestern to obtain criminal history record informationSalarySalary NegotiableExperience and EducationPh.D. in Computer Science or a related field of biological science, thesis work in bioinformatics and computational biology.  Master's degree in Computer Science or a related field of biological science, and two (2) years related research experience in bioinformatics and computational biology.  Bachelor's degree in Computer Science or a related field of biological science, and four (4) years related research experience in bioinformatics and computational biology.Job DutiesPerform professional work in support of scientific research using technical knowledge of software, software development, networking, and/or hardware in a complex computing environment. Subject matter expert in multiple areas of computing technology, and specific knowledge of molecular biology and genetics.Manage computer hardware and software programming and maintenance for one or more research laboratories. Ensure existing systems meet the continuing needs of the labs and/or recommend and test new systems as necessary.Perform or direct others to perform complex data analysis related to specialized research methodologies and results. Manage assigned research projects with minimal input from the Principle Investigator.Develop and/or modify software to support new and ongoing research projects.Resolve hardware, software, and network issues in support of the laboratory.Oversee the development and maintenance of complex databases to support new and ongoing research projects.Prepare research reports for presentation, and assist with preparation of manuscripts for publication.May specialize in bioinformatics, software development, network administration, or hardware/software maintenance.Perform other duties as assigned.Other Job ResponsibilitiesSeeking qualified individuals with degrees in computer science, bioinformatics or computational biology to study gene regulation on a global scale in the laboratory of Dr. W. Lee Kraus. We have a number of exciting ongoing projects related to the genomics of signal-regulated gene expression in various biological models (e.g., cancer, inflammation, adipogenesis, stem cells) using high-throughput sequencing technologies. UT Southwestern provides a dynamic, collaborative, and integrative research and training environment with state-of-the-art facilities.  Strong candidates will be proficient in computer programming and analysis of genomic/next generation sequencing data sets, and have experience working with biological systems. Should have demonstrated computer skills in a UNIX environment and significant experience with computational tools such as R/Bioconductor and programming experience using Python, Perl, Java, or C/C++. Should have broad knowledge of statistical analyses. Should have a good understanding of genomic databases and their annotations, a good understanding of the biology behind gene expression profiling, comparative genomics and genetic mapping, and an appreciation of the use of statistical methods and mathematical models in the interpretation of biological data. Must be well organized and detail oriented. Must be personable, flexible, possess excellent organizational and written/oral communication skills, be able to multi-task, and take pride in providing exceptional service while working in a team-oriented environment.  UTSouthwestern Medical Center is committed to an educational and working environment that provides equal opportunity to all members of the University community. In accordance with federal and state law, the University prohibits unlawful discrimination, including harassment, on the basis of: race; color; religion; national origin; gender, including sexual harassment; age; disability; citizenship; and veteran status. In addition, it is UTSouthwestern policy to prohibit discrimination on the basis of sexual orientation, gender identity, or gender expression."}