{"jobID": "2815083745", "jobLocation": "Kalamazoo_MI", "jobTitle": "Scientist - Platforms and Discovery", "companyRating": null, "companyInfo": {"Website": "www.kalsec.com", "Headquarters": "Kalamazoo, MI", "Size": "201 to 500 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job DescriptionJob Summary: Applies broad scientific expertise to projects and teams and is responsible for organizing own results. May train junior scientists and technicians in various techniques. Reviews own results and prepares draft reports for supervisor review. Executes studies with minimal direction on design from supervisor or project leaders. Reviews scientific literature to enhance job knowledge.Essential Job Functions:1. Serves as a scientific investigator by independently conducting experiments and associated research activities directed toward identified, strategic business opportunities requiring:a. Judgment in the independent evaluation, selection and, if necessary, creation and modification of appropriate scientific techniques.b. The application of specialized techniques or ingenuity in selecting and evaluating approaches to unforeseen or novel problems.c. A thorough understanding of scientific methods, research protocols, assessment instruments, and data analysis and interpretation.d. The evaluation and acquisition of new techniques and equipment that improve the capabilities of the laboratory and expand the possibilities for commercial opportunities.e. Careful recording of experimental observations in a laboratory notebook kept in a sufficient manner to protect Kalsec®’s intellectual property rights.f. Preparation of detailed reports describing research efforts, and, when appropriate, presentation of research results to scientific conferences, customers, Kalsec® staff, and/or other groups.g. The transition of promising research work into the application and process development groups and seeing products through to commercialization.2. Maintains a working knowledge of state-of-the-art technology, equipment, and business systems.3. Keeps abreast of the literature pertinent to current project as well as to scout new technologies.4. Develops contacts with outside researchers that furthers Kalsec®’s business objectives and multiplies research efforts.5. Maintains a safe and clean work area, complying with corporate safety and environmental policies.6. Participates in training programs deemed necessary to either develop job skills and laboratory capabilities or meet company policies and directives.7. Is aware of the company’s QA policy and objectives, strictly observing these policy provisions in the fulfillment of this job.8. Participates in sensory programs and projects.Specific Job Functions1. Researches and develops new products and processes to innovate both within Kalsec®’s core competencies and beyond.2. Identifies new technologies and areas of research for new potential product opportunities.3. Works collaboratively with Product Developers, Quality Control, Analytical, Process Technology, and Manufacturing to ensure successful technology transfer.4. Authors reports to disseminate data with Kalsec®. Travel 0 - 10% Shift Type Job Type Full-time Date Needed By Category Laboratory Job RequirementsEducation/Experience/Skills:Required: B.S. in chemistry, engineering, biology, food science or related field plus 4 years of experience, or equivalent Prior experience in chemical handling and safetyDesired: Prior experience working with food systems or natural products Career Level Experienced (Non-Manager) Location Kalsec, Inc. - Kalamazoo, MI 49006 US (Primary) Hiring Manager Education Bachelor's Degree Exemption Type Exempt Job Title Scientist - Platforms and Discovery # of Hires Needed 1 Wage Amount"}