{"jobID": "2689376604", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Analyst/Database Administrator", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "63000", "jobDescription": "Job Number: R0025024 Data Analyst/Database AdministratorKey Role:  Design and perform detailed data queries and data retrievals, including data interpretation using SQL, Oracle or other tools. Perform statistical procedures, including regression analysis, factor analysis, correlation analysis, and cluster analysis. Perform database administration tasks for existing IT systems. Resolve database problems and assist with data retrieval and data update. Provide relational database software package support. Create instances and views, write SQL queries, as required, manage extents, perform database backups and recovery, and conduct all typical DBA functions. Support diverse efforts through detailed research and analysis of technical approaches and progress updates.  Basic Qualifications:  -2+ years of experience in database administration or engineering with Postgres, Oracle, MySQL, or SQL Server  -2+ years of experience with database design, development, implementation, information storage, and retrieval  -2+ years of experience with supporting the analytical usage of databases, including using SQL to create ad hoc queries, scripts, and macros  -Ability to conceptualize directions, analyze trends, and help develop justification for business decisions using statistical methods on data sets of varied size and complexity  -Ability to apply thought leadership as a subject matter expert within a team comprised of diverse technical backgrounds and expertise  -Ability to organize, multi-task, and respond to quick turn-around requests  -Secret clearance required  -BA or BS degree required  Additional Qualifications:  -Experience with the Air Force or other DoD clients  -Ability to be a self-starter and work as part of a team or independently within a complex, fast-paced, and cross-disciplinary work environment  -Possession of excellent team-oriented, team building, presentation, organizational, analytical, and problem-solving skills  -Possession of excellent oral and written communication skills  Clearance:  Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}