{"jobID": "2837795292", "jobLocation": "Chicago_IL", "jobTitle": "Senior Big Data Engineer", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Lead Big Data Engineer - AWS Big Data - Chicago, IL - $140 - $160K Job Type:  Permanent  Date Posted:  13th June 2018  Location:  Chicago, IL  Contact Name:  Rahul Mirpuri  Telephone:  + 1 212 731 8282  Salary:  $140k - $160k Lead Big Data Engineer - AWS Big Data - Chicago, IL - $140 - 160K My client is an industry-leading analytics service provider seeking a Lead Big Data engineer to manage the design, development, and implementation of big data and analytics solutions. He/she leads numerous client projects and is responsible for examining and implementing the latest advancements in Big data analytics tools, practices and techniques to deliver greater results. Your ResponsibilitiesPrincipal client contact, working closely to understand clients' needs and ensure customer satisfactionDevelopment and implementation of big data analytics solutionsManage a team of Senior Big Data EngineersRequirementsMust be able to demonstrate advanced skills with AWS Big Data stack (Redshift, EMR, EC2, S3, Lambda, Kinesis)Strong proficiency in at least one of Python, Java, Scala, and C++Solid understanding of the design and development of Databases and Data Warehouses (SQL and NoSQL)Capable of working in an agile environmentThe ideal candidate should demonstrate strong leadership, communication, and project management skillsBenefitsAbility to work on different projects401k, healthcare, etc.High growth potential within the companyFriendly work environment with ready access to internal training FRG Consulting is a leader in Niche IT Recruitment with a focus on cloud technologies including Azure & AWS, as well as Big Data, Data Science and BI. We deal with both Microsoft Partners, AWS partners & End Users throughout North America. We have open positions and relationships with some of the top partners and end users throughout the US and offer some excellent opportunities in the BI, Big data space.  I understand the need for discretion and would welcome the opportunity to speak to any Big Data and cloud analytics candidates that are considering a new career or job either now or in the future. Confidentiality is of the upmost importance. For more information on available BI jobs, as well as the Business Intelligence, Big data and cloud market, I can be contacted at [Click Here to Email Your Resumé] or 212-731-8282. Please see www.frgconsulting.com for more information.  Big Data / Data Science / Hadoop / Microsoft Business Intelligence / BI / Business Intelligence / SSRS / SSAS / SSIS / SQL / T-SQL / MDX / Azure / Cloud / AWS / Data Warehouse / ETL / Power BI / Architect / Big Data / Hadoop / Scala / Python / Apache / Hive / Spark / MS Azure / Amazon Web Services / AWS / EMR / RDS/ Redshift / S3 / EC2 / Lambda / Glue / Data Pipeline / Kafka / Power BI / Data Lake / Data Lake Analytics / Azure IoT Hubs / BLOB Storage / HDInsight / Data Factory / Machine Learning / SQL Data Warehouse / Steam Analytics / Ruby / DynamoDB / Kinesis"}