{"jobID": "2658470684", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Health Sensing Data Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "187000", "jobDescription": "Sr. Health Sensing Data Engineer Job Number: 113388061Santa Clara Valley, California, United StatesPosted: Jun. 19, 2018Weekly Hours: 40.00 Job SummaryOur team is growing! Here is your opportunity to come and join an exciting engineering team responsible for building next-generation health sensors and features. The Human Interface Devices team is looking for talented and passionate engineers with expertise in data pipelines and infrastructure. This is an integral role where you will help design, develop, and support high quality, scalable data platforms and applications for analysis of machine, user, and sensor data.Key Qualifications Strong software development skills, with proficiency in relevant languages such as Python, JavaExtensive experience with Spark and/or Hadoop MapReduceExposure to web frameworks such as Django, FlaskFamiliarity with cloud-based infrastructure such as AWS and DockerPractical experience with SQL and NoSQL databases (MySQL, Postgres, MongoDB, Cassandra, HBase, etc)Creative and collaborative DescriptionAs a Senior Data Engineer in this central role you will own data pipelines, work with the data engineering team to develop general use tooling, and collaborate with the algorithm and QA teams to design and validate the pipelines and tooling. Your work will directly impact the development of features across multiple Apple hardware platforms. ADDITIONAL RESPONSIBILITIES INCLUDE: Scaling our existing data pipelines  Parallelization of data processing tools and frameworks and platform virtualization.  Supporting data collection and curation and handling large datasets.  Working closely with data scientists and algorithm engineersEducationBachelor or Master degree in computer science, 3+ years of programming experience, 1+ year distributed computing with Spark  Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}