{"jobID": "2674498503", "jobLocation": "Lambertville_NJ", "jobTitle": "Senior Quantitative Analyst", "companyRating": null, "companyInfo": {"Website": "www.robustwealth.com", "Headquarters": "Lambertville, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Description RobustWealth is a fast paced wealth management company that is changing the way investment advisors, banks, and enterprises are doing business. Our platform seamlessly integrates an array of previously modular features into one suite to optimize investing and wealth management practices. The technology suite includes: automated rebalancing, billing/remittance, document vaults, electronic account opening, institutional quality goals -&- risk based investment portfolios, and the open architecture use of investment options. Check out the positive press we've received in Financial Planning Magazine, Wealth Management Magazine, and the Philadelphia Inquirer to learn more! Position This position is responsible for development, maintenance and enhancement of quantitative/analytic models for automated retail portfolio optimization. This role focuses on the development and enhancement of portfolio optimization, benchmark tracking, tax optimization and similar efforts. The role often possesses an advanced degree in statistics or another related quantitative discipline.  Robust Wealth has an opportunity for a Senior Quantitative Analyst as well for a Mid-Level Quantitative Analyst within its quantitative team, which is responsible for providing quantitative modeling and support for automated client portfolio management. The candidate is expected, but not limited to perform the following tasks: Validate / code / support models and applications in support of automated portfolio optimization and custom benchmark tracking.Provide analytical and developmental support for new services being considered.Work with stakeholders on defining model enhancements, performing testing and impact analysis, and conducting ongoing analysis.Work with trading team to streamline operations.Requirements Requirements: Advanced degree in quantitative fields such as statistics, financial engineering, physics, mathematics, computer science, etc.Strong JAVA development skills strongly preferred.Advanced knowledge of other strongly typed object oriented languages will be considered provided proficiency in JAVA can be acquired quickly.Familiarity with R, Pandas or other data-centric languages is a plus.Experience in the finical industry as a developer or a quant developer/modeler is strongly preferred.Good command of statistical methods.Solid understanding of good coding practices.Effective thinking skills to identify/suggest/resolve issues independently and proactively.Ability to lead projects and work with other members of the developer and operations teams.Strong communication and collaboration skills.Benefits RobustWealth offers employees a selection of healthcare plans. We pay 85% of the cost of your RobustWealth health insurance. Dental & Vision coverage is free. You can read more on our healthcare plan here. Additional BenefitsUnlimited vacation days for employeesFree gym membershipNo dress codeFree lunch brought into the Lambertville office from local restaurantsFree Tax Preparation for Form 1040Regular Team Offsite Retreats/Events, e.g., ski trip, hiking, etc."}