{"jobID": "2804988928", "jobLocation": "Dallas_TX", "jobTitle": "Enrollment & Data services Analyst 1 -", "companyRating": null, "companyInfo": {"Website": "www.panamericanlife.com", "Headquarters": "New Orleans, LA", "Size": "1001 to 5000 employees", "Founded": " 1900", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Summary: The Enrollment & Data Services Analyst I reports directly to the Enrollment and Data Services Supervisor. The Enrollment & Data Services Analyst serves as centralized point of contact for clients and is responsible for all below referenced duties related specifically to the Enrollment side of Enrollment and Data Services. Assists Enrollment and Data Services Analysts II and III with the establishment and maintenance of vendor relations, as well as management of eligibility submitted by these vendors via the EDI process. Enrollment and Data Services Analyst I should be articulate, possessing the written and verbal communication skills expected of an employee who communicates regularly with clients and vendors. Bilingualism is a plus but not required for the position. The incumbent must maintain all established service level standards and quality measures established for job function. Job Duties to include the following: Enrollment: Primary Enrollment Contact for Client Accounts Oversees implementation of client selected Enrollment Strategies for new and renewing groupsCreates and distributes both internally and externally a summary of open enrollment activity such as enrollment transmittals, files, and ongoing deduction notificationsPosts and communicates enrollment materials such as Benefit Guides and Summary of Benefits and Coverages according to company guidelinesCommunicates with clients and brokers as necessary both verbally and in writing as requested on any issues related to the enrollment processesProcesses internal tasks via a proprietary task management system within set timing standards that relate to enrollmentPerforms regular updates to internal CRM (Customer Relationship Management) system to ensure effective documentation and record keeping is in place for internal parties to efficiently reference when neededPerforms enrollment training such as train the trainer and training for external Client HR personal as assignedTakes part in Client welcome calls as requested by Account Management teamMaintains online enrollment system as assignedData Services (20%)Assists with ancillary vendor eligibility error reporting as assignedAssists with urgent escalations to vendors as assignedPerforms regular audits of ancillary coverages as part of QC supportProvides backup to team members by processing additional internal tasks via a proprietary task management system related to post-enrollment areas specific to data services Fulfillment Provides weekly backup to Fulfillment Associate to ensure third-tier backup is in placeBackup responsibility of printing both pre- and post-sale fulfillment. Pre-sale fulfillment includes any marketing materials such as Proposals, Posters, Postcards, and Benefit Guides. Post-sale fulfillment includes any benefit information such as ID Cards and Summary of Benefits.Maintains printer system knowledge and be able to troubleshoot when issues arise. Other Duties as Assigned Serves as backup to other EDS Analysts as assignedOther duties, responsibilities , and special projects as may be assigned by managementRequirements to include the following: Spanish language proficiency a plus  Basic math skills required  Ability to multi-task and prioritize heavy workflow  Ability to do data entry with minimal errors  Ability to create and maintain spreadsheets  Excellent verbal and written communication skills  Detail oriented  Excellent organization and time management skills  Must possess excellent computer skills and working knowledge of Microsoft Word and Excel  Must be able to work on a diverse range of assignments within the assigned accountability area  We are proud to be an EEO/AA employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testingSDL2017"}