{"jobID": "2769070684", "jobLocation": "Jersey_City_NJ", "jobTitle": "Big Data & Analytics Software Engineering Lead-WM Fiduciary Analytics", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "138000", "jobDescription": "As an experienced Software Engineer, your mission is to help lead our team of innovators and technologists toward creating next-level solutions that improve the way our business is run. Your deep knowledge of design, analytics, development, coding, testing and application programming will help your team raise their game, meeting your standards, as well as satisfying both business and functional requirements. Your expertise in various technology domains will be counted on to set strategic direction and solve complex and mission critical problems, internally and externally. Your quest to embracing leading-edge technologies and methodologies inspires your team to follow suit. And best of all, you’ll be able to harness massive amounts of brainpower through our global network of technologists from around the world.Fiduciary Oversight & Controls organization is seeking a senior technologist to lead a team of data scientists & application developers in support of the Business Analytics platform being built for Fiduciary business teams. You will partner with stakeholders across the Fiduciary Business, Controls, Risk, Compliance organizations & core IT organizations to develop Fiduciary Portfolio analytics solutions (VAR, pro-forma analysis, What-If, Outliers, Anomalies, , Trends , Dispersion analysis etc.) mapping to individual business organizations needs. At the outset, business stakeholders may have a predetermined solution that may not necessarily realize the desired outcome. You must have an expertise to identify the true underlying business problem and appropriate solution. You will develop the platform utilizing modernized technology stack & and practices. We focus on people: It is critical to have the ability and credibility to lead a team of highly technical machine learning professionals, and application developers, and product managers. You must demonstrate competence in machine learning concepts and advanced analytics technologies, as well as previous success in leading a highly-functional and agile team. You must have demonstrated strong performance in prior roles, with increasing levels of responsibility and independence. Expertise in application, data and infrastructure architecture disciplines • Significant experience in both System Engineering and Software development • Advanced proficiency level with programming languages: Scala/Java and Python • 10 years of experience/expertise in and experience with server side development • 5 years of design and delivery of high volume high available backend infrastructures • Excellent in data analytics, statistics, and advanced analytics • Proficient in SQL and No-SQL DBs • Nice to have experience with Big Data Ecosystems(Spark, Impala, Hive) is a plus • Ability to quickly adapt and learn new technologies as the Big Data and IOT frontier expands. • Excellent communication and interpersonal skills which aid in interactions with business user to gather project requirements. • Recent development experience using Hadoop, Hive, HDFS, Pig, Flume , map reduce and Sqoop & solid ETL Development skills using Informatica, Data Stage, and Boom "}