{"jobID": "2820811456", "jobLocation": "San_Diego_CA", "jobTitle": "Analytic Scientist", "companyRating": null, "companyInfo": {"Website": "www.fico.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1956", "Type": " Company - Public (FICO) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " FICO (NYSE: FICO) is a leading global analytics software company, helping businesses in 90+ countries make better decisions. Join our world-class team today and fulfill your career potential! Job Summary Job Description As a leader on our team, you will be an integral part of a team of scientists working closely with external clients to build efficient predictive models, analyze and validate production model behavior and ensure optimal model performance. There will be opportunities to support the internal technology team in development of models and get involved in sales activities related to the evaluation of models for different client environments. You may also be involved in more strategic initiatives within the department and higher level management of key projects. Hiring Manager Job Responsibilities: Build and evaluate predictive and decision models to be deployed in production systems, or for research. This includes the analysis of large amounts of historical data, determining suitability for modeling, data clean-up and filtering, pattern identification and variable creation, selection of sampling criteria, generating performance definitions and variables, performing experiments with different types of algorithms and models and analyzing performance to identify the best algorithms to employ. Assist with model go-lives by performing production data validations and score distribution analysis of models in production. Assist with client meetings to investigate and resolve production data problems. Apply data mining methodology in thorough analysis of model behavior and provide support for customer meetings, model construction and pre sales. Manage medium to large scope projects under time and resource constraints and work with other teams within FICO (software, IT, product management, and product support) to enable integration and deployment of analytics software and solutions. May participate in post-implementation and model maintenance support. Mentor and assist in developing growth opportunities for professional scientists. Qualifications: MS or PhD degree in a statistics, engineering, mathematics, computer science, physics, operations research field. Significant hands-on related experience in predictive modeling and data mining. Demonstrated ability to lead cross functional teams on medium to large scope projects. Experience with Perl/Python, C, C++, or Java and familiarity with basic software design principles and coding standards and best practices. Experience analyzing large datasets and applying data-cleaning techniques along with performing statistical analyses leading to the understanding of the structure of datasets. Prefer knowledge of several of the following: Bayesian networks, PCA, independent component analysis, linear and logistic regressions, inference, estimation, experimental design, neural networks, SVM. Rewards: High performance culture promoting recognition, rewards and professional development. Competitive base salary coupled with an attractive role-specific incentive plan. Comprehensive benefits program. Why Make a Move to FICO? At FICO, you can advance your career with a leading organization in one of the fastest-growing fields in technology today Big Data analytics. We have a 50+ year history of excellence in providing analytics and decision management solutions. Here are a few examples of our impact globally: Credit Scoring 150+ billion FICO Scores have been sold to date, making it the most used credit score in the world. Fraud Detection and Security2.5+ billion credit cards globally are protected by FICO fraud systems. Lending 3/4 of US mortgages are approved using the FICO Score. FICOs proven science leverages the latest technology to drive consumer behavior insights and optimize business processes. We help many of the worlds leading banks, insurers, retailers, telecommunications providers and other firms reach a new level of success. Our success is founded on really talented people just like you who enjoy innovative and high-performance environments with the opportunity to grow. Join the FICO Family and help change the way business makes decisions! Learn more about how you can fulfill your potential at www.fico.com/Careers FICO values the strength that diversity and a culture of inclusion bring to our workplace. We are an equal employment opportunity and affirmative action employer and were proud to offer employment and advancement opportunities to all applicants without regard to race, color, ancestry, religion, sex, national origin, pregnancy, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.SDL2017"}