{"jobID": "2588940863", "jobLocation": "Bridgewater_NJ", "jobTitle": "Data Scientist, Clinical Data Sciences Team", "companyRating": "3.5", "companyInfo": {"Website": "www.sanofi.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SNY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, GlaxoSmithKline"}, "estimatedSalary": "109000", "jobDescription": " Data Scientist, Clinical Data Sciences Team Overview The Data Scientist main responsibility is to address research questions using advanced analytics and data sciences, across Sanofi portfolio in various therapeutic domains. And, to provide technical and strategic input on projects with the aim of bringing a clinical biostatistics expertise into a data science project, as well as providing knowledge on existing studies and results to bridge between multiple sources of data, statistical analysis plans, and available evidence generated previously on a compound. Responsibilities Under the leadership of the Data Sciences Group Head, work in collaboration with study and project statisticians and other functions to address research questions using advanced analytics and data sciences, across Sanofi portfolio in various therapeutic domains Provide technical and strategic input on projects with the aim of bringing a clinical biostatistics expertise into a data science project, as well as providing knowledge on existing studies and results to bridge between multiple sources of data, statistical analysis plans and available evidence generated previously on a compound. Translate project needs and goals into a data sciences plan describing research questions, data sources, endpoint definitions, and the advanced analytics approach, using rigorous statistical methods and machine-learning techniques Be responsible for preparing data and executing data analyses and/or be accountable for data sciences projects supported by third parties (e.g. data sciences company) Present results to stakeholders such as project and study statisticians and, when necessary, to other members of a project team Write a clinical data sciences report on assigned projects Contribute to the development of sanofi clinical data lake in collaboration with programming team to standardize and centralize analysis data sets (ADS) for prospective studies run by sanofi (global, regional and local) including phase II to IV clinical trials and observational studies registries. Support Data Sciences Group Head in forecasting resources for projects in your area of responsibilities with permanent and flexible resources (such as. external contractors, CROs). Actively contribute to the development of competencies in advanced analytics methods across the Biostatistics and Programming department in delivering internal training and collaboration with statisticians on clinical projects. Monitor research and literature in data sciences to lead development of innovative methods in data sciences in Biostatistics and Programming Support with the development and testing of machine-learning algorithms and data visualization Support the Group Head in identifying and engaging leading academic researchers in advanced methods development and facilitate knowledge transfer into the appropriate function groups and projects Support the Group Head in working with other data scientists in the team and other groups in the organization to scope and develop capabilities in data sciences systems, languages, and tools Represent Biostatistics and Programming department and work with other functional teams in transversal initiatives to enable the implementation of data sciences and advanced analytics across the organization Required Education/Experience MSc or PhD in data sciences, computer sciences, biostatistics, or related field required. 3+ years diverse experience applying advanced analytics (data mining, NLP, machine learning) in complex data environment and 2+ years working in clinical trials and clinical development Experience managing data-driven research from project inception to stake-holder communication. Deep knowledge in clinical data standards and exposure to real world healthcare data preferred. Proficient in R and SAS. Experience with other data sciences languages such as Python, Java or C++ Experience using tools such as Hadoop and application with machine learning and data mining. Experience in visualization tool such as Tableau or equivalent. Ability to thrive in a dynamic and fast-paced environment and drive change, collaborate effectively with a variety of individuals and organizations Excellent problem solving and negotiation skills Proven strong writing and oral communication skills. Sanofi US Services, Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law. #LI-SA #GD-SA Sanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions. With more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe. Sanofi, Empowering Life"}