{"jobID": "2777243440", "jobLocation": "Morris_Plains_NJ", "jobTitle": "Associate Scientist, QC", "companyRating": null, "companyInfo": {"Website": "www.novartis.com", "Headquarters": "Basel, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (NVS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Posting Title Associate Scientist, QC  15-May-2018 Job ID239492BRJob Description**Second Shift working (4) - (10 hour days): Sunday - Wednesday or Wednesday - Saturday • Perform micro/EM testing such as environmental monitoring, gram stain, sterility, en-dotoxin, and mycoplasma. • Perform all testing and activities compliantly following appropriate SOPs and proceedures. • Executes and follows SOPs and quality policies. • Collects and generates data for trend reporting • Monthly review of laboratory logbooks and monthly laboratory cleaning.. • Maintain controls and reference standards to support testing. • Maintain input to keep LIMS current • Verify the accuracy of data generated • Review/approve data generated by other team members. • Contributes to assigned projects by following pre-defined tasks and executing as in-structed. • Contributes to the gowning qualification program by taking samples and analyzes and generates data. • Identify process improvements • Execute method qualification/optimization of methods. • Contributes to investigations by partnering with Scientist and/or Senior Scientist. •Participate in OOS/OOE investigation • Participate in deviation investigation/CAPA implementation in a timely manner • Support 5S and Lean projects. • Interface with regulatory agencies during audits. • Knowledge of LabWare LIMS and/or other QC data systems. • Knowledge of appropriate GMP/GLP quality systems (eSOPs, TEDI, etc). • Plan and schedule activities.Minimum requirements BA or MS or advanced degree in biology, chemistry, biochemistry, microbiology or other related science or equivalent work experience. Fluent in English.  0 - 5 years of relevant experience in the pharmaceutical, biologics, microbiology, sterile manufacture, or medical device industry.  Knowledge of cGMP and an understanding of the concepts of GLP, good clinical practices and FDA guidelines, applicable state and foreign regulations, and standards routinely used in the industry (i.e. ANSI, ISO, etc.).  Thorough knowledge of microbiological and environmental monitoring, test methods.  Micro/Environmental knowledge to facilitate investigations.  Knowledge of LIMS systems.  Ability to communicate clearly with a variety of individuals in various aspects of Novartis operations.  Detail-oriented with expertise in problem solving and solid decision making abilities. Job Type Full Time CountryUSAWork Location Morris Plains Functional Area Quality Division Novartis Technical Operations Business UnitNTO BTDMEmployment Type Regular Company/Legal Entity Novartis Pharmaceuticals EEO Statement The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status. "}