{"jobID": "2710796912", "jobLocation": "Skillman_NJ", "jobTitle": "POST DOCTORAL SCIENTIST", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "76000", "jobDescription": " Johnson & Johnson Consumer Inc.  is looking to hire a Post-Doctoral Scientist in Upstream Innovation R&D; to  be located in Skillman, NJ.  Johnson & Johnson Consumer Inc.  develops and markets Oral Care, Wound Care, Womens Health and Skin Care  products that address the needs of consumers and health care professionals and  incorporate the latest innovations. The portfolio includes heritage brands  LISTERINE®, JOHNSONS Baby and BAND-AID® Brand, as well as leading skin care  brands such as AVEENO® and CLEAN & CLEAR®.  The Post-Doctoral Scientist will be  responsible for: Conducting research directed toward  discovery and development of new technologies to support the long-term growth  of the franchise through addressing consumer health needs.Work in a global, dynamic, highly  networked environment to improve the lives and healthcare of others.Identify technologies and conduct  assessments working closely with internal R&D; partners and external  collaborators.Chemical and biological in-vitro  models and cutting-edge assessment tools will be developed by the scientist  that are predictive of clinical outcomes and provide mechanistic insights.Compelling scientific data will be  used to support proof of principle clinical assessments.Develop prototype formulations, work  with cross functional colleagues to scale up and release materials for clinical  assessment.Intellectual Property will be  patented when feasible.Results of research will be  communicated regularly internally to upper management and externally at  external scientific conferences.Publication of scientific  discoveries is encouraged to help share the outcomes of our research  initiatives.QualificationsRecent PhD with up to 2 years of  research experience is required.A degree in Chemistry, Biochemistry,  Chemical Engineering, Materials Science, Biomedical Engineering or a related  major is required.Candidates with strong chemistry  background are highly preferred.Research experience in physical and  chemical instrumental methods (e.g. spectroscopy, chromatography,  microscopy, zeta potential, etc) is required and formulation development  experience is preferred.Candidates with an entrepreneurial  mindset are preferred.Thesis work in the fields of surface  chemistry, bio physical chemistry, bio analytical chemistry, polymer/material  chemistry or colloid science are highly preferred.Excellent oral and written  communication skills and solid presentation skills are required.The candidate must be able to work  independently on multiple projects AND able to successfully partner and  influence cross-functional team members.Technical writing and publication is  required.This position may require up to 20%  overall travel. If you want to explore the many  small-company environments behind the big-company impact of the Johnson &  Johnson Consumer Inc., bid on this position today!Primary Location United States-New Jersey-Skillman Organization J & J Consumer Inc. (6101) Job Function Administration Requisition ID7348180328"}