{"jobID": "2824097946", "jobLocation": "Princeton_NJ", "jobTitle": "Senior Data Analyst, Bloomberg Industry Classifications (BICS)", "companyRating": "3.7", "companyInfo": {"Website": "www.bloomberg.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Google, Goldman Sachs, Thomson Reuters"}, "estimatedSalary": "75000", "jobDescription": " Bloomberg runs on data, and in the Global Data team we're responsible for acquiring it and providing it to our clients. We collect, analyze, process and publish the data which is the backbone of our iconic Bloomberg Terminal- the facts and figures which ultimately move the financial markets. We apply problem-solving skills to identify innovative workflow efficiencies and we implement technology solutions to enhance our systems, products and processes- and all this while delivering advanced insights to our clients.  The Bloomberg Industry Classifications (BICS) Data Team is responsible for the timely and accurate entry and maintenance of industry classification data. They are also responsible for supporting the Financial Product and Sales teams by engaging in client outreach efforts and acting as subject matter experts within the classification business. The team works closely with other Global Data teams as well as Bloomberg News and Data Systems Engineering.  What's the role?  The Bloomberg Industry Classifications Data Team is looking for a highly motivated and driven Senior Data Analyst to cover sales team support, quality control, and stakeholder management within the Classification business. You will be directly responsible for the review and analysis of data, creating client support materials, and maintenance of all Bloomberg generated classification data. We'll trust you to:Ensure consistency and quality while delivering excellent customer service to internal and external customersMaintain expectations with internal stakeholdersCollaborate with Business Managers, Sales, and Engineering staff to support the development of our productParticipate in client outreach efforts and the marketing of classification productIdentify and implement improvements to workflow and operational efficienciesYou'll need to have:5+ years experience in finance, index creation, or fundamental related productsProven ability to drive projects to completionIn-depth experience in Bloomberg securities databasesEffective written, verbal and presentation skillsProven experience in building strong client relationships internally and externallyStrong organizational skills, attention to detail and capable of handling multiple projectsCapacity to deliver clear and concise documentation that supports business requirements, use cases, and process improvement flow charts Apply Now  Senior Data Analyst, Bloomberg Industry Classifications (BICS)Princeton  Posted May 9, 2018 - Requisition No. 67008  Apply Now  Bloomberg runs on data, and in the Global Data team we're responsible for acquiring it and providing it to our clients. We collect, analyze, process and publish the data which is the backbone of our iconic Bloomberg Terminal- the facts and figures which ultimately move the financial markets. We apply problem-solving skills to identify innovative workflow efficiencies and we implement technology solutions to enhance our systems, products and processes- and all this while delivering advanced insights to our clients.  The Bloomberg Industry Classifications (BICS) Data Team is responsible for the timely and accurate entry and maintenance of industry classification data. They are also responsible for supporting the Financial Product and Sales teams by engaging in client outreach efforts and acting as subject matter experts within the classification business. The team works closely with other Global Data teams as well as Bloomberg News and Data Systems Engineering.  What's the role?  The Bloomberg Industry Classifications Data Team is looking for a highly motivated and driven Senior Data Analyst to cover sales team support, quality control, and stakeholder management within the Classification business. You will be directly responsible for the review and analysis of data, creating client support materials, and maintenance of all Bloomberg generated classification data. We'll trust you to:Ensure consistency and quality while delivering excellent customer service to internal and external customersMaintain expectations with internal stakeholdersCollaborate with Business Managers, Sales, and Engineering staff to support the development of our productParticipate in client outreach efforts and the marketing of classification productIdentify and implement improvements to workflow and operational efficienciesYou'll need to have:5+ years experience in finance, index creation, or fundamental related productsProven ability to drive projects to completionIn-depth experience in Bloomberg securities databasesEffective written, verbal and presentation skillsProven experience in building strong client relationships internally and externallyStrong organizational skills, attention to detail and capable of handling multiple projectsCapacity to deliver clear and concise documentation that supports business requirements, use cases, and process improvement flow charts"}