{"jobID": "2261910385", "jobLocation": "Detroit_MI", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.mediquik.com", "Headquarters": "Woodridge, IL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " As a Data Analyst, you will play a critical part in the day-to-day operations. We are looking for a passionate Data Analyst to turn data into information, information into insight and insight into business decisions. You will conduct full lifecycle activities to include requirements analysis and design, develop analysis and reporting capabilities. It will be your responsibility to develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality. You will be working closely with management to prioritize business and information needs, along with locating and defining new process improvement opportunities. Desired Skills & Expertise3+ years proven experience as a data analystProven track record to identify, analyze, and interpret trends or patterns in complex data setsTechnical expertise regarding data models, database design development, data mining and segmentation techniquesStrong intellectual curiosity with the desire to go deep and understand the core drivers of our businessStrong knowledge of and experience with reporting packages (Business Objects etc), database (SQL etc), programming (XML, Javascript, or ETL frameworks)Knowledge of statistics and experience using statistical packages for analysing large datasets (Excel, SPSS, SAS etc)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyBachelors degree in Mathematics, Economics, Computer Science, Information Management or StatisticsCompensation includes base salary, health insurance, a 401k program, and free snacks.About Quikly Quikly is an industry-leading enterprise marketing platform. Our marketing suite focuses on customer retention, acquisition, and revenue generation. Trusted by leading brands, Quiklys scalable technology allows digital marketers the ability to generate demand in a meaningful way in real-time and drive far better return-on-investment per marketing dollar spent.  Headquartered in downtown Detroit, Quikly has become one of the fastest growing tech startups over the past three years. Quikly is a team of doers passionate about consumer marketing, technology, and design. Were here to reinvent how brands engage with their customers."}