{"jobID": "2669244182", "jobLocation": "Los_Angeles_CA", "jobTitle": "2 SLP - Speech Language Pathologist (Outpatient) Full Time", "companyRating": null, "companyInfo": {"Website": "www.allcaretherapies.com", "Headquarters": "Chatsworth, CA", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SLP - Speech Language Pathologist needed for Los Angeles, CASLP - Speech Language Pathologist in Long Beach, CAAll Care Rehab & Staffing is one of So. Cal’s leading provider of therapy services. In addition to providing specialized rehabilitative care in our Outpatient Clinics, All Care Rehab & Staffing is also one of the largest providers of home health therapy services in So. Cal. As a leader in the rehabilitative care industry, All Care Rehab’s goal is to continually bring solutions to address the evolving challenges of therapy providers.All Care Rehab is looking for a Full-time Speech Therapist to start immediately for our Los Angeles Outpatient Clinic and Long Beach, CA. Telepractice is available.Duties:Conduct Speech-Language assessments to determine eligibility for speech servicesDevelop, coordinate, implement, and monitor individual's POCCaseload includes kids, adults and geriatric population. Must be comfortable to work with kid 3 years and up in an outpatient setting.Maintain appropriate and timely weekly documentationOn-site training, assessments, and materials will be provided.Requirements:Master's Degree and valid certification as an SLP by ASHACA SLP state license.Spanish a plusBenefits:Competitive payFlexible scheduleGreat career growth opportunities***Telepratice available***Referral Bonus$$$$Join All Care Rehab now!If you are interested in learning more about the opportunities with All Care Rehab, please visit www.allcaretherapies.com. You can also contact Doris Gomez, Recruitment Manager at (562) 409-4704."}