{"jobID": "2545449206", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.arimo.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Independently named by FastCompany as one of the world’s most innovative companies in data science, Arimo’s Behavioral AI software is aimed at delivering predictive insights in commercial IoT applications.  Arimo's capabilities harness the behaviors of machines, devices, customers, and other entities to provide the most accurate predictions utilizing Deep Learning. With Arimo Behavioral AI™, leading companies are creating competitive advantage through new predictive insights, and delivering new services to their customers.  Our strong team includes executives with deep product and engineering experience. They have held senior positions at Google, Yahoo, Amazon, SAP, Microsoft, and VMware. Team members hold advanced degrees in computer science and business from leading universities. Arimo was previously funded by Andreessen Horowitz, Lightspeed Ventures, and Bloomberg Beta. To learn more, visit us at https://arimo.com.  Arimo is growing rapidly and now offering a position for Data Scientist. Passionate about digging into massive data sets and extracting data-driven insights to address complex business problems through analysis and visualization? Join us and be a part of this exciting journey! ResponsibilitiesExtract, analyze, and apply data-mining and machine learning techniques to large structured and unstructured datasetsDesign and analyze experiments to test new features & productsDevelop new algorithms and models for product improvementWork with product managers, designers, and engineers to build new features and productsRequired Skills and Qualifications2+ years of experience working with large amounts of real dataExpertise in at least one statistical software package, preferably RExperience with visualization tools such as d3, matplotlib, ggplotExperience with ETL & ML tools in R, Python, and Java such as scikit-learn, pandas, matplotlib, statsmodel, iPython, WekaProficiency in SQLAdvanced skills in a scripting language such as PythonExperience in Hadoop/Spark and/or other MapReduce paradigms is a plusExperience in Deep Learning is a plusAbility to translate business objectives into actionable analysesAbility to communicate findings clearly to both technical and non-technical audiencesTop-down thinker, excellent communicator, and excellent problem solver. Must be an active team playerOpen-minded and excited to learn new things. Have strong opinions but willing to change with new dataMs/Ph.D. in a CS or related discipline with domain expertise in Machine Learning, Statistics, Information Retrieval, or Graph Analysis Arimo offers competitive compensation packages commensurate with your experience. Offer includes full benefits, company stock options, continual career & compensation growth, and many other perks."}