{"jobID": "2787156885", "jobLocation": "Western_Springs_IL", "jobTitle": "Data Analyst : Western Suburbs, IL : 3 to 6 Months Contract", "companyRating": null, "companyInfo": {"Website": "www.cy-tec.com", "Headquarters": "Reston, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Title: Data AnalystLocation: Western Suburbs, ILPosition: 3 to 6 Months ContractInterview: Skype InterviewAs a Data Analyst Associate you will have the ability to work directly with client teams in a collaborative environment to provide value added input, deliver projects built around identified and strategic issues, and ensure the delivery of high levels of client satisfaction. Successful candidates should demonstrate thought leadership, flexibility, develop rapport with clients, team members, and managers. The individual in this role must be able to successfully apply skills and methodology to manage others, proactively mitigate risks, resolve issues, and escalate issues when appropriate. Associates work across multiple disciplines and industries, and must be able to understand their clients' businesses and build credibility quickly. Skills & Requirements:Bachelor's degree in business or technical area, or the equivalent combination of education and experience.Technical expertise data models, database design development, data mining and segmentation techniquesStrong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)Strong communication (oral and written), demonstrated interpersonal and relationship building skills.Ability to work creatively and analytically in a problem-solving environment.Proactive with demonstrated independent drive and ability to forge relationships with senior resources on the team."}