{"jobID": "2828562404", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.hyperloop-one.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "THE PURPOSE: The Data Engineer will be part of the Machine Intelligence & Analytics Group, within the Software Engineering department. This team works closely with all other teams to develop, deliver and maintain data driven products and backend analytics platforms for the discovery, interpretation, communication, and exploitation of meaningful patterns in data. In addition, this team will develop and maintain an analytics pipeline for acquisition, storage, and processing data types of interest to feed real-time artificial intelligent system behaviors. The Analytics team will architect data systems supporting machine learning applications, develop custom toolchains for analysis and exploration, and work with DevOps and IT to host and scale intelligent applications.  Ultimately, we will design reliable, scalable, real-time (or near-real time) applications that make Virgin Hyperloop One a reality. We are seeking candidates with various levels of experience to join our team of qualified, diverse individuals at our Los Angeles facility. THE ROLE:Architect and implement data pipelines (ingestion, batch simulation infrastructure, real-time insights).Perform ETL operations on large datasets from many complex, heterogeneous data sources.Develop or implement tools to support analyst-driven machine learning analyses.Work closely with Algorithms team to prototype AI/ML proof of concepts.Participate in design/code reviews to ensure compatibility with architecture.Deploy monitoring solutions to detect and resolve problems in real-time.Build reporting functionality on results of pipeline analysis and monitoring.Maintain quality and accessibility of data products.Champion processes and procedures across the organization.Develop or modify existing machine learning tools and libraries as needed.Develop visualizations of key parameters and relationships to provide insight into data.Enhance, scale, and deploy real-time analytics capabilities, models, and visualizations within production environment on production compute architecture.Collaborate in a fast-changing environment and communicate clearly and effectively with colleagues who range from data scientists, developers, DevOps, hardware engineers, and product managers.CANDIDATE PROFILE:Strong written and oral communication skills.Strong interpersonal skills.Ability to conduct research into issues and products as required.Ability to present ideas in user-friendly language and visuals.Highly self-motivated and directed.Keen attention to detail.Proven analytical and problem-solving abilities.Ability to effectively prioritize and execute tasks in a high-pressure environment.Customer-focused mindset, prioritizing developer productivity and application uptime.Ability to provide solutions to a variety of technical problems of increasing scope and complexity.Can identify potential bottlenecks and design systems appropriately.Ability to setup data pipelines from scratch.Ability with back-end data platforms and services.MINIMUM REQUIRED EXPERIENCE:Bachelors degree in Computer Science or a highly quantitative discipline.Minimum 1-3 years experience working as a Data Engineer.Strong knowledge in software engineering principles.Hands on experience and expertise with cloud computing services (AWS, Azure, etc.)Working knowledge of distributed computing architectures and databases.Working knowledge in manipulating large datasets.Strong programming ability with Python, Go and web technologies.Agile, fast prototyping skills, including feature integration during all cycles of development.Working proficiency and excellent communication skills in verbal and written English.PREFERRED EXPERIENCE:MS Degree in Computer Science or equivalent field.Ability with the following programming languages: Scala, RExperience with the following software packages: Tableau, TensorFlow, SQLAlchemy, Flask, PostgreSQL, NoSQL, Apache products (Airflow, Spark, Hadoop, Hive, etc.)Familiarity with DevOps and CI pipelines.Experience with visualization tools: Seaborn, Bokeh, D3.jsExperience working with front-end frameworks (Angular, React, etc.).Domain expertise and knowledge of transportation, logistics, and autonomous systems.Successfully delivered and maintained a major cloud service with a large numbers of end users. Hyperloop One is an Equal Employment Employer; employment is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender (including pregnancy, childbirth, or related medical conditions), national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other protected status. Hyperloop One will consider qualified applicants with criminal histories consistent with the Ban the Box legislation. We may access publicly available information as part of your application. For full information on how your personal information will be stored and processed, please click here.To all recruitment agencies: Virgin Hyperloop One does not accept unsolicited agency resumes. Please do not forward resumes to our jobs alias, Virgin Hyperloop One employees or any other company location. Virgin Hyperloop One is not responsible for any fees related to unsolicited resumes."}