{"jobID": "2829574277", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.claraanalytics.com", "Headquarters": "Santa Clara, CA", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About CLARA analytics CLARA analytics drives change in the commercial insurance markets with easy-to-use artificial intelligence (AI)-based solutions that dramatically reduce claims costs by anticipating the needs of claimants and helping align the best resources to meet those needs. Leading examples of our solutions include CLARA providers, which identifies the best available doctor engine is an award-winning provider scoring engine that helps rapidly connect injured workers to the right providers, while CLARA claims is an early warning system that helps frontline claims teams efficiently manage claims, reduce escalations and understand the drivers of complexity. CLARAs customers include a broad spectrum from the top 25 insurance carriers to small, self-insured organizations. For more information, visit www.claraanalytics.com.Job Description We are looking for an Data Analyst responsible for the development of ETL pipelines using Big Data technologies. You will be working alongside data scientists and engineers working on data ingestion and data analysis. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.Responsibilities · Analyze data and create data quality reports · Perform initial analysis to assess the quality of the data · Support initiatives for data integrity and normalization. · Ingest and normalize customer data · Communicate with engineering and customer support teams · Help to maintain CLARAs common interface standards (specifications) and collaborate with multiple teams to enhance it as needed.Skills · Strong Database and SQL skills · Strong EXCEL and MACRO skills · Strong written, verbal and presentation skills · Exposure to ETL processes · Experience working with large datasets · Excellent problem-solving capabilities and critical thinking skills · Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy"}