{"jobID": "2827043131", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.volumeintegration.com", "Headquarters": "Reston, VA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Volume Integration, LLC partners with our customers to deliver leading edge \"Big Data\" analytics solutions.  By leveraging our teams' extensive experience in cloud capabilities and emerging technologies, we design and deploy custom solutions to unique and evolving challenges. Volume employees and their families are our number one priority, while also ensuring our customer's mission and success remain the primary focus and objective.  If you are a motivated individual willing to tackle challenging, and interesting problems in cyber security, big data, and machine learning, come be a part of our dynamic team! Job Description Volume Integration is seeking a highly motivated, self-directed professional to fill the role of Data Scientist Engineer in McLean, VA. This position supports the development of a new robust data management framework for our customer. The candidate must be able to work well in a highly collaborative and fast-paced environment to meet defined requirements and satisfy customers. The candidate will be responsible for developing interactive dashboards and visualizations focused on data management. Required Skills:Develop scripts to transform data and create visualizationsDeep understanding of data lifecycle managementData modeling and analysisAbility to use algorithms and methods to extract additional insights into dataDesired Skills:Experience with Elasticsearch, Kibana and/or GrafanaEducation Requirements:Bachelor Degree in Computer Science, Engineering or a related technical discipline, or the equivalent combination of education, technical training, or work/military experience.Qualifications:Must be a U.S. Citizen6+ years of related experienceClearance Level:TS/SCI + polyLocation:McLean, VA To learn more about Volume Integration, LLC please see our website at: www.volumeintegration.com Volume Integration, LLC Diversity Commitment To harness the power of innovation, Volume Integration, LLC invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  Volume Integration, LLC is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with Volume Integration, LLC and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Careers@volumeintegration.com. Requests for reasonable accommodation will be considered on a case-by-case basis. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability. "}