{"jobID": "2586553227", "jobLocation": "Houston_TX", "jobTitle": "Research Scientist I-IV – Flow Cytometry", "companyRating": "2.2", "companyInfo": {"Website": "www.apocell.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": "ApoCell, Inc., Houston, TX– Research Scientist I-IV – Flow CytometryJob Description ApoCell is a leading molecular diagnostics company specializing in biomarker  development and translational research in the liquid biopsy and immuno-oncology  market. We are seeking an outstanding candidate for a key progressive scientific  position This individual will have the unique opportunity to utilize their scientific skills in  the environment of an innovative life science company that is committed to development  of innovative biomarker technologies. Responsibilities This person will have the responsibility in conducting and managing daily experiments  involving high complexity flow cytometry. Other experiments include rare cell separation  from blood using a proprietary microfluidic device and immunofluorescent high-content  image analysis or flow cytometry applications. This person will work closely with other  senior research scientists and technical directors to assist with assay development,  project design and execution, and generation of data reports. Technical applications  include basic cellular laboratory techniques with strong emphasis on  immunofluorescence detection, immunohistochemistry and flow cytometry analytical  methods. Experience with next generation sequencing (NGS) is a plus. This person can  contribute to quality control of reagents through a variety of tests, writing of SOPs, and  training of other laboratory personnel, generation of scientific abstracts, publications and  grant applications. We are looking for someone who is a good team player, meticulously  detailed and organized, can work under pressure and has good oral and written  communication skills. Preferred Candidate Expertise:Ph.D. in Genomics, Immunology, Cellular/Cancer Biology, Stem Cell, Fetal Cell  Biology or related fieldsAny level of postdoctoral research or industry experience in oncology,  immunology or related fields with focus on cellular analysis is requiredTranslational research experience or track record with publications is preferredExperience in acquiring and analyzing flow cytometry data. Organize flow data  for scientist, performs special projects as assignedStrong expertise with immunofluorescent and immunohistochemistry applications  including flow cytometry is requiredKnowledge of quantitative image microscopy platforms is a strong plusAdheres to established methods and SOPs, quality control procedures and  preventive maintenance schedules.Experience with rare cell analysis including Circulating Tumor Cells (CTCs), fetal  cells and/or stem cells is a strong plusOutstanding skills with project planning, experimental design, oversight and  advanced troubleshooting related to execution of experiments, documenting and  analyzing data and generating detailed reports is requiredStrong experience with statistical analysis is preferredA team player with good communication skills, ability to work under pressure and  multitask Please email your Resume/CV to: info@apocell.com and reference RSFC800 in the subject line."}