{"jobID": "2797061879", "jobLocation": "Wood_Dale_IL", "jobTitle": "Data Insights Analyst (SQL Experience Needed)", "companyRating": null, "companyInfo": {"Website": "www.chrobinson.com", "Headquarters": "Eden Prairie, MN", "Size": "10000+ employees", "Founded": " 1905", "Type": " Company - Public (CHRW) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As the Data Insights Analyst, you will be responsible for creating, presenting and implementing unique reporting and analytical perspectives related to net revenue across our various service lines, including sales, operations, and account management for the Global Forwarding division. As a Data Insights Analyst, you will be insightful, curious and consultative, and you will work beyond the numbers to develop meaningful insights that make the data actionable and provide significant impact on the business. This is an exciting, challenging and innovative role that will involve developing new processes and solutions from scratch. Responsibilities:Extract and interpret data to answer ambiguous questions working directly with personnel across the networkUtilize SQL to analyze data sets and generate insights for Global Forwarding processes and initiatives.Create, build and implement new processes and reporting methods to improve efficiency, service level and overall customer experienceUnderstand and utilize the current reporting suite and develop additional custom reporting, as neededPursue and deliver an efficient reporting platform for users (role-based)Train and mentor colleagues to understand and apply the available information tools and resources to drive a culture of analytics and assure fact-based decision-makingEngage in leadership discussions and develop and actively support strategic initiativesParticipate in business process reviewsCollaborate with other Shared Service Analysts to leverage and share best practices throughout the analytical communityQualifications:Bachelors degree preferredMinimum 2 years experience as an analyst or in a related field, working with data sets to impact the businessExpert proficiency with SQLExpert proficiency with Microsoft ExcelExperience using various reporting and analytical tools and ensuring data quality (Tableau and PowerPivot preferred).Proven ability to ask appropriate questions, interpret data results, and strive for action from learningsStrong experience thinking creatively and innovatively to develop a new data model or perspective to answer challenging business problems or scenariosStrong entrepreneurial spirit through recognizing and capitalizing on opportunities to make process improvementsComfortable working autonomously, but willingly seeks guidanceOrganized individual with strong self and project management disciplines, including the ability to lead, facilitate, influence and organize across groups and according to timelinesCreates consultative and collaborative conversations with those who seek information, guidance or analytical supportEffective communicator and data/reporting/business liaison (written and verbal)A willing teacher/mentor who also responds positively to feedback from leaders and colleaguesBenefits We offer a competitive compensation package and excellent benefits including medical, dental, and vision insurance, prescription drug coverage, paid holidays and vacation, disability insurance, life insurance, 401K with company match, profit sharing, Employee Stock Purchase Plan, and the opportunity to prosper in a growing Fortune 500 company. About C.H. Robinson C.H. Robinsonaccelerating careers with immense opportunities and professional growth within the global supply chain industry. Start here. Accelerate here.  Every individual working at C.H. Robinson is integral to the success of our customers and our company. C.H. Robinson is a Fortune 500, global company that values teamwork, initiative, accountability, and integrity from its employees. We work globally and innovate daily to enhance and execute supply chains that move goods around the world. The fast pace of the logistics industry translates into a high-energy and collaborative workplace environment. We are empowered to make decisions, help our customers grow, and accelerate our careers.  No matter the product being shipped or from which corner of the globe, C.H. Robinson can help make it happenquickly, securely, and reliably. Through personal connections and solid relationships, our employees use their in-depth knowledge, robust tools, and global network to help customers reach their goals quickly. Whether shipping by plane, rail, ship, or truck, C.H. Robinson has the knowledge, flexibility, and dedication to deliver the goods that make our world go round.  Join the 12,000 employees worldwide who are accelerating their careers at C.H. Robinson. Equal Opportunity Employer C.H. Robinson - Affirmative Action Employer/EOE/M/F/Disabled/Veteran  #LI-AB3"}