{"jobID": "2783200554", "jobLocation": "Los_Angeles_CA", "jobTitle": "Manager, Data Strategy", "companyRating": "3.2", "companyInfo": {"Website": "www.neustar.biz", "Headquarters": "Sterling, VA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Adobe, Akamai, Oracle"}, "estimatedSalary": "107000", "jobDescription": " Neustar, Inc. is a leading global information services provider driving the connected world forward with trusted, holistic identity resolution. More information is available at https://www.home.neustar. Job Requisition:R-1649 Manager, Data Strategy (Open)Primary Location:LOS ANGELESJob Description:Manager - Data Strategy Data is rarely perfect. The role of the data strategy team is to ensure we build and deliver the highest quality databases to support complex marketing analytics. You will work closely with teams of marketing strategists, scientists and data engineers to assess first and third party client marketing data to solve C-level marketing effectiveness questions. You will be hands-on with data profiling, QA and communicating with internal and external teams. We are hyper-focused on quality and customer service. Responsibilities & Key Tasks:Directly manage a team of analysts of varying levels of experience, coaching them to deliver outstanding service.In a leadership capacity, establish relationships and partner with other functions to deliver client value.Support all phases of data collection and assessment for client database builds.Acquire and assess client data from a multitude of sources for usefulness in analytics, and work with data providers to acquire data. Common tasks involve data mapping, identification and application of business rules to data sets and resolving varying date granularities.Gaining team consensus on statistical data processing logic, documenting data flow requirements for engineers and design quality assurance rules.Query and analyze data using tools such as Excel, SQL, Tableau, Python, SAS, R.Leading conversations with client data owners and media agency partners to understand strategy through data and identify data attributes critical to our modeling process.Coach, train, and mentor a team.Skills and Qualifications:10 years of experience in marketing research, agency, consulting, ad-tech, softwareExcellent diagnostic skills to analyze and identify discrepancies within data sets and identify solutionsResilient work ethic with the capability to adapt to the situationSelf-motivated and willing to take ownershipCapable of working independently on multiple projects to meet deadlinesAbility to handle ambiguity while striving for clarityEffective communication across diverse audiencesAnalytical reporting experience desirableBachelor’s Degree in Business, Economics, or experience in related analytical/technical fieldDIVERSITY Diversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us. EOE of Minorities/Females/Vets/Disability Neustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws.  Manager - Data Strategy - New York City  Data is rarely perfect. The role of the data strategy team is to ensure we build and deliver the highest quality analytic databases to support complex analytics. You will work closely with a team of marketing strategists and scientists to assess what data is available to solve C-level marketing investment questions. As a data strategist you will be hands-on, managing client projects from data assessment and analysis to delivering a final analytic dataset. We are hyper-focused on quality and customer service. What you'll be doing:You’ll directly manage a team of analysts of varying levels of experience, coaching them to deliver outstanding service.Profile client and 3rd party data from a multitude of sources for usefulness in analytics, and architect ways to wrangle and join this data together. Common tasks involve data mapping, identification and application of business rules to data sets and resolving varying date granularities.Document requirements and gain consensus across internal and external stakeholder teams.Manage data collection from clients, data review and quality checks of incoming data to ensure high quality data is used in database processing.Profile data using different query and visualization tools (e.g. Excel, SQL, and Tableau).Present data for validation to clients and internal teams.Communicate technical requirements to development teams. Work with internal developers to answer questions and resolve ambiguities.Managing work streams and priorities for client projects; Organizing messy aspects of projectsParticipate in client interactions; review data with clients and statisticians using Excel, PowerPoint, data visualization tools.Skills, Talents, Experience you have:5+ years of experience directly managing a team.3+ years of experience in marketing research, agency, consulting, ad-techAbility to navigate and influence across functional organizations and adaptability to new/different situationsAdvanced proficiency with software tools such as Excel/VBA to gather and assess data and PowerPoint to build presentationsExpertise in 1 or more of the following or related tools: SQL, R, Python, SAS, SPSS, Tableau, business intelligence tool experienceExcellent diagnostic skills to analyze and identify discrepancies within data sets and identify solutionsResilient work ethic with the capability to adapt to the situation, flexibility and nimbleness in terms of work planning, and the ability to think quickly on your feet.BS or BA (Bachelor Degree preferably in computer science, statistics, mathematics, marketing, or economics)Neustar does not accept unsolicited resumes from external firms or agencies. Neustar will not be responsible for placement fees associated with unsolicited resumes.DIVERSITY Diversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us. EOE of Minorities/Females/Vets/Disability Neustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws."}