{"jobID": "2835292671", "jobLocation": "Ne_Jersey", "jobTitle": "2261 - Assistant QC Scientist", "companyRating": null, "companyInfo": {"Website": "www.futransolutions.com", "Headquarters": "Princeton, NJ", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Assistant QC Scientist Devens, Massachusetts - United StatesPrimary SkillsMicrosoft Office Applications,Lims,cGMP,ICH,Trackwise and SAP systemsOverviewSUMMARY Support all aspects of Global Biologics Stability data management program as necessary, including but not limited to:data entry and verification in the electronic laboratory information management system (LIMS)archiving of electronic and paper data/informationSupport stability activities at third party facility, including but not limited to: inventory control, sample receipt, sample labeling, sample destruction, sample pulls, oversight of sample deliveries, etc.Ensure compliance with training requirements at all times.Maintain the office and stability facility in accordance with cGMP’s and good housekeeping practices.Initiate and promote change as part of operational excellence.KNOWLEDGE AND SKILLSKnowledge of science generally attained through studies resulting in a B.S. in science, engineering, biochemistry, a related discipline or equivalent.Minimum 2 years of experience in pharmaceutical, biotech or related fieldKnowledge and understanding of relevant industry guidelines, e.g. cGMP’s and ICHExcellent problem-solving, interpersonal, oral and written communication skills; as well as technical writing skills.Ability to prioritize objectives from multiple projects, adhering to scheduled timelines.Work independently and contribute to a team based environment; promoting a high commitment to business goals and objectives.Computer skills required: Microsoft Office applications; Experience with LIMS, Trackwise and SAP systems is desired.CONTACTS Direct daily interaction with all staff and management of Global Biologics Stability as required in daily work assignments. Occasional interactions with personnel from other BMS sites and third party stability storage facility to ensure alignment of sample shipping and receipt processes. WORKING CONDITIONS The work environment may consist of a combination of the following: Office space, Inside Work, Outside Work, Working Alone, Working with/around others, Extremes (Heat/Cold), Heights, Dust/Mist/Fumes/Wet, Damp/Walking or Work Surfaces, Chemicals.  The physical demands of the job may include but are not limited to: Unassisted lifting of items, not to exceed 50 lbs, Bending/Stooping, Twisting, Crouching/Squatting, Kneeling, Sitting, Crawling, Walking-Level Surfaces, Climbing (Ladder), Reaching (Shoulder), Repetitive (Use of Arm, Hands, Wrists). DECISION MAKING Will need to take action, make final decisions, and may work on assignments that are very complex in nature where independent action and a high degree of initiative are required to solve problems and develop recommendations. Will need to exercise judgment within generally defined practices and policies in developing improved business processes. Will need to coordinate with customers and technical experts on decisions and notify management as appropriate."}