{"jobID": "2560560555", "jobLocation": "San_Jose_CA", "jobTitle": "Business Analyst, Data Science", "companyRating": "4.9", "companyInfo": {"Website": "www.zoom.us", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " Zoom is the world leader in video communications with the highest customer satisfaction in our industry. We have been expanding rapidly since our Series D investment from Sequoia at a $1 billion valuation. Zoom was recently awarded the 5th Best SMB Company to Work for in the United States by Glassdoor (based on anonymous employee reviews). Now is the time to join our team of motivated and passionate people as Zoom grows to provide frictionless communications for businesses and organizations across the world. Visit zoom.us and follow us on Twitter (@zoom_us) and Facebook (Zoom Video Communications).  The Data Science team lies at the foundation of Zooms success- you'll be working cross-functionally with teams of engineers, scientists, marketers, and product professionals on some of the most critical projects in the company - whether it's exploratory research to predict user behavior, or running experiments to optimize untapped areas of growth, or developing machine learning models that deliver happiness to our users more consistently and at scale.  As a member of the Data Science team, you will play an important role in driving the growth of Zoom by surfacing, analyzing, and reporting on data that directly impacts near- and long-term strategic decisions.  This role is based out of our headquarters in beautiful downtown San Jose, California. Responsibilities:Develop analytical frameworks for future strategic initiatives and provide recommendations to senior management to drive business decisionsPerform variance analyses against critical benchmarks to identify the root cause behind trendsBuild/modify/maintain dashboards and reports to regularly communicate results and monitor key metrics in scalable waysWrite efficient SQL code to fuel analytical frameworks and dashboards mentioned aboveCollaborate with cross-functional teams such as product, engineering, operations, marketing, finance, and sales teams to unlock new opportunities for growthJoin a group of passionate people committed to delivering happiness to our users and to each otherRequirements:Bachelors Degree in Business/Economics, STEM (Science, Technology, Engineering, Mathematics) Degrees or similar fields2+ years of experience using data to facilitate business decisions; high growth, technology (B2B SaaS is a plus), management consulting, or business intelligence background preferredExcellent Excel and SQL skills with development experience in Python or R preferredInherently curious and believe in the power of data to drive decisionsStrong communication and organization skillsSelf-driven with the ability to work in a self-guided mannerCheck us out with a free download:zoom.us/download Zoom Video Communications is an equal opportunity employer and evaluates applicants regardless of an individuals age, race, color, gender, religion, national origin, sexual orientation, disability, veteran status. Our combined differences are what make us Zoom!"}