{"jobID": "2796094603", "jobLocation": "Washington_DC", "jobTitle": "Software Developer, OBIEE", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "89000", "jobDescription": "Job Description CACI is seeking an experienced Oracle Business Intelligence Enterprise Edition (OBIEE) developer who is passionate about building high-quality systems with software implementation best practices to join our team at one of our Arlington client site locations. The work is in a fast-paced, high visibility, client site environment supporting the Department of Defense. The work will be performed on a contract as a member of a large, highly productive team and contribute to building and supporting systems used to support the Department's financial management processes. The successful candidate will be performing development and analysis in our OBIEE systems and data on both classified and unclassified networks. Responsibilities:Designs, develops, enhances, debugs, and implements software.Troubleshoots production problems related to software applications.Researches, tests, builds, and coordinates the conversion and/or integration of new products based on client requirements.Designs and develops new software products or major enhancements to existing software.Consults with project teams and end users to identify application requirements.Performs feasibility analysis on potential future projects to management.May acts as team leader on projects.May instruct, assigns direct, and check the work of other software developers on development team.Required:Bachelors degree in relevant field or equivalent work experience10+ years software development experience5+ years Oracle Business Intelligence tools development experience4+ years PL/SQL development experienceDesired:Experience with TFS and ToadJob Location US-Washington-DC-WASHINGTON DC  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}