{"jobID": "2667337251", "jobLocation": "Pasadena_CA", "jobTitle": "Speech Research Scientist (ASR)", "companyRating": null, "companyInfo": {"Website": "www.oben.me", "Headquarters": "Pasadena, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SPEECH SPEECH RESEARCH SCIENTIST (ASR)ObEN’s mission is to enable everyone in the world to create their own Personal AI (PAI), intelligent 3D avatars that look, sound, and behave like the individual user. Secured and authenticated on the Project PAI blockchain, ObEN’s technology creates more productive, more personalized digital interactions. ObEN is a K11, Tencent, Softbank Ventures Korea and HTC Vive X portfolio company, and we work with our strategic investors to expand PAI technology across multiple verticals including hospitality, retail, healthcare, and entertainment.  Working at ObEN means taking on extraordinary transformations every day, in an environment that celebrates and encourages innovation. You’ll be working in small, agile teams (including world class researchers in areas of speech, computer vision, machine learning, NLP, and blockchain). We are blazing new trails in AI and blockchain technology, and we encourage and support publications to top conferences and journals. Learn more about working at ObEN in our blog post.Job Description: As an ASR Research Scientist, you’ll be working on developing tools to automate speech data acquisition and selection from diverse sources of data for the training of ObEN’s speech technology components. Responsibilities:Develop and extend ObEN’s proprietary ASR systems for different languages (English, Chinese, Korean, Japanese), in view of improving the robustness against environmental and channel distortion;Develop long (>1h) speech-text alignment systems;Develop lyrics-singing voice alignment systems;Develop tools and measures for data selection (confidence scores, acoustic measures);Develop tools for metadata extraction from speech and text (e.g: emotion, speakerID, etc).Requirements:PhD with strong research experience in ASR demonstrated by publications in top Speech Journals and Conferences (ICASSP, Interspeech, ASRU, etc.);Experience with robust ASR, long speech-text alignment, lightly supervised approaches and confidence measures computation;Fluent in Python and C++, excellent knowledge of Kaldi;Strong machine learning background and familiar with standard statistical modeling techniques applied to speech;Good knowledge of deep learning packages (Tensorflow, Theano, Keras, etc).Application requirements:Please send the following to careers@oben.comDetailed resume and/or LinkedIn profileLinks to any research / papers you have been an instrumental part of and are proud ofName of instructor / adviser, if any along with link to their profileCover Letter identifying your five favorite apps on your phoneIntroduction to ObEN: https://goo.gl/gxpxwTInterview process:STAGE 1: Phone Interview STAGE 2: In-person Interview at Idealab (we cover travel expenses for the day) STAGE 3: We require a sample project submission and a candidate proposal submission(To know more about what an ObEN candidate proposal is, click here) STAGE 4: Spend a day at our office and participate in all team activities. STAGE 5: Offer Letter "}