{"jobID": "2779331107", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Data Scientist / Manager - Prescriptive Analytics", "companyRating": "3.5", "companyInfo": {"Website": "www.allstate.jobs", "Headquarters": "Northbrook, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (ALL) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Progressive Insurance, State Farm, Farmers Insurance Group"}, "estimatedSalary": "120000", "jobDescription": "Where good people build rewarding careers. Think that working in the insurance field can’t be exciting, rewarding and challenging? Think again. You’ll help us reinvent protection and retirement to improve customers’ lives. We’ll help you make an impact with our training and mentoring offerings. Here, you’ll have the opportunity to expand and apply your skills in ways you never thought possible. And you’ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.Job Description  Data Discovery and Decision Science (D3) is the research and analytics organization at Allstate. We are 180+ people solving some of today’s most complex analytics problems, making the lives of our colleagues easier and more productive, and driving our mission to deliver exceptional insurance solutions to our customers. We are passionate about learning new ways to get the most value from our massive data resources. We are partnering to incorporate analytics into every aspect of the enterprise. Developing ourselves and others is key to our success. Job Description We have 2 opportunities in the Prescriptive Analytics space. One Sr. Data Scientist and one Manager. The roles are very similar in that they are hands-on technical innovators, but the manager has the additional job of focusing our workstreams and guiding two senior individual contributors  In either Prescriptive Analytics role, you will be responsible for researching, developing, and improving algorithms that help computers make recommendations based on predictive models under given constraints while optimizing key performance indicators. Our goal is to increase efficiency and reduce costs by application of models in the context of balancing business objectives in a comprehensive fashion. Building predictive models from large sets of structured and unstructured data remains a crucial first step. By moving the predictive models into an optimization context, you will help Allstate to improve the speed and ease with which we underwrite a policy, estimate a claim, or service a customer. Key ResponsibilitiesConducts state-of-the-art research in modeling on structured and unstructured data and the use of these models within an optimization contextLeverages research and applies state-of-the-art deep learning and optimization techniques to inform recommendations and decisions.Works across the enterprise to identify and incubate business use cases.Advises data scientists and business partners on applying prescriptive analytics in their work.Regularly educates and trains data scientists and business partners on the state of the art.  Job QualificationsExperience developing deep learning, machine learning, or artificial intelligence algorithms/models is required. Strong experience in optimization is required; especially helpful is a background in general nonlinear optimization over continuous and at least piecewise differentiable functionsA graduate degree in a field such as math, computer science, statistics, engineering or machine learning, or equivalent experience.Experience managing teams is required for the manager role.Experience with general machine learning tools to build models and analyze data. (e.g. in R, Python, Matlab) and deep learning tools (e.g. TensorFlow, Keras) and some optimization solvers is required.Proven skills in coding. Software development experience a plus.Knowledge of the theory and practice of optimization and deep-learning techniques.Ability to craft new concepts and stay current with academic research.Ability to summarize research and analysis for audiences with varying levels of expertise Verified analytic agility and team leadershipThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen. Good Work. Good Life. Good Hands®. As a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.  Learn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video. Allstate generally does not sponsor individuals for employment-based visas for thisposition. Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.  For jobs in San Francisco, please click \"here\" for information regarding the San Francisco Fair Chance Ordinance.  For jobs in Los Angeles, please click \"here\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.  It is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era."}