{"jobID": "2831871902", "jobLocation": "Chicago_IL", "jobTitle": "Junior Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Abbott Park, IL", "Size": "10000+ employees", "Founded": " 1888", "Type": " Company - Public (ABT) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve. JOB DESCRIPTION:Entry level role in the newly formed Big Data Advanced Analytics group of the organizationThis role is responsible for development of data platforms, business solutions, and proof of concept to assist the big data team in realizing its goalsDemonstrate high degree of analytic agility to meet fluid and dynamic business needsUse data engineering techniques to design and build solutions/ products for analyzing large data sets and identify patterns and relationshipsCreate, deploy and optimize large scale dataAssist in rapid development of new data and analytics prototypesExplore data sources to better understand the availability and quality of data.Document available data sources and how they are being transformed.Embrace an environment that supports innovation and process improvementManage data sources, organize data and create data assets using identified open source or proprietary toolsWork closely with SMEs, functional experts in Commercial, R&D;, finance, etc. for building data pipeline from structure and unstructured data sourcesWork on newest tools and technologies to achieve results - Scala, Scalding, Spark, HadoopPart of the centralized team responsible for building and managing advanced analytics products/ solutions in AbbottWorks under direction of managers, manages activities according to milestones and completes tasks assigned by more experienced analysts and managers Bachelor's degree in any of the following Math, Physics, Computer Science, Statistics, Economics, Quantitative Sciences 0-2 years of experienceStrong problem-solving skillsAbility and desire to learn new languages and technologiesAttention to detail and organization/ documentation skillsAbility to prioritize and triage deadline-driven tasks in a high-pressure environmentExperience manipulating and analyzing complex, high-volume data from varying sourcesAbility to communicate complex quantitative analysis in a clear, precise, actionable mannerExperience in AWS, Python, R, Spark, hive, HBase, Hadoop, Kafka, YARN etc. will be a plus JOB FAMILY:IT Services&Solutions; Delivery  DIVISION:ADD Diagnostics  LOCATION:United States>Chicago : WeWork National Building 125 S. Clark Street ADDITIONAL LOCATIONS: WORK SHIFT:Standard  TRAVEL:No  MEDICAL SURVEILLANCE:No  SIGNIFICANT WORK ACTIVITIES:Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)  Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.  EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf  EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}