{"jobID": "2836845747", "jobLocation": "Fairfax_VA", "jobTitle": "Data Analyst Specialist", "companyRating": "4.2", "companyInfo": {"Website": "www.ccpace.com", "Headquarters": "Fairfax, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Posted Date: 7/3/2018 Job Category: Analyst - Data Position Title: Data Analyst SpecialistSalary Range: Location: Washington-Arlington-Alexandria, Virginia, USADesired Skills: Description: • Must be authorized to work in the US. Employer is not providing work sponsorship currently  SCOPE OF WORK/TASKS  • Create business requirement documentsCreate UAT test cases and any related artifactsDocument test results and training materialsCoordinate deployments by creating pre- and post-deployment tasksWork with developers to ensure defect fixes and issue resolutionTrack project status and report to senior managementDevelop and troubleshoot sql queries; support creation of DDL scriptsDevelop solutions using tools like Dataflux, Python, and shell scripts.  Preferred Skills  • Strong data and financial analytical skillsKnowledge of fixed income products, especially mortgagesExperience with databases (Sybase, DB2, SQL Server, Oracle)Previous experience supporting multiple concurrent efforts/projects in various capacitiesApplication development and support experienceExperience with tools like Dataflux, Python, and Schell scripting.Excellent interpersonal, team, verbal, written and listening skills  An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against based on disability. EEO IS THE LAW CCPace invites any applicant and/or employee to review the Company’s written Affirmative Action Plan. This plan is available for inspection upon request. If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact us . "}