{"jobID": "2734423475", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst- Unity Connect", "companyRating": null, "companyInfo": {"Website": "www.unity.pl", "Headquarters": "Wroclaw, Poland", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data Analyst- Unity Connect San Francisco, Full-time  Unity Connect is Unity's go to community hub dedicated to the full spectrum of Unity creators. As our company grows to be used to power 50% of the world's 3d, real-time content, so to will our community. Data quality is vital to ensuring that we're growing and iterating in the right direction.  We're looking for an ambitious, self-motivated, and stellar analytical mind to join our team. In this role you will work closely with the team's Product Managers and engineering team to deliver world-class analytics to drive us forward. You'll be laying down process along the way for future analysts as well other teams at Unity. ResponsibilitiesYou will work closely with the product team to identify the most important KPIs and track themYou will work closely with a central data engineering team as well as our team's engineers to log all critical analytic events throughout Unity ConnectYou will maintain the data's integrity, create intermediate tables and views, and maintain the team's dashboardsYou will work with the product team to maintain a weekly reporting cadence of new features, programs and campaignsYou will mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.You will assess the effectiveness and accuracy of new data sources and data gathering techniques.You will use predictive modeling to increase and optimize customer experiences, revenue generation, other business outcomes.Requirements5+ years of analytical work at a mobile or web companyBA/BS in Computer Science, Math, Physics, Engineering, Statistics or other technical field. Advanced degrees preferred.Required fluency in SQLExperience creating & logging custom analytic eventsExperience building and maintaining intermediary tables that were either core to your service or to your company as a wholeExperience building and maintaining dashboardsPreferred experience with dashboarding tools such as Tableau or PeriscopePreferred experience with cross-service analytical workPreferred experience with statistical packages such as R, MATLAB, SPSS, SAS, Stata, etc.Preferred experience with a distributed data storage workflow (Hive/Hadoop)Ability to communicate the results of analysis succinctly Who We Are // About Unity  Unity is the creator of the world's most widely-used real-time 3D (RT3D) development platform, providing content creators around the world with the tools they need to build rich, interactive 2D, 3D, VR and AR experiences. In fact, apps made with Unity reach 2.7 billion devices worldwide, and were installed more than 24 billion times in the last 12 months.  The global engineering team keeps Unity at the forefront of technology and working alongside partners like Magic Leap, Google, Facebook, Oculus and Microsoft ensures optimized support for the latest technology and platforms. Unity is powering the real-time revolution, expanding beyond games and breaking into other industries including automotive, film, architecture, engineering, construction and more.  Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity. #LI-IS1 Job details  Location  San Francisco  Department  Marketing & Communications  Job type  Full-time  Apply now!  Other positions in Marketing & Communications  NoSDL2017"}