{"jobID": "2616059511", "jobLocation": "Dallas_TX", "jobTitle": "Population Science Data Analyst II - Behavorial and Communication Sciences", "companyRating": "3.8", "companyInfo": {"Website": "jobs.utsouthwestern.edu", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1943", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Baylor Scott & White Health, HCA Healthcare, Parkland Health & Hospital System"}, "estimatedSalary": "62000", "jobDescription": "SecurityThis position is security-sensitive and subject to Texas Education Code 51.215, which authorizes UT Southwestern to obtain criminal history record information SalarySalary Negotiable Experience and EducationMasters degree in related field such as Biostatistics or Computer Science and two (2) years research data analysis experience directly related to the type of database building and maintenance including experience working with and maintaining large complex databases along with database analysis experience, OR;  Bachelor's degree in related field such as Biostatistics or Computer Science and four (4) years research data analysis experience directly related to the type of database building and maintenance including experience working with maintaining large complex databases along with database analysis experience. Job DutiesExtract and transform raw data from multiple projects into usable forms that can be subsequently loaded in the database.Write more complex code for database access, modification and construction.Prepare detailed reports for publications.Work with Project Analysts and Project Coordinators to provide complex data analysis and ensure the highest quality data and utilities are produced and project needs are met in a timely manner.Prepare and maintain form and procedure manuals to affect implementation and continuing operation of computer application systems.Assist in training of Data Analysts and Project Assistants.Performs other duties as assigned. UTSouthwestern Medical Center is committed to an educational and working environment that provides equal opportunity to all members of the University community. In accordance with federal and state law, the University prohibits unlawful discrimination, including harassment, on the basis of: race; color; religion; national origin; gender, including sexual harassment; age; disability; citizenship; and veteran status. In addition, it is UTSouthwestern policy to prohibit discrimination on the basis of sexual orientation, gender identity, or gender expression."}