{"jobID": "2802118316", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Governance - Senior Business Analyst with Solugenix Cor", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with Solugenix Corporation  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job DescriptionGREAT OPPORTUNITY TO WORK AS DATA GOVERNANCE - SENIOR BUSINESS ANALYST Solugenix Corporation  Solugenix is a professional staffing and IT consulting firm, committed to meeting the needs of its candidates and clients. When you join Solugenix, you join the longest serving independent IT consulting firm in the nation, distinguished by a history of industry innovation. Long before they were commonplace, our pioneering systems became the DNA of today’s technologies. From firsts in cell phone billing systems, to web-based mapping and routing solutions, to fast food help desks, Solugenix drives IT solutions around the world. CHOOSE INNOVATION. CHOOSE VALUE. CHOOSE SOLUGENIX! Job Title: Data Governance - Senior Business Analyst  Location: Los Angeles, CA  Contract to Hire Position Job Description We are looking for a Senior Business Analyst with Heavy experience in Financial industry, extensive knowledge on Mortgage operations and capital market operations to support a brand New data org is being established at a large LA based financial institution that's a direct, long term client of ours.  Basic Qualifications  · Extensive Knowledge on Mortgage operations and Captial Market operations is a must  · Minimum 5 years of consultancy and facilitation skills  · Support establishment of an enterprise-wide Data Governance operating framework, with a focus on improvement of data quality through modifications to organization behavior, controls, policies and standards, principles, governance metrics, processes, and tools. Responsibilities · Serve as a liaison between Business and Functional areas and technology to ensure that data-related business requirements are clearly defined, communicated and well understood and considered as part of operational prioritization and planning.  · Define performance indicators and quality metrics to ensure compliance with data related policies, standards, roles and responsibilities, and adoption requirements.  · Provide analysis support for business users and other stakeholders involved in the creation of business requirements  · Create functional / data requirements documentation; conduct walk thru’s with internal and external stakeholders  · Establish data quality rules and data controls in line with the business requirements and overall control model.  · Analysis of the current state flows into and within Compliance  · Serve a subject matter expert on Captial market operations and Mortgage operations for the Data Management Office  · Provide inputs to develop test strategy and functional test cases (partner with QA team)  · Support functional testing, UAT and production implementation  Skills and Knowledge  · Bachelor’s Degree preferred  · Prefer 5 years of banking or financial industry experience with strong knowledge of Mortgage Operations or Capital Market Operations  · Experience working and effectively collaborating with reporting, operations and technology teams.  · Familiarity with operational and support environment issues.  · Must be driven, operationally savvy, action-oriented who continually strives for improvement  · Must have excellent written and verbal communication and interpersonal skills  · Strong ability to communicate effectively including problem resolution skills  · Ability to work independently with light to moderate supervision in various areas of responsibility  · Excellent interpersonal skills, verbal/written communication skills and strong project management skills.  · Experience consulting with senior management  · SQL Scripting would be a plus  · Thorough knowledge of personal computers and various software packages, including Excel and Word.Company DescriptionSolugenix, the longest serving independent IT consulting firm in the nation, delivers comprehensive, managed-services IT solutions known for their innovation, value and dependability. Our custom IT services, including Application Lifecyle Management Services, Business Applications Support, Custom Inbound/Outbound Call Centers, IT Service Desk Operations and Support and Professional Staffing solutions are tailored to unique industry requirements and delivered with predictable, manageable costs to optimize mission-critical transactions, drive business value and support customer success.  Apply"}