{"jobID": "2747008639", "jobLocation": "Washington_DC", "jobTitle": "Foreign Language Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.crctoday.com", "Headquarters": "Baltimore, MD", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB SUMMARY: CRC has an immediate opening for a Foreign Language Data Analyst within the Air Force Foreign Language Office in Washington, DC. DESCRIPTION: The candidate shall manage, cleanse, and visualize complex data sets and analyze trends in LREC data over time using Microsoft Excel and Statistical Analysis Software (SAS) to support decision making process for senior leaders. PRIMARY RESPONSIBILITIES:Support liaison activities with Defense Intelligence Components and ODNI subject matter experts in order to answer AF, DoD, IC and Congressional data calls concerning foreign language.Assist in compiling guidelines, common terms of reference, and Excel spreadsheet templates for ISR/FLO use in answering various foreign language-related data calls.Produce supporting Microsoft excel spreadsheets, pivot tables, Access database templates/reports, PowerPoint presentations, data reports and supporting narrative reports to communicate information clearly to senior leaders and decision-makers.Support liaison activities with members of the AF, DoD and IC foreign language community to refine measures of program effectiveness for foreign language support to Defense Intelligence mission requirements.Support ISR/FLO staff in documenting program effectiveness, comparison of programs against performance targets, and make recommendations to ISR/SLA for improvement.Support ISR/FLO staff in collecting, reviewing, and processing foreign language informationDraft memorandums, document and build data management visualization productsMINIMUM REQUIREMENTSActive TS/SCI clearanceBachelor's Degree in Engineering, Computer Science, Data Science or related field, Master's preferredAt least 8 years of experience managing, cleansing and visualizing complex data setsCOMPANY DESCRIPTION: Clear Resolution Consulting, LLC provides Intelligence Analysis, Business Management, Cyber Operations, Special Operations and Information Technology Consulting Services to the Department of Defense (DoD), Intelligence Community (IC) and other Federal Agencies.  This is a full-time position with employee and family medical, dental, and vision plans, life and AD&D; insurance, generous holidays and personal leave, 401(K) with company matching, short-term/long-term disability insurance, and tuition assistance.Clear Resolution Consulting, LLC is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, any other non-merit factor, or any other characteristic protected by law."}