{"jobID": "2759295864", "jobLocation": "Woodland_Hills_CA", "jobTitle": "Sr. Systems & Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.aig.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1919", "Type": " Company - Public (AIG) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "139000", "jobDescription": " Functional Area:IT - Information TechnologyEstimated Travel Percentage (%): No TravelRelocation Provided: NoAmerican General Life Insurance CompanyBachelors in finance, business administration, computer science, or data science  6-10 years of business intelligence and analysis experience in SQL and data analysis  Familiar with data visualization tools like Power BI, Cognos  Proficient with Microsoft BI stack: SSAS, SSRS, SSIS. Demonstrated ability with data mining using SQL, ETL  Strong analytical and problem-solving skills, with hands-on experience applying it to company wide data  Ability to collaborate with a variety of teams across the world  Strong problem-solving skill, a team working spirit, and an open mind to take extra steps to make projects successful Analyst should be able to complete moderately complex tasks on large or multiple projects with minimal direction.Responsible for analyzing and turning data into insight that informs, identifies trends, answers questions and provides recommendations to IT and BusinessGenerates reports/queries, including writing maintaining and supporting a variety of reports or queries utilizing appropriate reporting tools.Helps maintain data integrity in systems by running queries and analyzing data.Interprets results using a variety of techniques from simple data aggregation to complex statistical analysis.Facilitates brainstorming and data analysis sessions with key stakeholders designed to address insights found in their data.Reviews reports for quality and accuracy including working with technical staff on data validation activities.The position is responsible for implementing and supporting financial, technical and administrative systems and participates actively in development work groups, performing project management functions and mentoring team members.Perform workflow, process and root cause analysis, documentation and make recommendations on solutions.Provide technical expertise and guidance to team members and mentor staff to promote staff development.Participate in high level project meetings in the absence of the Lead Systems Analyst.Provide system support including testing, trouble shooting, and Production Implementation. It has been and will continue to be the policy of American International Group, Inc., its subsidiaries and affiliates to be an Equal Opportunity Employer. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories.  At AIG, we believe that diversity and inclusion are critical to our future and our mission – creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectives.We consider qualified applicants with criminal histories, consistent with applicable law."}