{"jobID": "2690454216", "jobLocation": "Mountain_View_CA", "jobTitle": "AI Research Scientist - Machine Learning", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "150000", "jobDescription": "AI Research Scientist Machine LearningLocation: Mountain View, CA General Description: The AI research team at Samsung Research America (SRA), located in Mountain View, CA, is looking for an outstanding and highly self-motivated research scientist. We are looking for candidates with expertise in deep learning, computer vision, robotics and language understanding.  You will work with a team of research scientists and engineers tackling real-world problems involving Samsungs Artificial Intelligence initiatives. You can also have the opportunity to publish at top-tier conferences in deep learning, computer vision, robotics, and language understanding. As a research scientist, you will be involved in very promising team projects with talented people at Samsung. You will benefit a lot by working in a fun and creative environment. The AI research center is a key part of Samsungs global R&D; effort and aims to have influence on future Samsung products reaching hundreds of millions of users worldwide. Position Summary: Samsung Research AI is looking for world class scientists to join its AI Lab. At the AI Lab you will invent, implement, and deploy state of the art machine learning algorithms and systems. You will build prototypes and explore new solutions. Responsibilities Include:Conduct advanced research for machine learning, machine perception, data mining, , and natural language understandingCollaborate with other colleagues to apply research results to prototypes and real-world applications of text mining and question answering and improve the performance with various technologiesIntegrate the resulting system/software into existing platform with high quality implementationSummarize research findings in high-quality paper and/or patent submissionsExperience Requirements:PhD in Computer Science or related discipline or Masters degree with 2+ Years experience.Technically deep in the principles of building large-scale machine learning systems.Strong Computer Science fundamentals in data structures, algorithm design and complexity analysis.Strong fundamentals in applied statistics and probability.Self-directed, flexible, goal oriented and strong sense of ownership.Strong verbal and written communications skills; experience presenting complex technical information, succinctly, to technical and non-technical audiences.Hands on development experience in C++, Java, and/or Python. Samsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}