{"jobID": "2828843105", "jobLocation": "Jersey_City_NJ", "jobTitle": "Corporate Finance: Data Science&Artificial; Intelligence Solutions PMO - Vice President", "companyRating": null, "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Apply Now  Corporate Finance: Data Science&Artificial; Intelligence Solutions PMO - Vice President  Req #: 180064698  Location: Jersey City, NJ,US  Job Category: Accounting/Finance/Audit/Risk Job Description: JPMorgan Chase&Co.; (NYSE: JPM) is a leading global financial services firm with assets of $2.4 trillion and operations worldwide. The firm is a leader in investment banking, financial services for consumers and small business, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase&Co.; serves millions of consumers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase&Co.; is available at www.jpmorganchase.com.  From managing the firm's capital and reporting quarterlyearnings to responding to and complying with regulatory requirements, more than15,000 colleagues around the world work together every day to manage the firm'sGlobal Finance function. Our job is to ensure the company is capable ofnavigating all types of market environments while maintaining a fortressbalance sheet. The Finance function is a dynamic organization that plays acritical role, particularly as increasing regulatory and capital requirementschange the way we do business. Planning&Analysis; (P&A;), in additionto CFO teams, Controllers, Business Managers and Project management, make upthe majority of the Global Finance team.  The Robotics&Dashboards; Center of Excellence (CoE) isleading initiatives across GF&BM; focused on automating manual processesusing robotics and enhanced automation techniques such as AI and MachineLearning and creating dynamic and flexible visual dashboards using Tableau. Sittingin the center, this CoE interfaces with internal clients (LOB P&A;, CFO andController Groups) to source ideas around robotics, enhanced automation anddashboard opportunities, run functional and technical feasibility analyses,translate the ideas into use cases and partner with Technology to delivertangible solutions against those use cases. Key Responsibilities:Partnerwith data scientists and artificial intelligence (AI) engineers and deliver ona portfolio of projectsProactivelymanage progress, delivery and overall execution of multiple projects atdifferent stages of development; report on status, risks / issues, andrecommend corrective actions to ensure successful completionMeasureproject performance using appropriate systems, tools and techniques such asproject plans and trackers.Createexecutive level readouts and status reporting for key client counterparts.UseAgile techniques to drive delivery efficiency with the engineering teams.Useappropriate verification techniques to manage changes in project scope,schedule and costsReportand escalate to management as needed.Reviewproject pipeline and schedules with senior management and team membersProvidethought leadership on implementation strategy and change managementDeterminethe scope of any new efforts, directing the strategic thinking, and developingan approach and structure required to achieve key deliverables withininitiativesFacilitatingworking group meetings with key stakeholdersMust be a highlyenergetic self-starter with a relentless focus on execution and exhibit theability to:Partner on end-to-end projects includingproject management, execution and evaluationPrioritize alternative solutions, driveresults and influence senior leaders in a cross functional, diverse environmentWork independently, and know when to ask forguidanceMaintain a positive attitude and act as team player while delivering on high priority, time sensitive initiatives5+ years of Project Management experience with at least 1 year managing technical projects.Experiencewith digital project execution and management.Bachelor's degree with a focus on Finance and/or Technology a plus.Good mix of technical and client engagement skills. Consulting background a plus.Excellent communication skills.Excellent understanding of project management techniques. PMP certification a Plus.Experience with Agile (Scrum/Kanban) methodologies.Ability to manage multiple stakeholders (senior executives to process SMEs) and partner with technical teams outside the COE.Solution oriented and a roll up your sleeves 'get it done' attitude.Comfortable wearing multiple hats and working in a dynamic, startup like environment."}