{"jobID": "2802114126", "jobLocation": "Houston_TX", "jobTitle": "Environmental Compliance Engineer/Scientist with ESE Partner", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Houston Interviews but with ESE Partners  Houston Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Title: Project Environmental Compliance Engineer/Scientist I  Reports To: Compliance Business Unit Leader  Position Responsibility: Assist ESE’s team with delivery of environmental compliance services to the marketplace in an organized and disciplined manner, striving to continuously improve in the areas of air, water and waste. The candidate may be responsible for preparing PBRs, NSR amendments, Title V permits, AVO Inspections, SPCC plans, SWPPPS, MS4 services, waste minimization plans, and other compliance related services. Positions Duties: · Deliver the professional consulting services offered by ESE Partners using ESE delivery systems and methodologies.  · Assist with the preparation and submission of state and federal air, water and waste permits to the state and federal agencies.  · Operate as one of the firm’s technical associates with respect to the disciplines related to Environmental Science and Engineering.  · Conduct Field Investigations – Visual Inspections and physical sampling.  · Author technical reports in accordance with the ASTM, TCEQ and RRC Guidelines.  · Perform Calculations related to Air, Water and Waste permitting and modeling.  · Manage and interpret laboratory analytical data.  · Manage and approve subcontractor accounts.  · Develop Site Maps and other pertinent drawings using Auto Cad and Arc GIS.  · Develop and maintain professional relationships with existing clients and vendors.  · Maintain a 90% Utilization OPPORTUNITES: Our goal is to be recognized as the best environmental firms to work for in Texas. We are making major strides in that direction with an ever-increasing amount of flexibility, benefits, rewards, and opportunity for professional growth.  Base Salary: Based on Experience and Licensing  Benefits: Health Insurance  Dental and Vision  401 K with employer matching up to 4% of gross.  8 Statutory Holidays  120 Hours PTO  Flex Work Schedule (9-hour work days Monday thru Thursday with 1/2 days on Friday)  Education: Minimum of a B.S. in Engineering or Environmental Science (M.S. is preferred).  Licenses: P.E. Preferred  Applicable Certifications: 40 Hour HAZWOPER, EIT, PE  Experience: 3+ Years in Environmental Compliance Consulting  Note: This is not an offer of employment. This document is intended to clarify the needs and opportunities presented by ESE. The offer if presented, will be under separate cover.  ESE is an Equal Opportunity Employer.Company DescriptionESE Partners is a full service environmental engineering consultancy offering environmental support to clients needing assessment, remediation, brownfields redevelopment, compliance, air permitting and natural resource related services. Headquartered in Houston, Texas, with branches in Austin and San Antonio, ESE provides environmental engineering services to both the private and public sectors.  Apply"}