{"jobID": "2291042789", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.instacart.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": " Instacart is building the best way for people anywhere in the world to shop for groceries. Since Instacart started in 2012, weve launched same-day delivery in 200 US markets. We are laser focused on delivering groceries from your favorite stores right to your door. We now cover over 60% of US households and aim to have 80% coverage by the end 2018that's 90 million households! From a technology point of view, the platform is complex, rapidly scaling and processing millions of transactions in real-time all of the time. Our technology coupled with operational expertise enables Instacart to deliver fresh groceries in as little as an hour. This is a difficult problem to master and we are making it happen. Every day, we solve incredibly hard problems to create an experience for our customers that is absolutely magical.  The Data & Analytics team at Instacart is new and you will have the opportunity to shape its direction and create large impact. Responsibilities The ideal candidate is able to build and maintain robust, scalable and sustainable data pipelines. Furthermore, they are well-versed in the best practices of data processing, but is flexible enough to think outside the box whenever necessary. The Senior Data Engineer should be no stranger to high-scale systems with complex data models and large amounts data coming from various sources. Our successful partnerships with our 100+ Retailer and Consumer Packaged Goods partners are heavily dependent on deep data integration and our ability to provide enterprise level analytical solutions.Work closely with business stakeholders and other engineering teams to gather technical requirementsProvide senior-level contribution to a team responsible for the design, implementation, deployment and maintenance of complex data pipelines.Work on integration between various internal and external systems.Contribute the continual improvement of the Instacart data platform via your observations and knowledge gained from your involvement and KPI'sWork in a collaborative environment -- meetings, iterative development and design and code review sessionsRequirementsExpert level proficiency in SQL. Ability to perform complex data analysis with large volumes of data. Attention to details.Working experience with variety of data storage technology, including columnar databases and Hadoop ecosystemExperience in data warehousing including dimensional modeling conceptsProficiency in at least one of the scripting languages: Perl, Python or othersExperience with Big Data technologies, e.g., Hadoop, SparkHands-on experience building real-time or near real-time data pipelines is a big plusBachelors degree in Computer Science, Engineering, Math or other quantitative fieldBenefitsTalented and collaborative coworkers who will both push and support youMarket competitive salary, equityMedical, dental, vision benefits and 401(k) retirement planTake what you need vacation (and we really mean it)16 weeks maternity leave / 8 weeks paternity leave so you can truly bond with your childComplimentary Instacart express membershipResourcesTech BlogLife at InstacartTeam Stories#LI-PRI"}