{"jobID": "2819135783", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.harrisassoc.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " The Security Data Management (SDM) group is responsible for the management of data and systems related to enterprise security reference data and security life cycle events such as pricing, corporate actions, and proxy voting.  You will be responsible for administering corporate actions and proxy voting events and ensuring the accuracy and consistency of security reference and pricing data for the firm. This includes information stored in systems and data repositories, as well as information sourced both internally and externally. You will work closely with business partners throughout the firm to help define, manage, and access security data and to resolve issues as they arise. Additionally, you will assist the Data Governance Manager with key data governance initiatives, including participation in testing new systems and system enhancements to ensure that data integrity is preserved. Duties&Responsibilities;:Establish, monitor, and proactively manage the firm's security master dataMonitor and administer corporate actions and proxy voting eventsFirm subject matter expert on corporate actions and proxy voting including a thorough understanding of the firm's proxy voting guidelines, and security reference and market data.Assist on developing the firm's MDM (Master Data Management) program, including exception management and vendor discrepancy researchProvide leadership and support for departmental and firm-wide projects as neededAssist with the development and implementation of procedures and training materials for the teamStay abreast of data governance and data management best practices and continually recommend and implement process improvementsAssist Data Governance Manager with initiatives related to data governance and the maturation of the data governance organizationKey contributor and team member in firm-wide data initiativesQualifications:Bachelor's degreeMinimum four years of investment management experience, preferably with two or more years in data managementHealthy curiosity about the industry and trends in data managementSound understanding of security characteristics (equity and fixed income)Self-starter with the ability to assess, explain and solve complex problemsExcellent communication and organizational skillsDetail oriented and thoroughThe ability to work effectively both independently and in a team environmentExcellent time management skillsExperience in corporate action processing and proxy voting administration is preferredExperience with querying database using SQL is preferredExperience with security reference data management systems (i.e. Eagle SRM) is preferred"}