{"jobID": "2645568140", "jobLocation": "Santa_Clara_CA", "jobTitle": "Product Management Director - Data Science", "companyRating": "3.9", "companyInfo": {"Website": "www.hortonworks.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Public (HDP) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Cloudera, MapR Data Technologies, Pivotal"}, "estimatedSalary": "175000", "jobDescription": " We are looking for a Product Manager specialized in the data science space to join our Product Management team. You will help customers conceptualize, design and implement their data science projects using Apache Hadoop (and specifically Spark). This role requires experience with machine learning and statistical analysis, good programming and scripting capabilities, and great communication skills. You will be working with local and distributed team members. Responsibilities:Work with our customers to understand and evaluate data science use-cases appropriate for their business along with the ecosystem of products and tools that are involved in satisfying their needs.Collaborate with customer teams to help formulate problems, guide solution development, and compare/contrast data architectures.Create prototypes in R, Python, Java, Scala or similar to demonstrate the results of various algorithmic approaches, evaluate their performance, and articulate challenges in tooling, debugging, and usage of existing components.Own the product roadmap as it relates to data science, lead the product feature planning process and work closely with engineering to ensure successful delivery.Define, track and interpret key business metrics to track overall product success.Understand the market and competition, and develop product and competitive positioning.Work collaboratively with and engage engineering leaders both within Hortonworks and within the open source community.Support field enablement and other go-to-market activities.Required expertise:BS or MS in Computer Science, statistics, applied math or equivalent.Proficiency in R, Matlab, Python Scikit-learn or other statistical modeling package / environment, with a focus on machine learning; experience with NLP a plus.Experience developing production systems for processing large volumes of structured and unstructured data in Java, Python or similar technology stack.Experience working with Agile development process with frequent release cycles.Good knowledge of Hadoop technology stack (MapReduce, Hive, Pig, Mahout, Spark, etc.).In depth understanding of Spark, Livy, Zeppelin, Jupyter, and related technologies.Excellent verbal and written communication skills. Strong team player, capable of working collaboratively within and across internal and customer teams. If you have enjoyed solving challenging data science problems and are ready to leverage that experience and explore a role in product management, please submit your resume today! All employees are required to adhere to all Hortonworks employment policies, including without limitation information security policies.ABOUT HORTONWORKS (NASDAQ HDP) Having gone public with its IPO in December 2014, Hortonworks is experiencing extraordinary growth as we deliver essential support to the burgeoning big data and IoT communities. Hortonworks is an industry leading innovator that creates, distributes and supports enterprise-ready open data platforms and modern data applications that deliver actionable intelligence from all data: data-in-motion and data-at-rest. Hortonworks is focused on driving innovation in open source communities such as Apache Hadoop, Apache NiFi and Apache Spark. Along with our 2,100+ partners, Hortonworks provides the expertise, training and services that allow customers to unlock transformational value for their organizations across any line of business.  For more information, visit www.hortonworks.com.  Hortonworks, Powering the Future of Data, HDP and HDF are registered trademarks or trademarks of Hortonworks, Inc. and it's subsidiaries in the United States and other jurisdictions.EOE/M/F/Vet/Disability. Hortonworks is an Equal Opportunity Employer in accordance with VEVRAA and Section 503 regulations. http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf"}