{"jobID": "2779832122", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.childrensnational.org", "Headquarters": "Washington, DC", "Size": "5001 to 10000 employees", "Founded": " 1870", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Children's Hospital of Philadelphia, MedStar Health, Shriners Hospitals For Children"}, "estimatedSalary": "72000", "jobDescription": " The Data Analyst will be responsible to maintain the physician database, develop reports, monitor, analyze, and recommend improvements based on feedback and the analysis of reports from the physican admission, etc. H/She will be responsible to monitor metrics of success and develop a scorecard for distribution. The data Analyst may implement solution design decisions, improvements and tailor the designated application to meet the requirements of the end-user. Help in the development of policies and procedures as appropriate. Identify and escalate issues as appropriate. Assist in end-user training and troubleshooting. May be assigned further projects. Minimum EducationB.S.Specific Requirements and Preferences Bachelor's degree in information technology or in other allied health profession. Minimum Work Experience 5 Year(s) Required Skills/Knowledge Excellent customer service skills. Demonstrate strategic thinking, ability to multi-task, organizational skills, and effective communiation. Required Licenses and CertificationsFunctional AccountabilitiesApplication Deisgn & ImplementationBuild and test application database.Assist in the development of policies and procedures for specific departmental/functional responsibilities; develop procedures for troubleshooting.Develop reporting databases.Assist in end-user training.Assist in the development of on-going maintenance requirements.Assist in the planning of subsequent enhancements/phases to ensure maximization of solutions.Communication ToolsProvide assistance, training and troubleshoot, as necessary.Montiitor metrics, recommend areas for improvement; responsible for monthly status/metric reports.Respond to community physician inquiries within 24 hours.Ensure on-going communication with end users, both internal and external.Physician DatabaseMaintain the commmunity physician database; register community physicians into the portal.Ensure the information is migrating as designed to the various applications.Update, add, delete as necessary.Organizational Accountabilities (Staff)Organizational Commitment/IdentificationPartner in the mission and upholds the core principles of the organizationCommitted to diversity and recognizes value of cultural ethnic differencesDemonstrate personal and professional integrityMaintain confidentiality at all timesCustomer ServiceAnticipate and responds to customer needs; follows up until needs are metTeamwork/CommunicationDemonstrate collaborative and respectful behaviorPartner with all team members to achieve goalsReceptive to others’ ideas and opinionsPerformance Improvement/Problem-solvingContribute to a positive work environmentDemonstrate flexibility and willingness to changeIdentify opportunities to improve clinical and administrative processesMake appropriate decisions, using sound judgmentCost Management/Financial ResponsibilityUse resources efficientlySearch for less costly ways of doing thingsSafetySpeak up when team members appear to exhibit unsafe behavior or performanceContinuously validate and verify information needed for decision making or documentationStop in the face of uncertainty and takes time to resolve the situationDemonstrate accurate, clear and timely verbal and written communicationActively promote safety for patients, families, visitors and co-workersAttend carefully to important details - practicing Stop, Think, Act and Review in order to self-check behavior and performance"}