{"jobID": "2822504219", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data/Research Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.vistadelmar.org", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 1908", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Under the direction of the Provost, the Director of Institutional Research– Reiss-Davis Graduate Center (RDGC) plans, develops, conducts, and coordinates institutional research activities for use in accreditation, program review, assessment, reporting, and planning. The Director supports educational effectiveness and accreditation activities by contributing to an institutional culture of evidence-based decision making and improvement. The Director collaborates by providing data and analytics that contribute to the alignment of strategic planning, budgeting, program review, as well as assessment to support the achievement of institutional goals, and contributes the WSCUC accreditation process. JOB DESCRIPTION: The responsibilities include:  Models RDGC’s mission and values;  Provides leadership for academic processes that align evaluative systems and strategic planning for educational and institutional effectiveness with best practices of higher education;  Provides assistance with the accreditation experience of the WSCUC’s upcoming Seeking Accreditation Visit 2 and future efforts;  Collects, interprets, analyzes, and reports data for records and reports to increase the systematic process for data-informed decision making;  Plans, organizes, coordinates, creates, administers, analyzes, and prepares reports for RDGC surveys;  Collaborates to assess and evaluate existing assessment and program review cycles to contribute to educational effectiveness;  Responds and coordinates responses to questionnaires and surveys received from agencies, and serves as the primary person to complete external reporting requirements for WSCUC, IPEDS, and other agencies;  Evaluates evidence that contributes to making institutional decisions, plans, recommendations, and revisions through Academic Program Review Self-Study. QUALIFICATIONS: To perform this job successfully, the applicant must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required; reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  Experience in institutional research;  Master’s degree ( minimum ) from an accredited college or university;  Proven leadership at an institution of higher education;  Current knowledge of federal and WSCUC higher education policies, issues, regulations and trends, and reporting requirements related to Institutional Research;  Strong interpersonal skills; self-directed, team builder, and able to set clear expectations and establish accountability;  Demonstrated ability to work independently and accurately, manage multiple time-critical projects, effectively prioritize work and meet deadlines with attention to detail, deadlines, and budget;  Proficient in Microsoft Excel, Word, and PowerPoint for the purposes of data queries, data analyses, and report writing;  Experience using a student information system (Populi);  Professional oral and written communication skills, with an engaging presentation style;  Be able to integrate planning, budgeting, and analytical activities and communicate the value of this alignment to the institution. Higher Education, Data Analyst, Data queries, Data interpretation, Report writing, Surveys, questionnaires, IPEDS, Self-Study, SPSS, Program review, Assessment, Budgeting, Research Analyst, Accreditation Reply Subject: Data/Research Analyst"}