{"jobID": "2819916838", "jobLocation": "Washington_DC", "jobTitle": "Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.powerhrg.com", "Headquarters": "Chester, PA", "Size": "1001 to 5000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Power Home Remodeling is a company founded on equal parts hard work and positivity. We believe that “dream” and “achieve” are not mutually exclusive. That philosophy has served us well in becoming FORTUNE Magazine’s #1 Workplace for Millennials and one of Glassdoor’s Best Places to Work.90% of our executives begin their careers in entry-level positions because we recruit, train, and retain talented individuals with a drive to succeed. Power is more than a home remodeling company. Power is a dream realization, technology-innovation, community-advocacy, expectation-shattering, happiness-maximizing company dedicated to improvement, both for our customers, and ourselves.Sales Representative  A full-time W-2 outside sales position, your role will be to develop relationships with pre-qualified prospective and existing customers. You are not responsible to generate your own leads. Prior to your first interaction with prospective customers, 75% of the legwork has been done for you. We have a very rigorous pre-qualification process that ensures we are putting our sales reps in the best possible position to succeed. Your only focus has to be on your career. We only ask you to learn our primary product lines, stay true to your training and deliver a proven sales presentation to consumers that truly need what you offer. Primary job responsibilities include:  • Delivery of interactive sales presentations on eco-friendly, green products and services to decision makers  • Participation in ongoing sales training and coaching camps on a weekly basis  • Team building and mentorship  • Strategic presentation developmentQualifications: • Highly developed interpersonal, organizational and communication skills  • Ability to speak publicly with confidence and poise  • Strong sense of ambition, self-motivation and self-discipline  • Ability to work both independently and in a team setting  • Naturally outgoing and articulate individual who thrives in social settings  • Previous sales experience preferred  • BA/BS preferred Salary and Benefits:  • $75,000-90,000 average first-year compensation  • State-of-the-art training and technology  • Monthly opportunities for performance-based rewards, such as luxury vacations, high-end electronics, gift cards and tickets to concerts and sporting events  • Full medical, dental, life and disability insurance plans that can be tailored to your specific needs and the needs of your family  • Ample paid vacation and holidays  • A competitive 401(k) retirement savings program, matched by Power  • Access to the latest technology, such as laptops, smart phones and tablets that will help you reach your earnings goals faster and more efficiently  • A dynamic social program filled with can’t miss events, parties, and activities, including an annual bonus in the form of a company trip to a tropical destination for you and a significant other  • Opportunity at unprecedented professional and personal growth"}