{"jobID": "2768159505", "jobLocation": "Austin_TX", "jobTitle": "Research Scientist, Discovery", "companyRating": null, "companyInfo": {"Website": "www.moleculartemplates.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Description: Molecular Templates (MTEM) is a clinical stage biopharmaceutical company targeting a variety of cancers through development of its innovative proprietary Engineered Toxin Body (ETB) platform. MTEM's first immunotoxin, MT-3724, is in clinical development for non-Hodgkin's lymphoma. Pipeline products for additional oncology targets are being advanced toward clinical development. For more information, please visit MTEM's website at www.mtem.com. Position Overview: Molecular Templates is seeking an accomplished and highly-motivated scientist to contribute to discovery projects for Research and Development (R&D;). This position will be primarily lab-based and focused on optimizing techniques to improve the expression of recombinant proteins and executing molecular techniques to discover innovative improvements to the ETB platform. In addition, this Scientist will contribute to the strategic design and forward progress of in vitro/in vivo model development for evaluation and characterization of novel ETB designs. This requires expertise in cell biology, excellent molecular biology skills and ability to manage competing priorities and projects, provide thought-leadership and deliver results. Job Responsibilities will include:Plan and execute cell-based assays in order to characterize and validate novel targets, including but not limited to: engineering cell lines, primary cell culture, microscopy and live cell imaging, in-vitro enzymatic assays, high-throughput drug screening, innate and adaptive immunological assays, and other cellular techniques, such as evaluating routing mechanisms and receptor turnoverConduct antibody-based biologics and bispecific molecule design and characterization, including but not limited to: targeting domain identification, construct engineering, cellular entry and payload delivery, binding properties, bispecific engagement of two targets present on the same cell, or to enable cell-to-cell bridging, and antibody-drug conjugate technologyPerform and optimize molecular biology techniques, such as Western blot, ELISA assays, PCR and cloningAnalyze data, summarize conclusions and plans for further action, and present results, to team members and management in a clear and timely mannerMaintain knowledge of scientific trends and industry processes through readings, conferences and seminars in order to contribute to strategic development of novel ETB platformsDocument all procedures in an accurate and timely mannerConduct general laboratory duties, including washing glassware, ordering supplies, and maintaining inventory (e.g. media prep) and basic laboratory equipmentExecute and manage new projects, as neededQualifications:Master's degree with 2+ years of relevant laboratory experience; or PhD immunology, oncology or related fieldExperience in industry, preferredExpertise in cell and/or molecular biology techniques, column purification techniques (SEC or size-based) or chemical conjugationExperience in one or more of the following: Receptor biology, cell signaling, cancer-specific cell surface marker identification and validation; antibody-based biologics and bispecific molecule design and characterization; Protein structural modeling (in silico and beyond); or Cellular biologyExperience with multi-parameter flow cytometry panel generation and design, requiredExcellent written and verbal communication skillsExcellent computer skills with knowledge of spreadsheet, word processing and statistical analysis softwareExcellent problem-solving and analytical skills applied to investigationsExcellent project management, time management, and multi-tasking skillsProven ability to design research projects independently and provide thought-leadershipAbility to manage competing priorities or projects and meet deadlinesAbility to function independently and exercise good judgement, as well as work closely in cross-functional teams to support multiple pre-clinical stage programsAbility to clearly and efficiently document, communicate and present complex data setsAbility to function in a fast-paced, high-growth and team-based work environmentMust possess willingness and desire to mentor junior scientists and entry-level associatesReporting Structure: This position currently has no supervisory responsibilities. This position reports to Director, Discovery, R&D.; Molecular Templates, Inc. is an Equal Opportunity Employer and offers competitive salaries and benefits.0"}