{"jobID": "2812170017", "jobLocation": "Washington_DC", "jobTitle": "Hotel General Manager", "companyRating": "4.2", "companyInfo": {"Website": "www.kimptonhotels.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Joie de Vivre, Thompson Hotels, Two Roads Hospitality"}, "estimatedSalary": "68000", "jobDescription": " Our mission is to be the best loved Hotel & Restaurant Company so regardless of position, we look for individuals who are passionate about providing genuine heartfelt care to our guest and employees.  What you get to do: To maximize the financial performance of the hotel by providing the highest possible quality of guest service and product, by fostering a positive work environment for all employees, and by developing and implementing an aggressive sales and marketing plan. Your day-to-day:Supervise and develop the performance of all operating departments including, but not limited to: Telephone, Reservations, Front Office, Guest Services, Housekeeping, Security and Maintenance to insure the highest possible levels of guest satisfaction in a cost efficient manner.Develop, implement, monitor and participate in a comprehensive sales and marketing plan that results in optimum, rate and occupancy for the hotel. Meet or exceed established budgetary guidelines for the hotel.Protect and enhance the value of all hotel assets through appropriate programs in maintenance, security, housekeeping and through the capital budgeting process.Ensure the timely and accurate completion of all period-end financial statements and reports, and provide controls to ensure the proper handling and accounting for all hotel receipts.Weekly forecasting and planning of operating staffing ad cost expenditures to correspond to forecasted sales and costs. Develop action plans to maximize occupancy and to maximize average rate.Review and approve all operating expenses.Maintain credit policies in sales, reservations, and front desk. Credit meetings, supervision of collection of major accounts, review of aging reports, and approval of write-offs.Develop and supervise programs that promote a positive work environment for all employees while ensuring that all employment-related processes and documentation are in compliance with local, state and federal laws and regulations.Perform other tasks associated as necessary in order to achieve the financial performance and goals of the organization.Confers with administrative personnel and reviews activity, operating, and sales reports to determine changes in programs or operations required.Directs preparation of directives to division or department administrator outlining policy, program, or operations changes to be implemented.Promotes organization in industry, manufacturing or trade associations.Assure regular repair, upkeep, and overall general maintenance of the hotel and provide a system of on-going maintenance of facilities and equipment.Ensure all hotel policies and procedures are fully implemented in all departments, including safety, emergency guidelines, etc.Supervisory Responsibilities:Manages all hotel employees (includes, Housekeeping, Engineering, Sales, Front Office, and Reservations). Is responsible for the overall direction, coordination, and evaluation of these units. Also directly supervises all non-supervisory employees.Carries out supervisory responsibility in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising, performance; rewarding and disciplining employees; addressing complaints and resolving problems.Specific experience we're seeking:Bachelor's preferred along with two to four years related experience and/or training; or equivalent combination of education and experience.QUALIFICATION REQUIREMENTS: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  EDUCATION and/or EXPERIENCE: Prior experience required. Depending on the role degree may be required.  LANGUAGE SKILLS: Ability to read, write, and verbally communicate effectively and professionally with other business departments, guests, and vendors. Ability to diplomatically deal with difficult situations and people, while exhibiting a consistent level of professionalism.  PHYSICAL DEMANDS: While performing the duties of this job, the employee is regularly required to stand, walk, and talk or hear. The employee frequently is required to use hands to finger, handle, or feel objects, or telephone. The employee must regularly lift and/or move up to 10-25 pounds and frequently lift and/or move up to 50 pounds.  (Please note: management reserves the right to change, modify, and/or alter any of the duties listed above to meet business demands)."}