{"jobID": "2700019265", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.cspacesol.com", "Headquarters": "Fairfax, VA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": "DATA SCIENTIST: Cyberspace Solutions is currently in need of a qualified Data Scientist with a broad range of associated skills and active TS/SCI clearance with CI polygraph to join our fast-growing team supporting an Intelligence Community (IC) mission. The ideal candidate has hands on work experience in mining both network and application/web utilization data, designing and setting up dashboards and other data visualization interfaces based on machine learning to identify anomalies, trends, and forecasts. The candidate would also provide supporting and continuous improvement of the resulting a web-based data analytics environment and has demonstrated experience researching, developing, and applying statistical learning models for data analysis and graphicly communicating results and ideas to key decision makers. Duties/Responsibilities: · Analyze, identify and support technical acquisition processes, flow monitoring, transformation, and ingestion, of data needed for analytics using tools such as Logstash, Beats, NiFi, and/or Kafka  · Setup and manage data repositories of indexed data using tools such as ElasticSearch and splunk, deployed in a remote virtual or cloud environment.  · Develop real-time and other user/dashboard interfaces for monitoring, anomaly detection, and analytics that communicate the desired data analysis at varying levels of detail to clearly to both technical troubleshooting (using drill down analytics), further analysis, and artful conveyance of resulting ideas to key decision makers using tools such as Kabana/Canvas  · Apply models to monitor and analyze network, application, and system of applications performance and utilization  · Develop testing framework and test model quality and data accuracy  · Use predictive modeling to support an increase and optimize experiences for monitored applications  · Coordinate with different functional teams to implement models and monitor outcomes  · Analyze a wide variety of operations and organize data for analysis and data sharing  · Analyze and interpret trends or patterns in complex data sets; develop data modeling methods Technical Qualifications: · Experience creating and using advanced statistical techniques and concepts (e.g. regression, properties of distributions, statistical tests, machine learning algorithms, modeling), their proper usage and application  · Must be proficient in Excel, SQL and two or more data science relevant languages/tools such as Python w/ appropriate libraries (preference), R, Tableau, Mathlab, SAS, splunk, ELK stack.  · Must have intermediate skill and experience in Web technology including XML related languages (e.g. XSLT, XPath, XML Schema), JavaScript, CSS, Web Services (e.g. REST)  · Must be proficient in one or more administration scripting language (e.g. BASH, Power Shell, Pearl, Pearl, etc.)  · Must have understanding or experience with deployment to VM or cloud environments (e.g. Amazon Web Services, IC ITE, VMware), and use of DevOps technology such as Orchestration Scripting (e.g. Puppet, Chef, Ansible) Education: Master's Degree or PhD in Math, Science, Statistics, Computer Science, Engineering, or related field, or equivalent combination of education, professional training, and work experience. Desired Certifications: Industry recognized certifications in provisioning technologies such as Cloudera Certified Professional, SAS Certified Big Data Expert, and/or Certified Specialist in Predictive Analytics (CSPA). Other Qualifications: · Active TS/SCI clearance and CI Polygraph  · Current Security+ or higher Certification  · More than 5 years of experience manipulating data sets and building statistical models  · More than 5 years of IT experience with an emphasis on computer science and/or mathematics  · Desired experience in ElasticSearch Suite or Splunk.  · Strong problem-solving skills with an emphasis on product development  · Experience working with and creating data architectures  · Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks  · Excellent written and verbal communication skills for coordinating across geographically separated teams  · A drive to learn and master new technologies and techniques  This position is full time. Normal working hours range between 0600-1800, Monday through Friday. Occasional travel may be required (10%). Work location is in Norfolk, VA. Telework is NOT authorized."}