{"jobID": "2805064690", "jobLocation": "Santa_Barbara_CA", "jobTitle": "Enterprise Data Management Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.sonos.com", "Headquarters": "Santa Barbara, CA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Media", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Bose"}, "estimatedSalary": "75000", "jobDescription": " In line with this ambition and the resulting growth plans, there is a continuous need for Sonos to invest in its organization across the globe, thus growing the level of professionalism, talent and experience within the Company.  At Sonos, the Global Operations team is responsible for all global Supply Chain and Business Operations activities required to serve to its global sales channels and end user customers within best in class product delivery and service levels, while maintaining lowest possible levels of cost and inventory. Aligned to its vision to fill every house with music and its strive for continuous innovation, Sonos is investing significantly in the expansion of its product portfolio. This is resulting in a continuous flow of new product introductions as well as product refresh, upgrade and transition projects. Timely and accurate master data management is the backbone to planning, costing and executing these programs.  This role is responsible for creating and maintaining material master data in all relevant Sonos systems, according to global data standards while supporting data governance processes. This role is also responsible for coordinating the completion of both upstream and downstream master data management to ensure timely availability of SKUs to support all relevant business operations processes. As part of the IBP team, this role is responsible for ensuring the highest level of data integrity, governance, and service to internal customers. This individual must understand the impacts of Master Data on business performance and provide guidance to the broader Sonos organization as related to master data and business taxonomy.The Ideal Candidate: Has strong intuitive skills to proactively ask the appropriate questions to ensure the quality of our master data.Understands the impact of master data within the organization and systemsProcesses master data requests in line with service level agreements and responds to queries in a timely fashion.Drives internal control and process compliance through active understanding, engagement, and awareness.Provides problem-solving support, advice and guidance to internal customers that is professional, responsive, and assumes responsibility for conclusion.Possesses strong interpersonal and communication skills to ensure that the end to end master data maintenance processes are adhered to by the cross-functional master data management team.Takes the initiative to drive continuous improvement to the current processes and systems.* The Master Data Analyst will be responsible for day-to-day activities and tasks associated with the Sonos Master Data and Taxonomy processes.Perform Master data maintenance based on New Product Introductions, supply chain partners and customersCollaborate with data owners, such as Program Management, Product Management, Marketing, Operations, Finance and Procurement, to evaluate material master data for integrity and accuracyWork with global counterparts in support of data governance and business rulesProvide master data training and support to end-users as needed to educate them how master data fits into overall commercialization processesProvide recommendations to internal and external partners to resolve issuesEnsure data quality, consistency and synchronization across multiple system environments"}