{"jobID": "2731582828", "jobLocation": "Los_Angeles_CA", "jobTitle": "Computer Scientist - Natural Language Processing", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "137000", "jobDescription": "Information Sciences Institute (ISI), a unit of USC’s Viterbi School of Engineering, is a world leader in the research and development of advanced information processing, computing, and communications technologies. ISI operates one of the world’s largest academic high-performance computing clusters. ISI has three research campuses: one in Marina Del Rey, CA; one in Arlington, VA; and one in Waltham, MA. *This position is located in Waltham, MA.* Information Sciences Institute (ISI) seeks a Computer Scientist who is talented and ambitious to lead and impact state-of-the-art natural language processing (NLP) research. Successful candidates for this position will generate research ideas, develop solutions to complex NLP problems, execute research projects in close collaboration with others, publish their research advances in top tier conferences and journals, and demonstrate leadership in the greater professional community.  Candidates should demonstrate a solid foundation in machine learning, possess strong programming skills, and have experience in performing and publishing research in natural language processing.  Examples of current research projects include: Creation of a new open source information extraction toolkit to enable reasoning and experimentation using diverse document interpretationsAutomatic extraction of causal knowledge from diverse information sources such as databases, news articles, social media, etc.Development of a multi-lingual common semantic space to enable cross-language information transfer (translation, retrieval, and summarization) for text and speech in low-resource languages (e.g. Swahili, Tagalog)Applications of language technology to diverse problems such as detecting cyber attacks, assisting in disaster relief, and providing aids to human reasoningA Ph.D. in Computer Science or a related field is preferred. The University of Southern California values diversity and is committed to equal opportunity in employment.Minimum Education: Master's degree, Combined experience/education as substitute for minimum education  Minimum Experience: 3 years  Minimum Field of Expertise: Knowledge of research processes and computer science."}