{"jobID": "2759337654", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist, Operations Decision Support", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "172000", "jobDescription": "At Google, data drives all of our decision-making. Quantitative Analysts work all across the organization to help shape Google's business and technical strategies by processing, analyzing and interpreting huge data sets. Using analytical rigor and statistical methods, you mine through data to identify opportunities for Google and our clients to operate more efficiently, from enhancing advertising efficacy to network infrastructure optimization to studying user behavior. As an analyst, you do more than just crunch the numbers. You work with Engineers, Product Managers, Sales Associates and Marketing teams to adjust Google's practices according to your findings. Identifying the problem is only half the job; you also figure out the solution.  As a member of the Operations Decision Support team, you will apply operations research and statistical methods to solve issues that may have never been solved at Google’s scale and complexity in the planning of compute, storage, network and datacenter capacity for both Google’s internal services and Google Cloud Platform. You will work broadly across Google’s platforms engineering, systems infrastructure, and site reliability engineering teams to optimize our deployment and pricing of resources and drive innovation in our software stack for efficiently utilizing those resources.  You will be expected to think critically and strategically about Google’s cloud as a technology, a business, and as an operation. You will be expected to be equally comfortable discussing total cost of ownership with hardware engineers, resource optimization with software engineers, or reviewing fleet plans and deployment policies with operations executives -- all based upon the analytical models that you will be developing.  Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We're always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible. Responsibilities Lead projects with hands-on analysis and modeling, drawing from a breadth of analytical methods to choose the right tool and right level of complexity appropriate to solving the business problem.Engage broadly with the organization to identify, prioritize, frame, and structure complex, ambiguous problems where advanced analytics projects or tools can have the biggest impact.Identify and communicate the challenges and opportunities that the group should be working on.Help define not just the analytical direction, but influence the direction of the associated engineering and infrastructure work and affect change. Qualifications Minimum qualifications:"}