{"jobID": "2812682873", "jobLocation": "Sunnyvale_TX", "jobTitle": "Machine Learning Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.yahoo.com", "Headquarters": "New York, 061", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Company - Public (YHOO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Google, Microsoft, Facebook"}, "estimatedSalary": "109000", "jobDescription": " Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.The Machine Learning Platform team develops machine learning services, libraries and tools for massive datasets and streams powering learning and prediction across Oath. We are looking for machine learning/data engineers/scientists to work with us to create novel machine learning platforms enabling efficient large-scale machine learning and empowering data scientists and engineers to develop solutions easily and quickly, and collaborating with product groups on challenging, high-impact machine learning problems and use cases.Responsibilities: Contribute into the tactics and strategy of the organization and the companyDevelop high-quality software systems ranging from early prototypes to rock-solid production systemsStay up to date and ahead of the world on where the technology and their applications might be evolvingGuide and collaborate other data scientists, machine learners and software engineers within the team and beyondWork with internal Machine Learning Platform customers and practitioners on solving business-critical data-driven problems, identify shortcomings and improvement opportunities in the platforms and make the world a better placeCreate proof of concepts and demonstrations on machine learning enabled solutions on potential future opportunities and challenges for the company Qualifications: BSc, MSc or PhD in Computer Science or related fieldWork experience in software engineering, data science, and machine learningDemonstrated track record in making impact from ideas to realizationsSolid knowledge of big data and machine learning technologies such as Spark, Hadoop, TensorFlow and XGBoostDeep understanding of algorithms, data structures and performance optimizationStrong programming proficiency with Scala, Java, Python and/or C++Strong technical, analytical and communication skills Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process.Currently work for Oath? Please apply on our internal career site."}