{"jobID": "2826643598", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Local candidates OnlyFace to Face interview is Must The Data Analyst will design and develop validation models to meet data quality requirements. Works with business analysts to understand and document data quality requirements and develop medium to complex SQL queries for data integrity analysis. The Data Analyst will work with the BI team, DBA's, Development and Support engineers to understand data sources and implement new requirements and develop Data Quality metrics. The Data Analyst is technically responsible for the quality of the deliverables. Job Responsibilities: Troubleshoot data issues, validate result sets, and provide ad-hoc reports and analysis on time and with high quality. Ensures Data Quality Metrics are under SLA. Recommend and develop new data quality metrics and maintain existing metric reports based on new system requirements. Supports SQL scripts maintenance, changes, and testing. Manage defect cleanup process from start to finish on multiple defects including the Initial impact analysis and final data cleanup and verification. Work with different groups within the organization to coordinate and facilitate the defect cleanup process. Design and generate tracking and monitoring tools to validate data. Ensures Data Quality Metrics are under SLA. Ensures new system design meets data quality standards. Other duties may be assigned. Qualifications:Strong Microsoft SQL Server skills.Ability to multi-task and work well under deadlines in a changing environment.Ability to independently manage and prioritize task assignments.Strong quantitative, analytical, process development, facilitation and organizational skills required. Ability to handle confidential information with diplomacy and tact.Ability to be flexible and work extended hours as required.Strong communication skills.Must have an understanding of or ability to quickly grasp technology concepts.provided by Dice Microsoft SQL Server, Query Writing, Data Analysis"}