{"jobID": "2830504717", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist, Industrial AI", "companyRating": "3.1", "companyInfo": {"Website": "www.hitachi.com", "Headquarters": "Tokyo, Japan", "Size": "10000+ employees", "Founded": " 1910", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " Company: Hitachi America, Ltd.  Division: R&D;/Big Data Lab  Location: Santa Clara, CA  Status: Regular, Full-Time  Summary  Hitachi America,Ltd. (http://www.hitachi-america.us/)has openings for Research Scientists in the Big Data Laboratory located in SiliconValley. The mission of this laboratory is to help create new and innovative solutionsin big data and advanced analytics. The laboratory focuses on research,technology innovation, proof-of-concept activities, technical marketing andbusiness development for novel big data solutions, leveraging Hitachi'stechnologies, reinforcing Hitachi's messaging around big data, and establishingHitachi as a leader in big data.  We are seeking researchscientists in deep learning and reinforcement learning to create innovate algorithmsand solutions for smart industry, social innovation and the Internet of Things. The successful candidate will have anopportunity to solve challenging real world problems, work on massive industrialdata and to contribute solutions that will benefit society. This position is aperfect match for a visionary scientist who is passionate about the unlimitedpotential of machine learning/AI/data mining/statistics for solving realproblems and empowering society, industry and the things that matter.  More informationabout the research done at the Big Data Laboratory can be found at:  http://www.hitachi-america.us/rd/about_us/bdl/  More informationabout Hitachi IoT technology in Smart Industry can be found at:  https://www.hitachivantara.com/en-us/solutions/iot-insights/industrial-iot.html Responsibilities:Research and develop innovative data analytics algorithms and solutions for smart industry, social innovation and the Internet of ThingsPrepare and execute proof-of-concepts of the solutions with customersWork with business units to commercialize the successful proof-of-conceptsProtect Hitachi's IP through patents and other activities, and publish technical results in leading venues to establish Hitachi as a leader in big data and advanced analytics.Qualifications:Ph. D degree in Computer Science orrelated fieldStrong research experience in deeplearning, reinforcement learning and other machine learning algorithms andtheir usage for classification, regression, and clustering tasks - Knowledge oftime series analysis techniques is a plusGood programming skills and knowledgeof data science tools and libraries in Python or R - Knowledge of big dataplatforms such as Hadoop and Spark is a plusSelf-motivated and passionate aboutsolving real-world problems and building innovative systems with big dataanalyticsDemonstrated ability to effectivelycreate and deliver technical communications, including patent applications, presentations,papers, and reportsAbility to collaborate successfullywith R&D; co-workers, Hitachi group company customers, partners, engineers,and business units in Hitachi with the goal of commercializing the proposedsolutionAbility to travel within the US andinternationally as needed EOE-Females/Minorities/ProtectedVeterans/Individuals with Disabilities  If youneed a reasonable accommodation to apply for a job at Hitachi, please send thenature of request and contact information to accommodation@hal.hitachi.com.Queries other than accommodation requests will not be responded to."}