{"jobID": "2826677549", "jobLocation": "Houston_TX", "jobTitle": "Master Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.westlake.com", "Headquarters": "Houston, TX", "Size": "5001 to 10000 employees", "Founded": " 1986", "Type": " Company - Public (WLK) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " LyondellBasell, Formosa Plastics, Oxychem Corporation"}, "estimatedSalary": "66000", "jobDescription": "Westlake Chemical offers you the potential to enrich your work life and career experience in an entrepreneurial environment. We work together to enhance peoples' lives through our products and presence in the communities in which we operate.​SUMMARY: The position is responsible for supporting the data systems and users in the PE Business Group, coordinating projects, testing process changes, training users, and maintaining system documentation and the change management process. This person will also be responsible for identifying process improvement opportunities relating to data processing and data structure, as well as maintaining customer and material master data structure in SAP. This position reports to the Supervisor, Data Analysis – Supply Optimization. ESSENTIAL DUTIES & RESPONSIBILITIES:Maintain SAP customer and material master data for PE Business Group. Work closely with the PE business management, sales representatives, plant personnel and customer service representatives to validate data integrity.Responsible for timely, accurate data creation, maintenance, and deactivation of material and customer master data in the SAP system. Ensure consistency of data across applications.Keep abreast of and appropriately leverage best practices used in the chemical industry related to master data management, data governance, and data quality.Identify process improvement opportunities in current data structure, work processing, etc., and work with data submitters and users to implement the opportunities to continually improve the system and process. Analyze and address affects caused by proposed changes prior to implementation and mitigate impacts to the business.Thoroughly test process changes before handing back to users, assuring changes don’t negatively impact other data or processes.Maintain system documentation and change management processes.Update and train users and new hires on current processes and any changes. This will include one-on-one sessions, as well as presenting to larger groups.Serve on teams for projects in other areas of the business to provide knowledge about PE master data and potential effects of the project on the current systems.Create routine and ad hoc reports for PE Business Group, utilizing tools such as Business Objects Crystal Reports, SAP, Business Warehouse, and SQL and Oracle databases. Validate and cross check the system data integrity with the help of business resources and tools.Function as backup support for other business analysts.Perform the primary thinking encompassed by this job description, and any other job responsibilities or tasks as assigned.Comply with all Company policies and procedures.QUALIFICATIONS:Effective communication skills. Must have good verbal and written English language skills.Ability to communicate and cooperate with all levels of the organization: technical team, sales representatives, customer service representatives, users, and management.Business process knowledge (sales, billing, returns, consignment, credit)3 years of experience with SAP/BW/SQL/Oracle reporting and Microsoft Office applications highly preferred.Must have extensive computer skills with emphasis in SAP, database systems, report writing software (e.g. Crystal, Access, etc.), “process thinker”. Must be proficient at data gathering, analysis/evaluation, and efficient use of time.Good change management skillsEDUCATION and/or EXPERIENCE:B.S. Degree (Logistics, Business, Engineering, or IS/IT preferred), and 5 years of experience in data management preferred, with specific logistic/supply chain experience preferred.PHYSICAL DEMANDS: While performing the duties of this job, the employee is frequently required to sit; stand; walk; use hands to touch, handle, or feel; reach with hands and arms; and talk or hear. The employee is occasionally required to stoop, kneel, or crouch. The employee must regularly lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus. WORK ENVIRONMENT: The noise level in the work environment is usually moderate as normally based in an office. Some of the work may be required in the operating units which can require usage of required PPE including safety glasses, hearing protection, etc. May also result in exposure to outside elements and may require usage of stairs and elevators. Travel up to 10% including air travel or auto travel.  Westlake Chemical is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, age (40 or older), disability, genetic information, or protected veteran status. If you are an active Westlake Chemical employee (or an employee of any Westlake Chemical affiliates), please do not apply here. Please go to your Workday homepage and click on the \\\"Careers\\\" worklet and view \\\"Westlake Career Opportunities\\\"."}