{"jobID": "2807527698", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": "1.9", "companyInfo": {"Website": "www.americanmidstream.com", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Public (AMID) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "American Midstream Partners, LP is a growth-oriented limited partnership formed to provide critical midstream infrastructure that links producers of natural gas, crude oil, NGLs, condensate and specialty chemicals to end-use markets. American Midstream’s assets are strategically located in some of the most prolific onshore and offshore basins in the Permian, Eagle Ford, East Texas, Bakken and Gulf Coast. American Midstream owns or has an ownership interest in approximately 4,000 miles of interstate and intrastate pipelines, as well as ownership in gas processing plants, fractionation facilities, an offshore semisubmersible floating production system with nameplate processing capacity of 100 MBbl/d of crude oil and 240 MMcf/d of natural gas; and terminal sites with approximately 6.7 MMBbls of storage capacity.ObjectiveThis position will be responsible for gathering requirements, building and maintaining reports for Operations, Accounting and Commercial as well as documenting business processes. This individual will also serve as part of a team managing historical and Azure databases. The Data Analyst will also assist with security in databases, reports and reporting tools.Primary ResponsibilitiesInterpret data, analyze results using statistical techniques and provide ongoing reportsDevelop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and qualityAcquire data from primary or secondary data sources and maintain databases/data systemsIdentify, analyze, and interpret trends or patterns in complex data setsFilter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct problemsWork with management to prioritize business and information needsLocate and define new process improvement opportunitiesParticipate in special projects as requiredBuild and maintain reports and security around reports developed in SSRS, OneStream, Power BI, Business Objects, ArcGIS and Dynamics 365Maintain communication with the Director of Business Technology; identify and escalate issues and risks as necessaryGather business requirements for developing new reports in the reporting solution that will best serve the usersTrain business users on new reports and dashboardsOther duties as requiredWorking ConditionsThe conditions the worker will be subject to in this position include:Physical activity(ies) of this position include: climbing, balancing, stooping, kneeling, crouching, crawling, reaching, standing, walking, pushing, pulling, lifting, fingering, grasping, feeling, talking, hearing, repetitive motionPhysical requirements of this position are:Sedentary work. Exerting up to 10 pounds of force occasionally and/or negligible amount of force frequently or constantly to lift, carry, push, pull or otherwise move objects, including the human body. Sedentary work involves sitting most of the time. Jobs are sedentary if walking and standing are required only occasionally and all other sedentary criteria are met.The visual acuity requirements including color, depth perception and field vision for this position include:The worker is required to have close visual acuity to perform an activity such as: preparing and analyzing data and figures; transcribing; viewing a computer terminal; extensive reading; visual inspection involving small defects, small parts, and/or operation of machines (including inspection); using measurement devices; and/or assembly or fabrication parts at distances close to the eyesThe conditions the worker will be subject to in this position include:None. The worker is not substantially exposed to adverse environmental conditions (such as in typical office or administrative work.)Anticipated travel less than 10%.Education and QualificationsAdept at queries, report writing and presenting findingsExperience in SSRS, Power BI, Business Objects and OneStreamGeneral knowledge of basic accounting principlesGeneral knowledge of Internet Information Server (IIS) and the basic operation of websites, Application Pools, IIS Administration, ports, and SSL CertificatesGeneral knowledge of business processes and documenting workflows in VisioStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyITIL Certification is a plusStrong analytical, organizational and documentation skills requiredExcellent communication and interpersonal skills, both written and verbal requiredAbility to prioritize assignments, deal with interruptions, and meet deadlines, and multi-task in a fast paced and growth oriented environmentAmerican Midstream is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, national origin or ancestry, sex, age (40 or over), disability, genetic information, veteran status, or any other legally protected status under local, state, or federal law. "}