{"jobID": "2820900084", "jobLocation": "San_Francisco_CA", "jobTitle": "Travel RN Registered Nurse - OR", "companyRating": null, "companyInfo": {"Website": "www.pprtravelnursing.com", "Headquarters": "Jacksonville Beach, FL", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " American Mobile Healthcare, Medical Solutions, FlexCare Medical Staffing"}, "estimatedSalary": null, "jobDescription": " PPR Travel Nursing has a great opportunity for a Full Time Travel Oncology RN/Registered Nurse in San Francisco, California. Job Details and Requirements:Full Time, 8-Hour DayMinimum One Year of Recent Acute Care ExperienceBLS Certification RequiredMeets all RN/Registered Nurse Oncology Skill Set RequirementsHere are some of the great benefits PPR Travel Nursing offers:Dedicated, Tenured Recruitment StaffWeekly Housing Stipend or Paid, Private HousingPer Diem AllowanceCompetitive PayWeekly Direct Payroll DepositPet FriendlyTravel and License ReimbursementsDay One Insurance with Three Comprehensive Insurance Plan Options401K Plus Match and Supplemental Insurance Offerings$1000 Referral BonusesWhy Travel with PPR? PPR Travel Nursing is known for our outstanding customer service and creating the best employee experiences in the industry since 1996. This experience begins with our team of tenured recruiters. Recruiters who are passionate, empathetic, and value-oriented. PPR nurses learn quickly that these qualities permeate the entire organization. Representatives in payroll, quality management, housing and human resources all pride themselves on creating a best-in-industry customer experience.  PPR Travel Nursing offers competitive compensation, an industry leading health insurance plan, paid private housing or housing stipends, license and travel reimbursements, 401k, and a generous referral bonus. Let the PPR family take care of you. Not just when you travel with us, but also during the application and job search process. We Put You First."}