{"jobID": "2832996165", "jobLocation": "Milpitas_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.livemindz.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data ScientistLocation : MilpitasJob requirements:i) Expert in cleansing data, removing anomalies, selecting features, reducingdimensions, building/optimizing classifiers, correlating hard business / technology generated data with social media data (like tweets / blogs / posts / etc.) to discover hidden or unseen data or trend from vast amounts of data by applying various data mining techniques, statistical analysis and thus building high quality prediction systems.ii) Excellent understanding of machine and deep learning concepts / techniques like k-NN, SVM, Decision Forests, linear regression models, gradient descent, K-means, RFM modelling, etc.iii) Strong Experience in using data science tools like Python, Py-Spark, Scala-Sparkiv) Knowledge of NoSQL databases such as MongoDB, Cassandra, Hbase, etc.v) Experience with using GCP / AWS cloud servicesvi) Knowledge of Hadoop stack, Spark, Map-Reduce, Hive, Pig, Shell Scripting and familiarity Unix/Linux OS.vii) Good understanding of relational databases with ability to write/ modify complex SQL queries to generate required datasets and tune query performance.viii) Understands dimensional data model, logical data model and physical data model for analytics and reporting. Understands data design that supports integration of data and information flow across various applications, systems and platforms.ix) Strong analytical and problem solving skills. Should provide solutions to complex problems without known solutions.x) Excellent communication skills and capability to effectively work with both Business and Technology teams.xi) Qualification Degree in applied math, statistics, engineering, computer science or other quantitative field required. PhD or MS/MTech preferred.xii) 3+ years of technology experience as a Data Scientist - provided by Dice  data scientist"}