{"jobID": "2827251081", "jobLocation": "Washington_DC", "jobTitle": "SharePoint Developer", "companyRating": null, "companyInfo": {"Website": "www.bwfed.com", "Headquarters": "Chantilly, VA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Government", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " BlueWater Federal Solutions is a dynamic and nimble systems integration firm providing professional services and IT solutions to the Federal Government throughout the nation. We are viewed by our Federal Customers (DHS, Army, Navy, CENTCOM, DHA, EPA, GSA) as a trusted partner with a track record of successful past performance and superior customer value.  Without question, our company's strength lies in our people – Over 250 men and women who are deeply passionate about client partnership, reliable delivery, and successful results. We are looking for individuals who share this aspiration and invite you to join us in work that truly makes a difference for our clients.  Summary  BlueWater Federal is looking for a talented SharePoint Developer to support a DOJ program in downtown DC. Provide support to develop Web based applications including online customer service for agency components to be able to deliver their services online.Provide support in developing the site concept, interface design, and architecture of the web-site.Provide support for the implementation of interfaces to applications.Bachelor’s degree is preferred3+ years of SharePoint development experienceMust have a Public Trust or higher clearance.Working knowledge and experience coding in Java is required.Knowledge of several of the following areas is desirable: Active Server Pages (ASP), JavaScript, and SQL Server, Visual Basic, JavaScript, MS Access, HTML, DBMS's (ex. - Oracle, Sybase, etc.).Full SDLC support - requirements, development, testing, deployment, O&M; BlueWater Federal is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability."}