{"jobID": "2803367625", "jobLocation": "Chantilly_VA", "jobTitle": "Applied Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.integrity-apps.com", "Headquarters": "Chantilly, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TASC, Vencore, Booz Allen Hamilton"}, "estimatedSalary": "79000", "jobDescription": "Integrity Applications Incorporated (IAI) is a unique and exciting software and systems engineering company headquartered in Chantilly, VA with additional offices nationwide. IAI has been selected as one of the best companies to work for in America by The Great Place to Work Institute, and we've been recognized as one of the top employers in the DC Metro area by Washingtonian Magazine. IAI's value lies in our ability to deliver the depth and breadth of our experience, culture, and technical acumen to our customers' most challenging issues, and we are looking for innovative, energetic, and talented people to join our team of highly skilled professionals and engineers to help us in this endeavor. IAI offers challenging work, competitive salaries, an incentive bonus program, and top-notch health and welfare benefits for you and your family.  IAI is seeking a data analysis and visualization specialist who will be responsible for supporting multiple government agencies and projects to include the U.S. Geological Survey National Land Imaging (NLI) Program and the Technology, Planning and Integration for Observation (TPIO) division, which is part of the Office of Projects, Planning, and Analysis (OPPA) in the National Oceanic and Atmospheric Administration (NOAA) National Environmental Satellite Data and Information Service (NESDIS). The USGS NLI Program is responsible for developing and maintaining requirements for collecting, processing, archiving, and distributing land surface data to the U.S. Government and other users. These requirements inform the development of future land imaging satellite missions and serve as a basis to evaluate the efficacy of sensor and mission designs. The NLI Program also supports land imaging architecture studies that span the range of available observing platforms (satellite and airborne) and data providers (government, foreign, commercial, etc.). NOAA/NESDIS/TPIO develops and maintains observing requirements, analyzes observing system portfolios and architectures, and manages the data sets for analytical support to NOAA senior leadership. The ideal candidate will have experience in the areas of data analysis and visualization. The successful candidate will be a self-starter who thrives in a fast-paced environment and is a team player with excellent oral and written communication skills. The candidate will represent IAI in a variety of forums and interact regularly with senior government personnel.  The candidate will be responsible for developing and supporting visualization tools as part of an integrated set of analytical processes. The candidate will develop dashboards and models and optimize the performance of analytical processes. Strong analytical and data management skills with a business background are desired. Additional science and/or remote sensing technology background or experience will be helpful. Job Duties:Generate interactive data visualizations using Tableau™ or similar toolsDevelop new tools or techniques for more efficient analysesProvide analytical support to a range of teams and customersQualifications:Bachelor’s or Master’s Degree (or higher) in business, data analytics, business analytics and/or applied information technology preferredStrong Microsoft Excel™ skillsTableau™ experience (work or education or combination)General programming skillsExperience with data analysis and data managementExperience with statistics or R is a plusSecurity Requirements: Must meet security clearance requirements Integrity Applications Incorporated is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or any other factor protected by law."}