{"jobID": "2808350624", "jobLocation": "San_Antonio_TX", "jobTitle": "Cybersecurity Test Engineer - TMAS Scientist/Engineer 3", "companyRating": "3.6", "companyInfo": {"Website": "www.colsa.com", "Headquarters": "Huntsville, AL", "Size": "1001 to 5000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " Founded in 1980, COLSA Corporation's team of cyber engineers, analysts and professionals across the US provide government customers with the latest and most sophisticated engineering, programmatic, and information technology services.  Centered at the core of its values, COLSA knows its people are its most valuable resource. In addition to receiving a competitive compensation package, our employees enjoy offerings such as flexible work schedules, paid time off, benefits that begin on the date of hire, recognition programs, tuition and certification assistance, and immediate vesting in our matching 401(k) plan. Our WE CARE Wellness program provides support and initiatives to empower employees and their families to live healthy, balanced lives and our Association of COLSA Employees (ACE) provides a fun way for employees and their families to come together in times of both celebration and need. We invite you to connect your talents with opportunity, and be a part of our \"Family of Professionals,\" in supporting cutting-edge initiatives related to our country's national defense! Job Description: This position provides support to the 47th Cyberspace Test Squadron Located at Joint Base San Antonio, TX. This support includes the following: Prepare and execute Developmental Test&Evaluation; (DT&E;) plans and procedures according to established test methodologies.Perform interoperability and integration testing, as well as functional testing of various systems, tools, and networks.May participate in all phases of risk management assessment and software/hardware development under the direction of a Senior Test Engineer.Coordinate with other engineers to ensure the test infrastructure will meet desired test objectives.Actively participate throughout the acquisition process in order to influence development of a product or capability that is testable.Provide technical advisory and assistance support to government sponsors.Compile and analyze test results data to determine conformity of the product or capability to the requirements.Document change requests/deficiencies of the product or capability as a result of test data analysis.Required Experience Bachelor's Degree in an applicable field and at minimum of 3 years of applicable experience is required. Six years of applicable experience may be substituted for an applicable BS Degree (Total of 9 years) or four years of applicable technical experience and an applicable Associates Degree (Total of 7 Years). Must possess an active Top Secret/SCI clearance.Bachelor's degree from an accredited college or university in computer science, mathematics, engineering or a mathematics-intensive, technical discipline.Must obtain the ISTQB CTFL certification within 6 months of hire.Must obtain the ISTQB CTAL-TA within 2 years of hire.Must have effective writing/oral presentation skills.Independent working knowledge of the following: encryption/key management, enterprise network architecture, communication equipment and technologies, routers, mail and web servers, Intrusion Detection&Prevention; Systems, firewalls, anti-virus tools, network protocol analyzers, and network traffic generation.Five years of intensive and progressive experience in a computer-related field.Minimum of one year software testing for software / hardware applications or systems is required.Desired Experience:Test automation.Cybersecurity (vulnerability assessments, blue team, red team, etc.).Understanding of AFIN&DODIN; architecture. Applicant selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information. COLSA Corporation is an Equal Opportunity Employer, Minorities/Females/Veterans/Disabled. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}