{"jobID": "2836056526", "jobLocation": "Rahway_NJ", "jobTitle": "Early Clinical Scientist- Clinical Operations", "companyRating": "3.7", "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  The Early Clinical Scientist/ECS coordinates the design, planning and execution of early phase clinical trials with the Clinical Director and internal/external team members. Oversees trials within and/or across program(s)/therapeutic areas and ensures excellence in execution/compliance to support study objectives and data validity. Manages CRO performance to achieve project objectives and resolves project performance issues if they arise.  Ensures appropriate clinical safety assessment and risk management of compounds. Conducts real-time oversight of ongoing trials to identify and mitigate study participant, study design, data or study conduct issues. Reviews and interprets clinical trial data. May conduct on-site study monitoring, including site training & supervision of complex, novel endpoint/biomarker collection processes. Applies knowledge of GCP, ICH guidelines, and regulatory requirements for clinical development.  Contributes to teams developing and/or improving internal job aids/SOPs. Identifies and communicates best practices within the organization.  Technical Writing & Communications  Co-authors clinical sections of protocols, clinical investigator brochures, clinical study reports, Worldwide Marketing Application/Common Technical Document (WMA/CTD) subsections, and regulatory agency update and safety reports, as well as clinical development plans, publications, and abstracts. Ensures documents are completed in accordance with applicable standards. Develops study operational documents with input from team members (e.g. site monitoring plan, study operations manual, informed consent, etc.).  Project Management  Manages trial and program projects including team activities (i.e. meetings, document/collaborative workspace management, etc.), provides risk assessment and contingency planning, under accelerated timelines. Familiar with early drug development processes, building knowledge and skills to effectively manage additional processes/procedures.  Overnight travelQualifications  Education Minimum Requirement:  Bachelor of Science degree (or BSN) and ≥4 years related* experience OR  Master’s degree or higher, and ≥3 years related* experience e.g., familiarity with or knowledge of clinical trial management and trial execution; clinical site training/monitoring; medical and regulatory writing; OR equivalent experience with developing preclinical model experiments for drug candidates (protocol authoring, experiment execution/oversight, authoring experiment reports).  Required Experience and Skills:  Understanding of clinical research development process from program planning to regulatory submission Able to quickly develop a working scientific knowledge of different therapeutic areas  Ability to manage complex operations and projects under accelerated timelines  Scientific, medical and/or safety writing and reporting (at least one is required)  Ability to partner effectively with internal and external (CRO) teams to achieve results  Strong team collaboration, leadership, communication (written and verbal), issue identification and resolution skills  Knowledge of GCP, ICH guidelines and regulatory requirements  Preferred Experience and Skills: Global Phase I subject and patient trials & safety reporting experience a plus"}