{"jobID": "2836380007", "jobLocation": "Washington_DC", "jobTitle": "Jr. Business Intelligence/Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.citizant.com", "Headquarters": "Chantilly, VA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Booz Allen Hamilton, Octo Consulting Group, Deloitte"}, "estimatedSalary": "58000", "jobDescription": " Company DescriptionCitizant is a leading provider of professional IT services to the U.S. government. We seek to address some of our countrys most pressing challenges in the areas of Agile application development, Enterprise Data Management, Enterprise Architecture, and Program Management support services focusing on the U.S. Departments of Homeland Security and Treasury. We strive to hire only ethical, talented, passionate, and committed A Players who already align with the companys core values: Drive, Excellence, Reputation, Responsibility, and a Better Future. No matter how large we grow, Citizant will retain its collaborative, supportive, small-company culture, where successful team effort to address external and internal customer challenges is valued above all else.Job DescriptionWe are looking for a passionate Data Analyst/Business Intelligence Report Developer. The candidate will turn data into information, and information into insight. Responsibilities include conducting full lifecycle analysis from interpretation of requirements, running data queries to developing robust data visualizations. The Data Analyst will develop and maintain integrated data reports and visualizations and respond to ad-hoc data requests. Collaborate with the data integration team on data design and user needs, BI analytics, researching and applying new visualization technics, and participation in user experience and user acceptance testing. Identify, analyze, and interpret trends or patterns in complex data sets. Work as part of an Agile Scrum development environment.Qualifications*3 + years experience working with data integration and data warehouse solutions  *3 + years writing SQL Queries, acquiring data from primary and secondary data sources and maintaining databases  *3 + experience interpreting data, analyzing results and using statistical techniques  *2 + years Oracle DB experience  *1 + years experience conducting analysis, creating and maintaining data visualizations and reports in Tableau  *2 + years experience conducting analysis, creating and maintaining geospatial visualizations in ArcGIS or AGOL  *Technical experience regarding data models, database design development, data mining and segmentation techniques. Strong knowledge of and experience with reporting packages (Business Objects), databases (SQL, etc.), programing (ETL)  *Knowledge of statistics and experience using statistical package for analyzing datasets (e.g. R, Python)  *Experience development and implementing data analysis, data collection systems and other strategies to optimize statically efficiency and quality  *Experience identifying and applying methods to cleansing data quality issues  *Experience creating and comprehending Logical and Physical Data models  *Experience interpreting and understanding complex business processes and breaking it down into data requirements  *Experience in translating functional artifacts (e.g., process maps, functional decompositions and users stories)  *Experience in establishing data dictionaries and documenting technical requirements  *Experience in conducting functional testing of business intelligence visualization objects  *Min. 3 years proven experience in data analysis and Business Intelligence report development  *BA or BS required Additional Qualifications: Experience working in Agile environment  Experience working with the following business functions: financial (budget programming and execution), human capital, organizational assets and operations, and contracts/procurement Clearance: *Preference given to candidates currently holding suitability for national security agencies  *Applicants selected will be subject to a security investigation and will need to obtain a favorable government suitability rating to start  *Must be a US CitizenAdditional InformationCitizant strives to be an employer of choice in the Washington metropolitan area. Citizant associates accept challenging and rewarding work and in return receive excellent compensation and benefits, as well as the opportunity for personal and professional development.  Citizant is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.  #cjpost"}