{"jobID": "2610668611", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Analyst, Quantitative Research", "companyRating": "3.3", "companyInfo": {"Website": "www.keltonglobal.com", "Headquarters": "Playa Vista, CA", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "WHO WE ARE: Kelton is a strategy consultancy that creates consumer-oriented business solutions based on core human truths. We create brand relevance and resonance for our clients, by taking a creative, thoughtful and rigorous approach to interpreting insights, developing strategies, and designing solutions that deliver on consumer desires. We have a leadership team made up of seasoned research, communications, marketing, and innovation/design professionals; thus there is ample opportunity to learn and grow every day. We are proud of having an entrepreneurial, start-up culture where training is very hands on and theres an atmosphere in which teams are tight and colleagues really help each other.  We serve as a strategic partner to a broad array of cross-industry clients including Target, Coca-Cola, Google, Pfizer, Amazon, Harley-Davidson, Verizon, TOMS, and 9 of the 10 largest PR firms in the country. With our consumer insights and research platform, weve built a team that is uniquely positioned to develop solutions for clients that keep their customers at the center of their strategy, marketing, and innovation efforts. WHO WE'RE LOOKING FOR: We have a fantastic opportunity for a motivated, innovative quantitative researcher. If you yearn to learn and grow your research and consulting skills while working with some of the best in the industry, this is the opportunity for you! In this role, we need you to be naturally curious and have a passion for understanding human behavior. A high level of motivation and excellent communication skills are required to manage an incredibly diverse slate of work, clients, and team personalities.  Flexibility to work on multiple projects, a natural aptitude for organization, and deadline-driven deliverable creation are equally important in this fast-paced environment. If youre someone who is able to deliver amidst the dynamic nature of workload and pace inherent in a client service business, we want to meet you!  Were relatively flexible on years of experience (although we desire at least 2 years working in a relevant agency or consulting environment). The right person for this role wont back down from a challenge, and will relish being in a small, entrepreneurial, fast growing environment. You must share our passion and energy for developing creative research solutions for our clients. We want you to begin consulting on day 1, and you should be a savvy, problem-solving marketing and research professional.  This position will partner closely with a diverse set of research and strategy colleagues to grow and build domestic and global client relationships. In this role, we are looking for someone who brings stellar quantitative technical research skills, but thats not enough on its own. We need a self-starter who is comfortable working on all stages of the process, from networking and capabilities discussions to crafting project proposals, questionnaires, story-driven deliverables, and participating in key research activities in order to foster client relationships. WHAT YOU'LL DO:Project management responsibilities are threefold. You must be able to (with limited oversight), effectively manage the following: Be the first point of contact for clients on projects and maintain comprehensive notes, demonstrating an ability to own client contact for projects of appropriate complexity,Maintain organization and timelines among the internal team (with the ability and desire to learn how to manage both up and down),Manage relationship with external vendors, including managing quality control, approving coding lists and providing clear instructions to vendors.Manage programming and fielding operations, including survey programming, analysis plan, and banners/tabs.Assist with report creation, including writing, analysis, chart/table creation in Excel or PowerPoint, Assist or lead writing survey questionnaires, in alignment with key survey writing principlesTest survey links (including testing for spelling, grammar, and logic skips) prior to survey fieldConduct secondary deck research to augment primary research learnings.Be able to effectively problem solve logistical issues and adjust on the fly.Proactively identify issues and suggests solutions on how to make projects run more smoothly.Basic understanding of qualitative research; able to guide the transition/serve as the link from quant to qual.Manage interns and entry-level staff on a project. Demonstrate a capability to help improve their skills, know what and when to delegate.WHAT YOU'LL BRING:2+ years relevant work experience, social science/research background desired.Excellent Excel, SPSS, and PowerPoint skills are necessary to be successful in this roleExperience working on both quantitative and integrated qual/quant engagements is preferred.Strong project management skills including an interest in growing and building strategic consulting skills. Be extremely comfortable talking with clientsStrong attention to detailPassion for solving big problems for big brandsBachelors degree required, Masters degree a plus."}