{"jobID": "2673827102", "jobLocation": "Southfield_MI", "jobTitle": "Lead Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.eaton.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1911", "Type": " Unknown", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "138000", "jobDescription": "Corporate Research & Technology focuses on the front end of innovation by: conducting research to advance the state of the art, emphasizing cross-business impact technologies, and innovating to provide Eatons customers with safe, efficient, and reliable power management solutions.The Machine Systems Technologies team has the principal goal of identifying, developing, and justifying commercialization of significant growth opportunities for diverse Eaton businesses in the area of electromechanical and electrohydraulic systems and components for the Vehicle, Aerospace, Hydraulics, and other industrial markets. Effectively managing the data generated by these components and systems is critical to generating value beyond the components and systems themselves.The Lead Data Engineer will work on implementing data projects with a focus on collecting, parsing, and managing large sets of disparate data using multiple platforms to enable easy data access for analytics and visualization. He or she should be able to decide on the needed hardware and software design needs and communicate to the leadership on the requirements. The data engineer should be able to develop proof of concepts and scalable solutions for real-world products.The Lead Engineer is expected to serve as a technical and/or project lead on projects within the Machine Systems Technologies team. They are responsible for meeting the schedule, scope, cost and technical targets for all efforts under their control. They are expected to contribute to technical papers and presentations as well as IP generation through authoring (or co-authoring) disclosures and patents.As a key member of the Machine Systems Technologies team the Lead Engineer is expected to develop themselves as a subject matter expert both internally and externally to Eaton. This includes attending conferences, seminars and/or consortium meetings in relevant industry to network with technical peers and stay relevant in their fields.Serves as a technical lead and/or project lead in technology realization programs/projects utilizing our internal project execution processes, including Gate Reviews, Design Reviews, and Technical Reviews.A technical lead, as a subject matter expert, is responsible for the execution of milestones that are critical to the project. The technical lead coordinates activities with other engineering resources on the team to ensure the timely completion of the project milestones.Project lead is the single point of contact for the entire project. Responsible for creating, executing and tracking all the milestones for the entire project. Assigns roles and responsibilities for the project team members.Discovery of data across many different systems, data sources and data types (structured and unstructured)Profile data to measure quality, integrity, accuracy, and completenessData preparation and blending for reporting and visualization purposesDesigning efficient and robust ETL workflowsHelping to streamline a better data supply chain for analytics that goes from experimentation into productionWorking with cloud computing environmentsEvaluate and analyze any new tools and recommend data strategy changes as neededContribute to group knowledge sharing platforms and best practiceParticipates in brainstorming sessions contributing to the technology strategy for their departmentContributes to the value proposition development for technical projects and programsContributes to government proposal preparation and/or assist with project execution. May serve as technical lead in proposal preparation and/or owner of work package during project executionSupports building business relationships by presenting ideas and projects, participating in ideation events and acquiring resources and funding neededAssists in the identification of leading external partnerships, outside technologies and best practices to bring to EatonParticipates in external open innovation events with universities and research institutesDevelops as a subject matter expert through active participation in conferences, seminars and/or consortium meetings in relevant industry to network and stay current on topics in their fieldActively contributes to IP generation through authoring or co-authoring disclosures and patentsEffectively applies appropriate processes, system and tools (ex: DFSS)Mentor Jr staff and consult internal business and engineering customers Qualifications"}