{"jobID": "2687384072", "jobLocation": "Suitland_MD", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.pragmatics.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": " Req #: 6225 # of openings: 1 DescriptionWould you like to perform rewarding, mission-focused work while contributing to the success of an established, growing company?Pragmatics, Inc. is seeking a Data Scientist to join our growing intelligence community team and provide research, analysis, and production services to our customer in Suitland, Maryland. RESPONSIBILITIES:Research opportunities for data acquisition and new uses for existing data and collaborate within the IC to perform exploratory and targeted data analysesDiscover data sources and tools for creating advancedgeospatialproducts and demonstrating a proof of conceptof how these data can fulfill maritime intelligence gaps.Prepare, mine, and analyze structured, semi-structured, and unstructured data, and identify trends and patternsDesign and develop new, scalable tools, dashboards, and visualizations to enable users to consume and understand data more effectively and efficientlyIdentify data needs and proper methods for data gathering, extraction, integration, preparation, quality, and governance from internal and external sourcesEmploy a variety of programming languages, analytic techniques, and tools to develop statistical algorithms and models, machine learning, and visualizations for use in predictive and prescriptive modeling and proof of concept initiativesCreate positive customer relationships in order to gather input and feedback for addressing analytical issues and advanced reporting needsCollaborate with other analytic professionals to continuously build a broader and deeper data science and analytics capabilityAttend GEOINT-related conferences and meetings in order to gain insight and understanding of the latest military and civil sector GEOINT techniques and technologies under development. (minimum of three events per year, 5 days each, in Dayton, OH, San Diego, CA, and Denver, CO)Produce and present Briefings and Presentation Materials, Technical Memoranda, etcProvide exercise support/test and demonstration wrap-up reports with recommendations on utility of application to maritime analysis.Create operating procedure manuals for data acquisition, analysis and production methods.REQUIRED SKILLS:Bachelor’s Degree in a quantitative or technical field of study, such as Statistics, Mathematics, Computer Science, or Geospatial Information Systems3 years’ experience integrating data mining, conditioning, and analysis that includes the use of current data analysis software and methods3 years' experience in ESRI ArcGIS3 years’ experience in 1 or more of the following: MATLAB, SAS, SPSS,orHive3 years’ experience programming in Python, C++, R,or Interactive Data Language (IDL)1 year’s experience working with geospatial data or imagery data1 year’s experience working with database structures and query tools2 years’ experience in technical writing for analysis reportsDemonstrated problem solving skillsDemonstrated presentation skills for conferences, including but not limited to presenting at professional or academic conferencesCLEARANCE:Must have Active Top Secret Clearance with SCI access, US Citizenship is requiredCOMPANY OVERVIEW: Join an established and reliable mid-tier government contractor with a reputation for excellence.  For over 30 years, Pragmatics, Inc. has provided state-of-the-art technology services and solutions to the Federal Government. We have diverse contracts with both Defense/Intelligence Agencies and Federal/Civilian agencies.  We provide Software Engineering, Agile Business Intelligence and Analytics, Audio Visual and Learning Technologies, Cybersecurity, Systems Engineering, Independent Verification and Validation, IT Service Management, Program Management, and Transportation Solutions.  We have been externally appraised at SEI CMMI® Level 5 and are ISO 9001, ISO/IEC 27001, and ISO/IEC 20000-1 certified. Pragmatics strives to provide the highest level of customer satisfaction, as well as rewarding careers for our employees, who are hardworking, enthusiastic, and dedicated to superior performance. We encourage you to find out more about our company and our benefits at: www.pragmatics.com. Pragmatics is an Equal Opportunity Employer. Minorities, Women, Veterans and Disabled. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, or protected veteran status and will not be discriminated against on the basis of a disability. Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New Search"}