{"jobID": "2726169599", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Supervising Computer Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "185000", "jobDescription": "Information Sciences Institute (ISI), a unit of USC’s Viterbi School of Engineering, is a world leader in the research and development of advanced information processing, computing, and communications technologies. ISI operates one of the world’s largest academic high-performance computing clusters. ISI has three research campuses: one in Marina Del Rey, CA; one in Arlington, VA; and one in Waltham, MA. *This position is located in Arlington, VA.* Information Sciences Institute (ISI) seeks a Director level candidate for a Senior Supervising Computer Scientist position. The successful candidate must have a demonstrated success record in developing and executing strategic growth plans in the area of technical expertise related to microelectronics design, fabrication, and deployment to applications either for the U.S. government, or industry world-wide.  Within this technology area, the successful candidate will have the following overall responsibilities: Formulating and leading technology programs of national importance, and providing administrative and budgetary management of these programs.Overseeing technology areas in microelectronics, initiating relevant innovative programs of national importance by invoking technologists not only at USC’s ISI, but also across the U.S., and establishing research directions that will strengthen the U.S. microelectronic industry worldwide.Developing funding sources, and originating proposals for the purpose of obtaining funding to support leading-edge research on microelectronics products that have significant impact to both the U.S. government and commercial industry.Funding sources could be either from the U.S. government, or private (e.g., venture capital), or a combination of both.Applying relevant principles and concepts in planning, coordinating, and executing the companion research objectives including the potential management of technical developments in relevant research groups.Overseeing budget and/or finances and other administrative requirements for the research projects that he/she initiated, working closely with ISI’s other project leaders to maintain a careful accounting of finances to ensure that the projects’ budgets are maintained, and following up with funding sources to ensure funding and increments arrive on a timely basis.Serving as a resource for funding agencies, and/or other organizations, to provide requested or required financial information and reports; also, technical reports in matters of technological achievements in a given area.Reviewing and preparing relevant management reports for clients.Making presentations at conferences and to sponsors, participating in workshops and meetings, and collaborating in specific areas of microelectronics technology research and development.Also, representing the university, and/or one of its units, as assigned or appropriate.Preferred Qualifications:Minimum 15 years of experience in the field of microelectronics.Knowledge of microelectronics (design and fabrication) and demonstrated ability to network to establish microelectronics based consortia.More than 10 years as a Sr. member of an industrial enterprise on microelectronics.Specialized knowledge in some area of microelectronics design and fabrication, including working knowledge of engineering design automation (EDA) tools, and microelectronics foundry fabrication processes. Relevant presentations at conferences and written journal articles is a plus.Applicants selected for this position must be able to obtain and maintain a security clearance. The University of Southern California values diversity and is committed to equal opportunity in employment."}