{"jobID": "2679401176", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.snowflake.net", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Amazon, Google, Microsoft"}, "estimatedSalary": "130000", "jobDescription": "Snowflake started with a clear vision: make modern data warehousing effective, affordable, and accessible to all data users. Because traditional on-premises and cloud solutions struggle with this, Snowflake developed an innovative product with a new built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the elasticity of the cloud at a fraction of the cost of traditional solutions. Snowflake: Your data, no limits.In this role you will work closely with Product Managers, Analysts, and Engineers to help build data products that inform customers how to optimize their use of Snowflake. You will uncover insights about how customers use Snowflake. And you will work on research projects to help drive our long-run Product strategy.As a Data Scientist, you will: Sleuth through large amounts of data to uncover feature-usage patterns, potential performance enhancements, and areas to improve user experience.Build data products that help inform our customers how to optimize their use of Snowflake.Identify and build solutions for operational use casese.g., system monitoring and alerting, outlier detection, etc.Help design and execute experiments and A/B tests.Use data to make recommendations on how to improve our self-service experience.Think creatively to find optimal solutions to our complex, typically unstructured problems.Our Ideal Candidate will have:5+ years of experience working as a Data Scientist.3+ years of experience working with truly large-scale data.Advanced SQL skills.Strong written and verbal communication skills.Expert-level abilities building and deploying unsupervised, semi-supervised, and supervised models on large-scale data (in that order of importance).A fluidity with tools commonly used for data analysis such as Python (numpy, pandas, and scikit learn), R, and Spark (MLlib).Experience with time-series forecasting.Experience building and deploying production-grade models in a real-time setting.Experience with a compiled programming language, preferably something that runs on the JVM.Experience with MPP databases, such as Snowflake, Redshift, BigQuery, Vertica, etc.Familiarity with data visualization tools/frameworks as well as notebooks.A degree of comfort at the command line. That means a thorough understanding of basic file-system commands, as well as the ability to ssh into remote machines and troubleshoot without a GUI, grep through logs, and deploy scripts and applications.Familiarity with Git and/or SVN.The ability to thrive in a dynamic environment. That means being flexible and willing to jump in and do whatever it takes to be successful.Please show us what youve built by including a link to your Github profile.About SnowflakeSnowflake Computing, the cloud data warehousing company, has reinvented the data warehouse for the cloud and todays data. The Snowflake Elastic Data Warehouse is built from the cloud up with a patent-pending new architecture that delivers the power of data warehousing, the flexibility of big data platforms and the elasticity of the cloud at a fraction of the cost of traditional solutions. Snowflake can be found online at snowflake.net.Snowflake has been voted as one of the Bay Area Best Places to Work in 2015, 2016, and 2017. We are a place where people work effectively with the same values and vision. We focus on doing what is right for our customers, shareholders, and employees. We create great products, individually and as a team.Snowflake is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, gender identity or expression, marital status, national origin, disability, protected veteran status, race, religion, pregnancy, sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances."}