{"jobID": "2729441075", "jobLocation": "Washington_DC", "jobTitle": "Research Scientist, Informatics", "companyRating": "3.7", "companyInfo": {"Website": "www.ncqa.org", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 1990", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " The scientist will take a leadership role in advancing the strategic vision of building an innovative health IT ecosystem within NCQA oriented to increasing opportunities to improve the quality of the healthcare system. The researcher is expected to develop a feasible governance framework for expanding the existing quality infrastructure to collaborate on new health IT applications to support future business. The person will serve as the technical lead on the design, development, and implementation of this framework and enforce adherence to both the technical processes and standards used for its development. The position also requires maintaining current industry knowledge on the trends of technology as related to the architecture and will represent NCQA’s work to scientific and key stakeholder audiences as well as enhance NCQA’s reputation for leadership through public speaking, publications and the creation of strategic partnerships. The holder of this position must be able to work independently on multiple projects in coordination with other internal and external project team members. Responsibilities: Direct the development and execution of a governance framework creating a culture of electronic access and use of health IT data for quality measurement. Accelerate integration of performance measurement research into other NCQA products, lead measurement development teams and research grants with external partners. Support NCQA’s performance measure development activities focused on precision medicine and person-centered care. Serve as PI on innovative research projects examining the utility, feasibility of new concepts leveraging disruptive technologies with a high-impact on healthcare outcomes. Develop opportunities for funding the research agenda by developing formal relationships with outside organization and agencies. Conduct and provide guidance in the analysis of research and performance data in collaboration with peers in the Analysis department. Represent NCQA to scientific and stakeholder audiences. Enhance NCQA reputation for leadership in the area of health IT and public health informatics through public speaking, publications, etc.Requirements: Masters level degree in Public Health, healthcare informatics, health services research, clinical effectiveness research or equivalent discipline. Terminal degree in health informatics preferred. At least 10 years’ experience conducting health services research, quality measure development or HIT data standards development. Knowledge of research design, clinical operations, grant preparation and management.Ability to multitask, work efficiently, supervise and prioritize, make decisions and function with modest supervision.Working knowledge of statistical packages.Able to work as a team player. NCQA provides a super working environment including many great place to work initiatives, annual incentive program, and a host of benefits to include automatic employer contribution to 401 plan (no employee match required,) as well as holidays, paid time off, company paid life, short term and long term disability, as well as a rich health and dental program.  NCQA is a drug free workplace. NCQA recruits, hires, trains and promotes individuals, and administers any and all personnel actions, without regard to race, color, religion, national origin, age, sex, pregnancy, citizenship, familial status, disability status, veteran status, genetic information, or other protected statuses under applicable state and federal laws. "}