{"jobID": "2816420829", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Scientist, Revenue Forecasting & Analytics", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "155000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Facebook is seeking a highly quantitative, driven, and experienced Data Scientist for the Revenue Forecasting & Analytics (RFA) team. The RFA team is a uniquely data intensive part of Facebooks finance organization, and plays a crucial role in delivering key revenue insights to management. This position will focus on forecasting and analyzing revenue for the advertising business while partnering across Finance and product leadership. The role is highly cross-functional and partner facing, involving coordination across a number of groups within Facebook. This role will challenge the candidate to both understand and contribute to many facets of a rapidly growing business, including revenue forecasting, analytics, and strategic decision support.  Responsibilities will revolve around driving revenue planning, playing a leadership role in the coordination of the revenue forecasting process, developing actionable insights for the business, and influencing decision makers to enable revenue growth. This teams focus on analysis and data-driven decision-making allows us to work effectively with our colleagues in the rest of the business to optimize long-term financial growth. Successful candidates will have exceptional analytical skills, experience in owning relationships with cross-functional teams, bias toward action, exceptional partnering and communication skills, and the know how to balance getting the details right while still moving fast. Responsibilities:"}