{"jobID": "2706452361", "jobLocation": "Dallas_TX", "jobTitle": "Entry Level Environmental Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.woodplc.com", "Headquarters": "Aberdeen, United Kingdom", "Size": "10000+ employees", "Founded": " 1848", "Type": " Company - Public", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": " Wood Environment & Infrastructure Solutions is currently seeking an Entry Level Environmental Scientist in Dallas, TX. Key ResponsibilitiesThe position is anticipated to be approximately 25% office work and 75% field work on industrial, commercial and federal sitesWill work under the supervision of a Senior Environmental Scientist/EngineerOffice activities include analysis and interpretation of analytical results and data, assistance with the preparation of reports and technical memos associated with field sampling and property due diligenceField activities include monitoring and sampling activities to include; construction observation, conducting interviews with property owners/businesses, collecting groundwater, surface-water and sediment samples as well as documenting field activitiesWill be expected to thoroughly check permit applications, data tables and figuresWill do field mapping and map preparation and maintain spreadsheets/databases of chemical results and other data for projects, prepare charts, conduct routine scientific calculations and run computer programsWill follow company safety standards, participate in safety training and prepare and implement site safety plansWill travel to project sites primarily in Texas and occasionally in surrounding states. Anticipated overnight travel approximately 20%BS or MS in Environmental Science or related technical degree1 – 3 years + environmental or field experience40-hour HAZWOPER OSHA Training desiredAsbestos and/or lead-paint and mold certifications are a plusProficiency with MS Office products including MS Word and Excel; AutoCAD and GIS experience is a plusMust be a self-starter with good written and verbal communication skillsAttention to detail and strong time management capabilities requiredWill be required to lift equipment and carry laboratory samples/equipment which may weigh up to 40 poundsAbility and willingness to travel to project sites as needed - Estimated 20% overnight travelMust pass drug test, physical, background check and must have a satisfactory driving record in accordance with the Company's driving (MVR) policyPhysical Demands75% field work in outdoor environmentsWear personal protective gear as requiredRequires the ability to lift 40 pounds Wood is a global leader in the delivery of project, engineering and technical services to energy and industrial markets. We operate in more than 60 countries, employing around 55,000 people, with revenues of around $10 billion. We provide performance driven solutions throughout the asset life cycle, from concept to decommissioning across a broad range of industrial markets including the upstream, midstream and downstream oil & gas, power & process, environment and infrastructure, clean energy, mining, nuclear and general industrial sectors. We strive to be the best technical services company to work with, work for and invest in.  www.woodplc.com  We are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws."}