{"jobID": "2548312794", "jobLocation": "Troy_MI", "jobTitle": "Senior Software Engineer (SmartTest)", "companyRating": "3.6", "companyInfo": {"Website": "www.asg.com", "Headquarters": "Naples, FL", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "Software Engineer - Troy, MI (4319)ASG Technologies provides global organizations with a modern approach to Digital Transformation to succeed in the Information Economy. ASG is the only solutions provider for both Information Management and IT Systems.  Our Information Management solutions enable companies to find, understand, govern and deliver information of any kind, from any source through its lifecycle. Our IT Systems Management solutions empower companies to support traditional and modern infrastructure more efficiently and effectively. ASG is proud to serve more than 3,000 customers worldwide in 60 countries. We are driven by three key operating principles, Customers Matter, People Matter, Results Matter; if we do a good job by our customers and people, the results take care of themselves.ASG Technologies is currently searching for a Software Engineer for the Application Management Development Group. We are considering candidates near to our Rochester Hills, MI; Purchase, NY; Herndon, VA; or Arlington, TX offices.Seeking a z/OS savvy technical expert to help us in developing and maintaining our ESW/Smart software product family. The product family consists of an interactive debugger, file and data edit, performance monitor and dump analysis tools. These tools are used by application programmers that develop and maintain programs written in COBOL for z/OS and major z/OS subsystems (CICS/DB2/IMS).Essential Duties and Responsibilities:Primary responsibilities include requirements analysis, technical design and development activities of application programmer productivity products. Technical support and problem determination of field reported defects. Provide technical assistance to Customer Support staff.Education Level Desired and/or Experience:Software development experience with a vendor software product or complex software application written in z/OS assembler that exploits system level services.BS/BA in a technical field.z/OS General Skill Sets DesiredStrong assembler language and macro coding skillsWell versed in z/Architecture, system service and data related functionsExpertise in coding techniques (concurrency, recovery, cross memory, extended addressability)Excellent problem determination skills, including trouble shooting system dumps using IPCSKnowledge of the internal structure and operations of COBOL and LE run-time componentsExpertise in programmer productivity toolsOther high-level language programming experience is a plusCICS technical background and systems level programming experiencez/OS and subsystem Special Skill Sets DesiredApplied knowledge of dataspaces, use of coupling facility structures and XCFSRB/Enclave execution, scheduling work on zIIP processorsStrong assembler language and macro coding skillsApplied knowledge of IBM CICS TS; CICS Global and Task related exits, XPI programming"}