{"jobID": "2835022106", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist, Electrical Engineering", "companyRating": "3.5", "companyInfo": {"Website": "www.sri.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " SAIC, Leidos, Battelle"}, "estimatedSalary": "96000", "jobDescription": "Title Research Scientist, Electrical Engineering  02-Jul-2018 Job Description SRI International's Advanced Technology and Systems Division (ATSD) performs research across a wide range of disciplines, from novel materials development to mixed-signal integrated circuit (IC) design to implementation of advanced optical, radar, and imaging systems, transitioning technology from basic R&D; to fieldable prototypes.  Our SRI campus in Princeton, NJ has an immediate opening for a Research Scientist within ATSD, to support the growth of our activities in novel electronic materials and devices, and circuit and system design. The position will be part of a close-knit team of applied physicists and engineers working on leading-edge R&D; projects to realize proof-of-concept demonstrations for our government and commercial customers. The candidate will be involved in the detailed analysis, design, fabrication, and implementation of advanced devices for prototype systems. The activity will be very hands-on, operating over a variety of projects, primarily relating to national security.  The candidate must have strong technical knowledge in electronic materials and devices, mixed-signal electronic circuits, systems, and IC-design, advanced fabrication, physical measurements and instrumentation, as well as familiarity with common lab measurement equipment. The candidate should have hands-on laboratory experience, with mm-wave IC design and familiarity with RF and/or optics a plus. Skills should include:Strong technical knowledge of principles of electrical engineering, especially electronic materials and devicesExperience in analyzing, designing, and testing mixed-signal electronic circuitsKnowledge of electromagneticsFamiliarity with physical measurements and laboratory instrumentationPhysical and mechanical intuition The candidate should be able to contribute at the individual level, with expected guidance from more senior group members, with a goal to develop into a principal investigator of innovative R&D; proposals and programs. Auto req ID1856BRLocation(s) Princeton, NJ Other Requirements-U.S. Citizenship required., --Ability to transfer/obtain/maintain a U.S. government security clearance required. See http://www.dss.mil/psmo-i/ps_faqs.htmlEmployment Status Full Time QualificationsPhD in Electrical Engineering or Applied Physics. New graduates are welcome to apply, while industry experience is a plus.Additional Skills:Modeling and Computer Aided Design (CAD)Programming experience for analysis, simulation, and instrumentation (e.g. MATLAB, LabVIEW, C++, Python, Java)Character qualities:Self-motivatedDetail-orientedEffective in a laboratory environmentStrong written and verbal communications skillsAble to work in a team environmentMust possess a results-oriented approachAn interest in multiple technical areasEOE/AA SRI is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Background Check Candidates who receive a conditional offer of employment will be subject to a background check. "}