{"jobID": "2825142442", "jobLocation": "Summit_NJ", "jobTitle": "Scientist, Chemistry - NJ", "companyRating": null, "companyInfo": {"Website": "www.apexlifesciences.com", "Headquarters": "Glen Allen, VA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Scientist Chemistry - HPLC, GMP, method development Job Description:Responsible for assisting in method development, conducting method validation, performing laboratory research and/or routine sample analysis under minimal guidance of a supervisor. Responsibilities will include, but are not limited to, the following:  Assist to carry out method development, optimization and validation for the analysis of drug substances, and finished products in accordance with cGMP regulations, established protocols, and applicable SOPs. Performs troubleshooting within method guidance.Performs reference standard qualification/requalification tests.Performs release and stability testing in accordance with established methods, specifications and protocols with limited supervision.Documents laboratory work that is detailed, timely and in compliance with GLP/GMP requirements.Skills/Knowledge Required:Strong background in Dissolution method development and testing is a mustIn-depth knowledge of cGLP/GMP; applicable FDA and ICH guidances a mustFamiliar with USP and other compendiaWorking knowledge of Empower required.Must have working familiarity with cGMP practice and safety awareness for analytical laboratories.Key techniques needed:HPLC-Waters 2695 alliance, Agilent 1290 infinity IIUPLC- Acquity WATERS - H-ClassDissolution- Hanson, Distek, In line UV Agilent 708/850 dissolution, Pion Fiber OpticDisintegration: Disitest50KF Oven Coulometer-MetrohmKF-756 Coulometer- MetrohmEmpower III- to Generate dataUV/Vis-8454 Agilent For Immediate Consideration please email your resume to [Click Here to Email Your Resum] #LI-GR1 EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resum] or ************.  Job ID: ******  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.  Apex Life Sciences  On Assignment's U.S. life sciences businesses, Lab Support and Valesta Clinical Research Solutions, have been re-branded as Apex Life Sciences. The U.S. divisions of Lab Support and Valesta are leaders in the scientific, engineering, and clinical research staffing and services industry. The new name was chosen to leverage the national brand of On Assignment's Apex Systems, a leader in the technology staffing and services industry. For over 30 years, Lab Support and Valesta have provided top talent for contract, contract-to-hire, and direct hire positions in the life sciences industries. With hundreds of thousands of successful matches over three decades, the divisions have built reputations as the best in the business. Contact Info Summit, NJ"}