{"jobID": "2817785198", "jobLocation": "San_Francisco_CA", "jobTitle": "AP Manager", "companyRating": null, "companyInfo": {"Website": "www.veritasinvestments.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB SUMMARY The AP Manager develops, implements and maintains Accounting systems including Accounts Payable, Cash Flows in accordance with GAAP policies and procedures. Designs operational procedures and processes that meet audit standars and improve efficiency. Ensures integration of data produced into systems and supports objectives of financial analysis. Participates in long-term planning and implementation projects to ensure effective use of current and future technology. Select, develops, and evaluates personnel to ensure the efficient operation of the function. ESSENTIAL DUTIES & RESPONSIBILITIESEffectively manage of a team 5-8 AP Team, included Customer Vendor Relations, AP Disbursement, 1099 and tax related matters to ensure accuracy and timelinessCreate and implement effective and scalable internal controls for AP processes; assist in establishing other key internal controls in accordance with Sarbanes-Oxley 404 requirementsWork cross-departmentally to ensure compliance; work closely with Property Managers and Asset Team to promptly resolve payment issuesSelect and Hire new AP specialist; train and evaluate employees to enhance their performance, development, and work product. Motivate, reward, and address performance issues and recommend for personnel actions.Collaborate with Business Process Improvement Team, IT, Treasury and Operations to continually automate and improve process efficiencies within the accounting groupContinue to implement change document processes, and assist with the introduction and training of new procedures.Maintain vendor files, update vendor profile; responsible for 1099 filing and reportingMaintain files and documentation thoroughly and accurately, in accordance with company policy and accepted accounting practiceResponsible of providing supporting AP documentation for auditsResponsible for AP month end closing, produce reports as neededSKILLS AND ABILITIESOrganized, reliable, and responsiveStrong written and verbal communication skills with support personnel and managementAbility to adapt to fast-paced, startup environmentStrong Excel skills, PC skills and business solutions software skillsGood planning and organizational skills to balance and prioritize multiple demands and meeting deadlinesAbility to build and improves processes to increase efficiencyQUALIFICATIONSBA/BS degree in Business, Finance, or Accounting, or equivalent work experienceMinimum of 3-5 years of accounting and leadership experience in APExperience in high volume transactions, minimum of at least 2500-3000 a monthReal Estate AP and Yardi experience a plusExperience with GAAP, as well as 1099 filingWORKING CONDITIONS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.  While performing the duties of this job, the employee is regularly required to use office equipment such as computers and copiers, to use hands and fingers operate tools or controls, and reach with hands and arms. The employee is frequently required to stand, talk and hear. DISCLAIMER This job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job. "}