{"jobID": "2788265483", "jobLocation": "Skillman_NJ", "jobTitle": "Senior Scientist, Skin BioDelivery", "companyRating": null, "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": null, "jobDescription": "Johnson & Johnson Consumer Inc., a member of the Johnson & Johnson Family of Companies, is recruiting for a Senior Scientist, Skin BioDelivery to be located in Skillman, NJ.Johnson & Johnson Family of Companies touches more than a billion peoples lives each day through our health care products and services, our corporate giving, and the volunteer efforts of our employees. The Johnson & Johnson Family of Consumer Companies develop and market beloved brands that address the needs of consumers and health care professionals worldwide. Our portfolio ranges across several distinct business units: Baby Care, Oral Care, Compromised Skin Care, Beauty, Feminine Care, and OTC products.The Skin Biology & BioDelivery team is an upstream Discovery and Enabling Programs team within the Global Skin Care Innovation Platforms group. The team is charged with identifying novel biological targets and breakthrough technologies to provide skin care benefits, evaluating cell signaling mechanisms in order to understand MOAs for key technologies and developing innovative in-vitro models and assays to assess the functional benefits of technologies and product propositions for skin care benefits.You will:Provide comprehensive guidance to cross-functional partners regarding the physicochemical and formulation based considerations/limitations to skin penetration in order to assess the topical bioavailability of actives in topical formulations and/or discover/develop, validate, and de-risk new topical delivery systems.Lead multiple projects, collaborating internally and externally to conduct skin penetration testing to evaluate treatment effects on skin disposition.Quantify skin biomarkers in tape-stripped or swabbed skin samples collected during clinical studies using appropriate collection and measurement methods to assess product efficacy.Conduct independent projects within a multifunctional environment.Work collaboratively internally with cross-functional partners across the R&D; organization, and also externally with academic institutions, contract laboratories or material suppliers.Present data to internal cross-functional teams and have the opportunity to present at scientific meetings and publish in peer-reviewed scientific journals.Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer.QualificationsA minimum of a Ph.D. degree in Pharmaceutical Science or related discipline with 0-2 years of industry or academic experience OR a Master degree with 3+ years of experience OR a BS with 5+ years of experience is requiredExpertise in topical/transdermal drug delivery and hands-on experience with skin penetration testing using Franz diffusion cells is requiredProven working knowledge of skin biology/biochemistry pathways and hands-on experience in current techniques including in-vitro assays and models is strongly preferredExperience in statistical analysis of experimental data is requiredAbility to independently manage complex technical projects is requiredAbility to partner with cross functional teams within a research and development environment is requiredAbility to apply organizational understanding, as well as participate in decision-making in collaboration with others is requiredAbility to build and deliver technical presentations to both technical and nontechnical business audiences is requiredProfessional scholarly activity (e.g. conference presentations, peer-reviewed publications, patents, etc.), and prior industrial or post-doctoral experience is strongly preferredUp to 10% domestic travel is requiredPrimary Location United States-New Jersey-Skillman Organization J & J Consumer Inc. (6101) Job FunctionR&D;Requisition ID1164180510"}