{"jobID": "2815784563", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Manufacturing Engineer", "companyRating": "2.6", "companyInfo": {"Website": "www.challenge-mfg.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " Manufacturing Engineer is responsible for developing and implementing optimal, cost-effective manufacturing processes and methods in accordance with product specifications and quality standards. Recommends and implements improvements to production processes, methods and controls. Coordinates manufacturing launch for new or revised products. Priorities include process improvement, problem resolution, project management and employee training. RESPONSIBILITIES AND RESULTS:Performs research, design and development of manufacturing processes, including production flow, assembly methods and production equipment.Prepares and maintains detailed layouts of buildings and equipment.Coordinates the manufacturing launch of new/revised products, including establishing goals, training team members and evaluating results.Designs, develops, tests or sources and cost-justifies various tools, machinery and equipment for recommended manufacturing methods.Creates and maintains job elements sheets and standard work sheets.Performs product/process analysis for cost reduction, quality improvement and efficiency improvement.Represents manufacturing on cross-functional teams.Leads and supports lean manufacturing initiatives; including, cost reductions and productivity improvements.SKILLS AND KNOWLEDGE:Process improvement skillsThroughputQualityMaterial flowsOperator utilizationLean manufacturing knowledgeExhibits problem solving & trouble shooting skillsProduct dimensional data analysis skillsGD&T; knowledgeInterpersonal skills to work with othersBEHAVIORAL REQUIREMENTS:Has high standards of performance for self.Takes responsibility for actions, results, and mistakes.Is thorough, accurate, and reliable when performing and completing job tasks; demonstrates honesty and integrity in all aspects of work.Takes positive action to objectively resolve conflict by listening, staying focused on issue to find resolution, and monitoring progress.Maintains positive relationships by constructively resolving conflicts.Uses feedback from others to continuously improve performance and work relationships.Moves within own and/or other work areas (flexes) to support plant flow.Works with sense of urgency to meet needs of customers.Has necessary experience, skills, and knowledge to perform all aspects of job; rotates through all job responsibilities.Maintains knowledge and skills to perform job effectively.Has ability to focus on benefits of change and see it as positive; approaches change or newness in constructive/objective manner; views change as learning opportunity.Looks for good in others; works collaboratively with others; shares information and knowledge.Is at work when scheduled and ensures coverage when absent; takes timely breaks/lunches; uses time wisely.WORK ENVIRONMENT / PHYSICAL DEMANDS:Depending on the support role, work environment can be from office to full production environment. See employee hand book for physical demands.REQUIRED EDUCATION AND EXPERIENCE:B.S degree from a four-year college or university in Engineering (Mechanical, Electrical, Industrial, etc) or equilvent experience and demonstrated knowledge of: o Automated assembly experience o Cell layout experience o MS Office experience o BIW product understanding & experience o Sheet metal fabrication and assembly experience o AutoCad experience o ERP (Plexus preferred) experience Other Duties:Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}