{"jobID": "2480113858", "jobLocation": "Richardson_TX", "jobTitle": "Data Analyst (Data Analytics & BI)", "companyRating": null, "companyInfo": {"Website": "www.realpage.com", "Headquarters": "Richardson, TX", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (RP) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Yardi Systems"}, "estimatedSalary": null, "jobDescription": "The Data Analyst (Data Analytics & BI) is responsible for the complete Product Development lifecycle for the Investment Analytics Portfolio products. You will be responsible for gathering and distillation into clear concise business and technical requirements  documentation, functional and technical design specifications and to manage the build of product, features, enhancements, releases and support issues through concept, design, development, testing, deployment and support. The role is responsible for the quality  launch and support of all technical applications in the Investment Analytics portfolio. Proficiency in web based technology solutions, web architecture, web -hosted (SAAS) software and web technology and database design are required. Business Analyst will  work independently to gather, distill and write detailed product business requirements documentation, and design specifications. The business analyst will be responsible for leading and documenting the project through all phases of the product development  lifecycle, including writing user stories, use cases, technical and work flows, data diagrams, trouble ticketing and root cause of issues.  Ideal candidates will have experience as an Analyst on data analytics projects, data flow documentation and ETL.  Technology experience in web based applications, SAAS applications, database design, and technical documentation and data flow diagraming are essential. The business analyst will also create technical documentation for test cases, use cases and UI mockups,  track progress, trouble tickets and manage multiple release schedules while coordinating different phases of multiple projects. A working knowledge of the Real Estate industry, Rental and Revenue Management of Multifamily properties specifically, is a plus. What you will do:Develop high-quality design documents within a scheduled timeframeGather requirements from both internal and external subject matter experts.Assist with identifying and solving design flaws and issuesParticipate in design sessions, contributing to the overall design of new products and product enhancementsOrganize, participate, and conduct internal product demonstrationsManage and track product issues and enhancements using the internal tracking system and departmental proceduresCreate and submit weekly status reports to management.Identify, recommend and participate in process improvement initiativesBuild and maintain positive relationships with customers and internal team membersManage tasks to meet the assigned project timelines and milestonesParticipate in product testing and certification activitiesAssist in daily management of support issues escalated to product team.Work with business consultants to understand and capture business requirementsPerform statistical data analysis and build forecasting and optimization modelsCommunicate the results efficiently to both technical and non-technical audiencesDirect and verify implementation of mathematical proceduresSupport customers with business and/or technical questions What we think it takes to do the job: College degree or equivalent experience.Minimum 5 years experience in performing business process analysis and/or product management or developmentSome multi-family real estate experience is a plus #LI-JL1"}