{"jobID": "2831498537", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Account Executive, Enterprise", "companyRating": null, "companyInfo": {"Website": "www.appannie.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " App Annie helps people build amazing app businesses. We are looking for a highly motivated and flexible Senior Account Executive to join our rapidly growing company. What you can tell your friends when they ask you what you do? You will be responsible for selling our premium product to companies in the media & entertainment, e-commerce, travel and retail industries. The role is based out of our San Francisco office and travel will be required. How will you be doing this?Net new logo acquisition of top tiered Enterprise CustomersDevelop and maintain a substantial pipeline of qualified opportunities together with your assigned Inside Sales Representative, and consistently maintain an accurate forecastBecome an expert at presenting how our product suite can help a company create winning strategies for the app marketBe responsible for managing the entire sales process from prospecting to close in your assigned territory (including but not limited to email campaigns, cold calling, networking, events, etc...)Collaborate with internal and external stakeholders to manage complex sales opportunitiesUpdate and create sales proposals and reports as requiredWhat will you bring to the team?5+ years of experience in enterprise software sales or selling data analytics toolsNet new business (Hunter) experienceConsistent quarter over quarter track-record of quota attainmentA keenly developed competitive natureThe technical aptitude to master our productsSuperior communication skills, incredible writing skills and the ability to capture an audience during a presentationExcellent consultative selling skillsAccurate forecasting and pipeline management skillsTons of energy, passion, humor and enthusiasmA thorough understanding of the app ecosystem is highly desiredExperience with selling to the media & entertainment, e-commerce, travel, gaming, retail industries is a plusProficiency with Salesforce, Google Docs, MS Office and Mac OS suite such as Mail, Word, ExcelAuthorization to work in the U.S. without visa sponsorshipWhat do we offer?Competitive compensation.All the tech tools you need to succeed: a new smartphone and Mac laptop.Catered lunches Monday through Thursday, snacks, fruit, good coffee and other stuff to help you get through the day.A 401(K) plan to help you plan for your future.Great health, dental and vision insurance packages to fit your needs to ensure youre happy and healthy.A yearly fitness stipend that will keep you up and moving.Commuter benefits that make getting to and from work a breeze.Employee referral bonuses so youll get the opportunity to work with friends (and get some extra cash in your pocket!).About App Annie App Annie delivers the most trusted app market data and insights for your business to succeed in the global app economy. Over 1 million registered members rely on App Annie to better understand the app market, their businesses and the opportunities around them. The company is headquartered in San Francisco with 450 employees across 15 global offices. App Annie has received $157 million in financing, including from investors such as Sequoia Capital, Institutional Venture Partners, IDG Capital Partners, e.ventures, Greenspring Associates, and Greycroft Partners. Yes, I want this job!"}