{"jobID": "2827169283", "jobLocation": "Union_Beach_NJ", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.iff.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 1889", "Type": " Company - Public (IFF) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Givaudan, Firmenich, Symrise"}, "estimatedSalary": "70000", "jobDescription": " We are IFF. We are the catalyst for discoveries that spark the senses and transform the everyday. International Flavors&Fragrances; Inc. is a leading innovator of sensorial experiences that move the world. At the heart of our company, we are fueled by a sense of discovery, constantly asking \"what if?\" That passion for exploration drives us to co-create unique scents and tastes in fine fragrances and beauty, detergents and household goods, as well as beloved foods and beverages.  Our 7,300 team members globally take advantage of leading consumer insights, research and development, creative expertise, and customer intimacy to develop differentiated products.  Dreamers and doers, we work tirelessly to discover flavors and fragrances that inspire customers and delight consumers. We are fueled by our four corporate values of passion, creativity, expertise and empowerment. It is the unique blend of these values that make us IFF. These qualities can be seen and felt throughout our amazing 129 year history and will continue to guide us as we explore our limitless possibilities and develop new-to-world solutions that enhance the lives of millions around the globe.  Please view our careers video at IFF Career Video- Great things are happening here The History of IFF: The History of IFF Follow us on social media: LinkedIn Facebook  Data Analyst is an execution focused on current initiatives and willing to learn and dabble in different technologies to move the organizational data management and analytics capabilities forward. As the organization is moving towards becoming a leading digital organization, data and analytics are key capabilities that provides insights and decision making. The successful candidate will allow us to analyze our data and help turn it into information then insight and finally into business decisions. As a Data analyst your responsibilities will include conducting full lifecycle analysis to include requirements, activities and design. You will also monitor performance and quality control plans to identify improvements. Interpret data, analyze results using statistical and modern data science techniques and provide ongoing reports.Develop and help implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and qualityAcquire data from primary or secondary data sources and maintain databases/data systems.Identify, analyze, and interpret trends or patterns in complex data sets.Filter and \"clean\" data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems.Work with management to prioritize business and information needs. Locate and define new process improvement opportunities.Work with the BI/Advanced Analytics teams on delivering Insights platform with Machine Learning, Artificial Intelligence, Forecasting, Advanced Search, Statistical Modeling capabilities, etc.Work with Application teams to build data capabilitiesRequired SkillsKnowledge of and experience with reporting packages, databases (SQL etc), programming (XML, Javascript, and/or ETL frameworks).Good understanding of AI and Machine Learning and packages in python or R for advanced analytics.Understanding of Big Data (Hadoop, Hive, etc.) and knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc).Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy. Adept at queries, report writing and presenting findings.Minimum BS in Mathematics, Economics, Computer Science, Information Management or Statistics. Good understanding of Chemistry, Biology or modeling in any of these fields is a plusKnowledge of hierarchical databases/graph databasesExperience extracting data or interconnecting with SAP would be a plus."}