{"jobID": "2682445123", "jobLocation": "Long_Beach_CA", "jobTitle": "Data Analyst - IAH", "companyRating": "3.8", "companyInfo": {"Website": "www.scanhealthplan.com", "Headquarters": "Long Beach, CA", "Size": "501 to 1000 employees", "Founded": " 1977", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Requisition Number 18-0079 Post Date 3/5/2018 Title Data Analyst - IAH Department Independence At Home City Long Beach State CA DescriptionData Analyst – IAHLong Beach, CAFull TimeAbout SCAN Our mission is simple: Keeping Seniors Healthy and Independent–that’s been our mission for almost 40 years. Rated as one of the top Medicare Advantage plans in California, SCAN Health Plan employees are passionate about what they do. Understanding that success  is based on achieving the mission, SCAN employees are afforded with the training and tools necessary to do their jobs and they are rewarded for their efforts and recognized as experts in their fields. Ask anyone who works here and we’ll proudly tell you that  SCAN’s commitment has never wavered. We are as steadfast in our pledge to help our members live healthy and independent lives. The job Support organizational and departmental decision-making by leveraging software to extract, link and organize data then analyzing the organizational data, organizing findings into concise understandable presentations, and effectively communicating results  to management. You willManages and coordinates software data collection related to IAH programs.Constructs and analyzes queries and reports to further program success.Supports operational needs by performing analyses on a wide range of organizational data.Interprets data in order to identify trends and measure outcomes of programs.Conducts data analysis on subsets of populations served and identification of areas for improvement.Generates and coordinates IAH-related reports for management and regulatory agencies.Translates business requests for data into accurate reports.Manages multiple projects by effectively prioritizing work and communicating workload issues to management.Achieves high-quality deliverables by assuring accuracy and thoroughness in executing projects.Develops and maintains up-to-date knowledge of the data warehouse and other organizational data sources.Maintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; participating in professional societies.Adheres to all quality, compliance and regulatory standards to achieve outcomes.Actively supports the achievement of SCAN and IAH’s Vision and Goals.Contributes to team effort by accomplishing related results as needed. RequirementsYour qualificationsBachelor’s Degree or equivalent experience, required.1 year of proven analysis experience preferred.Strong analytical skills required.Ability to effectively interact with, and present findings to, customers at various levels of the organization.Experience with managed care contract terms/analysis a plus.Ability to document processes and analyses for reference required.Expert skills in MS Office productivity software especially MS Excel and Access.Excellent technical, interpersonal, written and oral communication skills required.Preferred QualificationsExperience with Microsoft SQL and Visual Studio is preferred.Analysis experience in healthcare/managed care highly preferred.Experience with Microsoft Business Intelligence (BI) products a plus.What's in it for you?A competitive compensation and benefits programAn annual employee bonus programRobust Wellness ProgramGenerous paid-time-off (PTO)Ten paid holidays per yearExcellent 403(b) Saving Plan, providing up to 4 % match and vesting after three yearsCasual attireRobust employee recognition programTuition reimbursementA Work - life balance and much more! We're always looking for talented people to join our team! Qualified applicants are encouraged to apply now!SCAN is an Equal Opportunity Employer: Minority/female/disability/veteran.  It is our policy to abide by all federal, state and local laws prohibiting employment discrimination and all qualified applicants will receive consideration for employment. SCAN will not discharge or in any other manner discriminate against employees or applicants  because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions  cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding,  hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. Please view Equal Employment Opportunity Posters provided by OFCCP  here."}