{"jobID": "2749108196", "jobLocation": "Chicago_IL", "jobTitle": "Client Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.tsico.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "TSI, is a leading supplier of specialized business process outsourcing (BPO) services that are delivered in our call centers through a diverse workforce across North America supporting clients in multiple vertical markets comprised of banks, energy and utility companies, health care providers, universities, and government organizations. We support the entire customer lifecycle that includes customer acquisition, full loan servicing, delinquency management, and collections utilizing a combination of voice, chat, email, SMS, and interactive voice messaging channels. As a result, employees enjoy the opportunity to grow, develop and build long-term careers in exciting industries, supporting the best brands in business, all while earning tenure with a specialty BPO leader. TSI represents a new company name, but one with over 40 years of experience and success serving these markets. Job Description: The Client Data Analyst role on is responsible for assuring TSI-UAS clients receive exceptional customer service in a timely and professional manner. Responsibilities:Provide account management support to members of the client service teamManage outgoing and incoming communications with clientsAnswer, triage and follow up on client research requestsFacilitate and manage client interactions and assist clients with analytic tool questions and navigationAssist clients with website registration and navigationCreate and analyze client utilization reportingDocument client interactions via Customer Relationship Management (CRM) system; assume responsibility for CRM system data integrity and qualityBecome a CRM system “super-user”; assist fellow client service team members in appropriately utilizing its functionalityQualifications:Advanced Microsoft Excel experienceStrong experience with Microsoft SuiteExperience working with external customersSuperior communication skillsAbility to collaborate and work well in a team atmosphereAnalytical and problem solving skillsStrong organizational skills We provide Equal Employment Opportunity for all individuals regardless of race, color, religion, gender, age, national origin, marital status, sexual orientation, status as a protected veteran, genetic information, status as a qualified individual with a disability and any other basis protected by federal, state or local laws."}