{"jobID": "2786922790", "jobLocation": "Detroit_MI", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.dynatrace.com", "Headquarters": "Waltham, MA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "As a Data Scientist, you will work with a team of like-minded people as you actively shape our Digital Transformation initiative. This focus area will allow you to innovate very rapidly and be able to apply statistics, machine learning and big data analytics to create successful digital services. We use state-of-the-art technologies and place great emphasis on software architecture & quality.Qualifications Experience with Big Data, Data Analysis and StatisticsExperience with Machine Learning models for prediction, classification and clusteringProgramming skills in a high level language (e.g. Java, C++ or Python)Big Plus: Experience with Predictive Analytics, Pattern Recognition, Natural Language Processing and Deep Machine learningBachelors degree in Computer Science, Mathematics or related fieldDynatrace has redefined how you monitor todays digital ecosystems. AI-powered, full stack and completely automated, its the only solution that provides answers, not just data, based on deep insight into every user, every transaction, across every application. The worlds leading brands, including, 72 of the Fortune 100, trust Dynatrace to optimize customer experiences, innovate faster and modernize IT operations with absolute confidence.We offer competitive compensation, company-sponsored premium benefits, medical, dental, vacation/holidays, company matching 401(k) Plan, etc. Dynatrace is an equal opportunity employer and VEVRAA Federal Contractor. We consider all qualified applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law. If your disability makes it difficult for you to use this site, please contact recruiting@dynatrace.com. Dynatrace participates in E-Verify, participant information in English and Spanish. Right to work information in English and Spanish. EEO is the Law/EEO is the Law Supplement.Note to Recruiters and Placement Agencies: Dynatrace LLC (Dynatrace) does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Dynatrace employee. Dynatrace will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Dynatrace."}