{"jobID": "2826809290", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.kongsbergmaritime.com", "Headquarters": "Kongsberg, Norway", "Size": "1001 to 5000 employees", "Founded": " 1950", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " KONGSBERG makes solutions that enable people around the world to deliver extreme performance under extreme conditions. Today we are a world leader in several areas within the maritime, defense, aerospace, and oil and gas industries. Our strength is building centers of expertise around products, technologies and market needs. Want to be part of our advanced analytics team? Kongsberg Digital, Inc (KDI) is a provider of next generation software and digital solutions to customers within the maritime, oil & gas, and renewables & utilities industries. The company consists of more than 500 experts with industry leading competence within internet of things, smart data, artificial intelligence, automation and autonomous operations. In addition, Kongsberg Digital is the group-wide center of digital expertise for KONGSBERG.  We are in need of a Data Scientist to join our dynamic team. The ideal candidate will be responsible for running analytical experiments in a methodical manner, evaluating alternate models via theoretical approaches, and communicating results to internal and external stake holders. What's in it for you: You will be working on the group’s machine learning and analytics efforts – responsible for testing methodologies, tools and library development, data driven projects, cloud and platform analytics. This includes: Research and develop statistical and machine learning models for data analysis Build and implement algorithms and code to support KDI’s product portfolio, customer projects and business opportunitiesPartner with business leads to provide guidance and best practice on how customer data can be transformed into actionable items and return valueClosely interact with various product teams to support data and machine learning projects, bridging business and engineering effortsCommunicate results and ideas to key decision makersKeep up-to-date with latest technology trends in machine learning and A.IWhat do we expect:Masters/PhD degree in Applied Math, Statistics, Physics, Computer Science or EngineeringExperience level: 2-5 years of relevant experienceProficient knowledge of machine learning techniques, data analytics, statistics and numerical methodsCoding skills in Python. Familiar with machine learning toolkits such as TensorFlow, Keras, Scikit-learn etc.Ability to interpret high-level business objectives into a strategySelf-initiated learner, positive attitude, flexible and willing to adapt to changing situationsWhat do we offer:An interesting position within a dynamic and innovative high tech company.Career opportunities and personal development.Competitive compensation package.Great corporate culture within Kongsberg.An exciting journey.Supporting documents for your application:Optional: Link to GitHub account, relevant Python notebook or Kaggle competition, blog etc.Location:\u2028Houston, Texas, USA Application deadline:\u2028ASAP Expected Start Date:\u2028ASAP Contacts: HR, Houston Company homepage:\u2028http://www.kongsberg.com[KNM1]Is this ok to put here, Debbie? In Norway, the attractive Data Scientists are hard to get hold of, so we want to make it easy for them to apply (and we want to seem fleksible and modern Print  Send applicationShare on: LinkedIn  Facebook  Twitter  Google+  Pinterest  EmailJob type: RegularWorking hours: Full-timeWorking days: DayApplication deadline: 07/25/2018Expected Start Date: ASAPLocation: Houston, TXContacts: Debbie Suchoff  Telephone: +1 713-808-6775Company homepage: http://www.kongsberg.com"}