{"jobID": "2744125890", "jobLocation": "Dallas_TX", "jobTitle": "ISIP Data Analyst Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.istation.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Istation is a leading developer and publisher of educational software for prekindergarten through 8th grade students and educators. Istation’s interactive, internet- and web-based instructional programs include computer-adaptive assessments and intervention programs in the areas of reading, math, Spanish, and interdisciplinary studies, and they are currently being used in 40 states and seven countries.  We are looking for a passionate ISIP™ Engineer, better known as an Assessment Data Analyst. Ideal candidates will have a strong academic background as well as technical skills in applied statistics, machine learning, data mining, and software development. Familiarity with big data techniques and working with large-scale data sets would be a plus. The successful candidate will primarily write programs that will turn data into information, information into insight, and insight into client business communication. This role requires a highly skilled, highly analytical programmer with a knack for analysis, math, and statistics. Critical thinking, problem-solving skills, and a passion for machine learning and research are essential for this role.  The role is perfect for you if you are someone who works well independently and in a team and you have very strong programming experience, advanced analytics, drive, curiosity, and exceptional communication skills. Although you may be primarily writing programs, you know how to rise above the numbers and explain the essential insights to the general business user. While you rely on data to prove your point, you love to think outside the box and solve problems creatively. You have the ability to thrive in a fast-paced, entrepreneurial environment.  As part of this role, you will be encouraged and expected to keep your advanced-analytics skills sharp and current. You will have the opportunity to work the full development life cycle of putting analytics solutions into production. Position DetailsFull-time position at our Dallas-based corporate officeReports to Senior VP of Development & Tech ResearchRequires job assessment, background, and reference checkBenefits include: base salarycompetitive group health plan options401(k) with company matchbuilding amenitiesMain Duties and ResponsibilitiesWrite and maintain algorithms and complete programs for computer-adaptive and other assessments in a scrum-based environment.Develop and implement programs, data collection systems, data analytics, and other strategies that optimize statistical efficiency and quality.Identify valuable data sources and undertake preprocessing of structured and unstructured data.Interpret data, analyze results using statistical techniques, and provide ongoing reports.Write programs to make data extraction and analysis easier and more accessible to non-programmer experts.Filter data by reviewing logs and performance indicators to locate and correct code problems.Work within existing programs and frameworks to improve results without sacrificing reliability or overtaxing testing resources.Troubleshoot data-related problems and authorize maintenance or modifications.Present information using data visualization techniques and create programs to make such features available.Perform other duties as assigned.Required SkillsBe detail-oriented with strong analytical and organizational skills.Be able to think analytically about possible impacts to operational business costs.Possess an aptitude for high-level efficiency.Have a proven track record of success with a strong work ethic and self-discipline.Possess strong listening skills with the ability to diagnose issues and provide solutions.Be able to learn independently, conduct research, synthesize, and apply information from a variety of resources.Have strong quantitative and qualitative skills.Demonstrate excellent oral and written communication skills.Effectively manage information and monitor tasks to identify, analyze, and solve problems.Take initiative and meet deadlines.Be punctual and reliable.Be flexible, tolerate stress, and work well independently and with and within diverse teamsHave strong digital skills and aptitude, including proficiency with computers and basic applications software including Concur, Microsoft Office, and Google Mail.Have strong time-management and organizational skills with a proven ability to handle and follow through on multiple tasks or projects.Required Experiencestrong knowledge of and experience with business intelligence, reporting packages to include databases (SQL, etc.), and OO programming (Java or CSharp; C++ a plus)knowledge of statistics and experience using Excelexperience with statistical packages for analyzing datasets preferred (SPSS, R, BILOG, etc)strong math skills (e.g., statistics, algebra, etc.)adept at queries, report writing, and presenting findingsanalytical mind, problem solving aptitude, and business acumenexcellent communication, collaboration, and presentation skillsbachelor’s degree in computer science, engineering, information management, statistics, quantitative analysis, or other relevant field Job Location  Dallas, US-TX "}