{"jobID": "2733468243", "jobLocation": "Okemos_MI", "jobTitle": "Digital Marketing Intern", "companyRating": "3.6", "companyInfo": {"Website": "www.techsmith.com", "Headquarters": "Okemos, MI", "Size": "201 to 500 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "37000", "jobDescription": "Why You’ll Love Working Here: Working at TechSmith gives you a chance to hone your skills in an open, collaborative, and innovative environment where you can be excited to come into work every single day.  We are a technological melting pot comprised of nearly 250 uniquely skilled human beings that will continue to stretch your comfort zone—but in a good way. And speaking of comfort, who doesn’t love to show up to work in jeans, eat free snacks, and drink free pop?  With great products and great people behind them, we are always looking for passionate, fun, and hardworking individuals who truly enjoy coming to work and doing what they love. Sounds like you? We’d love to chat. Position Overview: The Digital Marketing intern will work within the TechSmith marketing department to understand and execute upon digital marketing strategies that drive ecommerce activity and growth. This position will be exposed to several facets of Digital Marketing with the opportunity to make valuable contributions to our digital marketing workflows.  This role will include email production, organic search research and optimization, digital advertising via search and social channels, as well as website content updates. This role will also have the opportunity to analyze data to guide future decisions and digital campaigns. Responsibilities:Learn and follow TechSmith brand guidelines to ensure all content and creative is aligned to the brandUpdate email content and creative within existing email templates and load it into our email marketing platform for distributionDevelop email, advertising, or web content as neededPull monthly email data for tracking and reportingReview and assign new leads to email nurture seriesUpdate purchaser lists for Google Display Network and Facebook advertising on a weekly basisPerform initial research on advertising opportunities to understand cost and coordinate next stepsSubmit trademark infringements on a monthly basis to Google, Bing, and FacebookResearch keyword terms for SEO optimization across TechSmith’s digital propertiesUpdate website and landing page content to support strategic initiativesReview website analytics to understand attribution and impact of each digital marketing tacticActively participate in digital marketing and ecommerce strategy brainstorming meetingsOther duties as assignedRequired Skills and Background:Background or experience in Digital Marketing preferred (which could include either email production, paid search, social advertising, website optimization, or e-commerce)Ability to communicate effectively and collaborate in a team environmentComfortable working in a fast-paced environmentRequires at least 15 hours per week, maximum of 28 hours per weekYou must be legally authorized to work in the United StatesYou must be enrolled full-time in classes in order to be considered for an internship with TechSmith CorporationPreferred Skills:Ability to understand and code basic HTML as it relates to emails or web updatesFamiliarity with Google Analytics or Google AdWordsDetail oriented with an eye for creative designFamiliarity with Excel and pivot tablesExperience working within a CMSCompensation and Perks: Competitive pay based on skills and experience. This is an hourly position with TechSmith Corporation. Hours are based on a consensus between you and your supervisor. We require a minimum of 15 hours per week, however hours are limited to 28 hours per week."}