{"jobID": "2828611146", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.volkswagengroupamerica.com", "Headquarters": "Herndon, VA", "Size": "1001 to 5000 employees", "Founded": " 1955", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Ford Motor Company, General Motors, Toyota North America"}, "estimatedSalary": "102000", "jobDescription": "VW. Two letters. Endless opportunities. A bright future. The Volkswagen Group is one of the world's largest producers of passenger cars and Europe's largest automaker and is on the road to number one. Come join our team and you could be part of that ride. For our employees, Volkswagen stands for more than just efficient and sustainable products - it’s an expression of who they are and how they move through life. Become a part of the Volkswagen of America experience and work with people who are passionate, innovative, enthusiastic, and high performing team players. Everyone deserves a better car and everyone deserves a better company - it’s a Volkswagen thing.Job SummaryProduct Support is the primary quality liaison group between the factories and Volkswagen of America. The primary role of the Data Scientist position is to identify quality trends in warranty data using text mining software and create data models using analytics software. Additionally, the Data Scientist will be responsible for developing databases, monitoring/improving work processes, and creating visual dashboards. Job ResponsibilitiesField Monitoring (70>)Develop/maintain Python-based text mining/data analysis tool to identify and prioritize top warranty concerns in the market Identify, track and report long term quality topics for older model year vehicles Create and incorporate predictive analytics/data modeling to improve data understanding and reduce cost Monitor and alert Product Support of new, emerging topics when trend is identified Track effectiveness of factory corrective actions introduced into production and service repairs Continuous Improvement (20>)Create and implement new tools, reports and visual dashboards to improve vehicle quality, reduce engineer workload, and improve data understanding Identify methods for improving work processes within Product Support Create new and maintain/improve existing Microsoft Access databasesCollaboration (10>)Work closely with other Product Support Data Scientist to create synergies within group and grow data analytics Collaborate with quality teams within NAR to improve processes and generate consistent data output Support the creation of presentations and reports within Technical ServiceQualificationsRequired Experience5 years professional experience with data analysis experience preferred1 year Python programming experienceRequired DegreeBachelor degree in Information Technology, Computer Science, Data Analytics, Data Science, Statistics, or a related fieldDesired DegreeMaster's degree in related fieldRequired SkillsDemonstrated IT/Systems/Database background Strong analytical skills High self-organizing skills Strong proficiency with the Microsoft Office Suite Excellent interpersonal and communication skills Ability to understand and communicate trends in large amounts of data Proficiency in MS Access Ability to apply statistical methods to convert data and trends into actionable information Python programming knowledgeDesired SkillsAutomotive technical knowledge/experience Working knowledge of automotive warranty systems and processes Proficiency with data extraction tools such as SQL, Business Objects, Cognos, etc.Work FlexibilityDomestic and international travel required – approximately 5>We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing.#LI-VR1"}