{"jobID": "2822092161", "jobLocation": "San_Bruno_CA", "jobTitle": "Lead Data Analyst (AB testing/ Optimization)", "companyRating": "3.6", "companyInfo": {"Website": "www.redolentech.com", "Headquarters": "Newark, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " We have following urgent role with our DIRECT client TITLE: Lead Data Analyst (AB Testing/ Optimization) LOCATION: San Bruno, CA  DURATION: 6+ months ( high possibility of Contract to hire)  Compensation: Competitive ( DOE ) Job Description:Lead planning and execution of campaign and channel measurement, across all walmart publisher channels (e.g. walmart, jet, grocery.)Lead Multivariate and A/B testing as an ongoing discipline to constantly improve campaign audience targeting, partner placement, and messaging.Collect and analyze data to be used in several ROAS models, including MM (Marketing Mix) and MTA (Multi Touch Attribution). Lead demand curve analysis and category and media investment scenarios.Drive customer segmentation analysis, including acquisition and retention measurement and LTV projections.Lead cross-device customer mapping to better understand the path of a customer.Leverage propensity modeling to help guide customer-centric targeting and retention strategies.Lead research projects to test elements of creative that are optimal for given audiences.Set-up measurement studies and performance tracking in partnership with key media partners to enhance our view of the customer.Recommend optimal channel mix, category mix, and device mix for a given campaign goal. *Fantastic communicator who is able to take the rocket science explanation and distill into simple business metrics for the general consumer.Measurement Insights is responsible for collaborating with a business segment to determine long-term vision and provide analytical support and guidance.They analyze large data sets to develop multiple, complex custom models and algorithms to drive innovative business solutions and work on large project teams in order to provide analytical support and guidance to a large project team (for example, email targeting, business optimization, consumer recommendations) across Walmart Media Group. *Build learning systems to analyze and filter continuous data flows and offline data analysis.Combine data features to determine search models.Required:Conduct advanced statistical analysis to determine trends and significant data relationships.Experience in omni-channel marketing, attribution and ROI measurement, especially for awareness focused online advertising and TV campaigns.Experience with Mobile channel measurement.Strong analytical and quantitative skills and ability to translate findings into actions that align to the needs of the business.Strong organizational skills, with the ability to effectively manage projects, communicate effectively, and be a self-starter.Demonstrated thought leadership and relationship building/management with internal stakeholders and external partners. Experience in data visualization across multiple tools such as Tableau, Thoughtspot, Looker and Domo.Experience and passion for working in a fast-paced agile environment. BA/BS degree or equivalent practical experience.4+ years of experience in campaign measurement and/or integrated marketing strategy.Experience working across various internal stakeholders including Marketing, Finance, and Engineering.Knowledge of the changing digital media landscape, including innovative measurement techniques for Mobile, Social, and Search. Well versed in Advertising technology, including 3rd party ad-serving and tag management solutions and programmatic ad buying platforms.Extensive experience with A/B and Multivariate test design and implementation.Practitioner of Multi-touch attribution techniques.Action-oriented analysis and recommendations: Focused on business outcomes to drive all priorities and accountability.Traditional Marketing Mix experience.Experience leading customer segmentation strategy and LTV analysis, with emphasis on the Omni-channel customer.Significant experience communicating technical material to range of audiences."}