{"jobID": "2698577839", "jobLocation": "San_Diego_CA", "jobTitle": "Director of Data Science", "companyRating": null, "companyInfo": {"Website": "www.teradata.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (TDC) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " EMC, IBM, Oracle"}, "estimatedSalary": null, "jobDescription": " Teradatas Analytical Ecosystem organization is seeking a Director of Data Science to join our team of researchers who build automated reasoning solutions to manage data, algorithms, and applications across heterogeneous analytic ecosystems. In this role, you will manage a group of data scientists, analysts and engineers providing thought leadership and collaboration. About the Role Reporting directly to the VP of Engineering, the Director of Data Science will define the strategy for the workload analytics data science team and lead a multi-disciplinary team of data scientists, analysts and engineers. This will include the following responsibilities: Recruit, inspire, mentor and retain talent with a diverse range of qualifications, interests and skills.Collaborate with product management and engineering teams to identify what data needs to be captured and analyzed to understand system behavior, performance and workload characteristics, features utilization, failure identification, etc.Guide the team in developing the scientific method of analyzing and interpreting data.Develop excellent understanding of Teradata platform products. Work with key technical resources to understand and explain causality of system events.Communicate findings with senior executives, product managers, engineers, partners and customers.Develop rapid data discovery and analytical prototypes and iteratively deliver production quality data applications.Deliver to committed timelines and scope as per agreement with product management and senior leadership.What You Have You are a thought leader who is passionate about the challenges of understanding how highly complex, massively parallel processing systems behave and have the audacity to define how they should be operated and optimized. The ideal candidate is a highly motivated individual who is ready to participate in a team environment and contribute to the success of Teradata. You have a positive attitude and are driven by intellectual curiosity. You bring excellent organizational and time management skills where scheduling priorities and efficiency in system configuration is essential.  Your career achievements include: 5+ years of experience in building and leading high performing teams in engineering management with 10+ years overall engineering experience.M.S degree or PhD in Mathematics, Physics, Computer Science or EngineeringPrior experience managing multi-disciplinary team of data scientists and engineers.Proficiency in working with extremely large data sets in a distributed computing environment.Extensive experience implementing machine learning, data mining and predictive algorithms for solving deep analytical challenges.Expert level SQL skills and experience with at least one analytical software package: R, SAS, Matlab, KNIME.Working knowledge with a scripting programming language of your choice.Adept at data visualization best practices and storytelling.Exceptional interpersonal and communication skills (verbal and written) as well as the ability to communicate advanced analytical concepts and complex quantitative analysis in a concise, clear and actionable manner.*Our total compensation approach includes a competitive base salary, 401(k), strong work/family programs, and medical, dental and disability coverage.Teradata is an Equal Opportunity/Affirmative Action Employer and commits to hiring returning veterans."}