{"jobID": "2774878719", "jobLocation": "Princeton_NJ", "jobTitle": "Sr. Applied Data Scientist, Machine Learning, Deep Learning and NLP", "companyRating": "3.1", "companyInfo": {"Website": "www.wolterskluwer.com", "Headquarters": "Alphen aan den Rijn, Netherlands", "Size": "10000+ employees", "Founded": " 1836", "Type": " Company - Public (WKL) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thomson Reuters, Pearson"}, "estimatedSalary": "111000", "jobDescription": " The Wolters Kluwer Global Platform Organization co-creates products and solutions with Wolters Kluwer businesses around the globe to serve professionals in the Legal, Tax, Heath, Finance and Compliance sectors. This wide and growing array of solutions supports Wolters Kluwer businesses in building and expanding their online product portfolios. The Global Platform Organization (GPO) provides global leverage of industry and customer insight, driving technology capabilities for local product innovation.  Do you want to use your skills and talent to make a meaningful impact to deliver expert solutions in a diverse set of professional domains: healthcare, compliance, legal and regulatory and tax and accounting?  Wolters Kluwer is a fast-growing and innovation-driven global company that has successfully made a transition from print publishing to a digitally-driven provider of professional software, online expert content and integrated workflow products.  We are searching for a Sr. Applied Data Scientist who is passionate about technology and solving real world problems to build models and applications in areas such Machine Learning, Deep Learning and Natural Language Processing. You should be willing to take on challenges of unknown dimensions, and work hand in hand with business, product leaders, customers, and developers. You will need to have very strong technical skills in data sciences and a proven ability to deliver products to the market.  Reporting into the Information Solutions and Advanced Technology team, this role is crucial to the continued growth and evolution of one of the leading companies providing expert solutions to the healthcare, compliance, legal and tax markets globally. ESSENTIAL DUTIES AND RESPONSIBILITIESEngage as a key member of the advanced technology teamRapidly research, experiment and build prototypes using commercial, Open Source and proprietary solutions for machine learning, deep learning and NLP including an assessment of production suitabilityCommunicate prototype results in an actionable form, including lessons learned and next steps for technical teams in the AI CoE and other technology groupsDevelop data science solutions that can cost effectively be leveraged across the organizationIdentify and drive best practices for data science solutions developmentA self-starter who can align the technology solution with a business goalAssess various machine learning frameworks and packagesCollaborate effectively with other data sciences teams across Wolters Kluwer to align on direction and leverage existing tools and knowledgeMonitor trends in Machine Learning, Deep Learning and NLP to influence the solutions within all Wolters Kluwer divisionsOTHER DUTIES Performs other duties as assigned by supervisor. Education: Strongly preferred: Graduate degree (MS or PhD) in Computer Science, Engineering, Mathematics or equivalent; specializing in machine learning or a related field.  Required: * 7+ years work experience in advanced technical domains  Experience 2-3+ years work experience in data sciences2+ years experience in team leadershipExpertise in one or more of data science, machine learning, deep learningExperience programming in languages such as Python, R, Java, or C/C+Experience with engineering cloud-based data science platforms for production solutionsExperience developing production software using agile methodologiesDemonstrated ability to function in multi-disciplinary teams across technology and businessStrong communication skills and the ability to relay and simplify complex concepts for diverse audiences Preferred Qualifications  The following is highly desired, but not required: PhD with academic experience in machine learning or deep learning or NLPExpertise in software developmentExperience with containerized solutionsExperience with DevOps, continuous integration, test automation, Git flowExperience with SPARQL and other no-SQL data bases a plusExperience with XML, XML Schema, XSLTExperience with semantics web technologies such as RDF, OWL, RDFa a plusTRAVEL REQUIREMENTS Up to 15% travel might be needed  About Wolters Kluwer  Wolters Kluwer N.V. (AEX: WKL) is a global leader in information services and solutions for professionals in the health, tax and accounting, risk and compliance, finance and legal sectors. We help our customers make critical decisions every day by providing expert solutions that combine deep domain knowledge with specialized technology and services.  Wolters Kluwer reported 2017 annual revenues of 4.4 billion. The company, headquartered in Alphen aan den Rijn, the Netherlands, serves customers in over 180 countries, maintains operations in over 40 countries and employs 19,000 people worldwide.  Wolters Kluwer shares are listed on Euronext Amsterdam (WKL) and are included in the AEX and Euronext 100 indices.  For more information about our solutions and organization, visit www.wolterskluwer.com, follow us on Twitter, Facebook, LinkedIn, and YouTube. EQUAL EMPLOYMENT OPPORTUNITY Wolters Kluwer U. S. Corporation and all of its subsidiaries, divisions and customer/business units is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orieSDL2017"}