{"jobID": "2604903452", "jobLocation": "San_Francisco_CA", "jobTitle": "Revenue Modeling & Data Science Lead", "companyRating": "3.3", "companyInfo": {"Website": "www.stubhub.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ticketmaster, Songkick, Bandsintown"}, "estimatedSalary": "167000", "jobDescription": " ORGANIZATION: StubHub, www.stubhub.com (an eBay company NASDAQ: EBAY) At StubHub , our mission is simple: help fans find fun. We connect fans with their favorite teams, shows and artists and introduce them to the ones they'll love next. As the largest ticket marketplace in the world, we enable fans to buy and sell tickets to tens of thousands of events, whenever they want, through our desktop and mobile experiences, including our StubHub app for iPhone, iPad, Apple Watch and Android. Offering a superior fan experience at its core, StubHub reinvented the ticket resale market in 2000 and continues to lead it through innovation. Our industry firsts include the introduction of the first ticketing application, the first interactive seat mapping tool and the first live entertainment rewards program, Fan Rewards. Our business partners include more than 130 properties in MLB, NBA, NHL, MLS and NCAA, plus AEG, AXS and Spectra Ticketing & Fan Engagement. With the acquisition of Ticketbis in August 2016, throughout the world, StubHub provides the total end-to-end event going experience. For more information on StubHub, visit StubHub.com or follow @StubHub on Twitter , Facebook and Instagram or YouTube.com/StubHub. OUR VALUES StubHub One We act as one team in pursuit of connecting people through inspiring event experiences. At StubHub, we are: Driven We strive for excellence constantly improving our game Courageous We are bold & not afraid to challenge the status quo Inventive We see what others dont & pioneer new paths Richly Diverse We recognize & respect everyone as a unique individual Brand We experience the world through StubHub THE OPPORTUNITY: StubHub is seeking an Operations Research practitioner to design, develop and implement a Revenue Optimization program that leverages econometrics and other core Revenue Mangement principles to drive increased sales at profitable margins. This person will be responsible for building StubHubs pricing models and partnering with other members of the Revenue Optimization & Growth team to deliver results at scale. This person will also work cross-functionally with business GMs, product & tech, finance and senior leadership to achieve KPIs. LOCATION: The Revenue Modeling & Data Science Lead will be based in San Francisco, CA and will report into the Head of Revenue Optimization & Growth. PRIMARY JOB RESPONSIBILITIES: Design and develop Revenue Management strategies and tactics to maximize key business objectives Lead a team of Revenue Modeling & Data Science resources in Revenue Management best practices and industry-standard techniques. Collaborate with fellow Revenue Optimization & Growth team members to provide holistic insights and recommendations for managing top-line growth and operating income Partner with senior executives & cross-functional colleagues to ensure pricing tactics balance growth with profitability Provide data-driven insight and strategic recommendations for all pricing, promotion and growth-driving business opportunities Partner with Business Development and Corporate Strategy resources to help inform the evaluation of partnership and affiliate deals Provide thought leadership and strategic guidance on all revenue-related initiatives including revenue-share and fee-based solutions Partner with the Revenue Portfolio Management team to proactively identify options to North America GMs to manage their P&L; Identify new opportunities for growth based on insights from other industries relevant to StubHubs business EDUCATION, SKILLS AND EXPERIENCE 5-7+ years of demonstrated experience building revenue management models and pricing frameworks. Experience solving revenue-related business problems using stochastic, heuristic or deterministic methodologies using R, SAS or other similar analytical tools Deep understanding of Revenue Management principles including but not limited to statistical segmentation, data normalization, market response modeling and price optimization. Demonstrated ability to measure price sensitivity and build pricing frameworks to capture additional volume while maintaining healthy profitability. Strong intellectual curiosity and ability to understand and evaluate business constraints to ensure models and pricing frameworks are operationally executable. Collaborative personality with the ability to build relationships both within the team and across the organization to drive results. Masters in Operations Research, Statistics, Mathematics, Economics or other applied mathematical discipline required, Doctorate preferred. AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYER StubHub is a Subsidiary of eBay. This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies View our privacy policy View our accessibility info eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com . We will make every effort to respond to your request for disability assistance as soon as possible. For more information see: EEO is the Law Poster EEO is the Law Poster Supplement"}