{"jobID": "2650080615", "jobLocation": "Los_Angeles_CA", "jobTitle": "Environmental Scientist, Geologist, or Environmental Engineer - 2 to 4 Years Experience", "companyRating": "4.2", "companyInfo": {"Website": "www.langan.com", "Headquarters": "Parsippany, NJ", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Work for an Industry Leader Challenging Projects & Dynamic Work Environment  Extensive Training Program  Community Service Opportunities  Langan is an award-winning ENR Top 500 Design Firm that offers integrated engineering and environmental services for both public and private sector clients at sites located throughout the United States and abroad. Langan receives numerous recognitions for its technical expertise as well as its work environment, including Zweig Group’s Best Firms to Work For, Glassdoor’s Employees’ Choice Award – Best Places to Work, NJ Biz Best Places to Work and Business of the Year – 50 Fastest Growing Companies, Hartford Business Journal’s Best Places to Work in CT, and Pittsburgh Business Times - Best Places to Work in Western PA. Visit our website for more information about our awards and recognitions.  Langan offers its employees opportunities that provide challenge and responsibility within an environment where they can grow and flourish!  Join our team of industry leaders and make a difference on some of the most exciting and interesting projects in the field!Langan has an opening for an Environmental Engineer, Scientist or Geologist with 2-4 years of related environmental experience in our Los Angeles, CA office. As the successful candidate, your responsibilities will include, but not be limited to: providing field services for construction and site investigation projects, performing field tests and collecting field data, monitoring complex construction related projects, and compiling daily reports. In addition, excellent communication skills, possession of a strong technical education, professional demeanor, and desire to learn is essential. Job Requirements:Bachelor’s degree in Environmental Engineering, Environmental Science, or Geology;Ideally will possess 2 to 4 years of related environmental experience. Experience in Southern California is preferred;Professional Registration preferred: EIT, GIT, PE, or PG;40-hour OSHA HAZWOPER certification;Field experience including gas / soil / groundwater sampling strongly preferred;Knowledge and understanding of California environmental regulations is preferred;Candidates must be able to work in the office and the field as necessary;Attention to detail with excellent analytical and judgment capabilities;Strong mathematics and computer skills;Excellent communication and organization skills;Possess a valid driver’s license in good standing and reliable transportation to job site and client locations;Availability to work Monday through Friday with evenings and weekends, when needed. Langan offers its employees opportunities that provide challenge and responsibility within an environment where they can grow and flourish!  We offer competitive compensation packages; full-time employment company paid medical, dental, and vision coverage; life insurance, short- and long-term disability insurance; 401(k)/Roth with company match; extensive training; buddy and mentoring programs; employee referral and professional license bonuses; educational reimbursement; and much more! Equal Opportunity Employer"}