{"jobID": "2835261506", "jobLocation": "Alexandria_VA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Shirley@britstaninc.com  This is a senior role that will determine data requirements, providing structure for raw data, extracting and manipulating data, creating new variables, conducting analysis, and determining conclusions based on predictive and statistical analysis.  The candidate for this position will: Provide predicative and statistical analysis of data retrieved from “Hadoop” which will ultimately produce new and creative analytic solutions.Analyze source system data and data flows, working with structured and unstructured dataManipulate high-volume, high-dimensionality data from varying sources to highlight patterns, anomalies, relationships and trendsPropose analytic strategies and solutions that challenge and expand the thinking of the working teamCitizenship: US citizenship is not required. Applicant must have valid working authorization.  All applicants will be required to submit a background investigation application prior to beginning work and must be able to obtain a public trust clearance. Required skills include:Statistical analysis expertiseData modeling, including reverse and forward engineeringDatabase Design: RDMS along with Data Warehouse, Data Mart and Data MiningData Modeling Tools experienceHadoop frameworks such as Hive, SparkExperience with Python, R, SQLExtensive experience in UNIX/LinuxAbility to create structured problem statements and conceptualize potential solutions from rough client specifications and informationDetailed knowledge of statistical and predictive modeling concepts and disciplinesKnowledge of industry-leading practicesExcellent verbal communication skills, including strong presentation skillsStrong listening and communications skills, with the ability to clearly and concisely explain complex problems and technologies to non-expert and executive audiences).Excellent Written Communication Skills includes ensuring that text is accurate and is expressed in a clear and straightforward manner.Bachelor’s degree and 15+ years’ experiencePreferred Qualifications:JavaXMLNLPDemonstrated experience with Machine LanguageMS SQL ServerMySQLIBM Data Quality toolTOAD for Data AnalystAbility to fine tune SQL for performanceprovided by Dice Must have 15 years of experience and a Bachelor Degree and able to obtain a Public Trust Clearance. Statistical Analysis Expertise is a Must!"}