{"jobID": "2760904813", "jobLocation": "Washington_DC", "jobTitle": "Senior Director, Tax Policy", "companyRating": null, "companyInfo": {"Website": "www.nam.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1895", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "TheNational Association of Manufacturers (NAM) is seeking a Senior Director, Tax Policy. Responsibilities include working with NAM member companies to develop NAM positions on tax policy and advocating these positions with members of Congress, Congressional staff, administration officials and the press. Join the NAM and Make an Impact in the Following Ways: Advise the department head on achieving department objectives and setting priorities.Coordinate, direct and participate in lobbying activities with NAM members on tax policy issues; meet with members of Congress, staff and Administration officials to identify, discuss and resolve policy issues.Identify tax issues affecting U.S. manufacturers and U.S. global manufacturing competitiveness. Develop NAM’s tax positions, working with NAM members, particularly the NAM's Tax and Budget Policy Committee and its various subcommittees and task forces.Develop, direct and work with coalitions of other industry groups and companies as part of policy advocacy campaigns. Manage and provide staff support for coalitions as appropriate. Speak at public events to build support for members' priorities.Prepare testimony, written reports, lobbying materials, letters, analyses and statements on major tax policy issues for distribution to Congress, the Administration, NAM members and the press.Develop and write communications to NAM members on tax policy issues.Respond to member company requests, questions and concerns and assist field and national division staff with member requests.Assist in planning and coordinating meetings and conferences with NAM members and with congressional groups or government agencies.Maintain and expand knowledge of and expertise in tax and economic policy issues.Qualifications:Bachelor's degree from four-year college or university, law or advanced degree preferred;Minimum of eight to twelve years of related association, law firm, corporation or executive branch and/or Hill experience;An in-depth understanding of the various tax and economic policy issues impacting U.S. manufacturers;Thorough knowledge of the public policy process; excellent communication (verbal and written) skills;Strong organizational and interpersonal skills;Current contacts on Capitol Hill and in the Administration;Experience handling media inquiries;Flexibility and the ability to work as part of a team.The National Association of Manufacturers (NAM) is the largest manufacturing association in the United States and one of the nation’s most influential advocates for manufacturing. By joining the NAM, you become part of a spirited and dynamic team that is driven to succeed. We recognize and reward our staff with competitive pay and annual performance based bonus programs. We offer an outstanding benefits package that includes health, dental, and vision insurance, life, short-term and long-term disability, flexible spending accounts, SmarTrip, and a 401(k) Salary Deferral plan with employer match and contributions, vacation and sick leave, complimentary on-site gym access and healthy snacks in the break room. Become part of a fast paced team passionate about keeping the United States the world leader in manufacturing. People. Passion. Progress.Learn more at www.nam.org/careers"}