{"jobID": "2811150613", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.strivector.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "\"The best way to predict the future is to create it.” - Abraham LincolnABOUT STRIVECTOR Strivector specializes in full time and contract position hiring for companies like Amazon, Client, Client, Client, Capgemini and many other Fortune 500 companies and Startups. Our clients are growing so fast that they can't hire good people fast enough to keep up with their growth. So we help them. We reach out to awesome talented individuals like you and connect them to their dream companies and dream jobs.  So if you're one of the best, and you are looking for something better, let's talk! :-D THE EMPLOYER Take your career up a few notches with one of the most awarded analytics innovators among analysts and customers alike - with over 170 customers across 21 countries. To see how your business can gain from analytics. THE JOB This is a Data Scientist position and requires someone who has SQL, R, Tableau, SAS. DESIRED SKILLS AND EXPERIENCE Most importantly, you need to be a passionate Data Scientist who enjoys his work and is considered to be one of the best within your organization. The ideal Data Scientist would be someone with deep experience in many (if not all) of the following: 5-7 years total Analytics experience with 3+ years of experience in Data Science Techniques (Classification, Prediction, Machine Learning, Unsupervised Clustering) and excellent working knowledge of RCreative thinker who knows how to create real-world analytical productsProven experience with large data sets and related technologies, e.g., Hadoop, Pig, Spark. Knowledge of SQL and NoSQL is requiredGood communication skills, ability to work with large cross-functional teams of technical and non-technical membersA data miner. Be able to extract patterns from large sets of data in order to deliver business insights from dataExposure to e-commerce / Marketplace knowledge and number-heavy areas such as Operations, Marketing, Finance etc. will be preferred We understand that even if you are a seasoned Data Scientist you may not have all the skills listed here. If you are a good at what you do and have a willingness to learn, lets talk. ADDITIONAL INFORMATIONCompensation: Based on Experience. One of the best in the industry Minimum Education: Math/Statistics graduate, Masters preferred Minimum Experience: 5-7 years total Analytics experience Type of position: Full-time Permanent Position with benefits Telecommute: No Location: San Jose, CA Relocation accepted: Yes provided by Dice SQL, R, Tableau, SAS, Data Scientist"}