{"jobID": "2592091793", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Science Instructor", "companyRating": null, "companyInfo": {"Website": "www.generalassemb.ly", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Since 2011, General Assembly has transformed tens of thousands of careers through pioneering, experiential education in todays most in-demand skills. As featured in The Economist, Wired, and The New York Times, GA offers training in web development, data, design, business, and more, both online and at campuses around the world. Our global professional community boasts 40,000 full- and part-time alumni and counting.In addition to fostering career growth for individuals, GA helps employers cultivate top tech talent and spur innovation by transforming their teams through strategic learning. More than 21,000 employees at elite companies worldwide have honed their digital fluency with our corporate training programs. GA has also been recognized as one of Deloittes Technology Fast 500, and Fast Company has dubbed us leaders in World-Changing Ideas as well as the #1 Most Innovative Company in Education.We are looking for a Data Scientist to teach our full time class: Our Data Science Immersive course empowers students with both the skills and mindsets to become Data Analysts and Data Scientists. The Global Instructor Lead will deliver instruction from a remote location to multiple classrooms on GA campuses. This role partners with local, on-site instructors to make up one Hybrid Instructional Team focused on delivering first-in-class education to GA students. You are:A strong presenter: Youre effective in a variety of formal presentation settings: one-on-one, small and large groups, and with peers. Youre comfortable providing 1:1 and whole class support in person.Good at motivating others: You create a climate in which people feel empowered and want to do their best; you can assess each persons hot button and use it to get the best out of him/her. You are eager to shape the skills, minds, and trajectories of the newest generation of data scientists.An adept collaborator: You are able to collaborate remotely, with team members and managers in different locations. You can quickly find common ground and solve problems for the good of all. You are seen as a team player who can solve problems with peers with a minimum of noise.Action oriented: You enjoy working hard and confront challenges with enthusiasm. You can set goals, prioritize next steps to achieve them, and measure your success/impact.Able to learn on the fly: You are a quick, relentless and versatile learner who is open to change. You like to experiment and will try anything to find solutions.Technical Requirements:1-2 years of professional data science experience.Expertise in SQL, Python, and related Python libraries (pandas, numpy).Domain expertise in statistics, mathematics, and probability.Ability to build and apply statistical models in python using machine learning libraries, such as scikit-learn and statsmodels.A deep understanding of statistical hypothesis testing and experimental design, data visualization techniques and tools (i.e. matplotlib, bokeh, etc), and manipulation of large data sets.Ability to demonstrate and explain the function of machine learning algorithms such as regularized regression, naive bayes, decision trees, ensemble methods, KNN, K-means clustering, and neural networks.Nice to haves:Proficiency with NLP python libraries such as NLTK; Hadoop or Apache SparkYou are on top of industry trends in big data, machine learning, deep learning, and AI.Previous data science or engineering teaching experience (a course, workshop, team training, etc.)Experience coaching, managing or supporting more junior staff or studentsResponsibilities and DutiesParticipate in 2 weeks of onboarding and collaborative planning prior to the course start, in which you will assist in the planning and implementation of a 12-week curriculumCollaborate with Global remote faculty to deliver full-time instruction 5 days a week, including teaching and student advising.Facilitate hands-on instruction on campus including: labs sessions, discussion sessions, and 1:1/small group support.Foster a dynamic and collaborative classroom community that will inspire students to persevere through the challenges of learning complex subjects.Collaborate with your instructional team to: plan instructional activities, plan discussion sections, plan labs, and determine how to best meet the needs and learning styles of all students.Provide students with 1:1 coaching and support throughout the course.Work closely with your instructional team to provide students with meaningful and prompt feedback on their progress.Guide students through the development of real world projects that will showcase their abilities to hiring managers.Contribute to the material and direction of an expanding global curriculum, ensuring the course remains cutting-edge and effective for students worldwide.Core CompetenciesDirecting OthersApproachabilityTechnical Skills in Data ScienceMotivating OthersPresentation SkillsTime ManagementPlanningManaging DiversityLicensure General Assembly is a licensed school in all states that we operate in, and some states require instructors to be licensed to teach. If hired, you will be required to submit and be approved as an instructor in relevant states. Directions for becoming licensed will be shared with you during onboarding. Licensure requirements vary by state, but you may be required to provide academic transcripts and to answer questions pertaining to moral character, professional conduct, education, and work history. General Assembly will pay for all licensing fees."}