{"jobID": "2829551298", "jobLocation": "Running_Springs_CA", "jobTitle": "Clinical Laboratory Scientist (CLS)", "companyRating": null, "companyInfo": {"Website": "www.soliant.com", "Headquarters": "Tucker, GA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Whether you are looking for a relaxing beach to visit, action-packed adventures, historic attractions, or family fun, California is the place to visit! Work in California and experience it all!!  California Medical Center has an immediate need for a Clinical Laboratory Scientist (CLS). Details of Job are describe below. This is a Permanent Position. Must have California State License (in-hand).  Shift: Day Shift - 3 x 12 (Wednesday-Friday) Rotating Weekends. 6:00 am -6:30 pm  **Must have Blood Banking experience.Strongly prefer Microbiology and Microscan.  **Must have experience with all or most of major equipment. Vitros 350, Siemens EXL, Abbott Ruby, Sysmex CA 540 or 620 a plus! Must be able to work independently. License & Certification Requirements: CLS certified Medical Technologist with at least two years’ experience as a Generalist. BLS Certification. Job Description: Assist the Laboratory Manager in the coordination of laboratory activities. Provide accurate, timely and cost effective testing of patient samples to aid in the diagnosis and treatment of disease in compliance and harmony with the quality management system. The Lab Technician has no supervisory responsibility. Maintains positive working relationship with the medical staff and hospital personnel. Uses positive interpersonal skills to educate/support lab customers and promote success of team members. Shares call duty and work different shifts as needed. Responsible for accurately completing records and reports and other statistical information for master files or databases. Follows laboratory policy for data retrieval, record keeping, specimen, and identification, requisition, reporting, charting, and billing procedures. Education and Experience: Bachelor's or Associate's Degree in Medical Technology or equivalent, Basic computer skills. Good written and verbal communication skills. Demonstrated ability to be flexible, organized and a critical thinker.  To apply directly, please send resume to: Jaye.Skidmore@Soliant.com \"Subject-line: CLS7696\""}