{"jobID": "2766813101", "jobLocation": "Washington_DC", "jobTitle": "Quantitative Analyst III", "companyRating": "3.7", "companyInfo": {"Website": "www.fanniemae.com", "Headquarters": "Washington, DC", "Size": "5001 to 10000 employees", "Founded": " 1938", "Type": " Company - Public (FNMA) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Freddie Mac"}, "estimatedSalary": "122000", "jobDescription": "THE COMPANY Are you interested in helping solve today's most critical housing challenges? In simplest terms, Fannie Mae serves the people who house America. We work at the heart of housing by providing reliable, affordable mortgage financing in all markets at all times, buying loans that banks and other lenders originate, so they can fund new loans. This gives more people the opportunity to buy, refinance, or rent homes and apartments. Creating these opportunities is what drives the people who work at Fannie Mae.  For more information about Fannie Mae, visit http://www.fanniemae.com/progress JOB INFORMATION A senior analyst who is focused on continued personal contribution. Has robust and deep subject matter expertise and highly developed technical capability. While not leaders in the sense of traditional people managers, they lead by example with their significant and boundary pushing solutions. Often tasked with some of the most difficult and complicated matters in their area. They will also be engaged in unsolicited research in order to mine risks or process advantages by contributing to tailored, self-developed or as a critical contributor to broader analytic offerings. KEY JOB FUNCTIONSInterfaces effectively and collaboratively with business customers, other areas of the analytics division, and vendors to provide solutions for business problems. Is considered an expert in their area (both business and technical aspects) and can provide mentorship and guidance to others in as needed. Engages in day to day development of highly technical product. Often will be the sole engine for creative design, technical implementation, and user interfaces for their self-developed products, leveraging the capabilities of other support teams as needed. Contributes to the development of data products but is not the owner or primary developer. They are however heavy users of data products developed by team members. Responsible for compliance with all levels of governance and best practices in implementation and automation. Works with data both institutional and outside of the company, builds intuitive and meaningful reporting or analytic explorative items for personal or business consumption, is technically capable of full development cycle including continued automation and quality control best practices, and effectively champions their products to their desired customer base. Responsible for development of and maintenance of a research agenda in their supporting area. Identifies effect champions and stakeholders for their research and other work products to ensure addressing of business concerns.EDUCATIONBachelor's Degree or equivalent requiredMINIMUM EXPERIENCE6+ years of related experienceSPECIALIZED KNOWLEDGE & SKILLSSuccessful background in quantitative field such as Statistics, Computer Science, Finance or Economics. Well-developed ability to provide insights from accurate analysis that are meaningful to technical and non-technical audiences. Detail-oriented with an ability to thrive in a dynamic environment and the energy to take on a growing portfolio of responsibilities. Advanced knowledge of statistical analysis tools, in particular SAS, SQL or R Experience with data visualization tools such as Tableau is preferredEMPLOYMENT As a condition of employment with Fannie Mae, any successful job applicant will be required to pass a pre-employment drug screen and to successfully complete a background investigation.  Fannie Mae is an Equal Opportunity Employer."}