{"jobID": "2827274092", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist - Immunosciences Drug Discovery", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " The successful candidate will be responsible for running an independent program in the areas of autoimmunity and/or immuno-oncology drug discovery. Responsibilities include designing and conducting cell-based assays for the evaluation of targets and agents in the area of cell immunology. This individual will work independently and provide oversight of the design, execution and interpretation of biochemical and cellular assays, as well as in vivo pharmacology studies. This role requires a close working relationship with other scientists within a drug discovery team and coordinating studies with several different functional groups.  Qualifications:  Ph.D. level scientist within the area of Cellular Immunology or a related field, with 2-5 years of postgraduate work experience, preferably with industry experience in leading immunology-based drug discovery projects. Knowledge of adaptive and innate cellular immunology and immune tolerance including, but not restricted to, primary T, B cells, innate lymphoid cells, dendritic cell activation and proliferation in the context of antigen presentation is a must. This position requires extensive experience with functional cell-based assays such as T-cell, B-cell and dendritic cell differentiation, proliferation, cytokine measurements, receptor binding and occupancy, and cellular signaling using appropriate biochemical and pharmacological techniques. Extensive experience with aseptic isolation and culture of rodent and human primary cells and FACS based characterization of the same is also a requirement. Experience in the analysis of genomics studies would also be of high value. Experience in supervisory responsibility and/or project leadership, with excellent communication skills and a publication record in peer reviewed journals are considered key qualifications"}