{"jobID": "2834574468", "jobLocation": "Detroit_MI", "jobTitle": "Assistant Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.henryfordhealth.org", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1915", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": "Assistant Scientist(s)Department of Psychiatry / Center for Health Policy & Health Services ResearchPosition Description: Henry Ford Health System’s (HFHS) Department of Psychiatry and Center for Health Policy and Health Services Research seek applicants for multiple positions at the rank of Assistant Scientist.  HFHS’ Department of Psychiatry and Center for Health Policy and Health Services Research are core members of the NIMH-funded Mental Health Research Network, the Health Systems Node of the NIDA Clinical Trials Network, and the Trans-America Consortium of the HCSRN for the NIH Precision Medicine Initiative Cohort Program. The Department and Center have particular expertise in suicide prevention, opioid use disorders, and depressive disorders and conduct a wide range of studies using all types of research designs, including trials, prospective studies, and large observational studies within Henry Ford and across our participating networks. Clinical opportunities are also available within the Department of Psychiatry.  Please address inquiries to Dr. Brian Ahmedani at the address below. Contact Information Brian K. Ahmedani, PhD  Director of Psychiatry Researchc/o cmarsha2@hfhs.orgThe ideal candidate will have expertise in suicide prevention, mental health or substance use disorders. To qualify for this position, the individual must have a PhD, MD or equivalent degree; post-doctoral research experience (min. 2 years); evidence of scholarly activity (publication of papers in peer-reviewed journals); potential to be an independent and externally-funded investigator. Research Bioscientific Staff are expected to obtain NIH funding; publish papers in peer-reviewed journals; report data at scientific meetings; participate in academic activities, (i.e. NIH study sections, editorial boards); and participate in HFHS research activities."}