{"jobID": "2790091011", "jobLocation": "Chicago_IL", "jobTitle": "Information Security Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.chicagofed.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1914", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Job Summary This role provides operational and technical support for data modeling and analysis within the logging platform. The complexity of work is considered intermediate and is performed under moderate supervision. This role has no direct reports but does assist in training junior staff. Principal Duties and Responsibilities • Develop stakeholder data source requirements  • Model data to meet or exceed stakeholder and data governance requirements  • Create, manage, and support knowledge objects (alerts, reports, dashboards)  • Provide level 2 technical support; assist with level 3 support, as appropriate  • Assist with customer education, including appropriate use and sharing of knowledge objects  • Develop, monitor, and report on platform and service metrics  • Address search performance, service risks and issues  • Provide input on and implement operational enhancements  • Help manage and contribute to operational support documentation  • Ensure all standards including change and risk management policies are followed  • Ensure service level agreements are met or exceeded  • Represent team as a subject matter expert at meetings, as needed Education and Experience • Bachelor's Degree in Computer Science or other related field or equivalent work experience  • 3-5 years of related work experience Knowledge and Skills • Good written and verbal communication skills  • Critical thinking and problem-solving skills  • Attention to detail in a well-controlled environment  • Good customer service and presentation skills  • Knowledge of message logging  • Knowledge of query languages  • Knowledge of various operating systems  • Familiarity with scripting and automation  • Familiarity with various programming languages  • Familiarity with various Business Intelligence (BI) tools  • Familiarity with regular expressions Other Requirements and Physical Requirements • Flexibility to work extended hours to support platform on ad hoc and rotational bases  • Flexibility to perform project and operations work, as needed  • Flexibility to learn new technologies, as needed Additional RequirementsApplicants must be current U.S. Citizens without the need for visa sponsorship now or in the future.This position has additional screening requirements due to the information accessed while performing the job. These additional screenings would be initiated at the time of offer acceptance and can take approximately two months to be completed. The screening covers areas such as education/employment verification, criminal history, credit history, and reaches out to your references and people that know you well. This document indicates the general nature and level of work performed by employees within this position. It is not a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. An employee's responsibilities, tasks, and duties might differ from those outlined in the job description, and other duties, as assigned, are a part of the job. The Federal Reserve Bank of Chicago reserves the right to modify the elements of this job description, as business needs require"}