{"jobID": "2767445963", "jobLocation": "Washington_DC", "jobTitle": "Associate FX Trader", "companyRating": null, "companyInfo": {"Website": "www.mavericktrading.com", "Headquarters": "Salt Lake City, UT", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " T3 Trading Group, TopstepTrader, Bright Trading"}, "estimatedSalary": null, "jobDescription": "Maverick FX is a proprietary trading firm focused on Forex currency trading. We are searching for motivated and teachable candidates to trade the Forex market on behalf of the firm. Forex trading is a great career as it offers flexible hours, a challenging profession, unlimited potential and the ability to trade from anywhere in the world via high-speed Internet.------- ABOUT MAVERICK FX -------Trade for a firm that backs you with technology, training, risk management and capital. As a proprietary trading firm, we provide our traders with capital, giving them tremendous leverage and earning potential in the markets. Our traders keep the lion's share (70%-80%) of profits. Each of our traders starts with a minimum of a $10K account. As our traders grow and illustrate track record of consistency and profitability, they are trading with enough of our capital to potentially earn well over $100K per year.------- REQUIREMENTS -------Ideally, applicants should have strong math/finance/business backgrounds (or comparable skills) and some trading experience. Education and work experience is always a plus, however, being a hard worker who is enthusiastic and willing to learn is more important than your background. Passion for trading is always key to success in this industry. ------- HOW TO APPLY -------Our application process has multiple steps, designed to communicate all the necessary information about the firm, our methodology, the way we pay our traders, and to separate those applicants who are truly determined from those who are just curious. To get started, click on the application link below, which will take you to a short video that will discuss Maverick FX, the recruitment process and the Capital Sharing Program. Please make sure to complete the entire process, so that our recruitment team can schedule you a suitability interview and answer all additional questions.CLICK on the application button or use the link below in your browser to begin the application process!Will you be our next great trader? We hope so. We look forward to speaking with you!– The Maverick FX TeamCompensation is commission-based with Performance BonusesFull-time or part-timeTelecommuting okayOpen for persons with disabilitiesFinance, math or business skills are a plusAny trading experience is preferred, but not required"}