{"jobID": "2731785798", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Paid Social Manager", "companyRating": null, "companyInfo": {"Website": "www.jellyfish.net", "Headquarters": "REIGATE, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewJellyfish’s Paid Social team is experiencing tremendous growth and we have a great opportunity to join this dynamic team. The Senior Paid Social Manager will execute and deliver of paid social strategies and efficient day to day management of assigned client accounts, focusing on gross profit growth. Key Responsibilities include executing, optimizing and reporting on best-in-class paid social media campaigns through available social media marketing platforms (e.g. Facebook, Twitter, Instagram, SnapChat, etc) with emphasis on innovative initiatives, and working closely with the Director of Paid Social, Client Services and agency wide teams to communicate campaign strategy, progress and results.Responsibilities Mastering, optimizing and defining Jellyfish’s methodologies utilizing third party and internal tools, required to deliver efficient and profitable Paid Social campaigns.Building out logical and audience focused media plansLeading the campaign strategy, researching potential marketing channels, analyzing competitors, and adopting a robust test & learn approachProduce client-facing reports, studies and presentations including measuring forecasts vs actual and clearly articulating rationale for optimization methodologies throughout campaigns.Managing relationships with advertising partners and communicating account strategy, budgets, and performance.Demonstrates measurable success through the achievement of set KPIs. e.g. account turnover and profitability, campaign management, report generation/analysis and overall service.Train other members of the team, where required, on best practice paid social campaign executionWork with data suppliers and other 3rd party data experts to help develop our data visualization and presentationQualificationsBachelor’s Degree in Business Administration, Marketing, Communications, or related field3+ years’ experience in Paid Social MediaAn in-depth knowledge of the technologies and processes involved in running Paid Social campaignsAdvanced knowledge & experience of using Facebook Power Editor and Twitter Ads ManagerFacebook Blueprint certified; Google Advertising Fundamentals ExamA good understanding of Google analytics and other web analytics packagesPossesses strong business writing skills and able to produce high quality documentsA self-starter who is highly motivated and passionate about social media and paid social"}