{"jobID": "2787849180", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software Engineer, Data Science Platform", "companyRating": "3.4", "companyInfo": {"Website": "www.instacart.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "171000", "jobDescription": " Instacart is building the best way for people anywhere in the world to shop for groceries. Since Instacart started in 2012, weve launched same-day delivery in 200 US markets. We are laser focused on delivering groceries from your favorite stores right to your door. We now cover over 60% of US households and aim to have 80% coverage by the end 2018that's 90 million households! From a technology point of view, the platform is complex, rapidly scaling and processing millions of transactions in real-time all of the time. Our technology coupled with operational expertise enables Instacart to deliver fresh groceries in as little as an hour. This is a difficult problem to master and we are making it happen. Every day, we solve incredibly hard problems to create an experience for our customers that is absolutely magical.  We're looking for an experienced Software Developer to join our Data Science - Platform team. We code mostly in Python and our infrastructure runs on Amazon Web Services. Come join us!What youll be doing: As a Software Engineer on the Data Science Platform team at Instacart, you will act as a multiplier to the efficiency and effectiveness of our data scientists by building tools and services to assist with developing, building, automation, and monitoring. You will have the opportunity to work with many teams (e.g. data engineering, data science, machine learning, software engineering, and core infrastructure) across Instacart. You will be critical in enabling Instacart to make better data-driven decisions faster and more scalably. As you succeed in this role, you will take ownership of the Data Science Platform team and scale it as needed. Responsibilities:You will build solid, reliable, and scalable software that accelerates data-driven decision making at InstacartDrive the continued development of Instacarts automated experimentation frameworkCollaborate with data scientists and data engineers to enhance and develop our automated anomaly detection frameworkDesign and implement tools and processes democratize our data and metrics, accelerating the dissemination of domain knowledge among our stakeholdersWork cross-functionally to design solutions that work for all of Instacarts data needsDevelop and deliver on the data science platform roadmapWhat you should already have:3+ years of industry experienceExperience with Python and RubyExperience with web frameworks, like flask or Ruby on RailsA successful track record on a platform team and demonstrated ability to improve be a force multiplier to those around youBachelors degree in computer science, computer engineering, electrical engineering or equivalent work experienceStrong coding abilityThe ability to ship pragmatic solutions with a high sense of urgencySelf-motivation and a strong sense of ownershipBonus Points:Data modeling, ETL and data pipeline development experienceThe ability to analyze data with SQLExperience with Postgres, Redis, and Elasticsearch, SnowflakeOpen-source projects or contributionsBenefitsTalented and collaborative coworkers who will both push and support youPersonal growth plans that let you stretch yourself or grow in new directionsMarket competitive salary, equityMedical, dental, vision benefits and 401(k) retirement planGreat office in downtown SFTake what you need vacation ( and we really mean it )16 weeks maternity leave / 8 weeks paternity leave so you can truly bond with your childResourcesSpotlight on Data & Analytics TeamTeam Culture#LI-DG1"}