{"jobID": "2800597618", "jobLocation": "Mountain_View_CA", "jobTitle": "Data analyst (SMB Revenue - Adoption Tracking Analyst, Local only)", "companyRating": "2.9", "companyInfo": {"Website": "www.intelliprogroup.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " Project Overview:  Our Marketing Solutions (Client) Sales Analytics and Solutions team is responsible for developing and maintaining systems that enable sales to drive customer success for our client's small and medium business advertisers. Overall Responsibilities: This role will support and communicate with Sales regarding system issues. This function provides initial response to the user and then investigate the issue. Tickets in low to medium complexity can be resolved at this tier based on troubleshooting documents and initial analysis, while more complex tickets will have to be escalated to Tier2. In addition, this tier will document known issues, run operational reports, manage the queue, prioritization, bucketing of tickets, analyzing dismissal reasons, and monitoring the systems proactively, communicating with users/reps.  Top 3 daily responsibilities: Answering support ticket requests and communicate with internal customers dailyInvestigate root-cause of issues and find resolution through data analysisTriage and escalate system issues to engineering teams Required Skills: BA/BS degree in Computer Science, Information Systems, or engineering/math relatedStrong analytical and communication skillsExperience in writing basic SQL queriesHigh attention to details and great organization skillsExperience in advanced data analysis using Excel or our client Sheets Nice to Have Skills/Not Required: Experience responding/resolving tickets or troubleshooting customer issuesExperience with CRM tools, sales / service applicationsKnowledge of our client AdWords or other Digital Advertising toolsAbility to read code (Python/Javascript)"}