{"jobID": "2824146772", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist Sr ( Secret Clearance Required)", "companyRating": "3.3", "companyInfo": {"Website": "www.alionscience.com", "Headquarters": "Mc Lean, VA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": "Responsibilities/QualificationPosition Summary Under minimal supervision, designs experiments, test hypotheses, and build models. Conducts advanced data analysis and complex designs algorithm. Duties and Responsibilities Establishes database management systems, standards, guidelines and quality assurance for database deliverables.  Identifies what data is available and relevant, including internal and external data sources, leveraging new data collection processes such.  Collaborates with Institute subject matter experts to select the relevant sources of information.  Works with IT teams to support data collection, integration, and retention requirements based on the input collected with the business.  Solves client analytics problems and communicates results and methodologies.  Works in iterative processes with the client and validates findings.  Develops experimental design approaches to validate finding or test hypotheses.  Validates analysis by comparing appropriate samples.  Employs the appropriate algorithm to discover patterns.  Defines the validity of the information, how long the information is meaningful, and what other information it is related to.  Works with the data steward to ensure that the information used is in compliance with the regulatory and security policies in place.  Qualifies where information can be stored or what information, external to the organization, may be used in support of the use case.  Identifies and analyzes patterns in the volume of data supporting the initiative, the type of data (e.g. images, text, clickstream or metering data) and the speed or sudden variations in data collection.  Collaborates with the data steward to ensure that the information used follows the compliance, access management, and control policies and that it meets the qualification and assurance requirements of the  Institute.  Recommends ongoing improvements to methods and algorithms that lead to findings, including new information.  Presents and depicts the rationale of their findings in easy to understand terms for the business.  Educates the organization both from IT and the business perspectives on new approaches, such as testing hypotheses and statistical validation of results. Helps the organization understand the principles and the math behind the process to drive organizational buy-in.  Provides business metrics for the overall project to show improvements (contribution to the improvement should be monitored initially and over multiple iterations).  Demonstrates the following scientist qualities: clarity, accuracy, precision, relevance, depth, breadth,  logic, significance, and fairness.  Assess the effectiveness and accuracy of new data sources and data gathering techniques.  Develop custom data models and algorithms to apply to data sets.  Performs additional duties and responsibilities as required. Education and Experience Bachelor’s degree in Computer Science, Statistics, Applied Math or related field plus 5 to 7 years of directly related experience.  In some cases, educational requirements may be adjusted or waived for more than 6 years applicable work experience. Work experience may be adjusted for highly specialized knowledge or uniquely applicable experience for positions involving new technology or labor market shortages as reflected by market survey data.  Experience with programming languages such as Java/Python an asset.  Excellent pattern recognition and predictive modeling skills. Knowledge, Skills, Abilities Strong problem solving skills with an emphasis on product development.  Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.  Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.  Knowledge and experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.  Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.  Experience working with and creating data architectures.  Ability to communicate and work effectively in a diverse work group.  Excellent written and verbal communication skills for coordinating across teams. A Secret Clearance is required for employment.*CB*CJDiversity Statement Women, minorities, individuals with disabilities and veterans are encouraged to apply. Alion will provide a reasonable accommodation to individuals with disabilities and disabled veterans who need assistance to apply. Please visit the Alion Careers site for more information  U.S. Citizenship Required."}