{"jobID": "2804212426", "jobLocation": "Arlington_VA", "jobTitle": "Senior Program Analyst LCS Mission Packages", "companyRating": "4.2", "companyInfo": {"Website": "www.wbbinc.com", "Headquarters": "Reston, VA", "Size": "501 to 1000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, SAIC, Leidos"}, "estimatedSalary": "88000", "jobDescription": "JOB TITLE: Senior Program Analyst LCS Mission Packages PROJECT OVERVIEW: OPNAV N96 is responsible for determining surface combatant force levels, shipboard and related support requirements, and major characteristics of programs involving weapon systems, Cruisers, Destroyers, Frigates, Command ships, Patrol Craft, and Littoral Combat Ships (LCS). N96 executes planning, preparation, and execution in support of this mission. JOB DESCRIPTION AND RESPONSIBILITIES: Provide on-site support, strategic analysis, and integrated support for N96 in accordance with DoD program requirements management and acquisition oversight policies and strategies for LCS Mision Package programs. Specific tasks: Provide strategic analysis and well-integrated/coordinated support for the LCS Mission Packages in accordance with DoD program management and Acquisition oversight policies and strategies.Assist in the development of proposals for PPBE POM budget cycles; identify, integrate and coordinate LCS and Mission Package issues into the POM processes.Track existing Mission Package program of record and analyze the program affects (i.e. maturity status, risk and performance) of new software & component integration, and the development of new technologies.Prepare briefs, outlines, draft reports and publications and documentation to support Flag level technical and financial briefings/meetings and major milestone decisions.Draft white papers, concept papers, technical reports, meeting summaries, or other material that document results meetings or analyses, and/or pertinent issues relating to Defense Planning Guide activities.Communicate program objectives to key high-level officials and project officers in those organizations that support the programs. Drafts formal presentations and high level briefings (e.g., N96, N9, N8, FMB, OSD CAPE) to support and defend programming proposals.Provide background for responses to OPNAV and Congressional inquiries related to LCS/FF and Mission Packages.Maintain a strong relationship and open communication with the PEO LCS (PMS 420, 501, 505, 515), NAVSEA Program Offices; Fleet Commands; and related government activities and industries under contract to the associated Program Offices.Provide weekly status updates of LCS Mission Package development, production, integration, testing and employment to N96 leadership.REQUIRED SKILLS AND QUALIFICATIONS:Active Secret security clearance.Minimum of ten (10) years of hands-on experience in performing operational functions and applying mission associated concepts, policies, requirements processes, and program guidance.Ability to work autonomously given broad tasking, and to interface directly with PMS 420 in PEO LCS, other OPNAV codes, and the Fleet to fully understand LCS mission package development, introduction and sustainment issues while representing N96.Independently generate briefs, issue papers and other work products on program issues for Flag-level audience.Provide JCIDS and PPBE support while also providing test and evaluation oversight for LCS Mission Package programs.Existing knowledge of the LCS Mission Package program including Performance, Cost, schedule and technical issues and shall display expert level of understanding of program requirements while performing all efforts related to this task.Proficient in MS Office including Word, PowerPoint, Excel, and Adobe Acrobat.DESIRED SKILLS AND QUALIFICATIONS:Support staff experience at OPNAV, NAVSEA or Program Executive Offices (PEOs)/Program Offices directly supporting ships and shipboard systems.Experience includes regular interactions with staff and senior leadership internal and external to affiliated organization.WORK LOCATION: Arlington, VA (Pentagon) TRAVEL: less than 5% KEY WORDS: OPNAV, N96, SWO, NAVSEA, NSWC, POM, PPBE, JCIDS, PEO IWS, PEO Ships, PEO LCS WBB is a technical and management consulting company that provides innovative products and services that solve government and commercial customers toughest problems. For more than 30 years, WBB has set the standard for excellence in consulting services, while providing its employees with an outstanding work environment with ample opportunities for growth and success. WBB continues to enjoy impressive growth, which is directly attributed to the companys hiring practice of always hiring the very best professionals from government, military and industry.We are proud of our diverse environment and are an Equal Opportunity Employer. WBB is committed to a policy of equal employment opportunity. WBB participates in E-Verify.WBB does not accept unsolicited resumes through or from search firms or staffing agencies. All unsolicited resumes will be considered the property of WBB and WBB will not be obligated to pay a placement fee."}