{"jobID": "2833061680", "jobLocation": "Houston_TX", "jobTitle": "Senior Data Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.usacompression.com", "Headquarters": "Austin, TX", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Public (USAC) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Requisition Number 18-0211 Title Senior Data Analyst Location Houston State TX Description USA Compression Partners, LP, provides gas compression services. We are one of the largest independent providers of compression services in the United States. We owe our success to the quality of our employees, our strong commitment to safety, and superior  service to our customers. Key Business Objectives: Reporting to the Manager of Business Analysis for Operations, this role will be responsible for organizing, analyzing and interpreting financial and operational data, providing critical support to Operations through reporting, variance analysis, forecasting,  and analytics. To be successful within this role, a candidate must have strong math, analytical, and communication skills; they must have the ability to think logically and be able to analyze different parts of the problem at the same time and solve a variety  of different business problems. A strong attention to detail is also critical. Requirements Duties and Responsibilities:Perform quantitative analysis and develop complex statistical results/reports, including developing predictive metrics.Consolidate weekly and monthly reporting metrics, dashboards, and scorecards, providing explanations of variances and trends.Mines data to derive insights for the business and to support critical business decision-making.Supports continuous improvement in reporting and analytics needs, always with a goal to improve business performance.Make insightful and relevant recommendations based on findings from data analytics.Assemble and analyze mechanical data to predict machine failures and optimize maintenance cost, reducing the risk of downtime.Link operations needs to inventory levels to optimize and predict working capital needs.Create reports and presentations in Excel, DOMO, and PowerPoint to effectively communicate results and conclusions to our executives as well as others within the organization, analyzing and summarizing data in a meaningful and intelligent manner.There will be a significant amount of ad hoc projects, including analyzing product performance, pricing, forecast changes, and account penetration and growth.Skills/Capabilities and Education:Bachelor’s Degree in finance, accounting, mathematics, statistics, or engineering.3-6 years of experience in finance, accounting or a related field.Advanced skills in Microsoft Excel, with experience in MS Access preferred.Working knowledge of SQL, SSRS, DOMO, and/or Azure Analytics tools a plus, but not required.Strong mathematical, analytical, and organization skills, with data mining and analysis, research, investigating, and problem solving skills.Professionalism in dealing with all levels of management and staff.Working Conditions:Dynamic, fast-paced, demanding environment.The employee spends the majority of time sitting or standing in a comfortable position with ample opportunity to move about.The position requires normal eyesight to read and interpret data as well as hearing and speaking ability to communicate and work with company and outside personnel.The position requires periodic research though files for data collection.Travel may be required, but is expected to be less than 20% of the time worked."}