{"jobID": "2731140015", "jobLocation": "San_Francisco_CA", "jobTitle": "Sales Representative - Level 1", "companyRating": null, "companyInfo": {"Website": "www.uline.com", "Headquarters": "Pleasant Prairie, WI", "Size": "5001 to 10000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "San Francisco, CaliforniaUline – Shipping Supply Specialists  \"The people I work with are as passionate as I am.\"  \"I came to Uline for a job. Instead, I found a career.\"Uline is North America's leading distributor of shipping, packaging and industrial supplies. We're a family-owned company known for our incredible customer service and quality products. Our people make the difference.  We're looking for the best and brightest to take our Sales department to the next level. If you have passion and expertise in business development, account management, or business acumen, Uline is the company for you. Click here to see what makes Uline's Sales team tick.Sales Representative - Level 1 Uline seeks Level 1 Sales Representatives for its San Francisco, California territory.  Experience a high-energy, fast-paced work environment that's both competitive and rewarding. Learn about our industry and soar with the support of great coaches and sales managers. All travel is local and typically within a 50 mile radius of your home - no overnight travel.Comprehensive new hire and ongoing training and development.Protected territory.POSITION RESPONSIBILITIESActively manage and grow a dedicated sales territory that includes a large, pre-existing customer base.Use our 750+ page catalog with over 34,000 items to sell product solutions to large and small companies.Prospect and develop new, exciting business relationships.Understand each customer’s needs to provide real, effective solutions.Deliver exceptional customer service.MINIMUM REQUIREMENTSBachelor’s degree.Ability to identify, qualify and close accounts.Excellent interpersonal, communication, problem-solving and presentation skills are a must.Travel required to our Southern California branch for 4 weeks of initial training.BENEFITSBase salary, 3 bonus programs plus national and local contest incentives.Internet and cell phone allowance.Mileage reimbursement.Complete insurance coverage – medical, dental, vision, life.401(k) with company match.Generous paid time off.Tuition reimbursement.If you are a competitive, detailed, dependable team player that thrives on achieving goals and solving problems, then Uline wants to hear from you! EEO/AA Employer/Vet/Disabled  Uline is a drug-free workplace "}