{"jobID": "2783665850", "jobLocation": "San_Jose_CA", "jobTitle": "AI Scientist, Vehicle Health", "companyRating": null, "companyInfo": {"Website": "www.nio.io", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "AI Scientist Vehicle HealthSAN JOSE, CA, OVERVIEWThe next generation computing platform will be the autonomous driving electric vehicle. With data from in-car sensors, a mobile internet connected car, increased computing power, and new user interfaces that support a seamless autonomous driving experience, they will dramatically improve our lives. After home and work, the car is where we spend the most time, and we will be working on making that experience pleasurable. NIO is much more than a car company. We are developing highly performance-optimized electric cars that will help reduce pollution and mitigate global warming, along with autonomous driving capability that will give time back to the drivers. Onboard Vehicle Health Monitoring is a key function for making the autonomous driving function safe to operate. Building this is an important part of the project that requires knowledge of Vehicle systems and their Dynamics, System Identification, Machine Learning, and various other technologies. The AI team will play a critical role in achieving this by working with all the subsystems from vehicle engineering, powertrain, and autonomous driving, and building this function. We are looking for an exceptional AI scientist to join our team to work on this core problem area. Responsibilities· Work with Vehicle Subsystems teams to determine potential faults and anomalies· Build simulation models for Fault occurrence and propagation· Research, Prototype, and Build Diagnostics & Prognostics Algorithms that detect, isolate, identify, and predict component faults and their effect on component and system performance.· Implement the Diagnostics & Prognostics algorithms and test them in a Matlab/Simulink and Python/C++ environment· Validate algorithms in vehicle test platforms.· Analyze the observed and experimental data and explain the findings to the managementRequirements· Masters or PhD in Aero-Astro, Electrical or Mechanical Engineering, Applied Mathematics, Computer Science or related degree· Experience in system diagnostics and prognostics, system modeling, machine learning, and optimization algorithms· Experience with analyzing data, including querying, aggregation, and visualization techniques.· Programming skills in Matlab Simulink, Python or C++· Communication and presentation skills to convey information and results clearly and concisely.· High-energy self-starter with a passion for your work, attention to detail, and a positive attitude.About NIO Our mission is to shape a joyful lifestyle for our users by offering smart, premium electric vehicles and providing the best user experience. We are a global company with world-class research and development, design and manufacturing centers in Shanghai, Beijing, San Jose, Munich, London and nine other locations. NIO U.S. is our Global Advanced Technology Center and North American headquarters. Our global company has achieved many great milestones such as:· Securing the inaugural Formula E Drivers Championship title in 2015 · Unveiling the fastest electric car in the world, the EP9, and setting a lap record for an electric vehicle at the Nürburgring Nordschleife in 2016· Unveiling its vision car, EVE, in 2017· Setting a new world speed record for an autonomous vehicle with the EP9 at the Circuit of the Americas in 2017· Launching the ES8, a seven-seat high performance electric SUV, on December 16 with deliveries slated to begin in 2018.Want to be a part of this? Join us!NIO is committed to a policy of equal employment opportunity. We recruit, employ, train, compensate, and promote without regard to race, color, age, sex, ancestry, marital status, religion, national origin, disability, sexual orientation, veteran status, present or past history of mental disability, genetic information or any other classification protected by state or federal law.NIO US is an E-Verify employer."}