{"jobID": "2673445148", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Proposal Development Professional", "companyRating": null, "companyInfo": {"Website": "www.smawins.com", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for Senior Proposal Development Professionals in the San Francisco area. Willingness to travel nationally is a plus.  SMA has a continuing requirement for highly motivated, proposal managers, volume leads, writers and other specialties driven by winning. We find those who succeed in this role are highly motivated, competitive individuals who seek out intellectual challenges.  We are seeking highly motivated individuals with over ten years of experience developing successful proposals on complex programs and systems.  This position requires, in addition to expertise with federal (B2G) or commercial (B2B) proposals, project management skills and leadership experience. For this senior position, successful candidates should typically be late-career professionals looking for an opportunity for a variety of project opportunities and work flexibility. Candidates should already have an extensive track record of related skills and experience. Candidates should also be proficient with writing and editing technical documents. The following are the basic requirements of the position: APMP Professional Certification or equivalent knowledge of best practices in proposal development, and at least ten years of practical experienceExtensive experience with the business of our clients, namely companies managing large complex programs whether in Aerospace or Defense, Information Technology and Sciences, High Technology, Lifesciences and Healthcare, or Industrial GoodsPreference is for candidates with an expert level of knowledge with programs and systems in the Department of Defense, Intelligence Agencies, National Aeronautics and Space Agency, Department of Homeland Security, Department of State, Department of Transportation, Department of Health and Human Services, or other major Federal AgenciesStrong organizational skills and demonstrated rigorous application of process with disciplineExpert level project management skills including resource planning, budgeting and cost managementProficiency in writing in technical subjects and critical editing skillsDemonstrated ability to quickly adapt processes and work approaches to meet changing client/end user needs—a problem solver mindsetIndividual must be effective in a highly collaborative and high pace work environment and have proven leadership skills and tradecraft expertise to perform at the highest levels of industry standards and be considered as an expert advisor to clientsA genuine intellectual curiosity and fondness for solving difficult technical and management problemsCollege degree in an engineering or science field; literature and journalism majors are also valued by SM&A;US Citizenship is mandatory, DoD or collateral security clearance is a plusAbout SMA To learn more about SMA, please visit our web page (www.smawins.com) and follow us on Glassdoor, Facebook and LinkedIn.SMA is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religious creed, national origin, physical or mental disability, protected veteran status, or any other characteristic protected by law"}