{"jobID": "2836812626", "jobLocation": "Santa_Clara_CA", "jobTitle": "Staff Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.chegg.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Public (CHGG) ", "Industry": " Consumer Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "243000", "jobDescription": "Staff Data ScientistConsumer Analytics Team | Santa Clara, CAThe Role: Students interact with Chegg site through a number of products and platforms. From these interactions, Chegg learns a lot about the behavior and preferences of users. The Staff Data Scientist will use analysis, modeling, and data science to quantify user preferences and behavior and help our product team provide a great experience to our students.  A key part of this role is the ability to quantify and clearly communicate what our data is telling us about our users. The right person will quickly grasp new and different datasets, and quickly drive meaningful insights from them. This person will work regularly with every part of Chegg, balance multiple efforts, and leverage other analytics team members and their skills to deliver insights. The ideal candidate is excited about joining our teams mission to help students save time, save money and get smarter. Responsibilities: · Perform analysis of Chegg engagement data. Analyze who our students are and what drives them to engage.  · Develop and define key product and business insights to help guide decision makers and executives.  · Engage with product and business leaders to drive the future strategy for the company grounded in data science.  · Develop presentations to communicate broadly across the product groups and business units.  · Generate dashboards, tools, and templates to monitor user engagement. Requirements: · Masters degree in a quantitative field (Sciences, Engineering, Economics, etc.)  · 5-7 years of previous analytics experience is required, preferably in user experience and engagement analytics  · Fluent in SQL and familiarity with Excel for data manipulation; comfortable using various data access tools.  · Strong experience with languages such as Python and/or R.  · Experience working with big data platforms such as Hadoop and Hive, a plus.  · Extensive analytical toolset including an advanced understanding of statistics (time series analysis, cluster analysis, multivariate analysis).  · Experience working with data from multiple sources of varying quality.  · Experience creating the dashboard and key metrics. Familiarity with BI platforms such as Tableau a plus.  · Self-motivated, independent, organized and proactive, highly responsive, flexible and adaptable when working across multiple teams.  · Passionate about producing high-quality analytics deliverables and communicating results to a broad audience.  · Strong communication skills. About Chegg: As the leading student-first connected learning platform, Chegg's Student Hub makes higher education more affordable and more accessible, all while improving student outcomes. Chegg is a publicly-held company based in Santa Clara, CA with offices in San Francisco, New York, Portland, India, Israel, Berlin, and Ukraine. Chegg Student Hub Services Include Chegg Study, Chegg Tutoring, Chegg Writing Tools, Test Prep, Careers Search, Internship Admissions, and College Admissions. Life at Chegg:https://www.youtube.com/watch?v=YYHnkwiD7OoChegg Benefits:http://www.chegg.com/jobs/benefitsChegg for Good:http://blog.chegg.com/category/chegg-for-good/Glassdoor Best Places to Work 2015:http://bit.ly/GDBPTW For more information, visitwww.chegg.com Chegg is an equal opportunity employer  #LI-BR"}