{"jobID": "2837755270", "jobLocation": "Oak_Brook_IL", "jobTitle": "Senior Data Modeler", "companyRating": null, "companyInfo": {"Website": "www.aptude.com", "Headquarters": "Naperville, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The data modeler is responsible for creating, and maintaining, conceptual, logical and physical data models which define information requirements for management and business intelligence purposes.  Responsibilities:  • Understand and translate business requirements into data models supporting long-term solutions.  • Work with the Information Governance and Enterprise Data Warehousing & Business Intelligence teams to implement data strategies, build data flows and develop conceptual, logical and physical data models using best practices which ensure high data quality and reduced redundancy.  • Optimize and update logical and physical data models to support new and existing projects.  • Maintain conceptual, logical and physical data models along with corresponding metadata.  • Leverage best practices and standards to ensure consistency of data models.  • Recommend opportunities for reuse of data models for new initiatives.  • Perform reverse engineering of physical data models from databases and SQL scripts.  • Evaluate data models and physical databases for variances and discrepancies.  • Validate business data objects for accuracy and completeness.  • Analyze data-related system integration challenges and propose appropriate solutions.  • Develop data models according to company standards.  • Guide System Analysts, Engineers, Programmers and others on project limitations and capabilities, performance requirements and interfaces. Experiences/Skills: • 7-10+ years overall data management and data modeling experience in the Enterprise Data Warehouse space.  • Deep competency in Business Intelligence/Data Warehouse methodologies, data warehouse design and software development lifecycle.  • Expertise in IBM InfoSphere Data Architect data modeling toolset, SQL or PL/SQL.  • Experience with at least three large full life cycle BI projects.  • Experience interacting with the business stakeholders and users to solicit data requirements, definitions and business rules.  • Very strong written and oral communications.  • Transportation or Logistics experience is a plus.  • Expertise in data modeling principles/methods including conceptual, logical & physical Data Models with both normalized and dimensional data modeling techniques.  • Ability to clearly communicate complex technical ideas, regardless of the technical capacity of the audience.  • Strong inter-personal skills and ability to work as part of a team.  • Ability to quickly learn and adapt modeling methods from case studies or other proven approaches  • Ability to assist in evaluating data sourcing, mapping, test case development and testing.  • RDBMS platforms (e.g. SQL Server, Oracle, Netezza, Teradata, DB2 / UDB)- provided by Dice  data modeling"}