{"jobID": "2803778322", "jobLocation": "Sacramento_CA", "jobTitle": "Analyst II/Data Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.eaest.com", "Headquarters": "Hunt Valley, MD", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Date Posted:06/05/2018 Job Title:Analyst II/Data Manager Job Description:We have an excellent opportunity for a Mid-Level Data Manager (Analyst II) in our Sacramento, California office. Selected candidate will project level support for federal and private clients primarily in California.  Requirements: Bachelor’s Degree4 to 6 years of demonstrated experienceDownload and process instrument log filesReduce raw data; review, compile, and input field dataCompile laboratory data (e.g., Excel, EDDs)Process, sort, and tabulate electronic dataMaintain site relational databases (e.g., Microsoft Access and EQUIS)Generate standard and ad-hoc data reports as neededExperience performing statistical analysisFamiliarity with statistical analysis software (e.g., ProUCL, Analyze-It, ChemStat) preferred but not necessaryDesigns graphics or illustrations (e.g., ArcGIS, Adobe Illustrator) preferred but not necessary. At EA Engineering, Science, and Technology, Inc., our core values are openness, prudence, balance, and challenge and we strive to improve the quality of the environment in which we live, one project at a time. Our professional, team-centric culture promotes collaboration and flexibility and allows employees to guide their own career development path. To that end, we provide training and coaching to support ongoing development for team members.  We offer a culture that values continuing education and personal development, competitive salaries, paid volunteer time, tuition reimbursement, and a comprehensive benefits package including a 401k with Employee Stock Ownership Plan (ESOP).  Interested candidates should refer to job #18052 and visit our website www.eaest.com to apply.  EA Engineering, Science, and Technology, Inc. is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status.EA Engineering, Science, and Technology, Inc., PBC is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected Veteran status. Location: Sacramento, CA Employment Type: 40hr FT"}