{"jobID": "2809822284", "jobLocation": "San_Bruno_CA", "jobTitle": "(USA-CA-San Bruno) Product Analyst, Data Science", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "128000", "jobDescription": " Note: By applying to this position your application is automatically submitted to the following locations: Kirkland, WA, USA; Seattle, WA, USA; Mountain View, CA, USA; San Bruno, CA, USA  Help serve Google's worldwide user base of more than a billion people. Business Analysts provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You weave stories with meaningful insight from data. You make critical recommendations for your fellow Googlers in Engineering and Product Management. As a self-starter, you relish tallying up the numbers one minute and communicating your findings to a team leader the next.  You can see different angles of a product or business opportunity, and you know how to connect the dots and interact with people in various roles and functions. You have substantial experience with analytical tools and techniques, and bring a solid skill-set in analyzing data and communicating recommendations. You will deepen your skill-set by working with analytical thought leaders across the company.  Data Scientists are changing the world one technological achievement after another.  Experimentation is at the core of what you do. In this role, you will work to effectively turn business questions into data analysis, and provide meaningful recommendations on strategy. This is a unique hybrid role that will focus on your knowledge of data infrastructure and your ability to drive insights.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.  ## Responsibilities Conduct data analysis to make business recommendations (cost-benefit, invest-divest, forecasting, impact analysis).Deliver effective presentations of findings and recommendations to multiple levels of stakeholders, creating visual displays of quantitative information.Develop and automate reports, iteratively build and prototype dashboards to provide insights at scale, solving for analytical needs.Collaborate with cross-functional stakeholders to understand their business needs, formulate and complete end-to-end analysis that includes data gathering, analysis, ongoing scaled deliverables and presentations.Help Google to focus on key decisions to improve products and services. ## Qualifications Minimum qualifications:BA/BS degree or equivalent practical experience.3 years of experience working with statistical packages (e.g. R, SAS, Stata, MATLAB, etc.)Experience with articulating product questions, pulling data from datasets (SQL) and using statistics to arrive at an answer.Preferred qualifications:BA/BS or Master's degree with emphasis on coursework of a quantitative nature (e.g., Statistics, Computer Science, Engineering, Mathematics, Data Sciences)Experience in scripting with SQL, extracting large sets of data, and design of ETL flowsWork experience in an inter-disciplinary/cross-functional field.Deep interest and aptitude in data, metrics, analysis and trends and applied knowledge of measurement, statistics and program evaluation.Distinctive problem solving skills and impeccable business judgment.Capable of translating analysis results into business recommendations. Strong written and verbal communication skills.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}