{"jobID": "2809125535", "jobLocation": "Chicago_IL", "jobTitle": "Staff Scientist/Geologist/Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.wcgrp.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " Staff Geologist/Scientist/EngineerAbout Weaver Consultants Group  From its inception in 1991, Weaver Consultants Group (WCG) has been founded upon the tenets of attentive and responsive customer service, strong project management, and solid internal financial controls. The quality of our people, our focus on understanding and responding to our clients' needs, and our application of good business management practices have resulted in most new projects originating from our existing customer base. Over the years, our professionals have faced the challenges of a constantly changing industry. Shifting federal and state regulations, cultural trends, and technical innovations have vastly impacted the way businesses work. Throughout it all, our team has remained dedicated to our clients, helping to identify pragmatic solutions to help them achieve their business objectives. WCG offices are located as depicted on the map and listed to the right. However, Weaver Boos provides services and has completed projects throughout the United States.  We are seeking qualified, degreed environmental professionals who will thrive in a fast-paced and challenging work environment and a place to grow and improve skills, while having a desire for autonomy. Our mission is to provide clients with very high quality, pragmatic, customer-focused service. We offer a very competitive compensation and benefits package that may include ownership opportunities for strong candidates.  This position will include field work, generally local, but some travel and overnight stays possibly including weekends will be required. As our Staff Geologist/Scientist/Engineer you will take direction from and work beneath senior level staff, located in our downtown Chicago office. Requirements We have a need for a mid-level degreed professional with experience in complicated Phase I Environmental Site Assessments (ESAs), environmental field work/Phase II ESAs, and remediation. 3 - 5 years professional experience with the following is required for this position: Phase I ESAs for Heavy Industrial/Commercial PropertiesPhase II ESAsSoil and Groundwater samplingAnalyzing technical dataPreparing soil boring logsExperience with IEPA LUST and SRP programs.Conducting environmental regulatory applicability analysis (Tier I/II, Form R, RMP, NPDES, Etc.)Creating tables in Excel and preparing technical reportsPreferred 40-Hour Hazwoper CertifiedQualificationsBA/BS/MS in Env. Science, Geological Science, or Env. EngineeringVery strong computing skills including high level use of spreadsheetsStrong writing and word processing skillsBeing comfortable working at industrial facilities/settingsAbility to travel 25%-50% EOE/AA/M/F/Vet/Disability  Weaver Consultants Group maintains a drugfree workplace.SDL2017"}