{"jobID": "2739528033", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Business Analytics Lead Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.fcagroup.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1925", "Type": " Company - Public (FCAU) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ford Motor Company, General Motors, Toyota North America"}, "estimatedSalary": "107000", "jobDescription": "Position Overview: The Business Analytics (BA) Lead Data Scientist must have a passion for data and a passion for solving complex business problems that help to create a competitive advantage, and help the business save costs and generate revenue through BA tools and practices. The BA Lead Data Scientist knows how to combine people, process and technology to achieve FCA's business goals and objectives.  The BA Lead Data Scientist helps business groups understand the art of the possible with advanced analytics technology. To achieve this end, the Lead Data Scientist must help business groups and the advanced analytics group work more like an investigative team brainstorming ideas together. The Lead Data Scientist helps the business and analytics team follow a scientific method of coming up with a hypothesis, gathering data, testing the hypothesis in the lab and then determining if an application can be moved into production.  The BA Lead Data Scientist and the Advanced Analytics development team create new technology proof of concepts and create examples of appropriate technology usage and standards. The BA Lead Data Scientist conveys technology solution architectures to project development teams and serves as a technology mentor to these teams. The Lead Data Scientist delivers sound technical recommendations to senior management and BA staff.  The BA Lead Data Scientist is responsible for analyzing the use and interpretation of data in alignment with the goals and procedures of FCA. He or she must guarantee the accuracy and accessibility of all valuable data, and is tasked with knowing what data is important and why. The BA Lead Data Scientist functions as an interpreter or an intermediary, identifying data needs of a particular group, and explaining the importance and use of the data applicable for them. The BA Lead Data Scientist oversees the design, assessment, selection, application and maintenance of major databases and metadata structures; examines and ascertains database processes and conducts risk and financial analysis studies. The BA Lead Data Scientist collaborates with the data management team, but is responsible for developing and maintaining an enterprise data model.  Reporting Relationship: Position reports to the Senior Manager of Business Analytics.  People Management: The BA Lead Data Scientist works with the Senior Manager of BA for forecasting, planning and staffing the team. This includes hiring direct and indirect resources and establishing third party relationships for meeting the demands of the business.  Responsibilities: Implement agile methods of working with the business to research and solve business problemsWork with the business to save costs and generate new revenue streams, presenting new ideas and opportunities to senior managementChampion and drive the development of the Big Data strategy, on-prem, in the cloud, etc.Develop Advanced Analytics capabilities including optimization, forecasting and predictive modelsWork with the development and database teams to translate logical data models into one or more physical implementationsPerform data analysis using advanced statistical modeling algorithmsOffer expertise on data integration and advanced analytics tools to the teamDevise the best-in-class strategies for data modeling, data wrangling and data integrationProvide technical and data leadership to the application development group, and the enterprise including being conversant with and cognizant of the future direction of systems, how that direction will impact the enterprise, and how future and current systems can be exploited using advanced analytics techniques for the benefit of the enterpriseRecognize and identify potential areas where existing policies and procedures require change, or where new ones need to be developed, with respect to future business opportunities"}