{"jobID": "2802562953", "jobLocation": "Chicago_IL", "jobTitle": "Data Support Analyst - Technology Startup", "companyRating": null, "companyInfo": {"Website": "www.enterprisepeak.com", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us: Enterprise Peak is a privately-held next-generation HCM technology and services firm founded by former Big Four leaders and executives. We are a burgeoning tech start-up focusing on delivering services in all major ERP products (Oracle EBS, PeopleSoft, JD Edwards, Lawson, SAP), leading Cloud applications (Workday, Taleo, Success Factors, Salesforce.com) and data analytics technology. We operate utilizing our virtual consulting platform of scientists, engineers, and management consultants to deliver global engagements. Our platform is based on natural language processing and machine learning technology.  We are located across the street from Oak Street Beach in the Gold Coast neighborhood of Chicago. In addition to a beautiful work environment, we offer full benefits, vacation time, paid holidays, and on-site gym membership. Data Support Analyst Responsibilities: The Data Support Analyst will join our data engineering team and will be responsible for mapping out high-tech labor markets. The major focus is supporting principals and senior delivery staff in running searches to collect labor data. Initial focus of the role will be with mapping out high-technology labor markets and using our proprietary tools to harvest candidate data. Opportunity will be provided to develop new tools and technology for our data harvesting process.  We are in the process of building a proprietary next generation Applicant Tracking System (ATS) utilizing our own unique harvesting formula. This position will have the opportunity to participate in this project and truly understand the entire talent acquisition and management approach.  Who We Are Looking For  This is a full-time (permanent) salaried position with paid time-off, medical and dental benefits, and opportunities for advancement.  This entry-level role would be ideal for a recent college graduate or someone with 1-2 years of professional experience. We are looking for sharp individuals who are tech-savvy, have excellent written communication skills, and most importantly, eager to learn our data process. An entrepreneurial mindset is a must. You will join a fantastic start-up atmosphere with full autonomy to lead and leave your mark!  Preference for candidates with development experience in JavaScript and Python (but not required)  First priority will be given to applicants with strong technology backgrounds; all majors will be considered  Must be comfortable with data-harvesting activities  Must be quick at typing, great with technology, and an expert in all Microsoft Office products, especially Excel (Visio is a plus)  EXCELLENT written and verbal communication skills absolutely required for this role  This is an on-site role at our Chicago office with regular business hours. We do not offer a relocation package at this time. Applicants must reside within commuting distance of our office.  Due to the nature of our clients work environments we can only consider US Citizens or Green Card Holders at this time. Thank you for your understanding.  If this sounds like an opportunity you would like to pursue, please apply with an updated resume. We are actively interviewing qualified candidates and looking to hire immediately.  If you know anyone who may be a fit for this role, please pass along this job description as we would love to talk to them!  NO 3rd PARTIES please!"}