{"jobID": "2794744159", "jobLocation": "Santa_Monica_CA", "jobTitle": "Clinical Lab Scientist (Per Diem)", "companyRating": "3.8", "companyInfo": {"Website": "www.uclahealthcareers.org", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Cedars-Sinai Medical Center, Loma Linda University Medical Center, Harbor Hospital"}, "estimatedSalary": "42", "jobDescription": "ResponsibilitiesThe Clinical Lab Scientist performs independently a wide variety of technical procedures in the Chemistry, Hematology, Coagulation, Urinalysis and Blood Bank sections of the UCLA, Santa Monica Clinical Lab. Other responsibilities include maintenance repair of laboratory instruments, sample processing, reagent preparation, training, teaching and data entry. On a daily basis, assess overall workload for any area that needs help and assist co-workers without being reassigned by the supervisor.QualificationsA current California Clinical Laboratory Scientist License or enrollment in a CLS apprentice program. Two years recent experience performing testing in a high volume testing lab. Recent demonstrated technical competence in high volume chemistry/hematology required. Abnormal Hematology experience preferred. Must have working knowledge of lab safety and test methodologies used in chemistry, hematology, urinalysis, blood bank. Demonstrated working knowledge of current instrumentation: Sysmex XN3000, Roche cobas c501, Siemens Vista, Dade CA1500, Osmometer, Microscope, Centrifuges. Clinical and Technical knowledge: Reference ranges, Test methodologies, Instrument operation and maintenance, CAP and other regulatory requirements. Personal computer knowledge. Must have knowledge of disease states associated with the tests performed in the area in order to be able to inform physicians on significance of test results. Working knowledge of laboratory safety. Able to perform testing, documentation, and interpretation."}