{"jobID": "2768934050", "jobLocation": "Washington_DC", "jobTitle": "Digital Advertising Specialist", "companyRating": null, "companyInfo": {"Website": "www.industrydive.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Your next opportunity awaitsWant to help plan and execute marketing campaigns for some of the most innovative Fortune 100 companies? Industry Dive is looking for a smart, passionate, and detail-oriented candidate to support our advertising operations team.  Our team is growing quickly. This position comes with the opportunity to carve out a unique and contributing role within the company and is perfect for someone looking to grow in their career. ResponsibilitiesSupport the Advertising Operations team with ad preparation and publisher-side launch responsibilities.Execute all pre-launch trafficking responsibilities and perform diligent and detail-oriented QA on advertising placements.Analyze post-campaign performance and make suggestions for optimization.Monitor and communicate advertising progress to internal teams, including but not limited to reporting as well as answering inquiries.Collaborate with internal teams to improve processes, documentation, and communication. What you can bring to the table: 0-1 year of experience.Bachelor’s Degree.Strong written and verbal skills, confident working with clients via email and phone; friendly, positive, service-oriented personality.Attention to detail; diligent, proactive, organized, accountable, analytical, and highly-motivated team player.Quick learner of new technologies, tools, and processes; ability to adapt to changing tides.Thrives in a dynamic, fast-paced, high-growth work environment, while managing numerous projects under tight deadlines.Experience with digital advertising or HTML a plus. About Industry DiveIndustry Dive is a digital B2B media company that delivers news and original analysis to more ­than one million business leaders in multiple industries. We are a company founded on the belief that executives should have access to the content they need in a way that is intuitive and insightful, no matter the device. Industry Dive pushes the boundaries of modern journalism and marketing.  Our office is a place where you work hard on clear monthly goals, have your voice heard, and shape the future of a growing media business. Located in the heart of Washington DC, our workspace boasts a lot of perks – whiteboard walls, treadmill desks, and a dedicated quiet room.  Industry Dive has been named an “Innovative Media Start Up” and one of the “Top 10 Hottest Publishing Start Ups.”Industry Dive was selected as a \"Best Place to Work\" in 2015, 2016 and 2017 by the Washington Business Journal."}