{"jobID": "2735283078", "jobLocation": "Loma_Linda_CA", "jobTitle": "Clinical Lab Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.lomalindahealth.org", "Headquarters": "Loma Linda, CA", "Size": "10000+ employees", "Founded": " 1967", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": "- Bachelors Degree**Eligible for $20K Recruitment Incentive with 2 years recent relevant experience**Job Summary: This position will support LLUMC's strategic plan and the organization's mission to continue the teaching and healing ministry of Jesus Christ, while embracing the core values of Compassion, Integrity, Excellence, Teamwork, and Wholeness. Performs and interprets moderate and high complexity tests and reports results following standard operating procedures for patient specimens, proficiency samples, and quality control. Monitors pending lists. Meets or exceeds turn-around time goals for test production and result reporting. Performs instrument and equipment calibration, preventative maintenance, troubleshooting, and repair. Serves as a technical resource including problem solving, troubleshooting, interpreting/consulting, and verifying specimen quality and test results. Serves as a preceptor/mentor to students, residents, and staff. These services may be provided for both the LLUMC and LLUCH hospitals. Performs other duties as needed. Job Descriptions: Possesses excellent dexterity and analytic skills. Ability to plan and organize technical work, manage workload, operate technical instruments and equipment, input data and type. Able to relate and communicate positively, effectively, and professionally with others; be assertive and consistent in following and/or enforcing policies; work calmly and respond courteously when under pressure; lead, supervise, teach, and collaborate; accept direction. Possesses clear speaking abilities in English. Ability to use available resource material independently to resolve and document challenges constructively. Possesses excellent and effective verbal and written communication skills in English matching the style to the message and the audience. Maintains excellent interpersonal relationships with all customers (e.g., staff, patients, vendors). Provides staff and management with timely information, constructive and actionable feedback. Fosters cooperation and collaboration, actively solicits opinions from others, builds respect and trust. Explains and teaches. Responds to guidance constructively. Detail oriented. Able to reason and solve problems effectively, analyze and interpret data. Able to organize work, to service multiple requests and tasks at one time, while maintaining quality and a professional manner. Self-motivated and works well with minimal direction. Articulates logical and well-founded arguments that support conclusions. Bachelor's Degree required. Minimum of three years of experience in high complexity, computerized clinical laboratory preferred. California Clinical Laboratory Scientist (CLS) required. California limited license evaluated case by case based upon departmental job requirements. CLS(NCA) or MT(ASCP) preferred. EOE AA M/F/Vet/Disability"}