{"jobID": "2812087493", "jobLocation": "Berkeley_Heights_NJ", "jobTitle": "Senior Clinical Data Manager", "companyRating": null, "companyInfo": {"Website": "www.sunrisesys.com", "Headquarters": "Edison, NJ", "Size": "501 to 1000 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Sunrise System Inc. is currently looking for Senior Clinical Data Manager in Irvine, CA with one of our top client.  Job Title: Senior Clinical Data Manager  Job Id: 18-08610  Location: Berkeley Heights, NJ 07922  Duration: 12 months  Position Type: Hourly contract Position (W2 only)  Summary  Must be a Senior Level Person and familiar and experienced in all aspects of Data Management Responsibilities, and must have DM Lead experience.  As a senior level contractor, responsibilities will include, but are not limited to overseeing the management of clinical trial databases from study start up to study closure at CRO (or when required, support other DMs) by performing the following activities:  Review and understand protocol synopsis and attend if required any protocol review meetings and act as subject matter expert for proper data capture based on protocol requirements.  Lead Case Report Form Design according to the protocol with all Study Team members using established standards  Author or review CRF completion guidelines  Develop or lead in the review of a Data Management Plan (DMP), when applicable, that outlines database design and testing, CRF flow, data queries, manual checks, coding, SAE reconciliation, third party vendor reconciliations, specification of data listings needed to facilitate data cleaning in accordance to a Data Review Plan, data lock and archiving, etc.  Develop and test edit specifications which may include the development of test scripts used for UAT as well as perform/coordinate UAT testing  Ensure coding has been performed and reviewed by Medical Coder,  Perform external data reconciliation, provide data management related metrics, provide specific data listings as required by the medical group and review when necessary  Make data, including interim data, available to company personnel and to regulatory agencies when required  Trouble-shoot database issues with DBA until resolution is obtained  Perform database lock and freeze activities  Prepare and present data collection requirements at Investigator Meeting  Participate in CRO selection  Review SOWs for data management activities and costs in contracts  Participate in regular team meetings and provide input when appropriate  Other Activities may include  Interact with physicians, scientists, monitors, programmers, study managers and statisticians in creating an appropriate database, data quality assurance, and resolution of data queries  Assist in database upgrades/migrations including performing User Acceptance Tests  Serve as the DM representative on clinical project teams that are developing NDAs Skills/Knowledge Required: BS/BA degree or equivalent in a relevant scientific discipline with a minimum of 5 years of experience as a LEAD data manager in a pharmaceutical/CRO setting  Experienced in understanding Sponsor responsibilities of oversight of a CRO.  Immunology, Inflammatory and Clinical Pharmacology is highly desirable,  Proficient knowledge of Medidata RAVE, Experience with RaveX is a plus  Knowledge of of JReview is a plus.  Basic knowledge of budget forecasting  Proficiency in regulatory guidelines, agencies, GCP  Advanced knowledge of clinical trial process and data management process  Excellent communication skills; ability to work in a team environment with medical personnel, clinical monitors, statisticians, programmers, and medical writers  Contact  Sunny Rajput  Direct: (732) 272 20302 | Email: Sunny.R@sunrisesys.com  Or  Sourabh Agrawal | Lead - Talent Acquisition  Direct: (732) 272 0301| Email: sourabh@sunrisesys.com"}