{"jobID": "2831265367", "jobLocation": "Dallas_TX", "jobTitle": "Business Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.solomononline.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Title Business Data Analyst  26-Jun-2018 Job DescriptionSolomon, the leading performance improvement company for the global energy industry, is seeking candidates for a Business Data Analyst (VBA/SQL) position to work in a dynamic, fast-paced business environment. This position will work closely with energy industry experts to design and conduct industry benchmarking studies. While these experts provide in-depth knowledge of the industry, these experts must be leveraged by partnering with a skilled data analyst capable of processing large amounts of benchmarking data through various automation tools. As such, this position will play a vital role in all aspects of the benchmarking process, including: Designing electronic form-based solutions for consistently collecting participant dataMaintaining a relational database for storing the collected dataPerforming database uploads, calculations, and queriesValidating the data for accuracy by designing data quality checksDesigning and building electronic reports and data visualizations that provide participants with key insights about their performanceReviewing the final reports for accuracy and delivering them to participants while maintaining the highest level of quality and confidentiality This role often requires developing creative solutions to respond to ad hoc data requests from both the industry experts and the study participants. To be successful in this role, the person must be highly collaborative, innovative, and versatile with the ability to effectively build strong partnerships.Auto req ID2168BRQualificationsQualificationsEducation Required: Bachelor of Science or Bachelor of Arts in Computer Science, Mathematics, or equivalent Preferred: Engineering degree or MBAWork Experience Required: 3–7 years of programming experience in a Microsoft environment (VBA, Excel macros, etc.)1–5 years Microsoft SQL database programming experienceTechnical Skills Required: Microsoft Office VBA development, Database development (Microsoft SQL Server preferred) Preferred: C# programming, VB.NET programming, Web programming (JavaScript, HTML, etc.)Non-Technical Skills Required: Excellent writing and verbal skills working with both developers and non-technical personnelProficiency in Microsoft Office products (particularly Excel and PowerPoint) Preferred: Experience in an engineering firm, especially oil, gas, or petrochemicalsOther Required: Strong analytical skills, attention to detail, the ability to work independently with limited supervisionHigh energy and an inquisitive mind Preferred: BilingualState Texas Employment Type Full Time Additional Information We are an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. The work environment characteristics, and any physical and mental requirements described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Other duties, responsibilities and activities may change or be assigned at any time with or without notice.City Dallas Country United States of America "}