{"jobID": "2823057431", "jobLocation": "San_Bruno_CA", "jobTitle": "Business Analyst With Data Analytics Background", "companyRating": "3.6", "companyInfo": {"Website": "www.tcs.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (TCSN) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Accenture, IBM, Infosys"}, "estimatedSalary": "83000", "jobDescription": " Advanced Solutions BusinessAnalyst, Data & Analytics  Have you ever walked down an aisle in your local Walmart andwondered why your favorite beverage or food product moved? At Nielsen, we workwith retailers to help them understand their consumers, and to optimize theirbusiness down every aisle. On the Nielsen Retail Team you will workface-to- face with major retail players and use Nielsen solutions to helpanswer questions such as finding the right assortment and guiding pricingstrategies. Every day brings a new challenge when working in the fast pacedretail environment.  Be curious. Be collaborative. Be forwardthinking. Join the Retail Team and work with our clients as a problemsolver and the voice of Nielsen at our clients. When you join the Nielsen team,you're signing up for an experience that requires flexibility, curiosity, andpassion. As a Business Analyst youwill:Work closely with clientservice team to define information objectives and design appropriate analyticmodel solutionEnsure pro-active insights and action orientedsolutions are delivered to clients on time and without errorsOwn the design, development, and maintenance ofongoing metrics analyses, dashboards, etc.Surface insights though polished visualizationsto help guide critical business decision-makingMaintain an organized workflow and activelycontribute to team knowledge baseEnsure data quality throughout all stages ofacquisition and processing, including data collection, cleansing, normalizationand transformation Background andTechnical Skills Proficiency in at least onescripting/statistical language (R or Python preferred)Experience building tools and automatedprocesses to extract, clean, and distill dataComfortable writing Linux OS shell scriptsAdvanced SQL knowledge (iterative functions,using WITH statements, performance tuning, etc.)Familiarity with Jupyter Notebooks a plus General Skills Strong logic, deductive reasoning, problemsolving and critical thinking skillsExperience tackling vague problems, transformingunframed problems into algorithmic solutions.Scrappiness and independent troubleshootingabilityDemonstrated mastery in data analysis &application; to client business issuesStrong project management skillsAble to work collaboratively with internal andexternal teamsSDL2017"}