{"jobID": "2836366212", "jobLocation": "San_Diego_CA", "jobTitle": "Associate Scientist, Nanofabrication", "companyRating": null, "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": null, "jobDescription": "Associate ScientistSummaryWe are looking for a talented, experimental Associate Scientist to become a member of the Nanofabrication team within the Advanced Engineering group in the Department of Research and Technology Development. Candidates with experience carrying out experimental work in the areas of physical chemistry, chemical patterning, surface characterization, surface modification, nanofabrication, microfluidics, semi-conductor process technology and fundamental materials development will be considered.This is an extremely exciting opportunity to contribute to core technology at the foundation of Illuminas products. This individual will be a key contributor to the development of the substrates and flowcells utilized in Illuminas sequencing platforms. This new team member will be responsible for contributing to the evolution of Illuminas existing technologies as well as help pave the path for future platforms. He/She will be part of multidisciplinary teams, performing experiments aimed at answering basic scientific questions and solving complex problems with a primary focus on developing products that change lives and have profound commercial implications.Responsibilities and Desired Qualifications: Job duties will include but are not be limited to Development of new substrates, patterning methodologies and advanced manufacturing process development; this includes working in an academic cleanroom environment at times as well as taking prototype substrates and performing both analytical and functional experiments with them.• Performing basic materials characterization, such as SEM, TEM, XPS, TOF-SIMS, AFM, high resolution spectroscopy and microscopy to characterize the interface between Illuminas surface chemistry and new substrate formats.• Development of new materials that can be used in future substrate formats; experience with photosensitive polymers and modification of those polymers to meet functional requirements may be required.• Perform micro- and nano-fabrication activities, including photolithography, nanoimprint lithography, reactive ion etching, metallization/material deposition to fabricate proof of concept substrates.• Perform surface chemistry protocols and run assays to assess the performance of prototype substrate formats.Work hand-and-hand with surface chemists, developing new methods for DNA analysis platforms.Design of new, disruptive processes for manufacturing patterned substrates.• Fabricate and characterize prototype substrates and flowcells and deliver to internal customers for end use; frequently working with customers to evaluate end performance and develop the assays run on these chips.Job requirementsThe ideal candidate will have a MS or Ph.D. in Physical Chemistry, Material Science, Analytical Chemistry, Physics, Electrical Engineering, Nanoengineering or a closely related field. Experience with nucleic acid chemistry is a plus.• Strong written and verbal communication skills. Contributor will present updates, write reports, lead and/or participate in technical meetings, and present results to managementExcellent laboratory and experimental skills; strong data analysis skills, ability to interpret and draw conclusions from limited to large amounts of data.Understanding of and experience with process development of multidisciplinary systems, including knowledge of optical, fluidics, microfluidics, electronics, and automation systems.Ability to work well as part of a fast pace cross functional team.Proven ability to research, plan, execute and report on multifaceted experiments not necessarily in field of expertise.Ability to multitask on projects with aggressive timelines.Strong work ethic with flexible schedule.Keywords:Physical chemistryNanotechnologySpectroscopyNanofabricationMaterial ScienceNanophotonicsAnalytical chemistryPhysicsExperimentalistMetrologySurface chemistryPolymerNanoimprint lithographySpectroscopyHigh resolution microscopySEMAFMTEMXPSTOF-SIMS Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at 858-255-5081. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}