{"jobID": "2820099649", "jobLocation": "Portage_MI", "jobTitle": "Data Manager Scientist, Web Tool Developer", "companyRating": null, "companyInfo": {"Website": "www.zoetis.com", "Headquarters": "Parsippany, NJ", "Size": "5001 to 10000 employees", "Founded": " 1950", "Type": " Company - Public (ZTS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Zoetis is a global animal health company dedicated to supporting customers and their businesses in ever better ways. Building on 60 years of experience, we deliver quality medicines and vaccines, complemented by diagnostic products and genetic tests and supported by a range of services. We are working every day to better understand and address the real-world challenges faced by those who raise and care for animals in ways they find truly relevant.  Our name, Zoetis (zō-EH-tis), has its root in zo, familiar in words such as zoo and zoology and derived from zoetic, meaning \"pertaining to life.\" It signals our company's dedication to supporting the veterinarians and livestock producers everywhere who raise and care for the farm and companion animals on which we all depend on.  Zoetis is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status or any other protected classification. Disabled individuals are given an equal opportunity to use our online application system. Zoetis also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must possess or obtain authorization to work in the US for Zoetis. Zoetis retains sole and exclusive discretion to pursue sponsorship for the acquisition or maintenance of nonimmigrant status and employment eligibility, considering factors such as availability of qualified US workers. Individuals requiring sponsorship must disclose this fact.  Please note that Zoetis seeks information related to job applications from candidates for jobs in the U.S. solely via the following: (1) our company website at www.Zoetis.com/careers site, or (2) via email to/from addresses using only the Zoetis domain of \"@zoetis.com\". In addition, Zoetis does not use Google Hangout for any recruitment related activities. Any solicitation or request for information related to job applications with Zoetis via any other means and/or utilizing email addresses with any other domain should be disregarded. In addition, Zoetis will never ask candidates to make any type of personal financial investment related to gaining employment with Zoetis.  Senior Associate, Data Systems Responsibilities The candidate selected for this position will assist efforts within Veterinary Medicine Research and Development (VMRD) to develop, maintain and use VMRD Data Management Systems in accordance with applicable internal and regulatory policies and standards. Successful candidates will have a strong technical background, with proven intermediate to advanced Web application development programming knowledge along with relational database design, SQL dialect knowledge, and data management experience. Specific responsibilities for this position include: Data Management Following business standards, work with study personnel to create Data Management Plans, which ensure data can be collected and transferred to the Clinical Data Management System according to business standards Provide study-specific database setupProgramming SAS and/or SQL code for data transformation and loading tasksDevelop data validation checks using SAS and/or SQL programmingSupport of statistical analysis and reporting requirementsSupport VMRD's Clinical Data Management SystemsSupport, create and enhance our Desktop Tools and Web applicationsSupport our relational databasesCommunicating effectively with other departmental colleagues, line management, and customersQualificationsMinimum skill, education, experience, attributes: Educational Background:  Minimum: Bachelor's Degree or equivalent experience in related area Work Experience/SkillsMinimum:Intermediate to advanced Web application development programming knowledge and SQL (database & dialect) Node.jsWeb dev in Microsoft WindowsGitSQL ServerData Management experienceProven ability to lead or work on several simultaneous projects or activitiesExcellent written and verbal communication skills are essential including the ability to author technical documentation, provide customer support and trainingDesirable Skills, Education, Experience, AttributesEducational Background (Desirable):Degree in the following areas:Computer ScienceInformation ManagementBioinformaticsData Science and/or Data Analytics"}