{"jobID": "2824642516", "jobLocation": "Los_Angeles_CA", "jobTitle": "Director of Data Engineering", "companyRating": "4.0", "companyInfo": {"Website": "www.servicetitan.com", "Headquarters": "Glendale, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FieldAware, FieldEdge, SuccessWare"}, "estimatedSalary": "198000", "jobDescription": " ServiceTitan is looking for a Director to lead our data engineering team within our Professional Services group. The team is a comprised of data engineers and business analysts] that support both onboarding of new clients and our existing client franchise. The ideal candidate will have eight or more years of professional experience which includes a balanced combination of ETL process ownership, professional services experience, and people management & development. The Director will oversee two primary workstreams; technical project delivery for our clients and internal process improvement. The person will have three main responsibilities 1) Manage team priorities to ensure projects are on track, 2) set and manage internal & external stakeholder expectations 3) further build out our ETL & custom reporting processes and ensure alignment with the companys overall data strategy. The candidate will be comfortable communicating with personnel at all levels. A successful candidate operates effectively in a fast paced environment, takes ownership of deliverables, demonstrates leadership, provides exceptional customer experience and has superb communications skills.  The work is extremely rewarding and impactful, both for our customers and organization. It will provide a platform for the successful candidate to bring positive change to an industry that is run by hard working, humble, and real people. This is an excellent opportunity for a self-starter to further build out high performance team that is mission critical for our companys success. Responsibilities:Manage execution of multiple data migration & custom reporting projects at any given time and ensure successful deliveryPrioritize improvements to ETL process design while ensuring consistency with the enterprise architecture strategyCollaborate with data architecture team to build out infrastructure to support nascent custom reporting offeringServe as internal stakeholder for any data migration related escalations from our clientsFurther build out our data engineering team through recruiting as well as developing team membersRequirements:Four year degree in MIS, Computer Science or other technical field or Business Management. Masters strongly degree prefered8-15 years of professional experience which includes at minimum 5 years in each of the following areas 1) ETL experience with non-structured data 2) Client-facing project management, 3) team managementBe a problem­ solver who has a demonstrated ability to overcome challenges with creative solutionsBe meticulously detail ­oriented with the ability to multi­task, manage client expectations and align external resources for quality and timely delivery of projectsPossess a roll-up-your sleeves attitude when dealing with client escalationsA track record of being a team player and leader with strong interpersonal and communications skillsExperience managing of a technical team within a professional services environment strongly preferred"}