{"jobID": "2767284257", "jobLocation": "Arlington_VA", "jobTitle": "Senior Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.threatconnect.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "151000", "jobDescription": "Company Description ThreatConnect® arms organizations with a powerful defense against cyber threats and the confidence to make strategic business decisions. Founded in 2011, ThreatConnect officially launched the ThreatConnect Platform in 2013. Since then, ThreatConnect has grown to more than 20,000 users worldwide. Today, ThreatConnect provides a suite of products designed to meet the threat intelligence aggregation, analysis and automation needs of security teams at any maturity level - built on the industry's only intelligence-driven, extensible security platform. If you want to work on building a world-class security platform, you will enjoy a career that truly makes an impact. For more information on the benefits of working at ThreatConnect, visit www.threatconnect.com/careers Job Description We’re analysts first. We know what it takes to work at the front lines of cyber defense. We know that we’re stronger together than we are apart. And, we’re strategic business thinkers. Since 2011, we’ve led the threat intelligence revolution, building the industry’s most comprehensive threat intelligence platform along with its largest trusted cybersecurity community.  Our ideal team member will have a passion for security analytics and have experience applying statistical and machine learning techniques across a broad set of problems. We are seeking motivated developers and analysts who can positively answer the following: Do you think of yourself as a scientist? Are you excited at the prospect of developing, articulating, and testing a hypothesis? Can you explain the results in a compelling fashion to both technical and non-technical audiences?Do you have the ability to prototype solutions within a distributed computing architecture?Do you want to work in a fast, growing, dynamic start-up environment?Do you like the idea of defining and pursuing a shared vision with other security and engineering enthusiasts? We are headquartered in Arlington, VA and maintain a tight collaborative environment across the “locals” and many remote teams. Location in the Northern VA/MD/DC area is desired, but remote work within the United States for the right candidate will be possible. ResponsibilitiesCollaborate with threat intelligence analysts, users, and stakeholders to define requirements and specifications for accessing and making use of dataCollaborate with intelligence research and product management teams to identify new sources of data to drive discovery, analysis, and recommendation capabilitiesEvaluate options for data management infrastructure and tools, design comparison tests, prototype as needed, advise on build/buy decisionsDevelop, test, and apply optimized algorithms and statistical models for discovering new threat intelligence data, minimizing false positives, and recommending courses of action for internal and external stakeholdersLeverage dynamic feedback from customer users and integrated devices for implementing appropriate workflows within the ThreatConnect platformInterface regularly with threat researchers to identify new ways to capture and leverage meaningful context and relationships across disparate data setsWork directly with product management, engineering, QA, and related team leads to ensure timely completion of products in conjunction with product roadmapsOther tasks as neededRequirementsQualifications:Bachelor’s Degree or higherAt least 2 years of experience as a Data Scientist/Modeler/Research Analyst in areas of threat intelligence, network security, probability, etc. dealing with large data setsProficiency in Python or similar scripting languagesProficiency with Structured Query Languages (SQL)Experience with Map Reduce, Spark, Pig, or other distributed programmingMust possess strong written and verbal communications skillsLegally authorized to work in the United StatesBenefitsWork-Life Balance:10 Paid Federal HolidaysAccrued Paid Time Off (PTO) for vacation/sick, timeYour birthday offEmployee recognition program with quarterly awardsEmployee referral programMilitary leave options availableEducation reimbursement program for job-related college courses and professional trainingCompany-provided refreshments at our headquartersQuarterly events with your geographic teamAnnual company partyMedical:MEDICAL PREMIUM FOR INDIVIDUALS AND FAMILIES ARE 100% COVEREDPrescription drug coverageDental coverageVision coverageCompany-paid short term and long term disabilityCompany-paid insurance and AD&D; coverageFinancial:401K retirement savings plan with company matching program up to 6%Health Savings AccountCell phone stipend"}