{"jobID": "2837556488", "jobLocation": "Alexandria_VA", "jobTitle": "Senior Tactical Data Links Analyst (Senior Military Operations Analyst)", "companyRating": "4.2", "companyInfo": {"Website": "www.spa.com", "Headquarters": "Alexandria, VA", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "115000", "jobDescription": " The Joint Cyber/Information Security, Intelligence Acquisition Group (JCAG) supports a broad array of clients in the Office of the Under Secretary of Defense for Acquisition and Sustainment (OUSD (A&S;) and Research and Engineering (OUSD(R&E;) on cyber, space, intelligence, and acquisition efforts. This position will be located in the NCR (Mark Center or Pentagon). Candidate must be available to start by 09/27/2018. Requirements: •Bachelor's degree in technical or business field.•8+ years of experience leading or conducting Material Solution Analysis.•Experience with acquisition and/or development of Common Data Link and ISR communications capabilities, to include: Link-16, Cooperative Engagement Capability (CEC), TTNT, MADL, JALN efforts, and open architectures for mission avionics.•8+ years of experience with the operational employment of Tactical Data Link capabilities. Understanding of Capability Based Assessments (CBAs).•Basic understanding of the DoD PPBE process and JCIDS documents.•TS/SCI clearance.Desired• MS/MA degree.• Experience working on Joint Staff or OSD staff.• Experience preparing documentation for Senior Leader review. Job Description: Provide direct on-site support to the Office of the Secretary of Defense, DASD Command, Control, Communications, Cyber, and Business Systems (C3CB) and perform technical studies and analysis of DoD Tactical Data Links. Conduct Material Solution Analysis (AoA/EoA). Prepare supporting documentation for Senior Leadership in DoD."}