{"jobID": "2502414622", "jobLocation": "San_Francisco_CA", "jobTitle": "Assurance Associate", "companyRating": null, "companyInfo": {"Website": "www.bpmcpa.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Novogradac & Company, Moss Adams LLP, Armanino"}, "estimatedSalary": null, "jobDescription": "BPM is a full service accounting firm providing comprehensive assurance, tax, and consulting services to clients globally. We are one of the largest California-based accounting firms and have built our success by focusing on our clients and our people. Our people-centered culture and firm motto Because People Matter has allowed us to be consistently recognized as one of the Best Places to Work in the Bay Area. We are dedicated to providing meaningful careers for all of our employees along with fostering an environment that allows an integrated lifestyle between work and play.Read more about BPM on Glassdoor and learn more about our key leaders on LinkedIn like Brian Finnegan, Jeff Pearson, and Melodie Olson. You will likely meet some of these people during your interview process! We have A unique people-centered culture that attracts the brightest and most forward-thinking accounting professionalsThe resources, expertise, and global capability of a Big Four accounting firm together with the responsiveness and accessibility of a local firmA regional presence in the Bay Area, while still serving our clients nationally and internationallyRecognition as one of the Bay Areas Best Place to Work and No. 1 Best Large Accounting Firm to Work for by Accounting Today You have (requirements) Interest in a career in public accountingA minimum GPA of 3.0 in a BS/BA/MSA/MST/Certificate Program in Accounting, Business Administration, Finance or EconomicsCompleted the CA CPA Educational Licensure Requirements, or will have completed them by Fall 2018Positive, enthusiastic energyThe people skills to work with individuals in and out of the organizationA forward-thinking and hands-on approachStrong written and verbal communication skillsA desire to learnLeadership skillsYou will (job responsibilities):Research basic and intermediate accounting topics and present more senior members with your proposed solutionDevelop and apply an intermediate knowledge of auditing theory and a sense of audit skepticismIdentify key issues and work with more senior team members to come up with an audit approachContribute ideas/opinions to the engagement teamsConnect key testing areas to the financial statement line items and ensure figures are properly supportedCollaborate with clients, working hand in hand to deliver a quality product within the clients time framePerform direct auditing work on key financial statement line items such as Cash, Accounts Payable, and Inventory"}