{"jobID": "2764731483", "jobLocation": "Hackettstown_NJ", "jobTitle": "Associate Scientist, Quality Management Processes", "companyRating": "3.9", "companyInfo": {"Website": "www.mars.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Apply now » Apply now  StartPlease wait... Associate Scientist, Quality Management Processes - Hackettstown, NJ LOCATION:Hackettstown, NJ, US, 07840#job-location.job-location-inline {  display: inline;  }JOB CATEGORY: R&D;REQUISITION NUMBER: 168374A mutually rewarding experience.  Work. Realize your ambitions. And realize there’s more to being in business than just making a profit. That’s the Mars philosophy. And the opportunity we offer every one of our Associates. An opportunity to take what you do and make it mean more for you, for those around you and for the planet. What you get here is challenging, interesting work. You get the tools you need to do a great job and you get to have the best possible people on your side to help you do it. And at the same time as getting to find ways to do business better today than we did it yesterday and driving a great career, you also get to build a more enlightened business and drive sustainability.  Because it’s never just about a single person, a single project or a single brand. It’s about how you can grab everything that’s within your reach here and use it to pursue mutual, long-term gain. It’s about having ideas. And ideals. Being prepared to risk failure because the promise of success means we’ll all be a little better off. It’s that mix of integrity and ambition that makes Mars such a special place to work. And why working here is always about more than just a job. About Mars, Incorporated Mars is a family-owned business with more than a century of history making diverse products and offering services for people and the pets people love. With almost $35 billion in sales, the company is a global business that produces some of the world’s best-loved brands: M&M;’s®, SNICKERS®, TWIX®, MILKY WAY®, DOVE®, PEDIGREE®, ROYAL CANIN®, WHISKAS®, EXTRA®, ORBIT®, 5™, SKITTLES®, UNCLE BEN’S®, MARS DRINKS and COCOAVIA®. Mars also provides veterinary health services that include BANFIELD® Pet Hospitals, Blue Pearl®, VCA® and Pet Partners™. Headquartered in McLean, VA, Mars operates in more than 80 countries. The Mars Five Principles – Quality, Responsibility, Mutuality, Efficiency and Freedom – inspire its more than 100,000 Associates to create value for all its partners and deliver growth they are proud of every day.  Mars Wrigley Confectionary is looking for Associate Scientist, Quality Management Processes in Hackettstown, NJ. The Associate Scientist BU QMP position provides functional leadership to develop, implement, maintain, and proactively improve quality management systems. The role is primarily responsible for management and implementation of the MARS Quality Management Process (QMP) at the business unit level.  This role is a key part of the Quality & Food Safety team. Much of the delivery of the role needs to be achieved through others. It is therefore essential that the job holder is able to effectively work with the corporate, global, regional, and local Quality & Food Safety teams and all functions that impact Quality across the business as necessary to develop, maintain and improve the segment QMP and Quality & Food Safety governance. Key Responsibilities:Create and coordinate metrics inputs to the business unit quality assurance management review process by data trending/data analyticsContinuously improve primary elements of the quality management system such as: document control, management review, and corrective and preventative actionProvide training and development support for key users and end users of the systems across the business unitDrive and prioritize continuous improvement for implemented systemsMinimum Qualifications:Bachelor’s degree in Food Science or related science3 years of relevant experience in food or related industryMicrosoft Office proficientStrong Problem Solving abilityData reporting formats and frequenciesAbility to travel up to 30% of the timeSuccessful Completion of a drug and background screenPreferred Qualifications:Advanced degree in Food Science or related science4+ years of relevant experience in food or related industryProven application of quality tools, laboratory methods, food science, and/or statisticsStrong organizational skillsDemonstrated ability to successfully handle multiple projects and programsExperience in auditing Company paid relocation is not available for this role.  Mars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request.Nearest Major Market: Allentown Job Segment: Scientific, Manager, Quality Assurance, Document Control, Engineering, Management, Technology, AdministrativeApply now » Apply now  StartPlease wait..."}